{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Здравствуйте, я просто хотел скопировать + вставить свой ответ в другую старую ветку для всех отчаявшихся людей, которые хотят узнать о гормонах и исцелении. Для меня важно, чтобы я поделился своим опытом.\n\nЯ сломал шею примерно десять лет назад в возрасте примерно 17 лет, мне заменили левое плечо \\ ~ 5 лет назад, тенодисис двуглавой мышцы около двух лет назад. Дополнительные травмы включают разрыв двух сухожилий двуглавой мышцы с двух сторон, частичные разрывы двусторонней вращающей манжеты и двусторонние разрывы губ (частичные). Есть еще много, но вы поняли идею.\n\nВ качестве предисловия к моему ответу у меня есть хроническая боль в течение десяти лет, и я буду страдать всю оставшуюся жизнь (в той или иной степени). После того, как мне потребовалась операция и порвались обе мои вращающиеся манжеты, я не смог открыть двери, одеться, поиграть на гитаре, заняться спортом - все и все было болезненно, а качество моей жизни было чрезвычайно плохим. До того, как я начал свой режим, я исчерпал все другие варианты лечения, консервативные и другие (десятилетие физиотерапии, операции, PRP, стволовые клетки, холодный лазер, противовоспалительные диеты, Rolfing, Chiro, иглоукалывание - вы понимаете).\n\nПосле того, как мои ротаторные манжеты были разорваны во время физиотерапии для операции на тендоизе двуглавой мышцы, и я становился все хуже и хуже, я принял решение сделать последний рывок для достижения приемлемого качества жизни. Я начал инъекции гормона роста, имел несколько протоколов PRP / стволовых клеток / повторных травм, ежедневно принимал горстки витаминов и увеличивал свою физическую терапию до 10 раз в неделю. Кроме того, когда я только начинал, я также вводил BPC-157 и TB500. Мой подход был «все + кухонная раковина, потому что я не желаю прожить еще столько лет в моей жизни».\n\nЯ поправился. Намного лучше. Это было чрезвычайно сложно, однако, побочные эффекты были экстремальными. У меня были обмороки, сильная летаргия, растерянность, и я работал усерднее, чем когда-либо в своей жизни (в краткосрочной перспективе мой уровень боли резко увеличился из-за интенсивного режима ПТ + протокол повторной травмы).\n\nЧто я имею в виду под «я стал лучше»?\n\n\\ -После 6 месяцев этого режима я мог выполнять основные задачи без боли и помех. Одеваться, писать, основные движения над головой были возможны практически без боли. Я вырос примерно на дюйм (мой врач считает, что это произошло из-за декомпрессии и восстановления спинного мозга между моими позвонками + заживление / освобождение заблокированных мышц + нервов, а не из-за роста костей, как в период полового созревания). Сейчас я нахожусь на восьмом месяце вышеупомянутого режима, и я покинул ПТ и снова тренируюсь (осторожно, у меня все еще есть много проблем, которые мешают мне поднимать тяжелые или делать нажимающие движения).\n\nЯ описал восстановление своего здоровья после того, как мне сказали, что мои увлечения, увлечения и увлечение жизнью в основном закончились как не что иное, как «чудо». Чудо из крови, пота, слез и океана упорства. Я потратил много часов, просматривая медицинскую литературу, анекдотические отчеты и составляя максимально безумную, всестороннюю схему лечения. Трудно понять, насколько лучше я мог бы получить только с помощью одного гормона роста, однако это был катализатор исцеления, который иначе был бы невозможен с медицинской точки зрения (отрастание сухожилия, трещины в костях были устранены - ничего, кроме гормона роста, не помогло бы). быть в состоянии сделать это из моего понимания). Мои слезы на ротаторной манжете закрылись полностью (я отслеживал их с помощью снимков у одного из моих врачей - довольно здорово видеть, что он становится все меньше и меньше, а потом ... исчез), у меня меньше болей в шее + спине и т. Д. И т. Д. ,\n\nМои друзья, семья, профессора и коллеги по академическим наукам наблюдали, как я отказываюсь от необходимости требовать все самые обширные медицинские помещения в университете (например, я не мог пользоваться дверями, пока их не открывал кто-то другой, если не было кнопки для инвалидов) + атрофированный + опустошенный + больной многолетней хронической болью, не нуждающейся в приспособлении, возвращаясь к моим страстям + режим занятий в тренажерном зале. Многие отреагировали внутренне, увидев, что я возвращаюсь к здоровью, у меня были наставники и профессора, улыбающиеся до ушей и неоднократно спрашивающие меня: «Какого черта ?!».\n\nЯ плачу, и у меня мурашки по коже, просто пишу это. Гормон роста был самым большим подарком в моей жизни. Я разговаривал с плеотоорой медицинских работников, друзей, семьи, которые настоятельно рекомендовали не делать то, что я делал. Я не рекомендую делать то, что я сделал с кем-либо, если у вас нет других вариантов. Я пришел к выводу, что существует вероятность того, что будут долгосрочные последствия (потенциально). Мой эндокринолог на самом деле плакал со мной и пытался затащить меня в отделение акромегалии, чтобы отпугнуть меня от того, что я предложил.\n\nЯ рад, что не слушал, мягко говоря. Я держал видео журналы о процессе. Оглядываясь на них сейчас, унизительно.\n\nЯ надеюсь, что тот, кто читает это, найдет восстановление любым способом.\n\n\\-Морская свинка","title":"Мой гормон роста и восстановления после травм","subreddit_name_prefixed":"r/Biohackers","ups":10,"created":1549851791,"link_flair_background_color":"","id":"ap6mzn","author":{"name":"GuineaPiglet5"},"permalink":"/r/Biohackers/comments/ap6mzn/my_hgh_and_injury_recovery/","url":"https://www.reddit.com/r/Biohackers/comments/ap6mzn/my_hgh_and_injury_recovery/","created_utc":1549822991}