{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"\\ -Быстрый снимок моей установки PlatinumLED BIOMAX900 x2: [Распаковка / настройка / измерения / спектры BIOMAX] (https://imgur.com/a/jr95Eyw)\n\n\\ -Ссылка на [панели BIOMAX] (https://platinumtherapylights.com/collections/shop?aff=65)\n\n\\ -Руководство по загрузке: [https://cdn.shopify.com/s/files/1/0007/9711/4434/files/platinum-manual-v7-spreads-web.pdf?5533](https:// cdn.shopify.com/s/files/1/0007/9711/4434/files/platinum-manual-v7-spreads-web.pdf?5533)\n\n\\ -Скидной код для 5% скидки на любой свет или аксессуар: \"BIOHACK5\"\n\nКраткая предыстория, прежде чем я войду в первую часть моей серии обзоров. Впервые я узнал о терапии красного света шесть месяцев назад от одного из моих лидеров / модераторов в группе Thermo Diet на Facebook. Я следил за программами Thermo Diet и Kinobody в течение нескольких месяцев с фантастическими результатами. Я считаю, что эти программы диеты и физических упражнений работали для меня так хорошо, потому что они использовали несколько мощных методов биохакерства, таких как прерывистый пост, холодный душ, нервно-мышечные тренировки и оптимизация гигиены сна. Идея о том, что красный и ближний инфракрасный свет могут влиять на мое тело каким-либо существенным образом, казалась чрезвычайно интересной, и я начал погружаться в исследование. Несколько удивительных ресурсов, на которые я до сих пор ссылаюсь:\n\nИнтервью Ари Уиттена с доктором Майклом Хэмблином: [https://www.youtube.com/watch?v=D9oUlKpo1ek](https://www.youtube.com/watch?v=D9oUlKpo1ek)\n\nКнига Ари Уиттена «Главное руководство по терапии красного света: [https://www.amazon.com/Ultimate-Guide-Light-Therapy-Near-Infrared-ebook/dp/B07FJNZ821](https://www» .amazon.com / Окончательный-Guide-Light-Therapy-Near-Infrared-книга / дп / B07FJNZ821)\n\nВеб-сайт и подкаст Бена Грифилда (много хороших рецензий и подкастов на сайте): [https://bengreenfieldfitness.com/podcast/biohacking-podcasts/photobiomodulation/](https://bengreenfieldfitness.com/podcast/biohacking -podcasts / photobiomodulation /)\n\n\\ -Общая информация и отзывы пользователей в группах Facebook и Reddit. Введите «Фотобиомодуляция терапии красного света» в поиске в Facebook, чтобы присоединиться к одной из крупнейших групп. Более 3 тысяч участников.\n\nБыстро отправьте несколько месяцев, и я проверял свои варианты покупки. Я использовал эту формулу определения индекса стоимости, чтобы взвесить мои главные выборы (я использую это для всех больших билетов, и это особенно хорошо работает для панелей светотерапии): [https://imgur.com/giFBTlf](https://imgur. ком / giFBTlf)\n\nЧего-то не хватало. Панели Joovv казались слишком переоцененными, а в более дешевых вариантах отсутствовали некоторые важные функции, такие как цифровые элементы управления с таймером и блокировочные панели. Я не чувствовал себя комфортно, заказывая у Alibaba напрямую, так как в прошлом у меня было несколько неудачных попыток, связанных с получением поврежденных товаров и не получением приемлемого разрешения от продавца. Более того, если вы зададите им технический вопрос через Alibaba, они, как правило, будут угасать (для тех из вас, кто знаком с кантовской этикой, это также называется «уклонением от кантов»). Например, Q: «как ваши панели сравниваются с панелью« A »в отношении плотности мощности и качества сборки, A:« почти такой же, но гораздо дешевле ». В этом примере продавец не лжет, но его ответ, тем не менее, вводит в заблуждение и не полезно для покупателя. Если вы покупаете у Alibaba, следите за этим и убедитесь, что вы получите реальные ответы.\n\nЯ стремился к чему-то лучшему, чтобы выйти на рынок, зная, что терапия красным светом - это быстро растущее пространство.\n\nОколо восьми недель назад я заметил, что на странице магазина PlatinumLED в Facebook просочились несколько изображений новой линейки продуктов под названием «BIOMAX» (да, я следил за страницей этой компании в Facebook, надеясь на какую-то продажу или объявление :-)). Эти панели очень похожи на панели Joovv по своему дизайну и внешнему виду. Они выглядели современно, с цифровым управлением и аналогичными светодиодными проекторами, которые есть в устройствах Joovv. Я не знал подробностей в то время, но я подумал, что это стоит подождать, и, надеюсь, панели будут в моем бюджете.\n\nКогда PlatinumLED наконец объявил о светах / спецификациях, я был очень впечатлен общим предложением ценности и их новым [R + | NIR + спектром] (https://platinumtherapylights.com/blogs/news/nir-the-most-advanced-led-therapy -light-спектр & АРР = 65). Я разместил заказ на BIOMAX900 и получил его около месяца назад. Я разместил статью о быстрой распаковке и настройке галереи здесь: [https://imgur.com/a/jr95Eyw](https://imgur.com/a/jr95Eyw)\n\nПо поводу учебы. Ознакомьтесь с этой сводной таблицей документов Google. Вы можете использовать Ctrl + F для быстрого поиска интересующих тем: [https://docs.google.com/spreadsheets/d/1ZKl5Me4XwPj4YgJCBes3VSCJjiVO4XI0tIR0rbMBj08/edit?fbclid=IwAR12jUUxfoS8NvidxwxWGWGWGWGW0D0D0D0D0D0D0D0D0D0tto://Y://JJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJJ) / таблицы / д / 1ZKl5Me4XwPj4YgJCBes3VSCJjiVO4XI0tIR0rbMBj08 / редактировать? fbclid = IwAR12jUUxfoS8NvruQDMgJmyfDXCvNPGD8BYmIFZKAQWoRYj5oCsAi8Zw5yg # GID = 0)\n\nПервые впечатления.\n\nДавай приступим к этому. Актуальные вопросы в моей голове: будет ли группа делать все то, что рекламировала, и в какой степени она будет делать это? Это будет стоить потраченных денег и времени?\n\nРанее я четыре месяца подряд тестировал одну лампочку 250 RubyLux, чтобы посмотреть, не повлияет ли она на меня и не улучшит ли я некоторые солнечные пятна. Хотя он имел слабый эффект на кожу и сон, я бы сказал, что мощные светодиодные панели находятся в своем классе. Количество света, которое они излучают, чрезвычайно впечатляет (не представляю, что думают соседи, когда видят свет ночью).\n\n(Я пытался проводить лечение каждый день. Иногда я пропускал день из-за моего графика)\n\nДень 1. Я начал с 5-минутной процедуры для головы / туловища. Я хотел быть консервативным и посмотреть, как это повлияло на меня. После лечения я заметил слабое настроение и заряд энергии. Позже той ночью я спал глубже и спокойнее. Как будто я испытывал недостаток в чем-то, что мое тело не знало, что это нужно\n\n\\ ~ День 3. Я сократил время лечения до шести минут и добавил заднюю часть туловища. Дополнительное время обработки / площадь поверхности, казалось, немного повысили уровень энергии / настроения, и я также заметил небольшое сияние на моей коже. Я читал, что преимущества скинов приходят не быстро, поэтому было приятно увидеть небольшие изменения в этом отделе.\n\n\\ ~ Конец первой недели. К концу первой недели я определенно спал глубже, и прилив энергии / настроения стал более заметным. Мое плохое правое плечо и спина начали чувствовать себя «лучше», и я больше не расстраивалась из-за мелочей. Я решил обработать все тело (6 минут спереди, 6 минут назад и 3 по бокам от 8,5-12 ”).\n\nДень 10. Десять дней спустя я смог довольно хорошо почувствовать прилив энергии / настроения и даже почувствовал, как оно наступает через несколько минут после 18-минутной процедуры. К этому времени я заметил еще кое-что: резкое усиление умственной сосредоточенности. Я разместил заказ на вторую BIOMAX900, чтобы ускорить полное лечение тела.\n\n\\ ~ День 14. Я начал делать все процедуры для тела непосредственно перед тренировкой с отягощениями, чтобы извлечь выгоду из повышения энергии. В выходные дни я делаю сеанс 1 час на восходе или закате солнца в зависимости от моего графика.\n\nДень 21. Через неделю я работаю над новым пиаром в спортзале. Мой общий уровень силы и выносливости повышается, и я заметил, что мышцы живота полны гликогена большую часть времени. Моя кожа выглядит более здоровой и увлажненной.\n\n\\ ~ Конец первого месяца Я последовательно заканчиваю свои тренировки на 10-15 минут быстрее с бензином в баке. Медленно растущие / упрямые группы мышц, такие как мои бицепсы, хорошо реагируют на процедуры светотерапии.\n\nПо поводу совместных вопросов. Моя боль в пояснице и плечах значительно уменьшилась, однако, эти области все еще чувствуют себя нестабильными и, вероятно, нуждаются в комбинации светотерапии, растяжек и физиотерапии. Если вы страдаете от проблемы с суставами, я настоятельно рекомендую проверить книгу: «Мышцы: тестирование и работа с осанкой и болью». Просмотрите книгу, а затем оцените обученный физкультурник, чтобы определить, какие области вы должны растянуть и укрепить.\n\nОтносительно мышечной боли и восстановления (DOMS). У вас когда-нибудь была отличная тренировка, и на следующий день вы чувствуете сильную боль, которая может нарастать и длиться в течение нескольких дней? Кажется, я всегда получаю DOMS в ногах после короткого увольнения и возвращения к своим любимым тренировкам в приседе. Терапия красным светом устраняет этот сильный дискомфорт / боль от повреждения мышц / накопления молочной кислоты. Вы все еще чувствуете небольшую боль, но это совсем не плохо, потому что она не острая. Такое ощущение, что ты получил хорошую тренировку и не переусердствовал. Вы можете толкать себя сильнее в тренажерном зале, но IMO это не заходит так далеко, чтобы предотвратить выгорание ЦНС, поэтому постарайтесь не убивать себя, даже если соблазнительно продолжать увеличивать объем / вес ... Я добился лучших результатов с легкие процедуры перед тренировкой (гири) и предварительное активное восстановление (ходьба, катание на пену, йога и т. д.) в выходные дни.\n\nЧто касается тестостерона. Я не проверял свои уровни, но IMO повышение либидо реально. Если вы решите лечить яички, я советую начинать с консервативной дозы: каждый день с красным светом на расстоянии всего ~ 24 дюйма в течение 2 минут. Медленно продвигайтесь до 4 минут, красный свет только с расстояния 12 \". Вы можете сделать это после основной процедуры всего тела.\n\nВ дальнейшем я экспериментирую с разными временами лечения и расстояниями. Я опубликую больше статей после того, как у меня будет дополнительное время, чтобы испытать долгосрочные эффекты. Я пытался приблизиться к 4-6 ”, и было совершенно очевидно, что доза была слишком большой. Моя энергия была не такой высокой по сравнению с расстоянием 8,5-12 дюймов. Я буду тестировать панели с Tes-1333, чтобы набрать сумму в джоулях. В конце дня вы должны узнать, как вы себя чувствуете, и проверить верхний и нижний пределы, чтобы увидеть, как свет влияет на вас.\n\nПара вещей, которые я хотел бы добавить / улучшить в PlatinumLED, включают опцию каскадной последовательности для таймера (устанавливаются интервалы включения / выключения) и обновление для их приложения, чтобы отражать различные модели и обработанную площадь поверхности.\n\nПо поводу цены. Я понимаю, что эти панели недешевы, поэтому я обратился к PlatinumLED и установил купон на скидку «BIOHACK5» со скидкой 5% на любой свет. Я лично заплатил полную цену за оба светильника, и даже тогда я думаю, что они стоят затрат, особенно по сравнению с альтернативами. Если у кого-то возникнут вопросы, дайте мне знать, и я сделаю все возможное, чтобы ответить на них.","title":"PlatinumLED BIOMAX: первые впечатления от терапии красным светом","subreddit_name_prefixed":"r/Biohackers","ups":11,"created":1564214213,"link_flair_background_color":"","id":"ciaicp","author":{"name":"hhkb4lyfe"},"permalink":"/r/Biohackers/comments/ciaicp/platinumled_biomax_red_light_therapy_first/","url":"https://www.reddit.com/r/Biohackers/comments/ciaicp/platinumled_biomax_red_light_therapy_first/","created_utc":1564185413}