{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"# LogSmarter\n\nВсем привет, я собираюсь поступить на младший курс по специальности «Информатика» и хотел бы поделиться проектом, над которым я работаю последние несколько месяцев. Я одержим оптимизацией и количественной оценкой каждого аспекта моей жизни в отношении пригодности питания, и я могу предположить, что многие из вас тоже. Я лично очень заинтересован в фитнесе и спортивном питании, поэтому мне интересно, что я провожу много свободного времени, узнавая больше об этих темах. Этим летом я посвятил большую часть своего свободного времени работе над программным обеспечением, связанным с поиском очень точной оценки чьего-то TDEE. TDEE - сокращение от Total Daily Eneregy Расходы и является количеством калорий, которые ваш организм сжигает каждый день. Мой проект использует алгоритм адаптивной оценки для расчета вашего предполагаемого TDEE. В отличие от использования уравнений прогнозирования BMR и умножения на коэффициенты уровня активности для получения оценки TDEE (как работает большинство онлайн-калькуляторов), алгоритм также способен учитывать ежедневные колебания веса, потребление калорий и естественно учитывает дополнительные расходы, такие как незапланированные упражнения. ,\n\nLogSmarter - это веб-приложение, которое в настоящее время сосредоточено исключительно на поиске наиболее точной оценки вашего TDEE. В дальнейшем я планирую сделать приложение способным гораздо больше в отношении отслеживания питания, но в первом выпуске я действительно хотел сосредоточиться на том, чтобы делать что-то одно и делать это хорошо. LogSmarter является полностью функциональным в отношении оценки вашего TDEE и содержит документацию, в которой вы узнаете, как его использовать и как он на самом деле работает. Если вы хотите протестировать сайт, у меня есть то, что я считаю первым выпуском и выпуском, к которому вы можете получить доступ по следующей ссылке (бесплатно и без рекламы).\n\n[Https://ryanlefebvre.github.io/Log\\_Smarter/#/](https://ryanlefebvre.github.io/Log_Smarter/#/)\n\n& # X200B;\n\nПока Reddit - единственное место, где я показал LogSmarter кому-либо, кроме моих друзей и семьи. Через три дня на LogSmarter зарегистрировалось более 250 пользователей, что просто потрясающе. Так как этот проект заинтересовал многих людей, я решил сделать Kickstarter. Независимо от того, достигнута ли моя цель финансирования, я буду продолжать выпускать обновления, и текущая версия LogSmarter останется бесплатной и без рекламы. Однако с финансированием я смогу посвятить больше времени проекту и позволить себе некоторые обновления его текущей инфраструктуры. Если вы заинтересованы в поддержке проекта, ссылка ниже. [https://www.kickstarter.com/projects/logsmarter/logsmarter-simply-and-accurately-track-your-nutrition?ref=project\\_build](https://www.kickstarter.com/projects/logsmarter/ logsmarter-просто-и-точно-трек-ваш-питание? исх = project_build)\n\n# Скриншоты:\n\n& # X200B;\n\nhttps://preview.redd.it/hnz6njpqewg31.png?width=1897&format=png&auto=webp&s=ed3350a96c57378e50c009a2e28ea4ad76f64f55\n\nhttps://preview.redd.it/vvec5jpqewg31.png?width=1187&format=png&auto=webp&s=de947d5357cdc3d473a24eeed945df1c3a06334b\n\nhttps://preview.redd.it/5qkuyhpqewg31.png?width=1020&format=png&auto=webp&s=1ff9ff1cdc77d6e53915ccc27ab4f83eec764606\n\nhttps://preview.redd.it/4glt2lpqewg31.png?width=1290&format=png&auto=webp&s=c725fc5ab2f999eb83e409fa545f601ad117e6ff\n\n# Планы на будущее:\n\nУ меня есть много планов и идей о том, как улучшить LogSmarter, ниже приведен список лишь некоторых вещей, о которых я подумал, но в конечном итоге не вошел в текущую версию LogSmarter.\n\n* Пользователи смогут отслеживать больше переменных, чем просто калории и вес тела, цель состоит в том, чтобы позволить пользователям создавать и определять свои собственные переменные. Это может быть что-то вроде процента жира в организме, минут кардио, количества потребленной воды, часов сна и чего-либо еще на самом деле. Эта функция значительно расширит возможности LogSmarter. Она действительно станет местом, где вы сможете отслеживать, количественно и анализировать все переменные, прямо или косвенно связанные с питанием. Позволяя пользователям определять свои собственные переменные, это также предотвращает беспорядочное отображение информации, которая вас не волнует, предотвращая принудительный просмотр пользователями информации, которая им не нужна, и является постоянной функцией LogSmarter.\n* После того, как реализована возможность отслеживания определенных пользователем переменных, графические дисплеи для углубленного просмотра также будут обновлены. Вместо того, чтобы иметь только три графика для выбора, Пользователь сможет выбрать любые переменные для оси X и Y, а также тип графика. Таким образом, пользователь может сохранить определенные конфигурации, которые они предпочитают, и установить их в качестве параметров по умолчанию.\n* Я планирую реализовать способ синхронизации пользователя с учетной записью MyFitnessPal. Это было бы большим улучшением качества жизни при использовании приложения и позволило бы пользователям извлекать и анализировать свое питание, отслеживаемое в MyFitnessPal. С помощью этой функции вы можете извлекать записанные макросы в течение определенного периода времени и импортировать их в LogSmarter, а затем вы можете просмотреть свои пользовательские переменные и выбрать переменную для сравнения с вашими макросами. Например, вы можете выбрать пользовательскую переменную, такую как «энергия во время тренировки», которая оценивает энергию во время тренировки по шкале от 1 до 10, сравнить ее с вашим потреблением углеводов за определенный период времени, и вы можете сделать выводы о том, как потребление углеводов влияет на вашу энергию во время тренировки.\n* В конечном итоге я хотел бы разрешить отслеживать, количественно оценивать и анализировать аспекты тренировок и физических упражнений, но сейчас основное внимание будет уделено отслеживанию питания.\n* Я также хочу выпустить LogSmarter на IOS и Android, это было бы гораздо удобнее, чем загрузка веб-приложения в браузер на мобильном телефоне.\n* Еще одна особенность, связанная с отслеживанием, которое я хотел бы реализовать, - это позволить пользователям устанавливать цели для своих журналов питания (объем, нарезка, обслуживание). LogSmarter сможет анализировать прогресс людей в достижении их цели. Например, если ваша цель была громоздкой, и через 3 недели ваши данные показывают, что вы прибавляете со скоростью 1,5 фунта в неделю, то LogSmarter посоветует вам снизить скорость роста, потому что вы не оптимизируете соотношение полученной мышечной массы по сравнению с чтобы жир набрал.\n* Еще одна функция качества жизни - позволить приложению работать в автономном режиме, в настоящее время LogSmarter не позволяет пользователям обновлять данные, когда они не подключены к Интернету.\n\n# Как это работает:\n\nLogSmarter использует алгоритм адаптивной оценки для расчета вашего предполагаемого TDEE. В отличие от использования уравнений прогнозирования BMR и факторов уровня активности для получения оценки TDEE, LogSmarter способен учитывать ежедневные колебания веса, потребление калорий и естественно учитывает дополнительные расходы, такие как незапланированные упражнения. Если вы действительно хотите погрузиться в код, который реализует алгоритм или как работают другие части системы, весь проект находится в общедоступном хранилище, так что вы можете посмотреть на мой github. Внешний интерфейс приложения написан на Angular, и все данные на внутреннем сервере в настоящее время хранятся с использованием Google Firebase. [https://github.com/RyanLefebvre] (https://github.com/RyanLefebvre)\n\nПо сути, алгоритм работает с использованием правила 3500 калорий на фунт, которое гласит, что 3500 калорий эквивалентно одному фунту массы тела. Чтобы сделать это правило полезным, нам нужно знать несколько переменных: сначала нам нужно знать суточную массу тела и потребление калорий в течение нескольких дней, а затем нам нужно знать период времени, за который у нас есть данные. Период времени, за который у нас есть данные в этой системе, будет называться журналом, который в действительности является списком записей, в которых есть дата, вес и потребление калорий.\n\nКак только мы узнаем, сколько времени у нас есть данные, мы можем начать делать некоторые вычисления. Сначала мы захотим определить количество потерянного или прибавленного веса, рассчитав разницу между начальным и текущим весом пользователя. Чтобы сделать это значение более точным, система использует средние значения вместо одного значения, когда пользователь создает новый журнал, ему предлагается ввести начальный вес. Это дает системе начальное значение для работы, но оно будет перезаписано после ввода данных за неделю. Обновленное значение будет отражать среднее значение их первой недели записей, что является более точным, чем одна запись. Точно так же текущий вес пользователей является средним значением их записей за последние недели. Следует отметить, что алгоритм рассматривает недели как 7-дневные периоды, которые начинаются с даты начала журнала, вместо использования недель, определенных григорианским календарем.\n\nЗатем нам нужно найти среднюю еженедельную норму прироста или потери в фунтах веса для пользователя, это можно сделать, взяв разницу в начальном весе и текущем весе и разделив ее на количество недель в журнале. При средней еженедельной норме прибыли или убытка мы можем затем определить среднюю недельную избыточную калорийность или дефицит путем умножения нормы в фунтах на 3500.\n\nНаконец, мы можем взять средний недельный профицит или дефицит и разделить это значение на 7, теперь у нас есть среднесуточный профицит или дефицит для пользователя. Используя это значение, мы можем взять среднее количество калорий, которое пользователь потреблял каждый день в журнале, и это даст среднесуточное потребление калорий для пользователя. Затем мы производим оценку TDEE пользователей путем вычитания среднего ежедневного избытка из среднего ежедневного потребления пользователей или добавления среднего ежедневного дефицита к среднему ежедневному потреблению пользователей.\n\nЭтот алгоритм является самонастраивающимся и благодаря закону больших чисел он со временем улучшит свою точность. Следует помнить, что для правильной работы системы сбор данных должен быть согласованным. Для получения рекомендаций и рекомендаций я предлагаю ознакомиться с руководством по началу работы на сайте.\n\n# Что этот проект значит для меня:\n\nКоличество дезинформации, которая широко распространена в отношении фитнеса и питания, поистине огромна. Как и многие другие, я изначально был одурачен «гуру», предлагающим универсальное решение для оптимальной диеты или программы тренировок. Я до сих пор помню, как изменились мои взгляды на питание, когда я впервые начал тренироваться из-за своих источников информации. Я прошел через фазы потребления смешного количества белка (до 2 г / фунт веса тела), полностью исключая углеводы, устанавливая будильник на моем телефоне ночью, чтобы проснуться и бросить протеиновый коктейль и массу других смешных и ненужных привычек ,\n\nВ конце концов я понял, что мой подход был ошибочным и постоянно пытался подражать тому, что рекомендует личность YouTube с хорошим телосложением, просто не получал желаемых результатов. Я решил должным образом научиться тому, как тренироваться и есть так, чтобы помочь мне добиться прогресса в достижении моих физических и силовых целей. Я начал исцелять свои источники информации о здоровье и фитнесе, основываясь на доверии, а не на популярности. Медленно, но верно я внедрял научно обоснованные методы в свое обучение и питание, что позволило мне развиваться быстрее, чем когда-либо прежде.\n\nЕдинственное вмешательство, которое я нашел наиболее полезным, - это количественная оценка переменных, связанных с моей тренировкой и питанием. У меня есть журналы, датированные более 2 лет, с ежедневными данными о моем весе тела, потреблении калорий, процентном содержании жира в организме, разделении макронутриентов и объеме тренировок в тренажерном зале. Возможность наблюдать за тенденциями в данных, которые я собираю о себе, открыла мне глаза на полезность записи и анализа таких переменных. Однако проблема этого подхода заключается в том, что у меня не было централизованного места для хранения всей этой информации, вместо этого у меня было несколько электронных таблиц, ноутбуков и приложений, которыми я одновременно управлял. В конце концов я пришел к решению собрать всю эту информацию в небольшой блокнот и искать тенденции и связи между переменными, это было лучше, чем ничего, но я знал, что должен быть более разумный способ сделать это.\n\nПосле нескольких месяцев неэффективного отслеживания этих данных мне пришла в голову идея создания программного обеспечения, позволяющего объединять все эти переменные в одном месте, я хотел, чтобы программное обеспечение обеспечивало простое понимание и анализ отслеживаемых переменных, а также предоставило пользователям возможность создать дисплей, состоящий только из информации, которую они хотели. К сожалению, когда я пришел к этой идее, это было начало второго семестра моего второго курса в колледже, и у меня не было дополнительного времени, чтобы посвятить побочный проект. Я записал свою идею, и она находилась в файле .txt на моем рабочем столе в течение следующих нескольких месяцев до лета 2019 года.\n\nВ июне этого года я начал свою первую стажировку по разработке программного обеспечения. Каждый день я работаю с 9:00 до 17:00, немедленно ухожу с работы и хожу в тренажерный зал, а затем каждый вечер, возвращаясь в свою квартиру, я медленно отрываюсь от LogSmarter. Это привело к большому количеству очень долгих дней, и я часто терял сон, чтобы не отставать от проекта. Моей первой целью было создать что-то функциональное, которое было бы простым в использовании, выполняло определенную задачу и хорошо выполняло эту задачу. Этим летом я потратил большую часть своего свободного времени на создание LogSmarter, и для первого выпуска LogSmarter я доволен состоянием приложений, но у меня гораздо большие планы на будущее. Если вы решите использовать LogSmarter, пожалуйста, дайте мне знать, что вы думаете о проекте и как я могу сделать его лучше.","title":"Адаптивное веб-приложение для оценки TDEE","subreddit_name_prefixed":"r/Biohackers","ups":5,"created":1566028215,"link_flair_background_color":"","id":"crejie","author":{"name":"BostonRAL"},"permalink":"/r/Biohackers/comments/crejie/adaptive_tdee_estimation_web_app/","url":"https://www.reddit.com/r/Biohackers/comments/crejie/adaptive_tdee_estimation_web_app/","created_utc":1565999415}