{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Я обновил свой Chilipad до Ooler, и пока охлаждающий блок великолепен, новая прокладка дует. Они добавили [абсурдное количество отступов] (https://imgur.com/tlRgQAm). Я буквально должен был проверить, работала ли вещь даже при самой низкой температуре. Если Ooler - ваш первый аппарат, вы можете подумать, что слабое охлаждение - это нормально, но это не так. Это должно быть намного круче. В этом посте я покажу вам, как это сделать (и это может относиться и к Chilipad).\n\nДля обеспечения объективности я измерил температуру поверхности [до] (https://i.imgur.com/F6NIDpx.jpg) и [после] (https://i.imgur.com/0FISExC.jpg), удалив изоляцию и там это колоссальная * 9 ° F разница *. В основном, большая часть охлаждения не проходила через утешительную изоляцию. Кроме того, изоляция удерживает тепло вашего тела, а водостойкий слой менее воздухопроницаемый. Кроме того, более тонкая (серая) сторона обращена вниз, поэтому большая часть охлаждения уходит в кровать! Неудивительно, что мне было так чертовски тепло.\n\nЯ не знаю, кто подписался на этот смешной дизайн коврика. Это эффективно наносит вред основной цели устройства: охлаждение вашего тела. По-видимому, это было потому, что несколько человек жаловались, что они могут чувствовать трубки (хотя я не видел ни одного отзыва о Chilipad, в котором упоминается об этом, хотя [много отзывов] (https://www.amazon.com/chiliPAD-Cube-3-0-Te Temperature -Enhancement / product-reviews / B07GT9NNZD / ref = cm_cr_dp_d_hist_1? Ie = UTF8 & filterByStar = one_star & reviewerType = all_reviews # reviews-filter-bar) хотелось бы, чтобы она была холоднее, даже с более тонким Chilimat).\n\nЕсли вы заплатили сотни долларов за Ooler, я настоятельно рекомендую отрезать слой изоляции. Охлаждение великолепно лучше. Вот как:\n\nОказывается, что на подушке фактически есть [сэндвич слоя внутреннего вкладыша] (https://i.imgur.com/VCvGo0s.jpg) на месте труб (что делает внешние слои еще более нелепыми). Таким образом, нет риска срезать ненужные внешние слои. Все, что вам нужно сделать, это прижать рыхлый наружный слой к середине и вытащить его, убедившись, что вы не захватываете какие-либо трубки, в точности [как показано на рисунке] (https://i.imgur.com/VCvGo0s.jpg). Чем ближе к середине, тем безопаснее.\n\nПосле того, как вы оторвались, сделайте небольшое отверстие для стартера, из которого вы можете начать резать по периметру. Сначала сделайте серую сторону, так как это легче (вы можете даже разорвать ее вручную, чтобы быть еще безопаснее, или использовать рыхлитель шва). Вот изображение [мягкой стороны] (https://i.imgur.com/kKSldcr.jpg), та же самая процедура, только немного толще.\n\nЗдесь вы можете видеть, что [внутренний слой] (https://i.imgur.com/vkWlwFb.jpg) плотно пришит к трубам, поэтому нет риска натянуть его вместе с неприкрепленным внешним слоем, если вы начнете в середине. , Если бы вы случайно схватили его, вы бы сразу поняли, потому что выдернули бы весь слой труб.\n\nРазница между днем и ночью. Я чувствовал * огромную * разницу, когда моя кожа касалась мата. Внутренний слой на самом деле тоньше, чем оригинальный Chilimat и [перфорированный] (https://i.imgur.com/VCvGo0s.jpg), поэтому охлаждение еще лучше. Они должны просто отправить это так! Так что я на самом деле рад, что изменил пэд Ooler, а не обменял его на Chilimat. IMO - это пустая трата, чтобы платить все эти деньги за единицу, а не делать это улучшение.\n\nЭто, конечно, приведет к аннулированию гарантии на площадку. Но я предпочел бы иметь планшет, который действительно работает, чем бесполезный с гарантией.\n\nВы также можете вырезать внутренний слой и просто выложить сырые трубки для дополнительного охлаждения. Я могу сделать это, я еще не решил. Единственное, что он делает, это держит трубки равномерно на расстоянии, если вы не будете много катиться, вы можете получить еще лучшее охлаждение, сосредоточив их все под своим телом. Я сомневаюсь, что они будут двигаться очень даже без лайнера. Плюс без вкладыша его никогда не нужно мыть.\n\nЕсли у вас есть Chilipad, вы тоже можете это сделать. Chilipad не имеет дополнительных внешних слоев, так что вы будете в основном резать отдельные каналы, чтобы сырые трубки были выставлены. Разница не будет столь существенной, потому что для начала меньше отступов, но все же есть существенное количество, и все, что он делает, это ухудшает охлаждение. Почувствовав усиление охлаждения при удалении прокладки Ooler, я бы сделал это с моим Chilimat. Для Chilimat я бы просто обрезал линию вниз по каждому «каналу», в котором находится трубка, и вытянул трубку и позволил ей упасть на верхнюю часть прокладки. Таким образом, они все еще держатся вместе на концах, но трубы пустые.\n\nЕсли вы хотите получить представление о том, насколько это важно, перед тем как разрезать, положите тонкое одеяло (такой же толщины, как показано на рисунке) поверх вашего Ooler / Chilipad и посмотрите, насколько оно снижает ваше охлаждение. Именно так существующая обивка ухудшает ваше охлаждение.\n\nНаконец, владельцы Ooler, пожалуйста, присылайте им отзывы об этой абсурдной прокладке, чтобы они надеялись улучшить продукт. Честно говоря, я не знаю, знают ли они, насколько хуже этот новый планшет. Я думаю, что они пытались решить одну проблему (чувствовать трубы) и непреднамеренно создали большую проблему на своем месте (не круто). Я бы предложил сделать его дополнительным «комфортным» слоем с застежкой-молнией, но не заставлять его всех. Опубликуйте также свой опыт здесь, если вы найдете в нем значительное улучшение.\n\nИзменить: В дополнение к этому, это удивительное интервью Ронды Патрик с [Ray Cronise] (https://www.youtube.com/watch?v=uNzZod_d18A) рассказывает о широких преимуществах расширенного умеренного воздействия холода (помимо просто лучшего сна). ). Этот разговор - главная причина, по которой я одержим максимальную холодность моей установки и почему изоляционная прокладка просто не режет ее.","title":"Сделайте свой Ooler (или Chilipad) ПУТЬ более эффективным, отключив ненужную изоляцию","subreddit_name_prefixed":"r/Biohackers","ups":22,"created":1567468233,"link_flair_background_color":"","id":"cyqpto","author":{"name":"notapersonaltrainer"},"permalink":"/r/Biohackers/comments/cyqpto/make_your_ooler_or_chilipad_way_more_effective_by/","url":"https://www.reddit.com/r/Biohackers/comments/cyqpto/make_your_ooler_or_chilipad_way_more_effective_by/","created_utc":1567439433}