{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Недавно я запустил продукт, который фокусируется на пользе для здоровья трав и специй. До того, как я начал работать над этим проектом, я определенно не считал, что травы и специи являются суперпродуктами, как ни крути, и я считал себя осведомленным в отношении здоровья и питания.\n\nЧто делает их суперпродуктами? Их фитохимические или, в общем, антиоксиданты. Что меня действительно заинтересовало, так это то, что я наткнулся на исследование, проведенное на более чем 3100 пищевых продуктах, измеряющих содержание антиоксидантов. Унция на унцию травы и специи составляла в среднем ** наибольшее содержание антиоксиданта ** - больше, чем темный шоколад и черника на километры ...\n\nТак что это немного заинтересовало меня, но помимо этого я хотел узнать больше.\n\nЯ нашел целые книги по фитотерапии, такие как этот золотой прииск: ** Фитотерапия, 2-е издание Биомолекулярные и клинические аспекты **, найденные здесь - [https://www.ncbi.nlm.nih.gov/books/NBK92773/] (https://www.ncbi.nlm.nih.gov/books/NBK92773/) некоторые из последствий - отвисание челюсти. Он углубляется в механизмы того, как травы и специи положительно влияют на важные болезни нашего времени, включая рак, сердечно-сосудистые заболевания, дерматологические расстройства, нейрогенеративные заболевания, диабет и многое другое.\n\nОдно из моих любимых исследований, основанных на данных, которое я нашел на PubMed, изучало историческую тенденцию в биомедицинской литературе, сообщающей о ассоциациях с болезнями пряностей. Обнаружение экспоненциального увеличения статей, сообщающих о терапевтическом действии специй в последние несколько десятилетий. Количество статей, сообщающих о положительных ассоциациях специй с болезнями, значительно превосходило число статей, сообщающих о негативных ассоциациях. Вот график, представляющий данные:\n\n[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5973616/bin/pone.0198030.g002.jpg](https://www.ncbi.nlm.nih.gov/pmc/articles/ PMC5973616 / бен / pone.0198030.g002.jpg)\n\nПоэтому я начинал думать, что, может быть, здесь, на западе, мы просто потеряли связь с силой трав и аюрведических практик. Традиционная китайская медицина основана на 5000-летней медицинской практике и богатом данными клинических экспериментов, которые гарантируют ее эффективность и действенность. Думаю, для этого есть что сказать.\n\nЕсли вам интересен механизм действия всех положительных эффектов от специй, я познакомлю вас с другим исследованием, опубликованным в ** Журнале трансляционной медицины **, в котором говорится:\n\n«Соединения специй взаимодействуют с несколькими мишенями и изменяют нерегулируемые пути воспаления, связанные с хроническими заболеваниями. Следовательно, благодаря фатальным побочным эффектам и завышенной стоимости современных терапевтических средств, специи и их активные компоненты имеют огромную гарантию для разработки доступных, новых и безопасных лекарств от хронических заболеваний.\n\nПомимо великих последствий для болезни, будучи «биохакером», я хотел знать, был ли я уже здоровым человеком выше среднего уровня, как я могу использовать травы и специи в своих интересах и еще больше оптимизировать свое здоровье?\n\nПоэтому я начал находить исследования (модели человека и животных), предлагающие различные терапевтические эффекты, которые достижимы из трав / специй. Вот несколько примеров:\n\n* Смешивание розмарина, тимьяна и орегано вместе и нанесение его на мясо перед грилем снижает количество канцерогенных соединений (ГКА / ПАУ) до 78-87%.\n* Корица превратила плохо обучающихся мышей в хороших учеников. Корица метаболизируется в бензоат натрия, химическое вещество, используемое в качестве лекарственного средства для лечения повреждений головного мозга. Бензоат натрия превращается в BDNF, который считается чудом для мозга, потому что он создает новые клетки мозга, помогает поддерживать целостность нейронов и синапсов, в дополнение к обучению и памяти. Более низкие уровни BDNF связаны с когнитивным снижением\n* Эквивалент 1 ½ чайной ложки куркумы в течение 18 месяцев показал улучшение памяти на 28% и меньшее количество бляшек и клубков в головном мозге, которые связаны с болезнью Альцгеймера у пожилых людей с легкими жалобами на память.\n* Было также установлено, что экстракт розмарина улучшает когнитивные функции и работу памяти до 15% у людей.\n\nПо общему признанию сначала я был главным образом сосредоточен на пользе для мозга, но в конечном счете я обнаружил целый ряд других терапевтических эффектов.\n\nИмея это в виду, я бы пошел в магазин и купил травы и специи, которые были самыми высокими в списке антиоксидантов (перекрестные ссылки также на несколько других антиоксидантных анализов), и те же самые, как оказалось, имели самый терапевтический потенциал. В частности:\n\n* Гвоздика\n* Корица\n* Орегано\n* Розмарин\n* Тимьян\n* Куркума\n\nЯ хотел знать больше, и как оптимизировать дальше, поэтому я начал задаваться вопросом, что я пропустил? Вот некоторые другие выводы:\n\n* Пиперин (основное соединение черного перца) увеличивает биодоступность куркумина (полезного основного соединения куркумы) ⁠ у крыс на 154%, а у людей на 2000%.\n* Вид трав и специй также важен - например: корица кассии богата гепатотоксическим соединением (молекула, повреждающая печень), а у Цейлона AKA «True» корица очень низкая.\n* Травы и специи являются светочувствительными, что означает, что они будут ухудшаться и терять свою потенцию при воздействии света. Почти все специи в магазине в прозрачных контейнерах ?! Что если я забуду хранить их в темном месте?\n\nМоим решением для всего этого было сделать продукт, который я бы использовал сам, для которого я был бы заказчиком. Я также хотел получить ** максимальную выгоду ** от ** минимальных усилий ** - путь наименьшего сопротивления. Поэтому я сформулировал дополнительные смеси, которые делили общие терапевтические преимущества и которые (из-за отсутствия лучшего термина) «синергизируют» друг с другом, почти как сложный эффект. Используя только самые чистые виды и все, хранящиеся в янтарном стекле, которое блокировало бы 99% ультрафиолета на случай, если я оставлю свои специи на прилавке открытыми для света.\n\nПоэтому я создал [https://www.blendful.org/](https://www.blendful.org/)\n\nПосмотрите и дайте мне знать, что вы думаете - любая конструктивная критика приветствуется, и я ценю любые отзывы!\n\nНадеюсь, это было не слишком многословно, я действительно чувствовал, что мне нужно больше информировать о травах и специях, что они предназначены не только для ароматических целей с минимальной питательной ценностью - совсем наоборот. Надеюсь, я достиг этого, даже если только один человек получил пользу.\n\nСпасибо за чтение!\n\nJavon\n\nИсточники:\n\n[Https://nutritionj.biomedcentral.com/articles/10.1186/1475-2891-9-3](https://nutritionj.biomedcentral.com/articles/10.1186/1475-2891-9-3)\n\n[Https://www.ncbi.nlm.nih.gov/books/NBK92773/](https://www.ncbi.nlm.nih.gov/books/NBK92773/)\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5973616/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5973616/)\n\n[Https://www.mdpi.com/1420-3049/21/5/559/pdf](https://www.mdpi.com/1420-3049/21/5/559/pdf)\n\n[https://uanews.arizona.edu/story/grilled-meat-oregano-reduced-risks-of-cancer-foodborne-disease](https://uanews.arizona.edu/story/grilled-meat-oregano- уменьшенные риски, из-рака-болезней пищевого происхождения)\n\n[Https://www.sciencedaily.com/releases/2007/06/070627124111.htm](https://www.sciencedaily.com/releases/2007/06/070627124111.htm)\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5097886/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5097886/)\n\n[Https://eurekalert.org/pub\\_releases/2018-10/s-nrs101518.php](https://eurekalert.org/pub_releases/2018-10/s-nrs101518.php)\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4466762/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4466762/)\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5785894/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5785894/)","title":"Почему мы не говорим о травах и специях?","subreddit_name_prefixed":"r/Biohackers","ups":20,"created":1567647138,"link_flair_background_color":"","id":"czo0nc","author":{"name":"javonbangs"},"permalink":"/r/Biohackers/comments/czo0nc/why_arent_we_talking_about_herbs_spices/","url":"https://www.reddit.com/r/Biohackers/comments/czo0nc/why_arent_we_talking_about_herbs_spices/","created_utc":1567618338}