{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Подумайте, лучший подход к диете - это экспериментировать самостоятельно, а не слепо следовать тому, что думают «эксперты». Вот часть того, почему я так думаю:\n\n** Пищевая эпидемиология **\n\nИсследования в области питания имеют невероятно низкое качество, во многом из-за чрезмерного использования эпидемиологии питания FFQ, большинство рекомендаций дано для исследований такого типа:\n\nhttps://www.bmj.com/content/360/bmj.k822/rr-13\n\n> Анализ 2011 года 52 утверждений, сделанных эпидемиологией питания, протестированных в 12 хорошо контролируемых исследованиях, показал, что ни одно из 52 утверждений - 0% - не может быть подтверждено. [5] Анализ эпидемиолога Стэнфорда Джона Иоаннидиса, проведенный в 2005 году, пришел к выводу, что высоко цитируемые данные наблюдений, такие как данные о питании, были подтверждены РКИ только в 20 процентах случаев. [6] ¨\n\n\n\n---\n** Fiber **\n\nИдея, что волокно является хорошим, в основном основана на таких ужасных исследованиях, было много гипотез о том, почему это хорошо. до сих пор они в основном терпели неудачу при испытаниях в клинических испытаниях.\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3435786/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3435786/)\n\n> ЗАКЛЮЧЕНИЕ: Идиопатический запор и связанные с ним симптомы могут быть эффективно уменьшены путем прекращения или даже снижения потребления пищевых волокон.\n\n[Диаграмма данных исследования, сравнивающая потребление клетчатки с симптомами] (https://ibb.co/fuodEm)\n\nЕсли вы еще не поняли истоков идеи о том, что волокно хорошее, я настоятельно рекомендую вам это сделать, это довольно интересно.\n\n[http://davidgillespie.org/4-good-reasons-not-to-add-fibre-to-your-diet/](http://davidgillespie.org/4-good-reasons-not-to-add -fibre к вашей диете-/)\n\nПохоже, что это был постоянный сдвиг в постах, поскольку различные гипотетические преимущества не были реализованы при испытаниях в клинических испытаниях.\n\n\n** Фрукты и овощи **\n\n[Https://www.ncbi.nlm.nih.gov/pubmed?Db=pubmed&Cmd=ShowDetailView&TermToSearch=12064344](https://www.ncbi.nlm.nih.gov/pubmed?Db=pubmed&Cmd=ShowDetailView&TermToSearch=12064344)\n\n> Поскольку не наблюдалось долгосрочных эффектов ГТД, исследование в основном служило исследованием истощения фруктов и овощей. Общий эффект 10-недельного периода без диетических фруктов и овощей заключался в снижении окислительного повреждения ДНК, белков крови и липидов плазмы, одновременно с заметными изменениями антиоксидантной защиты.\n\n[Http://www.diagnosisdiet.com/food/vegetables/](http://www.diagnosisdiet.com/food/vegetables/)\n\n> На момент написания статьи (август 2012 г.) в PubMed (научная поисковая система) перечислены 762 клинических исследования, связанных с овощами и здоровьем человека.\n>\n> ...\n>\n> О, и в случае, если вам интересно, из 7 одиноких исследований, которые рассматривали только овощи (вместо фруктов и овощей вместе), 6 из этих 7 исследований оказались в отрицательной категории, что означает, что овощи ( s) не обеспечили ожидаемой пользы для здоровья. Хммм.\n>\n> ...\n\n** Антиоксиданты **\n\n\n\n[Https://www.sciencedirect.com/science/article/pii/S0271531717303287](https://www.sciencedirect.com/science/article/pii/S0271531717303287)\n\n> Антиоксиданты из рациона или пищевых добавок не изменяют маркеры воспаления у взрослых с риском сердечно-сосудистых заболеваний. Пилотное рандомизированное контролируемое исследование\n\n[https://www.psychologytoday.com/us/blog/diagnosis-diet/201712/the-antioxidant-myth](https://www.psychologytoday.com/us/blog/diagnosis-diet/201712/the- антиоксиданты миф)\n\n> Короче говоря, нет никаких научных оснований полагать, что потребление ненужных антиоксидантов улучшает здоровье человека. Министерство сельского хозяйства США зашло настолько далеко, что удалило свою базу данных по антиоксидантам для выбранных продуктов со своего веб-сайта из-за:\n>\n>> «Все больше доказательств того, что значения, указывающие на антиоксидантную способность, не имеют отношения к воздействию конкретных биоактивных соединений, включая полифенолы, на здоровье человека… [антиоксидантные] значения обычно используются компаниями-производителями пищевых продуктов и биологически активных добавок для продвижения своих продуктов и потребителей для направлять их выбор продуктов питания и пищевых добавок ».\n\n** фитонутриентов / фитохимикалии **\n\nФитонутриенты раньше назывались фитохимическими веществами, большинство из которых - инсектициды растительного происхождения.\n\nБольшая лекция на тему: [Растительные пищевые токсины в эволюционном контексте - Джордж Диггс, доктор философии. (AHS14)] (https://www.youtube.com/watch?v=fnjX3cZ4q84)\n\nмногие лекарства берут свое начало в таких соединениях, но это не означает, что это хорошая идея - потреблять широкий спектр их в небольших количествах, надеясь, что в сети это полезно ...\n\n** зерну **\n\nЗерна с низким содержанием большинства питательных веществ:\n\n[Http://www.zoeharcombe.com/2014/04/healthy-whole-grains-really/](http://www.zoeharcombe.com/2014/04/healthy-whole-grains-really/)\n\n[Https://www.cochrane.org/CD005051/VASC_whole-grain-cereals-cardiovascular-disease](https://www.cochrane.org/CD005051/VASC_whole-grain-cereals-cardiovascular-disease)\n\n> Заключение>> В настоящее время недостаточно рандомизированных контролируемых исследований, чтобы рекомендовать потребление цельнозерновой диеты для снижения риска сердечно-сосудистых заболеваний или снижения уровня холестерина в крови или артериального давления.\n\n[Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3705319/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3705319/)\n\n> В этом обзоре мы обсуждаем данные исследований in vitro, in vivo и вмешательства человека, которые описывают, как потребление пшеницы, а также других зерновых культур, может способствовать проявлению хронического воспаления и аутоиммунных заболеваний за счет увеличения проницаемости кишечника и инициирования воспалительный иммунный ответ.\n\n[Https://www.ncbi.nlm.nih.gov/pubmed/19538307](https://www.ncbi.nlm.nih.gov/pubmed/19538307)\n\n> Интересно, что последние данные свидетельствуют о том, что глиадин также участвует в патогенезе СД1. Появляется все больше доказательств того, что повышенная проницаемость кишечника играет патогенную роль при различных аутоиммунных заболеваниях, включая CD и T1D. Поэтому мы предполагаем, что помимо генетических факторов и факторов окружающей среды, потеря кишечной барьерной функции необходима для развития аутоиммунитета. В этом обзоре каждый из этих компонентов будет кратко рассмотрен\n\nОни бедны питательными веществами, высококалорийны, иммуногены, все вокруг ужасная пища.\n\n---\n\n\n** RDA **\n\nИсследования RDA использовали людей на стандартной диете и, следовательно, применимы к людям на стандартной диете. Существует множество причин, по которым потребности в питательных веществах при радикально различающейся диете будут другими.\n\nпроверьте эту лекцию: https://www.youtube.com/watch?v=kX4qsJd_Plc\n\n\n\n\nНекоторые проблемы с применением RDA: s\n\n- часто не учитывается биодоступность, которая может различаться в зависимости от пищи: [пример] (http://www.diagnosisdiet.com/wp-content/uploads/2012/08/micronutrients-meats.jpg )\n    \n- индивидуальные вариации, такие как: [генетические мутации] (https://chrismasterjohnphd.com/2018/10/02/what-everyone-should-be-doing-about-methylation/), здоровье кишечника и т. д. могут влиять на то, сколько вы поглощаете и сколько тебе нужно.\n    \n- Он не учитывает анти-питательные вещества: [значения цинка в крови после употребления устрицы с различными продуктами и без них] (http://www.diagnosisdiet.com/wp-content/uploads/2017/09/oyster-zinc-graph -768x640.png) - [Исследования] (http://www.nutrientsreview.com/antinutrients)\n    \n- RDA, где создали изучающих людей на довольно нормальных диетах. Большинство минералов и витаминов используются в обмене веществ. если вы радикально измените свой метаболизм, оптимальное количество, вероятно, изменится. Несколько примеров этого:\n    \n    - [потребность в тиамине сокращается вдвое при низкоуглеводной диете] (https://chrismasterjohnphd.com/2017/06/01/thiamin-carbs-ketogenic-diets-microbes-mwm-2-14/)\n    - [Потребность в витамине С снижается при кетогенной диете] (https://www.breaknutrition.com/ketogenic-diet-vitamin-c-101/)\n    - [49/50 человек, соблюдающих палеокетогенную диету (плотоядное животное) без добавок, имели нормальные сывороточные уровни магния] (https://jevohealth.com/journal/vol2/iss2/6/)\n\n\n---\n\n** История **\n\nИстоки организаций диетологии также невероятно интересны и не должны быть упущены, если вы попытаетесь понять сферу питания:\n\nhttps://www.isupportgary.com/articles/seventh-day-adventist-plant-based-nutrition","title":"Почему вы не должны слепо доверять специалистам по питанию, а вместо этого самостоятельно экспериментировать.","subreddit_name_prefixed":"r/Biohackers","ups":31,"created":1569347578,"link_flair_background_color":"","id":"d8ky2y","author":{"name":"greyuniwave"},"permalink":"/r/Biohackers/comments/d8ky2y/why_you_should_not_blindly_trust_nutrition/","url":"https://www.reddit.com/r/Biohackers/comments/d8ky2y/why_you_should_not_blindly_trust_nutrition/","created_utc":1569318778}