{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Прошло уже несколько лет, как «40 лет дзен» работает. Прочитав об этом в Интернете и обсудив его с друзьями, я обнаружил, что программа сочетает в себе продвинутую тренировку нейробиоуправления со специальной диетой для мозга, ноотропами и техниками медитации.\n\nПоложительных:\n\n* ** Продвинутые методы нейробиоуправления **\n* Сочетает в себе все, что может повысить работоспособность мозга, включая диету и ноотропы\n* Мне действительно нравится, как это полностью ** избегает стигмы сектора психического здоровья **. Он избегает любых упоминаний о психических расстройствах и болезнях и всего, что может связать это с областью медицины.\n* ** Умный маркетинг **. Это способствует формированию образа, объединяющего древнюю мудрость и традиции с современной наукой, что может создать впечатление, что это безопасно.\n\nОтрицательных\n\n* Это ** очень рискованно **. Это очень новая наука и технология. И «40 лет дзен» сочетают в себе новейшие технологии. Конечно, на сайте есть красивые картинки и дружеская презентация, и он сделан очень богатым предпринимателем. Но как вам нравится кто-то играет с вашим мозгом? И какой здоровый человек рискнул бы, чтобы кто-нибудь связался с их мозгом?\n* Нет абсолютно никаких упоминаний о риске или ущербе **. Это просто слишком идеально. Еще одна из тех черно-белых вещей, которые удивительно все белые. У него просто нет негативов. Это сделает вас супер гением, или иначе, просто веселым опытом. Не то, как работает мозг человека. Если это имеет эффект, это может пойти ужасно, ужасно неправильно. И очень вероятно, что это случится с кем-то. Возможно не 99/100, но в 1 из 100. Так что, если это произойдет? Интересно, как \"40 лет дзен\" сходит с рук. Единственная мера, которую я обнаружил, - это то, что каждый, кто подает заявку на первую поездку туда, должен пройти тест, и он принимает только определенных людей. Я предполагаю, что они отвергают любого, у кого есть психическое расстройство в определенном прогрессирующем состоянии ..\n* Кажется, он основан на этом футуристическом американском менталитете, где он представляет нейробиологов как некую форму супер-богов, которые полностью контролируют мозг, а с технологической мощью они делают магические вещи, которые наука никогда раньше не могла! Вау, вдруг они продвинули науку, когда наука не продвинулась. Как они это делают? MAGIC! На самом деле, нет. Они хотели, чтобы это было так просто, и они открыли все. На самом деле, я не вижу, чтобы это было намного лучше, чем в любом другом центре нейробиоуправления, с той разницей, что они также добавили диету, ноотропы и медитацию.\n* Он не был проверен достаточно долго **. Откуда кто-то знает, что они не сойдут с ума через несколько лет? Чем более «продвинут» метод, который они используют, тем больше неизвестны побочные эффекты. Никто не знает долгосрочных эффектов и побочных эффектов этого курса.\n* ** Обманные заявления о повышении IQ **. Некоторые люди все еще верят, что повышение IQ возможно. Нет, это не так, и если вы думаете иначе, докажите это с помощью тестов. Я читал об IQ в течение последних 20 лет, и я являюсь членом многих обществ с высоким IQ, где, угадайте, что, большую часть своего времени я читал об IQ и как его можно увеличить. И вот где «40 лет дзен» использует некоторые хитрые маркетинговые уловки: исследование за исследованием утверждает, что IQ постоянен в жизни человека. Но на самом деле это не совсем так. IQ падает, если у человека психическое заболевание. Например, IQ людей, которые страдают от шизофрении, падает. Это не потому, что у больного низкий IQ, а потому, что он не может действительно хорошо выполнять тест из-за болезни. По сути, IQ человека никогда не увеличивается и не всегда стабилен в течение всей жизни. У него фиксированный * потолок *, который показывает, насколько хорошо они могут работать, когда они здоровы. Тем не менее, когда человек становится слишком напряженным, он не может выступить на своем потолке. Начиная с этого, «40 лет дзен» не увеличивают чей-либо потолок IQ. IQ членов упал ниже их потолка из-за стресса, беспокойства или плохого питания. И программа помогает им вернуться к этому. Кроме того, курс не принимает всех, кто за это платит. Возможно, они выбирают людей, которые могут хорошо выступить после, и пропускают тех, кто выглядит так, как будто они этого не сделают. Таким образом, они могут поддерживать высокие результаты своего успеха.\n\nВ целом, «40 лет дзен» больше похожи на скрытую клинику без стигмы, а не на место, которое делает людей супер-умными. Это более модная версия Neurocore центров, предназначенная для высококлассных людей и руководителей. Я все еще нахожу это намного более освежающим и во много раз лучше, чем когда психиатр утверждает, что «у вас психическое расстройство, и вам нужно принимать лекарства», а психолог рассказывает о вашей жизни в детстве и проповедует в течение 3 лет, что любили ваши родители ты.\n\nВы взяли курс? Что вы думаете?","title":"Ваши взгляды на \"40 лет дзен\". Кто-нибудь пробовал это?","subreddit_name_prefixed":"r/Biohackers","ups":11,"created":1571125896,"link_flair_background_color":"","id":"dhzdri","author":{"name":"itcodn"},"permalink":"/r/Biohackers/comments/dhzdri/your_views_on_40_years_of_zen_has_anyone_tried_it/","url":"https://www.reddit.com/r/Biohackers/comments/dhzdri/your_views_on_40_years_of_zen_has_anyone_tried_it/","created_utc":1571097096}