{"subreddit":{"display_name":"Biohackers"},"subreddit_loc":"Biohackers","selftext":"Привет - это Натан из [BiohackStack.com] (https://BiohackStack.com) с нашей первой серией интервью с основателями и лидерами в отрасли биохаков и долголетия.\n\nСегодняшнее интервью с [Доктор Саджад Залзала] (https://biohackstack.com/posts/dr-sajad-zalzala/), основатель [QALYtude] (https://qalytude.com) \\ - американской клиники, специализирующейся на назначении лекарств. антивозрастная терапия. Мы говорим о том, как работает его компания, принимающая метформин, а также о его личном стеке биохаков.\n\n# Здравствуйте, доктор Zalzala! Каков ваш опыт и чем занимается ваша компания?\n\n[QALYtude] (https://qalytude.com) - это онлайн-клиника, специализирующаяся на обеспечении легкого доступа к долгосрочным и здоровым методам лечения. Часть нашей миссии - ускорить разработку методов лечения долголетия, поддерживая и участвуя в исследованиях.\n\nЧасть QALY в названии - это экономические термины - Годы жизни, скорректированные на качество - где 1 QALY = 1 идеальный год здоровья. Мы хотим дать возможность нашим пациентам и обществу в целом придерживаться позиции, чтобы иметь больше QALY.\n\nЯ использую свой опыт работы с другими телемедицинскими компаниями, чтобы сделать рецепты долголетия такими же легкими, как Виагра.\n\n# Какова была ваша мотивация за Qalytude? Как началась компания?\n\nЕще с моего первого года обучения в медицинской школе я стремился к комплексной или интегративной медицине. Я нахожу область профилактики гораздо более привлекательной, чем пытаться лечить болезни после их возникновения. Отсрочка воздействия старения является матерью всех мер профилактики, поскольку старение является причиной почти всех хронических заболеваний.\n\n# Как работает рецептурный процесс Qalytude? Это законно?\n\nДа, QALYtude совершенно законно. Мы пользуемся преимуществами относительно недавнего изменения законов о телемедицине, чтобы разрешить назначение с использованием только интернет-встречи. В тех немногих штатах, где требуется телефон / видео, мы придерживаемся этих правил, предлагая пациентам забронировать краткую консультацию с лечащим врачом. У нас есть врачи, получившие лицензию во всех 50 штатах, а также американские аптечные партнеры, базирующиеся во всех 50 штатах.\n\n# Я знаю, что многим любопытно принимать метформин для долголетия (включая меня). По вашему мнению, какие факторы должны учитываться при принятии решения о приеме метформина или любой другой (потенциально) антивозрастной рецептурной терапии? Должны ли мы ждать результатов испытания TAME (или аналогичных испытаний FDA), прежде чем принимать решение?\n\nНаша цель в QALYtude - не убеждать кого-либо начинать терапию долголетия. Мы хотим представить науку и исследования и надеемся, что люди будут принимать свои собственные обоснованные решения. Как только они решат, что это то, что они хотят сделать, мы облегчаем им задачу.\n\nМетформин в настоящее время имеет достаточно данных, чтобы лично я чувствовал себя комфортно, не только принимая его сам (и мою жену), но и рекомендуя его своим пациентам. Я полагаю, что никогда не будет достаточно доказательств, чтобы убедить каждого скептика в отношении метформина и других методов лечения долголетия - именно так работает наука (и жизнь в целом). Каждому человеку необходимо просмотреть данные и принять решение, подходят ли метформин и другие методы лечения.\n\nКогда мы стремимся представить другие методы лечения, мы работаем с группой экспертов-консультантов, чтобы проверить методы лечения, которые являются наиболее перспективными, но в то же время имеют хороший протокол безопасности и подходят для назначения с помощью телемедицины.\n\n# Насколько безопасен метформин? Что я могу ожидать, если я решу принять метформин для предотвращения старения? Есть ли полезные биомаркеры, которые стоит отслеживать при приеме?\n\nМетформин, по моему мнению и опыту, является одним из самых безопасных рецептов, которые может назначить врач. У нас есть данные о метформине, близкие или превышающие 1 миллиард пациентов в год, и они назначаются на протяжении более 60 лет. Побочные эффекты от метформина обычно незначительны и могут быть устранены путем корректировки дозы или просто прекращением приема. Серьезные побочные эффекты для метформина довольно редки. В тысячах рецептов, которые я написал для метформина, я не видел ни одного серьезного побочного эффекта.\n\nСамая большая проблема с метформином - это состояние, называемое лактоацидозом, однако крупные исследования показали, что не метформин вызывал лактоацидоз, а другие сопутствующие заболевания, такие как сердечная недостаточность, гипоксия, сепсис и т. Д., Которые предрасполагают к лактоацидозу. Фактически, автор статьи 2004 года о лечении диабета заключил, что «когда метформин используется в соответствии с маркировкой, повышенный риск лактоацидоза либо равен нулю, либо настолько близок к нулю, что его нельзя учесть при принятии обычных клинических решений».\n\nС точки зрения биомаркеров, легко доступными могут быть такие вещи, как натощак глюкоза и инсулин, а также тест на глюкозу / инсулин для орального теста на глюкозу (где вы берете определенное количество глюкозы на «тест» и проверяете уровни глюкозы и инсулина в определенное время баллы - обычно 30, 60, 90 и / или 180 минут). В скором времени мы также представляем датчики FreeStyle Libre CGM (непрерывный мониторинг уровня глюкозы), которые будут предоставлять в реальном времени и отслеживаемые данные об уровнях глюкозы. Более сложное тестирование будет включать тестирование метилирования ДНК, такое как тесты часов Horvath или GRIM, которые определяют «возраст» ДНК пациента.\n\n# Как вы относитесь к возможности того, что метформин [притупляет адаптацию к занятиям аэробикой] (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6351883/)? Вы рекомендуете принимать метформин ночью (например, Питер Аттиа) или в нерабочие дни (например, Дэвид Синклер)?\n\nЯ подозреваю, что ВСЕ методы долголетия придут с некоторым компромиссом. Ключ будет в том, чтобы найти методы лечения, которые приносят гораздо больше пользы, чем любой потенциальный вред. На нашей странице часто задаваемых вопросов мы решаем эту проблему. Пациентам, которые являются спортсменами, занимающимися спортом, или работающими над достижением цели, связанной с увеличением сухой массы тела, я бы рекомендовал пропустить метформин в течение этого времени. Или мы говорим пациентам пропускать метформин в дни, когда они выполняют интенсивные упражнения (согласно Дэвиду Синклеру). Что касается всех остальных, я думаю, что это исследование имеет очень мало клинической значимости.\n\n# Каково ваше мнение о других потенциально омолаживающих терапиях, таких как NMN & NR, NAD +, рапамицин, дазатаниб, ресвератрол и кверцетин? Как вы решаете, какие из них предложить через Qalytude?\n\nМы являемся большими поклонниками NAD + - настолько, что вскоре мы выпускаем патчи NAD +, которые будут самыми близкими к инфузиям IV NAD +, но с гораздо более доступными затратами и удобством. На данный момент мы держимся подальше от внебиржевой терапии, так как есть много отличных (а иногда и не очень) компаний, предоставляющих эти продукты.\n\nБолее экспериментальные методы лечения, такие как рапамицин и дазатиниб, безусловно, находятся на нашем радаре и являются очень многообещающими. Но мы работаем с исследовательскими организациями, чтобы предоставить их в условиях клинических испытаний, чтобы обеспечить надлежащие протоколы безопасности и мониторинга, а также для сбора данных, необходимых для продвижения этих методов лечения.\n\n# Что до сих пор было самой большой проблемой для Qalytude?\n\nЯ думаю, что наша самая большая проблема состоит в том, чтобы помочь людям изменить то, как они думают о своем здравоохранении, - попытаться перевести пациентов с реактивной «медицинской помощи» на более активную медицинскую помощь. Первые пользователи получают его, и это наши первые клиенты. Но мы являемся глубоко укоренившейся системой диагностики и лечения заболеваний.\n\nЕще одна задача - показать ценность методов лечения, которые мы предлагаем. Возвращаясь к этой укоренившейся системе - почти все хотят использовать эту блестящую страховую карту в своем кошельке. Но большинство не понимают, что оно обеспечивает \"больную\" страховку, а не \"медицинскую\" страховку. Мы работаем за пределами страховой системы, но используем технологии, чтобы сделать наше лечение удобным и доступным.\n\n# Что сейчас у вас в личном стеке биохаков?\n\nВ настоящее время я принимаю метформин в качестве единственного лекарства. Я использую CGM, чтобы попытаться сохранить свой уровень сахара в крови как можно ниже. Недавно я начал использовать пластыри NAD, которые технически не являются лекарством, но доступны только по рецепту. Я считаю, что патчи NAD повышают мою энергию и помогают с умственной сосредоточенностью. Метформин помогает контролировать мой аппетит и помогает мне не набирать вес так легко, как я склонен - он также привязывает мой сладкий зуб.\n\nЯ склонен чередовать добавки, которые я принимаю, и время от времени менять их в зависимости от множества факторов, включая новые исследования. Я регулярно принимаю: омега-3, куркуму, ресвератрол, витамин К2, магний, CoQ10I, делаю анализы крови и минералов волос, чтобы оптимизировать уровень минералов и микроэлементов. Иногда это означает брать маленькую миску с добавками в течение нескольких месяцев, чтобы оптимизировать мой уровень.\n\nЯ отслеживаю уровень своего висцерального жира и другие аспекты своего тела, используя золотой стандарт DXA-сканирования через DexaFit (раскрытие: у меня есть филиал DexaFit в Детройте, и я являюсь медицинским директором в нескольких других местах по всей стране). В 2011 году я избавился от глютена и не оглядывался назад (ну, я на 95% без глютена). Я стараюсь придерживаться привычки палео-стиля (мне не нравится слово «диета»), хотя я люблю молочные продукты.\n\nЯ стараюсь делать прерывистый пост, по крайней мере, два раза в неделю. И каждый год для Рамадана я постился в течение 30 дней (без еды и воды от солнца до заката).\n\nМой основной источник упражнений - бег за тремя детьми.\n\nЯ стараюсь не пренебрегать своим сном. Некоторые из моих друзей дразнят меня, потому что я засыпаю так рано (9 или 10 вечера в зависимости от сезона), но я надеюсь пережить их, так что шутка с ними :-)\n\nМне нравится пробовать то, что я читаю или слышу о том, что есть здравая наука. Я подписываюсь на многочисленные подкасты, посещаю несколько конференций в течение года и много читаю о новых исследованиях.\n\n& # X200B;\n\n# Какой аспект вашей жизни вы работаете, чтобы оптимизировать больше всего?\n\nЯ усердно работаю, стараясь поддерживать низкий уровень глюкозы в крови. В детстве у меня был лишний вес, и это заставило меня легко набирать вес - у меня все еще больше веса, чем я могу себе позволить. Я обнаружил, что если я ем слишком много углеводов, вес легко возвращается.\n\n# Какой процесс вы используете, чтобы оценить, какие биохаки работают на вас?\n\nКак я уже упоминал ранее, я использую CGM для отслеживания уровня глюкозы в крови, DXA-сканирование для отслеживания моего висцерального жира, анализ минералов волос для отслеживания уровня минеральных веществ и комплексную панель химии крови, чтобы убедиться, что моя щитовидная железа и другие гормоны оптимизированы.\n\n# Каковы наиболее эффективные биохаки, которые сработали для вас и рекомендовали бы другим проверить?\n\nБезусловно, самым впечатляющим изменением, которое я реализовал, стало отсутствие глютена и переход на привычку питания в стиле палео.\n\n# Что дальше для Qalytude? Что вы взволнованы?\n\nВ настоящее время мы предлагаем методы лечения, которые потенциально могут отсрочить начало заболевания, связанного с возрастом. Действительно захватывающая терапия долголетия еще даже не была разработана или исследована - такие вещи, как сенолитики, которые избавляют организм от «зомби-клеток», которые, по-видимому, ускоряют старение. Я взволнован, чтобы быть частью или поддержать исследование этих и других методов лечения. Как и другие методы лечения, которые разрабатываются намного умнее людей, чем я, - этим компаниям понадобится платформа, чтобы сделать их новые и более эффективные методы лечения долголетия доступными, и мы надеемся, что они придут в QALYtude.\n\n# Есть ли что-то еще, что вы хотите сообщить нам о Qalytude? Где мы можем узнать больше о вас и вашей компании?\n\nЯ мечтаю о том, чтобы [QALYtude] (https://qalytude.com) стал платформой, помогающей оптимизировать здоровье человека - хотя на данный момент это остается концепцией. Также QALYtude зарегистрирована как PBC - общественно-полезная корпорация. Мы нацелены на улучшение общества и человечества.\n\n\\ -------------------\n\n* Понравилось это интервью? Посмотрите другие наши профили лидеров биохакера на * [* BiohackStack.com *] (https://BiohackStack.com)","title":"Почему этот врач основал онлайн-клинику долголетия","subreddit_name_prefixed":"r/Biohackers","ups":2,"created":1574806996,"link_flair_background_color":"","id":"e1yl7d","author":{"name":"NathanBiohackStack"},"permalink":"/r/Biohackers/comments/e1yl7d/why_this_doctor_started_an_online_longevity_clinic/","url":"https://www.reddit.com/r/Biohackers/comments/e1yl7d/why_this_doctor_started_an_online_longevity_clinic/","created_utc":1574778196}