{"subreddit":{"display_name":"biology"},"subreddit_loc":"биология","selftext":"\n\n[Фаги T4 визуализируются с помощью Cinema4d] <span translate = \"no\"> (https://preview.redd.it/7nllcx22blz21.jpg?width=1920&format=pjpg&auto=webp&s=129fb35cb010128f12e7205bd76353c325eed> 91)\n\nполное видео здесь: [https://youtu.be/V73nEGXUeBY] (https://youtu.be/V73nEGXUeBY) \n\nБолее 100 лет назад французский ученый Феликс д'Эрель выявил бактериофаги! Они похожи на космические корабли из другого мира и являются самыми грозными машинами для убийства, к счастью, они нацелены исключительно на бактерии. Д'Эрель и его коллега Джордж Элиава сразу поняли, что фаги могут быть использованы для помощи пациентам в борьбе с бактериальными инфекциями. Однако в западном полушарии контроль над опасными для жизни бактериальными инфекциями был вскоре достигнут с помощью антибиотиков, в то время как фаги и вирусы стали любимыми инструментами исследования генетиков.\n\nЭто объясняет, почему бактериофаг T4, который изображен здесь, является одним из наиболее интенсивно изучаемых биологических объектов. Тем не менее, фаготерапия была впервые разработана Институтом Элиавы в Грузии, где она развивалась с момента своего открытия. Фаги прилипают к бактериям своими волокнами, похожими на ноги, что вызывает изменение конформации белка, проталкивая их ствол в бактериальный корпус. Внутренняя часть ствола содержит иглу, которая прокалывает бактериальную оболочку, позволяя фагу вводить свой генетический материал. Геном фага в течение нескольких минут преодолевает бактериальную защиту, компоненты фагов собираются внутри клетки, прежде чем она разорвется, чтобы выпустить новую волну фагов. Несколько биотехнологических компаний теперь готовы использовать смертельный потенциал фаговой терапии в качестве секретного оружия для уничтожения суперпопулярных насекомых.\n\n** Модель фага T4 **\n\nФаг T4, изображенный в этом видео, во многом соответствует текущему состоянию исследований. Модель была собрана с использованием структурных данных, доступных из общедоступных баз данных (см. Ниже), и значительно выиграла от следующих публикаций:\n\nЛейман П.Г., Арисака Ф., ван Раай М.Ю., Костюченко В.А., Аксюк А.А., Канамару С., Россманн М.Г. Морфогенез хвоста T4 и волокон хвоста. Virol J. 2010 Dec 3; 7: 355. doi: 10.1186 / 1743-422X-7-355.\n\nЭрик С. Миллер, Элизабет Куттер, Гизела Мосиг, Фумио Арисака, Такаши Кунисава, Вольфганг Рюгер. Бактериофаг T4 Геном MMBR, март 2003, с. 86–156 Том. 67, № 1 doi: 10.1128 / MMBR.67.1.86-156.2003\n\nБо Ху, Уильям Марголин, Ян Дж. Молинью и Джун Лю. Структурное ремоделирование бактериофага Т4 и мембран хозяина при инициации инфекции. PNAS 1 сентября 2015 г. 112 (35) E4919-E4928; впервые опубликовано 17 августа 2015 г. [https://doi.org/10.1073/pnas.1501064112] (https://doi.org/10.1073/pnas.1501064112) \n\n** EMDB: **\n\nEMD-2774, EMD-6079, EMD-6080, EMD-6081, EMD-6082, EMD-6083: Hu B, Марголин W, Molineux IJ, Liu J, Структурное ремоделирование мембран бактериофага T4 и хозяина во время инициирования инфекции. PNAS 112 e4919-e4928 (2015) doi: [10.1073 / pnas.1501064112]  (https://doi.org/10.1073/pnas.1501064112) \n\nEMD-8661: Чэнь З, Сунь Л, Чжан З, Фокин А., Падилья-Санчес В., Ханеин Д., Цзян В., Россманн М. Г., Рао В. Б., Крио-ЭМ структура изометрической головки бактериофага Т4 с разрешением 3,3 ангстрем и ее отношение к сборке икосаэдрических вирусов. PNAS 114 E8184-E8193 (2017) doi: 10.1073 / pnas.1708483114\n\n** К ним относятся следующие коды PDB: **\n\n5VF3 Бактериофаг T4 изометрический капсид\n\n3FOH Встраивание кристаллической структуры gp18M в 3D крио-ЭМ реконструкцию удлиненного хвоста бактериофага T4\n\n5IV5 Крио-электронная микроскопическая структура комплекса гексагональной предварительной насадки T4 опорная плита-хвостовая труба\n\n2XGF Структура иглообразного рецептор-связывающего наконечника бактериофага T4 с длинным хвостом\n\n** Получено с EMDB.org:**\n\nКонсорциум wwPDB, Protein Data Bank: единый глобальный архив для данных трехмерной макромолекулярной структуры (2019). Исследование нуклеиновых кислот Том 47 p.D520-D528 doi: 10.1093 / nar / gky949\n\n** Получено с rcsb.org **\n\nСтивен К. Берли, Хелен М. Берман и др. Банк данных белка RCSB: биологические макромолекулярные структуры, позволяющие проводить исследования и изучать фундаментальную биологию, биомедицину, биотехнологию и энергетику (2019 г.) Исследования нуклеиновых кислот 47: D464 – D474; doi: 10.1093 / nar / gky1004.\n\nИдея и анимация: Никола Тасич\n\nНаучный совет, текст и рассказчик: Стефан Грюнерт\n\nПроизведено biolution GmbH","title":"Фаг T4, атакующий E.coli","subreddit_name_prefixed":"r/biology","ups":236,"created":1558484043,"link_flair_background_color":"","id":"brcbvz","author":{"name":"5teviewonder5"},"permalink":"/r/biology/comments/brcbvz/t4_phage_attacking_ecoli/","url":"https://www.reddit.com/r/biology/comments/brcbvz/t4_phage_attacking_ecoli/","created_utc":1558455243}