{"subreddit":{"display_name":"biology"},"subreddit_loc":"биология","selftext":"В 1989 году группа антропологов, изучающих охотников-собирателей хадзы в северной Танзании, заметила, как усердно работает одна конкретная группа: бабушки.\n\n«Им было за шестьдесят, и их продуктивность была такой же высокой, как и у женщин, которые все еще находятся в детородном возрасте», - говорит Кристен Хоукс, один из антропологов.\n\nХоукс, ныне профессор Университета Юты, изучал эволюционную биологию человека - как жизнь развивается и адаптируется с течением времени - на протяжении десятилетий. Ей и ее сотрудникам приписывают сбор данных, который подтвердил гипотезу бабушки, которая широко считается одной из наиболее важных теорий в современной эволюционной биологии. Теория, первоначально предложенная в середине 60-х годов, заключает, что помощь бабушки имеет решающее значение для долголетия человека.\n\nМы производим шоу под названием [Empowered Health]  (https://empoweredhealthshow.com/ep-25-menopause-and-how-older-women-are-essential-to-society-the- «Бабушка-гипотеза-с-Кристен-Хокс» /) , подкаст, посвященный вопросам здоровья женщин, мы только что выпустили эпизод с Кристен Хоукс о том, насколько важна гипотеза бабушки для эволюции человека и как эта концепция развивается в западный мир. Теперь мы понимаем, что женщины в постменопаузе важны для очень многих аспектов общества, и мы хотели поделиться научными данными, подтверждающими эту идею.\n\nСобранная команда Хоукса продемонстрировала, как помощь бабушек в уходе за детьми и обеспечении стабильного и стабильного источника пищи дала матерям больше времени и энергии для размножения и обеспечивала хорошее питание сообщества во времена, когда мужчины не имели успеха в охоте на крупную дичь - что было часто так. С добычей бабушки - то, что молодые внуки слишком малы, чтобы быть успешным - дети, более вероятно, выжили.\n\nЧем старше живет бабушка, тем больше у нее будет детей. Эти потомки унаследуют преимущество в выживании, передаваемое из поколения в поколение через более сильные гены и большие шансы на питание. Неудивительно, что бабушка всегда пытается заставить тебя закончить свою тарелку.\n\nСегодня у нас так много разных семейных структур, некоторые из которых не связаны с рождением детей, и мы подумали, что эта тема особенно важна, потому что она показывает нам, что многое из того, что нам рассказали или учили о нашей ценности в обществе, не полная история В то время как бабушки в этих сообществах охотников и собирателей выполняли эту важнейшую функцию в своих общинах, обеспечивая стабильные источники пищи и помогая заботиться о детях, сегодня у нас есть женщины, которые выполняют важные для общества вещи и за пределами сферы воспроизводства. В этих обществах возможности были четко определены и ограничены. В нашем обществе женщины в постменопаузе имеют шанс радикально изменить свою роль, взять на себя невероятные обязанности и помочь всему нашему обществу. Когда ваши дети покидают гнездо, так же, как те бабушки в этих обществах охотников-собирателей, у вас есть шанс оказать огромное влияние, если хотите.\n\nПонял, что этот subreddit может быть интересен, вот ссылки на эпизод:\n\n[APPLE PODCASTS]  (https://podcasts.apple.com/us/podcast/ep-25-menopause-how-older-women-are-essential-to-society/id1452440833?i = 1000449096713)  | [SPOTIFY]  (https://open.spotify.com/episode/6LyaDxEvFD4VCsmLP4UUPT)  | [GOOGLE]  (https://play.google.com/music/m/Dzftfaq7quo5hky64zjyzvum62e?t=Ep_22_Whats_happening_to_my_body_The_run_up_to_menopause-Empowered_Health)  [\"> = PL> https://play.google.com/music/m/Dra7oefmwvbbr3mnoufzbeiktey?t=Ep_25_Menopause_and_how_older_women_are_essential_to_society_the_grandmother_hypothesis_with_Krist) </ span> | [STITCHER]  (https://www.stitcher.com/podcast/empowered-health/e/63776454)  | [LUMINARY]  (https://luminarypodcasts.com/listen/emily-kumler-469/empowered-health/ep-25-menopause-and-how-older-women-are-essential- к-обществу-бабушка-гипотеза-с-кристен-хокс / accab137-9e41-4335-b7f6-c4fd90113e64)  | [OVERCAST]  (https://overcast.fm/+QuxmOyItE)  | [ВЕБ-САЙТ] <span translate = \"no\"> (https://empoweredhealthshow.com/ep-25-menopause-and-how-older-women-are-essential-to-society-the-grandmother-hypothesis-with- Kristen-Hawkes /) </ SPAN>","title":"Как бабушки важны для общества, как объяснил антрополог Кристен Хоукс","subreddit_name_prefixed":"r/biology","ups":177,"created":1568706409,"link_flair_background_color":"","id":"d58sei","author":{"name":"EmpoweredHealth"},"permalink":"/r/biology/comments/d58sei/how_grandmothers_are_essential_to_societies_as/","url":"https://www.reddit.com/r/biology/comments/d58sei/how_grandmothers_are_essential_to_societies_as/","created_utc":1568677609}