{"subreddit":{"display_name":"biology"},"subreddit_loc":"биология","selftext":"[T4 Фаговый поток с gp17 в красном, действующий в качестве мотора для нити ДНК со скоростью 2000 п.н. / сек через пору] <span translate = \"no\"> (https://preview.redd.it/yqyika10mww31.jpg?width=1920&format= pjpg & автоматического = WebP & s = 2beee46b2fbfa2ec21248487dacd4f4c7e7ff4b9) </ SPAN>\n\nЭто научно правильная визуализация того, как ДНК попала в машину-убийцу: [https://youtu.be/RbL3BZCGPA4] (https://youtu.be/RbL3BZCGPA4) \n\nВ бактерии, зараженной T4, новые бактериофаги собираются поэтапно: шахта накапливается, ДНК реплицируется, а пустая про-головка собирается как пустая оболочка. Но как ДНК попадает в передний план?\n\nИнициирование импорта ДНК не совсем ясно, но как только ДНК, мотор упаковки и про-головка взаимодействуют, ДНК быстро проникает через пору в круговом двигателе со скоростью 2000 пар оснований в секунду.\n\nКак только головка заполнена, упаковочный двигатель разрезает ДНК, и комплекс падает с расширенной головки, которая изменила форму. Волокно и длинный хвост волокна прикрепляются для завершения инфекционной частицы. В течение 1 часа из одной зараженной бактерии высвобождается более 100 новых фагов, что делает фаг Т4 одним из самых эффективных, но в то же время увлекательных убийц.\n\n** Модель фага T4 **\n\n** Фаг T4, изображенный в этом видео, во многом соответствует текущему состоянию исследований. ** ** Модель была собрана с использованием структурных данных, доступных из общедоступных баз данных (см. Ниже), и значительно выиграла от следующих публикаций: **\n\nЛейман П.Г., Арисака Ф., ван Раай М.Ю., Костюченко В.А., Аксюк А.А., Канамару С., Россманн М.Г. Морфогенез хвоста T4 и волокон хвоста. Virol J. 2010 Dec 3; 7: 355. doi: 10.1186 / 1743-422X-7-355.\n\nЭрик С. Миллер, Элизабет Куттер, Гизела Мосиг, Фумио Арисака, Такаши Кунисава, Вольфганг Рюгер. Бактериофаг T4 Геном MMBR, март 2003, с. 86–156 Том. 67, № 1 doi: 10.1128 / MMBR.67.1.86-156.2003\n\nСийинг Лин, Танфис И. Алам, Вишал И. Коттадиэль, Карл Дж. Ван Гессель, Вэй-Чун Тан, Янн Р. Чемла и Венигалла Б. Рао. Изменение скорости мотора упаковки ДНК из бактериофага T4 Nucleic Acids Res. 2017 ноябрь 2; 45 (19): 11437–11448. doi: 10.1093 / nar / gkx809\n\n\\ * \\ * EMDB: \\ * \\ * EMD-2774, EMD-6079, EMD-6080, EMD-6081, EMD-6082, EMD-6083: Ху Б, Марголин W, Молинье И.Ю., Лю Ж, Структурное ремоделирование бактериофага Т4 и мембраны хозяина во время инициации инфекции. PNAS 112 e4919-e4928 (2015) doi: 10.1073 / pnas.1501064112EMD-8661: Чэнь З, Сунь Л, Чжан З, Фокин А, Падилья-Санчес В, Ханейн Д, Цзян В, Россманн М.Г., Рао В.Б., Крио-ЭМ структура изометрической головки бактериофага Т4 с разрешением 3,3 ангстрем и ее значение для сборки икосаэдрических вирусов. PNAS 114 E8184-E8193 (2017) doi: 10.1073 / pnas.1708483114\n\n** К ним относятся следующие коды PDB: **\n\n5VF3 Бактериофаг T4 изометрический капсид\n\n3FOH Встраивание кристаллической структуры gp18M в 3D крио-ЭМ реконструкцию удлиненного хвоста бактериофага T4\n\n5IV5 Крио-электронная микроскопическая структура комплекса гексагональной предварительной насадки T4 опорная плита-хвостовая труба\n\n2XGF Структура иглообразного рецептор-связывающего наконечника бактериофага T4 с длинным хвостом\n\n** Получено с EMDB.org:**\n\nКонсорциум PDB, Protein Data Bank: единый глобальный архив для данных трехмерной макромолекулярной структуры (2019). Исследование нуклеиновых кислот Том 47 p.D520-D528 doi: 10.1093 / nar / gky949\n\n** Получено с rcsb.org **\n\nСтивен К. Берли, Хелен М. Берман и др. Банк данных белка RCSB: биологические макромолекулярные структуры, позволяющие проводить исследования и изучать фундаментальную биологию, биомедицину, биотехнологию и энергетику (2019 г.) Исследования нуклеиновых кислот 47: D464 – D474; doi: 10.1093 / nar / gky1004.\n\nПроизводитель: ** Ирис Грюнерт **\n\nМоделирование и анимация: ** Кристиан Мюллер **\n\nИдея, научная консультация, текст и рассказчик: ** Стефан Грюнерт **\n\nМузыка: ** Чад Крауч - Инструментальная вода в верховьях ** [** https: //freemusicarchive.org/music/Chad \\ _Crouch **] <span translate = \"no\"> (https://freemusicarchive.org/music/Chad_Crouch ) </ SPAN>\n\nПроизводитель ** Biolution GmbH 2019 **","title":"ДНК всасывается в фаг, как спагетти","subreddit_name_prefixed":"r/biology","ups":602,"created":1572987979,"link_flair_background_color":"","id":"dryvz4","author":{"name":"5teviewonder5"},"permalink":"/r/biology/comments/dryvz4/dna_getting_sucked_into_phage_like_spaghetti/","url":"https://www.reddit.com/r/biology/comments/dryvz4/dna_getting_sucked_into_phage_like_spaghetti/","created_utc":1572959179}