{"subreddit":{"display_name":"biology"},"subreddit_loc":"биология","selftext":"","title":"Убит в то время как выдающийся","subreddit_name_prefixed":"r/biology","ups":4071,"created":1573174322,"link_flair_background_color":"","id":"dt0fcb","author":{"name":"One_Last_Thyme"},"permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/","url":"https://imgur.com/SB851sR.jpg","created_utc":1573145522,"replies":[{"ups":269,"link_id":"t3_dt0fcb","replies":[{"ups":87,"link_id":"t3_dt0fcb","replies":[{"ups":4,"link_id":"t3_dt0fcb","id":"f6vml4x","author":"FarrahKhan123","parent_id":"t1_f6vadg8","subreddit_id":"t5_2qhn7","body":"Эти компании действительно хотят заработать на всем и вся. Спасибо, что сказал мне это. Удивительно, как кто-то может думать, что он может владеть * геном *","body_html":"<div class = \"md\"> <p> Эти компании действительно хотят заработать на всем и вся. Спасибо, что сказал мне это. Удивительно, как кто-то может думать, что он может владеть <em> геном </em> </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vml4x/","name":"t1_f6vml4x","created":1573219957,"created_utc":1573191157,"subreddit_name_prefixed":"r/biology","depth":4},{"ups":2,"link_id":"t3_dt0fcb","id":"f6vtt4g","author":"tommys_mommy","parent_id":"t1_f6vadg8","subreddit_id":"t5_2qhn7","body":"Они не просто пытались терпеливо переносить гены BRCA1 / 2, Myriad держал патент на них с момента их открытия в середине 90-х до 2013 года. В течение этого времени Myriad взимала около 4000 долларов за тестирование этих двух жанров, в то время как тестирование других гены в тот же период времени были намного дешевле. Приблизительно в 2010 году они продолжали делать дополнительный анализ генов, сначала, только если страховка пациента покроет это. (Подумайте на минуту, как это облажалось). Затем они начали предлагать его людям, которые хотели заплатить еще почти 500 долларов. Но не было условий, чтобы они могли делать все, что хотели. Буквально через несколько минут после объявления Верховного суда, по крайней мере, одна лаборатория обновила свой сайт, чтобы показать, что они предлагают тестирование по более низкой цене.\n\n\nСегодня стоимость тестирования этих генов наряду со многими другими генами, связанными с риском развития рака (в одном тесте), сейчас составляет от 250 до 1500 долларов, в лаборатории, какие гены и т. Д.\n\n\nНесмотря на то, что они больше не могут оправдать свои безумные затраты и цены были снижены, Myriad теперь не делится ни одной из своих альтернативных данных, что-то уникальное среди генетических лабораторий. Хотя все больше людей, проходящих тестирование в других лабораториях, в конечном итоге воссоздают все эти данные, тем временем пациенты и их семьи оказываются в неблагоприятном положении. Но если они больше не могут зарабатывать деньги на патентах, они должны как-то это сделать, и теперь они утверждают, что они стоят дополнительных затрат из-за всех этих данных, которые они хранят. Не дай Бог, они фактически участвуют в создании базы генетических знаний, как буквально в любой другой лаборатории, особенно учитывая всех пациентов, которые не смогли пройти тестирование, потому что Множество жадных.","body_html":"<div class = \"md\"> <p> Они не просто пытались терпеливо переносить гены BRCA1 / 2, Myriad держал патент на них с момента их открытия в середине 90-х до 2013 года. В течение этого времени Myriad заряжалась около 4000 долларов за тестирование этих двух жанров, в то время как тестирование других генов за тот же период времени было намного дешевле. Приблизительно в 2010 году они продолжали делать дополнительный анализ генов, сначала, только если страховка пациента покроет это. (Подумайте на минуту, как это облажалось). Затем они начали предлагать его людям, которые хотели заплатить еще почти 500 долларов. Но не было условий, чтобы они могли делать все, что хотели. Буквально через несколько минут после объявления Верховного суда, по крайней мере, одна лаборатория обновила свой сайт, чтобы показать, что они предлагают тестирование по более низкой цене. </Р>\n\n<p> Сегодня стоимость тестирования этих генов наряду со многими другими генами, связанными с риском развития рака (в одном тесте), сейчас составляет от 250 до 1500 долларов, в лаборатории, какие гены и т. д. </p>\n\n<p> Несмотря на то, что они больше не могут оправдать свои безумные затраты и цены были снижены, теперь Myriad не делится ни одной из своих альтернативных данных, что-то уникальное среди генетических лабораторий. Хотя все больше людей, проходящих тестирование в других лабораториях, в конечном итоге воссоздают все эти данные, тем временем пациенты и их семьи оказываются в неблагоприятном положении. Но если они больше не могут зарабатывать деньги на патентах, они должны как-то это сделать, и теперь они утверждают, что они стоят дополнительных затрат из-за всех этих данных, которые они хранят. Не дай Бог, они фактически участвуют в создании базы генетических знаний, как буквально в любой другой лаборатории, особенно учитывая всех пациентов, которые не смогли пройти тестирование в этой части, потому что Множество жадных. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vtt4g/","name":"t1_f6vtt4g","created":1573229085,"created_utc":1573200285,"subreddit_name_prefixed":"r/biology","depth":4}],"id":"f6terlq","author":"FarrahKhan123","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"Это действительно интересная информация. Лично я не думаю, что кто-то имеет право запатентовать этот чертов геном человека. Но это супер интересно","body_html":"<div class = \"md\"> <p> Это действительно интересная информация. Лично я не думаю, что кто-то имеет право запатентовать этот чертов геном человека. Но это супер интересно </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6terlq/","name":"t1_f6terlq","created":1573176674,"created_utc":1573147874,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":14,"link_id":"t3_dt0fcb","replies":[{"ups":1,"link_id":"t3_dt0fcb","id":"f6vu0ze","author":"tommys_mommy","parent_id":"t1_f6u6ncy","subreddit_id":"t5_2qhn7","body":"Буквально никто не выдвигает и даже не «в основном аргументирует», что у нас не должно быть патентов.","body_html":"<div class = \"md\"> <p> Буквально никто не выдвигает и даже не \"в основном аргументирует\", что у нас не должно быть патентов. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vu0ze/","name":"t1_f6vu0ze","created":1573229412,"created_utc":1573200612,"subreddit_name_prefixed":"r/biology","depth":4},{"ups":1,"link_id":"t3_dt0fcb","replies":[{"ups":1,"link_id":"t3_dt0fcb","id":"f6wbl73","author":"mabolle","parent_id":"t1_f6w8mfx","subreddit_id":"t5_2qhn7","body":"Я знаком с этими аргументами, но я думаю, что моральный абсурд отдельного человека или компании, владеющей правами на природное явление, перевешивает любые выгоды.","body_html":"<div class = \"md\"> <p> Я знаком с этими аргументами, но я думаю, что абсолютный моральный абсурд отдельного человека или компании, владеющей правами на природное явление, перевешивает любые выгоды. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6wbl73/","name":"t1_f6wbl73","created":1573251256,"created_utc":1573222456,"subreddit_name_prefixed":"r/biology","depth":6}],"id":"f6vu83f","author":"mabolle","parent_id":"t1_f6u6ncy","subreddit_id":"t5_2qhn7","body":"Я не делал этого аргумента вообще. Существует огромная разница между патентованием изобретения, которого раньше не существовало, и патентованием открытия мира природы.","body_html":"<div class = \"md\"> <p> Я вообще не приводил этот аргумент. Существует огромная разница между патентованием изобретения, которого раньше не существовало, и патентованием открытия мира природы. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vu83f/","name":"t1_f6vu83f","created":1573229703,"created_utc":1573200903,"subreddit_name_prefixed":"r/biology","depth":4}],"id":"f6tvlhs","author":"mabolle","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"Нет, в этом нет нюансов. Идея патентования любой части человеческого тела (или любой другой части природы) является отвратительной. Хорошей новостью является то, что суды США приняли решение против этого в последующие годы.\n\nВентер полностью заслуживает этого данка. Я признаю, что он много сделал для исследований, но его ценности дерьмовые и он явно лицемер.","body_html":"<div class = \"md\"> <p> Нет, в этом нет нюансов. Идея патентования любой части человеческого тела (или любой другой части природы) является отвратительной. Хорошей новостью является то, что в последующие годы суды США приняли решение против этого. </P>\n\n<p> Вентер полностью заслуживает этого данка. Я признаю, что он много сделал для исследований, но его ценности дерьмовые, и он явно лицемер. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tvlhs/","name":"t1_f6tvlhs","created":1573183456,"created_utc":1573154656,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":9,"link_id":"t3_dt0fcb","replies":[{"ups":12,"link_id":"t3_dt0fcb","replies":[{"ups":3,"link_id":"t3_dt0fcb","id":"f6u7iuq","author":"3kixintehead","parent_id":"t1_f6tlohd","subreddit_id":"t5_2qhn7","body":"Я придерживаюсь мнения, что у нас нет данных для поддержки прибыли. Большая часть работы уже выполнена правительствами.","body_html":"<div class = \"md\"> <p> Я придерживаюсь мнения, что у нас нет данных для поддержки НИОКР. Большая часть работы уже выполнена правительствами. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6u7iuq/","name":"t1_f6u7iuq","created":1573187920,"created_utc":1573159120,"subreddit_name_prefixed":"r/biology","depth":6},{"ups":5,"link_id":"t3_dt0fcb","replies":[{"ups":1,"link_id":"t3_dt0fcb","id":"f6vdov8","author":"Kriggy_","parent_id":"t1_f6v5v3t","subreddit_id":"t5_2qhn7","body":"Потому что ожидание в очереди за туалетной бумагой является примером эффективного распределения. Но здорово, что мы сделали больше тракторов, чем было запланировано. Мои родители провели половину своей жизни в коммунизме, они, вероятно, дадут больше историй. Моя бабушка тоже","body_html":"<div class = \"md\"> <p> Потому что ожидание в очереди туалетной бумаги является примером эффективного распределения. Но здорово, что мы сделали больше тракторов, чем было запланировано. Мои родители провели половину своей жизни в коммунизме, они, вероятно, дадут больше историй. Моя бабушка тоже </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vdov8/","name":"t1_f6vdov8","created":1573212116,"created_utc":1573183316,"subreddit_name_prefixed":"r/biology","depth":8}],"id":"f6torin","author":"JanSnolo","parent_id":"t1_f6tlohd","subreddit_id":"t5_2qhn7","body":"Я ученый. Я разрабатываю спасительное лечение рака. Я «отдаю его бесплатно» в том смысле, что я не подаю никаких патентов и рассказываю миру, как это сделать и управлять им.\n\nТеперь мы должны проверить этот препарат, чтобы убедиться, что он безопасен и эффективен. Это означает, что клинические испытания. Этап 1, 2 и 3 как минимум. Это стоит много миллионов долларов. Кто за это заплатит?\n\nСейчас он прошел клинические испытания, и мы знаем, что это безопасно и эффективно. Ура!\n\nНо загвоздка в том, что производство стоит 100 тысяч долларов за дозу. Никаких взвинчиваний, просто стоимость безубыточности. Кто за это заплатит?\n\nОчевидно, что пациенты не могут этого сделать. Очевидно, что благотворительность не может этого сделать. На самом деле есть только два варианта: государственный и частный бизнес.\n\nЕсли ваш ответ «правительство», то вы помещаете всю отрасль здравоохранения от производства лекарств до распределения и ухода за оплатой под эгидой правительственной бюрократии. Это выходит далеко за рамки социального медицинского страхования. Это коммунистическая система, чистая и простая. И мы знаем из теории и истории, что коммунистические системы не могут распределять ресурсы так же эффективно, как капиталистические. Результат «попытки сделать это» будет сродни массовым голодам, которые произошли в Китае во время Великого скачка Мао, за исключением лекарств. Люди будут умирать от легко излечимых болезней, потому что какой-то правительственный чиновник отправил лекарства в неправильный город, основываясь на внутренних прогнозах, которые были слегка отклонены.\n\nЭто оставляет нам только один вариант: частный бизнес. Которым нужно руководствоваться стимулами. Вы можете поспорить о том, как должны быть структурированы стимулы и какие правила должны быть введены в действие для регулирования рынка. И это важные дискуссии.\n\nНо полное устранение стимулов или перестройка всей системы с нуля не только никогда не произойдет, это опасная идея, которая даже не работает в теории.","body_html":"<div class = \"md\"> <p> Я ученый. Я разрабатываю спасительное лечение рака. Я «отдаю его бесплатно» в том смысле, что я не подаю никаких патентов и рассказываю миру, как это сделать и управлять им. </P>\n\n<p> Теперь мы должны проверить этот препарат, чтобы убедиться, что он безопасен и эффективен. Это означает, что клинические испытания. Этап 1, 2 и 3 как минимум. Это стоит много миллионов долларов. Кто за это заплатит? </P>\n\n<p> Сейчас он прошел клинические испытания, и мы знаем, что это безопасно и эффективно. Ура! </P>\n\n<p> Но загвоздка в том, что производство стоит 100 тысяч долларов за дозу. Никаких взвинчиваний, просто стоимость безубыточности. Кто за это заплатит? </P>\n\n<p> Очевидно, что пациенты не могут этого сделать. Очевидно, что благотворительность не может этого сделать. На самом деле есть только два варианта: государственный и частный бизнес. </Р>\n\n<p> Если ваш ответ - «правительство», то вы переводите всю отрасль здравоохранения от производства лекарств к дистрибуции и уходу за платежами под эгидой правительственной бюрократии. Это выходит далеко за рамки социального медицинского страхования. Это коммунистическая система, чистая и простая. И мы знаем из теории и истории, что коммунистические системы не могут распределять ресурсы так же эффективно, как капиталистические. Результат «попытки сделать это» будет сродни массовым голодам, которые произошли в Китае во время Великого скачка Мао, за исключением лекарств. Люди будут умирать от легко излечимых болезней, потому что какой-то правительственный чиновник отправил лекарства в неправильный город, основываясь на внутренних прогнозах, которые были слегка отклонены. </Р>\n\n<p> Это оставляет нам только один вариант: частный бизнес. Которым нужно руководствоваться стимулами. Вы можете поспорить о том, как должны быть структурированы стимулы и какие правила должны быть введены в действие для регулирования рынка. И это очень важные дискуссии. </P>\n\n<p> Но полное устранение стимулов или перестройка всей системы с нуля не только никогда не произойдет, это опасная идея, которая даже не работает в теории. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6torin/","name":"t1_f6torin","created":1573180872,"created_utc":1573152072,"subreddit_name_prefixed":"r/biology","depth":6}],"id":"f6tjnly","author":"potentpotables","parent_id":"t1_f6ti5yt","subreddit_id":"t5_2qhn7","body":"если вы уберете стимул к прибыли, вы увидите, что будет развиваться гораздо меньше лекарств.\n\nс другой стороны, может быть, нам не нужно 20 видов таблеток для ЭД, но это их выбор.","body_html":"<div class = \"md\"> <p> если вы уберете стимул к прибыли, вы увидите, что разрабатывается гораздо меньше лекарств. </Р>\n\n<p> С другой стороны, может быть, нам не нужно 20 видов таблеток для ЭД, но это их выбор. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tjnly/","name":"t1_f6tjnly","created":1573178705,"created_utc":1573149905,"subreddit_name_prefixed":"r/biology","depth":4},{"ups":2,"link_id":"t3_dt0fcb","id":"f6vwh0d","author":"thisdude415","parent_id":"t1_f6ti5yt","subreddit_id":"t5_2qhn7","body":"Это сложный бизнес. Я ученый в фармацевтической промышленности. Многие лекарства переоценены, особенно дженерики. С другой стороны, самые невероятно дорогие лекарства представляют собой настоящий прорыв, который излечивает болезни, которые буквально не поддаются лечению даже десять лет назад.\n\nВы предпочитаете мир с более дешевыми лекарствами, где наши химические препараты намного хуже? Вы бы предпочли слово, где люди неизменно умирают от ВИЧ? Это настоящие прорывы, и эти лекарства будут с нашими видами в течение следующего миллиона лет.","body_html":"<div class = \"md\"> <p> Это сложный бизнес. Я ученый в фармацевтической промышленности. Многие лекарства переоценены, особенно дженерики. С другой стороны, самые невероятно дорогие лекарства представляют собой настоящий прорыв, который излечивает болезни, которые буквально не поддаются лечению даже десять лет назад. </Р>\n\n<p> Вы предпочитаете мир с более дешевыми лекарствами, где наши химические препараты намного хуже? Вы бы предпочли слово, где люди неизменно умирают от ВИЧ? Это настоящие прорывы, и эти лекарства будут с нашими видами в течение следующего миллиона лет </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vwh0d/","name":"t1_f6vwh0d","created":1573233215,"created_utc":1573204415,"subreddit_name_prefixed":"r/biology","depth":4}],"id":"f6tewpn","author":"FarrahKhan123","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"> Идея состоит в том, что они запатентовывают участки генома или патента ДНК, которые являются потенциальными терапевтическими мишенями, аналогично тому, как фармацевтические компании патентуют молекулы, которые являются терапевтически активными.\n\nЭто точка их всех.","body_html":"<div class = \"md\"> <blockquote>\n<p> Идея состоит в том, что они запатентовывают участки генома или патента ДНК, которые являются потенциальными терапевтическими мишенями, аналогично тому, как фармацевтические компании патентуют молекулы, которые являются терапевтически активными. </p>\n</BLOCKQUOTE>\n\n<p> Это точка их всех. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tewpn/","name":"t1_f6tewpn","created":1573176728,"created_utc":1573147928,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":2,"link_id":"t3_dt0fcb","id":"f6v55uk","author":"d3sperad0","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"Я не чувствую, что это законный нюанс. Ни в коем случае нельзя запатентовать геном человека. Никаких нюансов не требуется. Я подозреваю, что это то, что парень ответил на доктора. Вентер думал. Хотя, комментарий соломенный человек, так что это так.","body_html":"<div class = \"md\"> <p> Не думаю, что это законный нюанс. Ни в коем случае нельзя запатентовать геном человека. Никаких нюансов не требуется. Я подозреваю, что это то, что парень ответил на доктора. Вентер думал. Хотя, комментарий соломенный человек, так что есть. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6v55uk/","name":"t1_f6v55uk","created":1573205702,"created_utc":1573176902,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":2,"link_id":"t3_dt0fcb","id":"f6udaz6","author":"watcherintgeweb","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"Патентное право - это чушь собачья, которую компании используют для поддержания мертвой хватки в экономике. Патентование человеческого генома в любом качестве было бы пародией","body_html":"<div class = \"md\"> <p> Патентный закон - это чушь, которую компании используют для поддержания мертвой хватки в экономике. Патентование человеческого генома в любом качестве было бы пародией </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6udaz6/","name":"t1_f6udaz6","created":1573190113,"created_utc":1573161313,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":1,"link_id":"t3_dt0fcb","id":"f6vstra","author":"JohnnyRelentless","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"Ты не уверен? В самом деле? Вау.","body_html":"<div class = \"md\"> <p> Вы не уверены? В самом деле? Вау. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vstra/","name":"t1_f6vstra","created":1573227673,"created_utc":1573198873,"subreddit_name_prefixed":"r/biology","depth":2},{"ups":1,"link_id":"t3_dt0fcb","id":"f6w1p9g","author":"Blueowl789","parent_id":"t1_f6tec7a","subreddit_id":"t5_2qhn7","body":"> оставил много нюансов для простого твиттера.\n\nХотя я думаю, что это эпидемия, если не сказать больше, которая полностью самоубийственна для общества, я не согласна с тем, что это является ее примером.\n\nТо, что вы только что объяснили, только выдвинуло на первый план, почему J Craig Venter - действительно душ, и капитализм разрушает все - как обычно. ОП была просто лаконична, а не небрежна.","body_html":"<div class = \"md\"> <blockquote>\n<p> упустил много нюансов для простого твиттера. </p>\n</BLOCKQUOTE>\n\n<p> Хотя я считаю, что это эпидемия, мягко говоря, полностью саморазрушительная для общества, я не согласен с тем, что это является ее примером. </Р>\n\n<p> То, что вы только что объяснили, только что подчеркнуло, почему Дж. Крейг Вентер - действительно душ, а капитализм разрушает все - как обычно. ОП был просто лаконичным, а не небрежным. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6w1p9g/","name":"t1_f6w1p9g","created":1573241464,"created_utc":1573212664,"subreddit_name_prefixed":"r/biology","depth":2}],"id":"f6tcqmo","author":"FarrahKhan123","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Как кто-то может даже попытаться запатентовать гребаный геном?","body_html":"<div class = \"md\"> <p> Как кто-то может даже попытаться запатентовать гребаный геном? </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tcqmo/","name":"t1_f6tcqmo","created":1573175893,"created_utc":1573147093,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":82,"link_id":"t3_dt0fcb","id":"f6tq9dn","author":"bilyl","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Я не получил его комментарий. Разве он не знает, что за публикацию в журналах PLOS нужно платить много, особенно PLOS ONE? Открытый доступ не является бесплатным доступом. Он должен защищать наличие препринта на биорксив для каждого представления.","body_html":"<div class = \"md\"> <p> Я не получил его комментарий. Разве он не знает, что за публикацию в журналах PLOS нужно платить много, особенно PLOS ONE? Открытый доступ не является бесплатным доступом. Он должен отстаивать наличие препринта на биорксив для каждого представления. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tq9dn/","name":"t1_f6tq9dn","created":1573181429,"created_utc":1573152629,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":50,"link_id":"t3_dt0fcb","replies":[{"ups":1,"link_id":"t3_dt0fcb","id":"f6vu51v","author":"mabolle","parent_id":"t1_f6ud17a","subreddit_id":"t5_2qhn7","body":"Хм. Да, чтение «позволить» в более широком смысле, чем просто финансовый, имеет смысл в качестве интерпретации.","body_html":"<div class = \"md\"> <p> Хм. Да, чтение «позволить» в более широком смысле, чем просто финансовый, имеет смысл в качестве интерпретации. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vu51v/","name":"t1_f6vu51v","created":1573229578,"created_utc":1573200778,"subreddit_name_prefixed":"r/biology","depth":2}],"id":"f6tuw5z","author":"mabolle","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Я даже не понимаю, как твиттер Вентера грамматически связан. Ученые, которые не могут опубликовать открытый доступ, должны публиковать открытый доступ? Значит, они должны делать то, что не умеют? Никаких оправданий?","body_html":"<div class = \"md\"> <p> Я даже не понимаю, как твиттер Вентера грамматически связан. Ученые, которые не могут опубликовать открытый доступ, должны публиковать открытый доступ? Значит, они должны делать то, что не умеют? Нет оправданий? </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tuw5z/","name":"t1_f6tuw5z","created":1573183187,"created_utc":1573154387,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":17,"link_id":"t3_dt0fcb","id":"f6tg7w8","author":"DangerousBill","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Сколько людей на самом деле заплатили 45 долларов за перепечатку? Есть ILL, запрашивающий перепечатку непосредственно у автора или даже из публичной библиотеки. Да, в публичных библиотеках работают библиотекари, у которых мало шансов практиковать то, к чему они были подготовлены.","body_html":"<div class = \"md\"> <p> Сколько людей фактически заплатили 45 долларов за перепечатку? Есть ILL, запрашивающий перепечатку непосредственно у автора или даже из публичной библиотеки. Да, в публичных библиотеках работают библиотекари, у которых мало шансов практиковать то, для чего они были подготовлены. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tg7w8/","name":"t1_f6tg7w8","created":1573177256,"created_utc":1573148456,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":14,"link_id":"t3_dt0fcb","replies":[{"ups":2,"link_id":"t3_dt0fcb","id":"f6uqep1","author":"braconidae","parent_id":"t1_f6ul2h5","subreddit_id":"t5_2qhn7","body":"Эх, это действительно зависит. В энтомологии / агрономии для меня вы можете снимать для Науки и т. Д., Если вы думаете, что у вас есть что-то всплесковое, но вы часто будете придерживаться общественных журналов в качестве следующего уровня воздействия для вашей области, которые в основном бесплатны как часть. членских взносов. Для меня, чтобы опубликовать в другом месте и получить более чем пару сотен долларов, это должен быть действительно хороший журнал, чтобы преодолеть этот порог. Я бы потратил лишние 1-2 КБ на сторонний проект или что-то в этом роде вместо открытого доступа.","body_html":"<div class = \"md\"> <p> Да, это действительно зависит. В энтомологии / агрономии для меня, вы можете снимать для Науки и т. Д., Если вы думаете, что у вас есть что-то всплесковое, но вы часто будете придерживаться общественных журналов в качестве следующего уровня воздействия для вашей области, которые в основном бесплатны как часть. членских взносов. Для меня, чтобы опубликовать в другом месте и получить более чем пару сотен долларов, это должен быть действительно хороший журнал, чтобы преодолеть этот порог. Я бы потратил лишние 1-2 тыс. На сторонний проект или что-то в этом роде вместо открытого доступа. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6uqep1/","name":"t1_f6uqep1","created":1573195317,"created_utc":1573166517,"subreddit_name_prefixed":"r/biology","depth":2}],"id":"f6tyvwz","author":"braconidae","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Просто смотреть на основной твит, это даже не имеет смысла. Если вы не можете позволить себе оплату публикаций для журналов с открытым доступом, это уже говорит о том, что вы не можете позволить себе оплату за «Журналы PLOS с самым высоким рейтингом ...»","body_html":"<div class = \"md\"> <p> Просто смотреть на основной твит, это даже не имеет смысла. Если вы не можете позволить себе оплату за публикацию в журналах с открытым доступом, это уже говорит о том, что вы не можете позволить себе оплату за «Журналы PLOS с самым высоким рейтингом ...» </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tyvwz/","name":"t1_f6tyvwz","created":1573184704,"created_utc":1573155904,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":7,"link_id":"t3_dt0fcb","id":"f6u8p2k","author":"AlpG95","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Scihub решает подобные проблемы","body_html":"<div class = \"md\"> <p> Scihub решает подобные проблемы </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6u8p2k/","name":"t1_f6u8p2k","created":1573188358,"created_utc":1573159558,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":10,"link_id":"t3_dt0fcb","id":"f6tqqzn","author":"houseoflies_qwerty","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Я плачу тебе за публикацию моей статьи, а ты зарабатываешь на этом, а я ничего не получаю. Научные журналы и публикации должны быть не для прибыли.","body_html":"<div class = \"md\"> <p> Я плачу вам за публикацию моей статьи, и вы зарабатываете на этом деньги, а я ничего не получаю. Научные журналы и публикации должны быть не для прибыли. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tqqzn/","name":"t1_f6tqqzn","created":1573181618,"created_utc":1573152818,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":5,"link_id":"t3_dt0fcb","id":"f6uyfeo","author":"Largo_La-Grande","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Среди ученых, которые были близки к нему, он был известен как Дарт Вентер.\n\nПравдивая история","body_html":"<div class = \"md\"> <p> Среди ученых, которые были близки к нему, он был известен как Дарт Вентер. </Р>\n\n<p> Правдивая история </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6uyfeo/","name":"t1_f6uyfeo","created":1573200614,"created_utc":1573171814,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":16,"link_id":"t3_dt0fcb","replies":[{"ups":8,"link_id":"t3_dt0fcb","id":"f6u3mu5","author":"tallanddanky","parent_id":"t1_f6ty3yz","subreddit_id":"t5_2qhn7","body":"Одежда не обязательна в моей лаборатории.","body_html":"<div class = \"md\"> <p> Одежда в моей лаборатории не обязательна. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6u3mu5/","name":"t1_f6u3mu5","created":1573186476,"created_utc":1573157676,"subreddit_name_prefixed":"r/biology","depth":2}],"id":"f6trra9","author":"JoziePosey","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Кроме того, хм ... люди, которые вкладывают свою кровь, пот и слезы в это исследование ... им нужно где-нибудь есть и жить.\n\nИногда им даже нужна одежда. O_0","body_html":"<div class = \"md\"> <p> Кроме того, хм .... люди, которые вкладывают свою кровь, пот и слезы в это исследование ... им нужно где-то есть и жить. </Р>\n\n<p> Иногда им даже нужна одежда. O_0 </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6trra9/","name":"t1_f6trra9","created":1573182002,"created_utc":1573153202,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":4,"link_id":"t3_dt0fcb","replies":[{"ups":1,"link_id":"t3_dt0fcb","id":"f6wg55m","author":"carrotssssss","parent_id":"t1_f6wcbjg","subreddit_id":"t5_2qhn7","body":"О, абсолютно, и не ко всему можно получить доступ таким образом, просто кое-что, о чем я думал, читая этот пост, ха-ха.\n\nЯвляется ли скимуб незаконным, как мне сказали? Например, мы спросили некоторых профессоров, что произойдет, если у нас будут источники на бумаге и кто-то узнает об этом, и один из них сказал: «Это незаконно, лучше по электронной почте им», а другой сказал (и я цитирую) «Я также смотрю игру престолов»","body_html":"<div class = \"md\"> <p> О, абсолютно, и не ко всему можно получить доступ таким образом, просто кое-что, о чем я думал, читая этот пост, ха-ха. </p>\n\n<p> Является ли скимуб незаконным, как мне сказали? Как мы спросили некоторых профессоров, что произойдет, если у нас будут источники на бумаге и кто-то узнает, и один сказал: «Это незаконно, лучше отправь им письмо», а другой сказал (и я цитирую) «Я также смотрю игру престолов» </р>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6wg55m/","name":"t1_f6wg55m","created":1573254560,"created_utc":1573225760,"subreddit_name_prefixed":"r/biology","depth":2}],"id":"f6v1m7f","author":"carrotssssss","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Разве в других странах не принято отправлять копию по электронной почте автору? Все профессора в моем колледже были «это совершенно нормально и прекрасно, спросить, мы делали / делаем это все время в наших исследованиях. Большинство ученых хотят, чтобы их работу читали» или что-то в этом роде. Недавно попробовал и через 2 часа я получил ответ и ссылку WeTransfer.","body_html":"<div class = \"md\"> <p> Разве в других странах не принято отправлять копию по электронной почте автору? Все преподаватели в моем колледже были «это совершенно нормально и прекрасно, мы спрашивали, мы делали / делаем это все время в наших исследованиях. Большинство ученых хотят, чтобы их работы читали» или что-то в этом роде. Недавно попробовал, и в течение 2 часов у меня был ответ и ссылка на WeTransfer. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6v1m7f/","name":"t1_f6v1m7f","created":1573203005,"created_utc":1573174205,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":2,"link_id":"t3_dt0fcb","id":"f6tiyl0","author":"Arsenicflare","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Эквивалент налога на дыхание ...","body_html":"<div class = \"md\"> <p> Эквивалент налога на дыхание… </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tiyl0/","name":"t1_f6tiyl0","created":1573178409,"created_utc":1573149609,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":1,"link_id":"t3_dt0fcb","id":"f6v63tv","author":"microbionub","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Крейг Вентур уже стар, чувак должен уже отвалить.","body_html":"<div class = \"md\"> <p> Крейг Вентур уже стар, чувак должен уже отвалить. </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6v63tv/","name":"t1_f6v63tv","created":1573206413,"created_utc":1573177613,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":1,"link_id":"t3_dt0fcb","id":"f6vxr40","author":"mermnfrog","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Право на!!\nУ меня было три геморрагических инсульта пару недель назад ... И я изучал другие последствия правого мозгового инсульта ... И я прочитал эту статью ... Ответил на мои вопросы ... Но я не могу вспомнить, что он сказал ... Я спас его перечитать это позже, но я не могу открыть это, потому что я перечитал это .. И не мог открыть это. Одни и те же.","body_html":"<div class = \"md\"> <p> Отлично!\nУ меня было три геморрагических инсульта пару недель назад ... И я изучал другие последствия правого мозгового инсульта ... И я прочитал эту статью ... Ответил на мои вопросы ... Но я не могу вспомнить, что он сказал ... Я спас его перечитать это позже, но я не могу открыть это, потому что я перечитал это .. И не мог открыть это. То же. </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6vxr40/","name":"t1_f6vxr40","created":1573235308,"created_utc":1573206508,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":1,"link_id":"t3_dt0fcb","id":"f6wa7mi","author":"zepp9008","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"ВАМ ДВА НУЖНО ПОЙТИ В ПОЛИТИКУ","body_html":"<div class = \"md\"> <p> ВАМ ДВА НУЖНО ПОЛУЧИТЬ В ПОЛИТИКУ, ШУТОВАТЬ НЕ </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6wa7mi/","name":"t1_f6wa7mi","created":1573250150,"created_utc":1573221350,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":1,"link_id":"t3_dt0fcb","id":"f6tkvxt","author":"CaptainDG5","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Это буквально сделало бы его ...\n\n\nБог?","body_html":"<div class = \"md\"> <p> Это буквально сделало бы его ... </p>\n\n<Р> Бог? </P>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6tkvxt/","name":"t1_f6tkvxt","created":1573179238,"created_utc":1573150438,"subreddit_name_prefixed":"r/biology","depth":0},{"ups":-1,"link_id":"t3_dt0fcb","id":"f6wbc9r","author":"zepp9008","parent_id":"t3_dt0fcb","subreddit_id":"t5_2qhn7","body":"Я верю, что честность решит все проблемы, с которыми мы сталкиваемся в крупной фармацевтике, например, почему мы до сих пор лечим людей, когда у них есть лекарство, я лично хотел бы знать, откуда приходят эти побуждения, я имею в виду, что мы можем говорить о том, откуда берутся деньги или собирается весь день, но мы все знаем, что происходит что-то не так, а кто-то нечестен","body_html":"<div class = \"md\"> <p> Я полагаю, что честность решит все проблемы, с которыми мы сталкиваемся в крупной аптеке, например, почему мы до сих пор лечим людей, когда у них есть лекарство, я лично хотел бы знать, откуда приходят эти подстрекательства. значит, мы можем говорить о том, откуда деньги идут или идут на весь день, но мы все знаем, что происходит что-то не так, и кто-то нечестен </p>\n</DIV>","permalink":"/r/biology/comments/dt0fcb/murdered_while_grandstanding/f6wbc9r/","name":"t1_f6wbc9r","created":1573251061,"created_utc":1573222261,"subreddit_name_prefixed":"r/biology","depth":0}]}