{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Всем привет!\n\nЯ представил эту библиотеку под названием «классная» около месяца назад. С тех пор библиотека была переименована, так как классная версия уже была взята на luarocks, проблемы с производительностью были решены, и я представил некоторые новые функции.\n\nВы можете проверить это здесь: https://github.com/SvenMarcus/lua-pie\n\nТак что же он может сделать?\n\nСамым очевидным является то, что классы написаны так, что они похожи на другие объектно-ориентированные языки, такие как Java.\nВот короткий пример:\n\n`` `Lua\nкласс \"Человек\" {\n    public {\n        конструктор = функция (self, arg)\n            self.arg = arg\n            самостоятельно: private_func ()\n        конец\n    };\n\n    частный {\n        private_func = function (self)\n            печать («Я не могу получить доступ снаружи!»)\n        конец\n    }\n}\n`` `\n\nКак видно из этого примера, lua-pie предоставляет функции для публичных и приватных методов. Но это еще не все, он также поддерживает статические члены, а также операторы / метаметоды.\nКроме того, lua-pie допускает одиночное наследование, а также вводит интерфейсы с абстрактными функциями.\nПочему интерфейсы в Lua? Главным образом как напоминание, так что вы не забудьте реализовать любые методы. Всякий раз, когда класс реализует интерфейс, но не определяет все необходимые методы в своем публичном блоке, lua-pie выдаст ошибку. Все это происходит, когда класс определен, поэтому вы не теряете производительности при создании экземпляров или использовании классов.\n\nЭто первая библиотека, которую я когда-либо написал для использования другими людьми, и до сих пор мне было очень весело работать над этим, и я очень счастлив, как это получилось. Я действительно надеюсь, что это может кому-то пригодиться!\n\n\nTLDR: это библиотека классов. Проверьте это здесь: https://github.com/SvenMarcus/lua-pie","title":"lua-pie v1.05 - библиотека классов с полиморфизмом, наследованием и инкапсуляцией","subreddit_name_prefixed":"r/lua","ups":8,"created":1544485556,"link_flair_background_color":"","id":"a4wqxb","author":{"name":"TRPox"},"permalink":"/r/lua/comments/a4wqxb/luapie_v105_a_class_library_with_polymorphism/","url":"https://www.reddit.com/r/lua/comments/a4wqxb/luapie_v105_a_class_library_with_polymorphism/","created_utc":1544456756}