{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Это 3d Luta-сценариевый либретро-интерфейс, над которым я работал.\n(Обратите внимание, что он не использует код RetroArch).\nЯ вложил большую часть усилий в Lua API, так что это может быть интересно\nнекоторым программистам Lua. Это все еще грубый WIP, я бы сказал, пре-пре-альфа.\nНо если кто-то хочет помочь, я хотел бы проверить три основных вещи:\n\n1. Открывается ли он на чужом компьютере (никто другой не пытался загрузить программу).\n\n2. У плагина установи работу.\n\n3. Загружает ли тестовая модель и эмулятор ядро.\n\nВам не нужно читать документы, но если вам интересно, я начал работать над документацией в\nhttps://github.com/runvnc/VSIMdocs\n\nДля тестирования, если вы можете просто:\n\n1. Скачать программу:\n\n[скачать]  (https://drive.google.com/uc?export=download&id=1YotzX1Lrk6rRrG613yE7mz7wfjdghzF_) \n\n2. Распакуйте его в c: \\ vsim или что-то\n\n3. Дважды щелкните файл vsim.exe. Это загружается? ПРИМЕЧАНИЕ: на моей Windows 10 написано, что некоторые BS о\n защита моего компьютера и \"Не беги\". Вы должны нажать на ссылку «Подробнее» вверху, а затем\nпозволит вам запустить его. Я обещаю, что это не вредоносное ПО. В конце концов я постараюсь подписать программу\nили что-то еще, но из того, что я прочитал, это не обязательно заставит это уйти, пока куча\nлюди устанавливают это.\n\n4. Если он загружается, подождите, пока консоль прекратит прокрутку, затем нажмите F5\n\n5. Надо сказать «Установить плагин». Нажмите Ctrl-V, чтобы вставить этот URL\n\n[ссылка]  (https://drive.google.com/uc?export=download&id=1DeGNBVegdQHvUMb06VAuVaEEQ1Ov9WEq) \n\n6. Нажмите ENTER и немного подождите. Он должен сказать «Загруженные х байтов» несколько раз, затем сказать, что установлен и т. Д.\n\n7. Закройте программу (Ctrl-F10) и перезапустите.\n\n8. Нажмите клавишу кавычки (рядом с 1 на тильде), чтобы открыть консоль.\n\n9. Введите `spawnc64 ()` [ENTER]\n\n10. Подождите несколько секунд, затем должна появиться 3d модель. Подождите еще несколько секунд, это\nдолжен показать экран C64.\n\n11. Закройте консоль, нажав обратно кавычку. Затем нажмите клавишу 1. Это должно увеличить, и вы должны быть в состоянии\nвведите текст в C64.\n\nБольшое спасибо всем, кто может проверить эти вещи.","title":"Ищите кого-нибудь, чтобы помочь протестировать интерфейс 3d-эмулятора Lua-scriptable, над которым я работал","subreddit_name_prefixed":"r/lua","ups":1,"created":1545601247,"link_flair_background_color":"","id":"a8upx9","author":{"name":"runvnc"},"permalink":"/r/lua/comments/a8upx9/looking_for_someone_to_help_test_a_luascriptable/","url":"https://www.reddit.com/r/lua/comments/a8upx9/looking_for_someone_to_help_test_a_luascriptable/","created_utc":1545572447}