{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"[https://ibb.co/tMSqxkM] (https://ibb.co/tMSqxkM)  \\ - изображение 3\n\n[https://ibb.co/p2PQJzF] (https://ibb.co/p2PQJzF)  \\ - изображение 2\n\n[https://ibb.co/Tq4c68N] (https://ibb.co/Tq4c68N)  \\ - изображение 1\n\n\n\nИтак, это мои 3 скриншота, мое устройство - iphone 8 Plus, а игра, для которой я создаю сценарий, - мобильная игра под названием Bleach Brave Souls.\n\nРазрешение экрана: 1242, 2208 Поворот экрана: LandscapeRight.\n\nТак что это просто часть скрипта, с которой у меня, в частности, возникают проблемы, и это странно, потому что его более или менее те же позиционные цвета, что и у меня в скрипте для моего iPad Pro.\n\nЕсли вы посмотрите на изображение 1, вы заметите кнопку Pink / Purple, но в самом дальнем правом углу экрана, вот что я использовал для первых 5 строк. Цель состоит в том, чтобы распознать кнопку и нажимать ее каждые 5 секунд. После того, как вы нажмете на кнопку, персонаж делает «специальный ход», поэтому, чтобы пропустить анимацию, сразу же выполняется второе нажатие. Я хочу, чтобы это продолжалось до тех пор, пока я не достигну экрана вознаграждения в конце, через который он пройдет все, и у меня есть другие линии, которые перезапустят комнату и т. Д.\n\n\n\nМоя проблема заключается в том, чтобы получить 5-секундный специальный цикл, у меня это отлично получается на моем ipad, но на моем iphone сценарий нажимает кнопку, пропускает анимацию и затем просто не повторяется.\n\n\n\nКакие-либо предложения ?\n\n(не могу вспомнить, почему я разместил другие ссылки, но это нормально)\n\n\n\n\\ - 5сек специальный цикл и пропустить конец и вознаграждение\n\nif getColor (1912, 797) == 16711422\n\nи getColor (2111, 776) == 16711422 тогда\n\nUSleep (4000000);\n\nкран (2103, 763);\n\nUSleep (500000);\n\nповторение\n\nкран (1294, 1127);\n\nUSleep (500000);\n\nпока getColor (1910, 796) == 16711422\n\nили getColor (1788, 1185) == 3107322\n\nконец\n\n\n\n","title":"Написание lua-скрипта «loop» с просьбой о помощи.","subreddit_name_prefixed":"r/lua","ups":1,"created":1546340981,"link_flair_background_color":"","id":"abedea","author":{"name":"Num1Player"},"permalink":"/r/lua/comments/abedea/writing_a_lua_script_loop_requesting_help/","url":"https://www.reddit.com/r/lua/comments/abedea/writing_a_lua_script_loop_requesting_help/","created_utc":1546312181}