{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Привет,\n\nПоэтому я пытался исправить ошибку, которую я получал в своих скриптах. То, что я пытался сделать, это собрать воедино код, чтобы переделать генетическую эволюцию Super Mario Bros в Super Mario Kart. Это было довольно сложно, однако я обнаружил, что большая часть работы уже была проделана за меня пользователями [Sethbling]  (https://www.youtube.com/channel/UC8aG3LDTDwNR1UQhSn9uVrw)  и [Winterbunny]  (https://www.twitch.tv/winterbunny) . Я, вероятно, просто глуп, но если кто-то может потратить час или два, чтобы помочь мне выяснить мою ошибку, я был бы чрезвычайно благодарен. Я хочу узнать больше о кодировании и машинном обучении, но эта проблема выходит за рамки такого начинающего, как я.\n\nВот что я сделал и откуда я их взял. Сначала я скачал файл rom Super Mario Kart и эмулятор BizHawk. Затем я загрузил [основной скрипт]  (http://pastebin.com/xLvr1zrR)  вместе с [csv.lua]  (http: //pastebin.com/PAzNjZbi)  и [map.txt]  (http://pastebin.com/mUeWhWaH)  и преобразовали их в файлы соответствующих типов. Наконец, я, когда для запуска игры, а когда для одиночной игры> Time Trials. Я также выбрал Марио в качестве гонщика вместе с картой Mario Circuit. Наконец, я создал файл состояния сразу после начала гонки, а затем перезапустил эмулятор и запустил скрипт, как только гонка начнется снова. Первоначально я столкнулся с ошибкой, когда все файлы не были в одной папке и названы имена выше, за исключением основного сценария, который вы можете изменить. Тем не менее, после исправления этих проблем, я получаю эту ошибку каждый раз, когда я запускаю ее. `NLua.Exceptions.LuaScriptException: table`","title":"Генетическая эволюция в Super Mario Kart","subreddit_name_prefixed":"r/lua","ups":3,"created":1547203737,"link_flair_background_color":"","id":"aeqted","author":{"name":"MorrisRees"},"permalink":"/r/lua/comments/aeqted/genetic_evolution_in_super_mario_kart/","url":"https://www.reddit.com/r/lua/comments/aeqted/genetic_evolution_in_super_mario_kart/","created_utc":1547174937}