{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"[https://github.com/tilkinsc/LuaConsole] (https://github.com/tilkinsc/LuaConsole) \n\n\n\nЗдравствуйте! Я автор LuaConsole. У меня здесь есть программа CLI, которая добавляет гораздо больше функций и улучшений по сравнению с PUC-Lua и luajit CLI. Он кроссплатформенный, поэтому можно использовать posix, unix и windows. Некоторыми основными улучшениями являются поддержка рабочих каталогов, возможность выполнения библиотек строк и файлов с использованием переключателя аргументов, полная поддержка stdin, улучшенная отчетность об ошибках, возможность определять переменные, которые также пересекают таблицы, переключать версии lua через -w, данные запуска из режима шумоподавления stdout, чтобы вы могли использовать lua для обработки с помощью stdio и piping, принудительно включайте режим REPL после выполнения сценария для отладки, с поддержкой LuaDIST и LuaRocks и в поддерживаемом формате, написанном на C, который вы можете добавить или преобразовать для настройки. Проверьте полный список в [ЗДЕСЬ]  (http://tilkinsc.github.io/LuaConsole/) .\n\n\n\nWindows теперь создана и выпущена для легкой загрузки и использования, но включает только luajit, lua-5.1.5, lua-5.2.4 и lua-5.3.5. Для дополнительных подрывных действий, вы должны скачать и собрать его самостоятельно. [https://github.com/tilkinsc/LuaConsole/releases/tag/v4.0] (https://github.com/tilkinsc/LuaConsole/releases/tag/v4.0)  (FWIW добавленный мною значок сделал исполняемый файл с 45 056 КБ до 81 920 КБ, а загрузка - 1 818 624 байт)\n\n\n\nТеперь я поддерживаю китайский, испанский, португальский и русский языки, насколько мне позволяет Google Translate. Тем не менее, специальные символы не отображаются правильно (если вообще). Так что китайский, немного португальский, немного русский и недавно добавленный японский не будут работать, пока я не преобразую выходной конвейер в wchar \\ _t или что-то подобное. По-видимому, запрос на тягу на русском языке переводится как добыча. Отправить извлечение товарищей.\n\n\n\n\\ -c теперь указывает на комплимент, переименован в -q для тихого\n\n\n\n\\ -c можно использовать для компиляции ваших файлов .lua, используйте его точно так же, как любой другой исполняемый файл luac. Удалено в luajit из-за наличия опции -b.\n\n\\ `luaw -w lua-5.3.5 -c res / testing.lua \\`\n\n\n\nСпасибо за вашу поддержку! <3\n\n\n\n","title":"LuaConsole теперь поддерживает [5.1.x to luajit] в двоичном файле AIO!","subreddit_name_prefixed":"r/lua","ups":18,"created":1547460280,"link_flair_background_color":"","id":"afqtql","author":{"name":"Hydroque"},"permalink":"/r/lua/comments/afqtql/luaconsole_now_supports_51x_to_luajit_in_an_aio/","url":"https://www.reddit.com/r/lua/comments/afqtql/luaconsole_now_supports_51x_to_luajit_in_an_aio/","created_utc":1547431480}