{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Ссылка: [https://github.com/nico-abram/LuaNES/] (https://github.com/nico-abram/LuaNES/) \n\n\n\nЯ пишу эмулятор NES на Lua (он вдохновлен / основан на рубиновом эмуляторе NES [https://github.com/mame/optcarrot] (https://github.com/ mame / optcarrot) ). Он еще не закончен, но в настоящее время он может работать почти постоянно со скоростью 50 кадров в секунду (хотя при запуске mario он обычно работает со скоростью 49-114 кадров в секунду) и принимать ввод, однако у него еще нет звука. Я запустил пару тестовых ромов, и они их проходят. Он использует love2d для ввода и вывода видео (хотя мне удалось также использовать его в ритм-игре, в которую встроен luajit, [https://github.com/etternagame/etterna] (https : //github.com/etternagame/etterna) ). В настоящее время это около 5000-6000 строк кода.\n\n\n\nЯ поторопился с этим процессом, и большая часть кода, вероятно, не особенно хороша и не очень приятна. Пара таблиц использует индексирование 0, чтобы упростить его (поскольку большую часть времени ему нужно выполнять побитовые операции с данными, и добавление одной может сбивать с толку), а иногда, когда я этого не делаю, нужно добавить 1 непосредственно перед индексацией, потому что индекс является результатом побитовой операции. Он использует довольно простую и, вероятно, некрасивую служебную функцию класса (я не думал, что использование чего-то вроде middleclass того стоило, учитывая, что оно почти не использует наследование). В результате большинство функций полезности находят начальную точку с \"t \\ [0 \\] и 0 или 1\", которая разбивает мою душу каждый раз, когда я ее вижу. Я обещаю, что со временем все нормализую. Есть также несколько служебных функций в utils.lua, присутствующих в ruby, которые могут иметь или не иметь более быстрый, более стандартный эквивалент в lua, и я со временем заменю.\n\n\n\nЯ думаю, что luajit должен быть в состоянии выполнить это \\ * намного \\ * лучше, и я виню в этом его текущую производительность (и мою в значительной степени основанную на эмуляторе ruby). Для справки, mesen, эмулятор в C ++ способен довольно стабильно запускать mario на скорости около 350 кадров в секунду на моей машине, когда он не ограничен. Любая помощь, чтобы попытаться улучшить производительность, приветствуется \\ * очень \\ * (я пробовал профилирование с использованием \"luajit -jp\", \"luajit -jp = v\" и вижу результаты трассировки с помощью \"luajit -jv\". Мне удалось удалить один NYI благодаря выводу -jv, но я не смог найти много других полезных вещей из их вывода (кроме множества сопрограммных сообщений. NES имеет 2 компонента, которые имеют разные скорости / тактовые частоты (cpu и apu (аудио)) и Процессор имеет довольно специфический порядок работы, и некоторые игры полагаются на него. Вот почему он использует сопрограмму. Может ли это быть тем, что замедляет его?). Вывод профилировщика, с и без \"v\" (и другие флаги) не был особенно полезен, главным образом потому, что он не кажется детерминированным (я получаю выходные данные, которые меняются каждый раз). Я ничего не делаю со случайными числами или вводом / выводом, поэтому я предполагаю, что это может быть диск или Кэш-память ОЗУ или что-то другое, что меняет вещи (удивительно, что даже% вещей, получающих JITted, меняется случайным образом)). Я также попытался заменить пару таблиц массивов, которые, согласно выводу профилировщика, были связаны с узкими местами в большинстве исполнений с массивами FFI. Это не оказало заметного влияния (FPS в целом чувствовал себя немного хуже).\n\n\n\nКроме того, для аудио: если кто-нибудь знает способ потоковой передачи сэмплов из lua в love2d и как кодировать 8-битные или 16-битные сэмплы в нормализованную выборку от -1 до 1, которая, по-видимому, нужна любой аудио-функции setSample love2d (в соответствии с документами) помощь или понимание было бы очень полезно.\n\n\n\nЕсть ли какие-то разногласия lua / luajit, чтобы попросить помочь оптимизировать код?\n\n\n\nКто-нибудь знает хороший инструмент для отладки / профилирования любовных приложений?\n\n\n\nКто-нибудь знает, использует ли love2d luajit? (Я уверен, что так и есть) Включен ли JIT? (У меня не было доступа к модулю jit или к любому конкретному модулю luajit)\n\n\n\nКто-нибудь знает хорошие инструменты love2d (IDE, отладчик, профилировщик и т. Д.). В настоящее время я использую vscode, и он довольно хорошо работает для форматирования / linting / предупреждений об ошибках, но у afaik нет специальных плагинов для love2d.","title":"Эмулятор NES: LuaNES","subreddit_name_prefixed":"r/lua","ups":26,"created":1547908361,"link_flair_background_color":"","id":"ahjo8j","author":{"name":"Nickitolas"},"permalink":"/r/lua/comments/ahjo8j/an_nes_emulator_luanes/","url":"https://www.reddit.com/r/lua/comments/ahjo8j/an_nes_emulator_luanes/","created_utc":1547879561}