{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Недавно я начал использовать lua, в основном потому, что пытался начать новый проект в рамках моих ограниченных возможностей, чтобы вернуться к программированию после того, как узнал, что я делаю, но со странным недоверием к тому, что сделали другие люди. Пройдя как можно более низкий уровень, чтобы поэкспериментировать с созданием своего собственного языка и компилятора и испытать кучу проблем, пытаясь просто получить некоторые библиотеки, которые я хотел бы использовать для работы, у меня наконец появилась прекрасная идея сделать похожий на roguelike и обнаруживший, что моя любимая библиотека, bearlibterminal, которую я не мог заставить сделать всплывающее окно на других языках, которые я пробовал, могла бы использоваться с lua фантастически прямым способом. Я немного поработал над своим проектом и до сих пор любил lua, но я захотел использовать структуру ecs, потому что раньше этого не делал, и концептуально это действительно здорово для меня. Я посмотрел на библиотеки ecs, которые существуют для lua, и увидел, что их не так много по сравнению с другими языками, с которыми я играл, такими как python, rust или c ++. Мне не очень понравилось то, что я нашел отчасти из-за странного недоверия, которое я испытываю к вещам других людей, и поэтому недавно работал над созданием своего собственного, и ранее сегодня у меня возникла мысль, что вы можете просто использовать таблицы как объекты, данные в этих таблицах как компоненты и функционируют как системы, которым вы просто передаете компоненты напрямую. Я не очень разбираюсь в lua или вообще в кодировании, но приехал сюда, чтобы спросить, есть ли что-то, чего мне не хватает, что сделало бы эту ужасную идею? или мне даже не нужна библиотека, чтобы сделать что-то, что в противном случае было бы сотнями или даже тысячами строк на других языках?","title":"Мой опыт работы с Луа и возможно тупой вопрос","subreddit_name_prefixed":"r/lua","ups":10,"created":1548825131,"link_flair_background_color":"","id":"al4t0z","author":{"name":"Theguywholikesfrench"},"permalink":"/r/lua/comments/al4t0z/my_experience_with_lua_and_a_possibly_dumb/","url":"https://www.reddit.com/r/lua/comments/al4t0z/my_experience_with_lua_and_a_possibly_dumb/","created_utc":1548796331}