{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Я пытаюсь изменить код старой мобильной игры под названием Fun Run 2 как уникальный исследовательский проект для моего курса по разработке программного обеспечения в колледже. Я сделал сообщение о stackoverflow (https://stackoverflow.com/questions/54566247/how-to-re-compile-a-compiled-bytecode-listing-for-luas-vm-compiler) и мне предложили приехать сюда, потому что мой вопрос стал широким, и ответы все дальше уходили от темы.\n\nКороче говоря, приложение было создано с использованием Corona SDK и поэтому запрограммировано на Lua. Итак, как только я взял APK и распаковал его, мне нужно было распаковать файл resource.car (Corona ARchive), чтобы получить доступ к файлам Lua. Я так и сделал, и все файлы в этом архиве являются предварительно скомпилированными .lu файлами.\n\nПервым, что я попытался изменить в коде Lua, было использование unluac / luadec для декомпиляции файлов .lu в читаемый, модифицируемый, пригодный для компиляции исходный код. Я смог успешно декомпилировать, модифицировать и перекомпилировать их, однако, когда он действительно выполнял измененный файл .lu в игре, он зависал из-за попытки индексировать нулевое значение. Я обнаружил, что причиной этого был тот факт, что существует нечто, называемое повышением, которое при извлечении отладочной информации из скомпилированного файла Lua невозможно получить, и поэтому попытка декомпилировать и перекомпилировать файлы .lu не собиралась на работу (или так я думал на данный момент).\n\nЗатем мой следующий подход заключался в использовании команды \"luac -l\", которая создает список скомпилированного байт-кода для виртуальной машины Lua. Я сделал это и изменил список байт-кодов только для того, чтобы выяснить, что нет реального способа скомпилировать этот список байт-кода обратно в скомпилированный двоичный файл Lua.\n\nЯ чувствовал себя застрявшим в этой точке, пока не обнаружил, что то, что я раньше думал о повышении стоимости, было неверным. Я узнал, что значение upvalue - это просто ссылка на переменную, объявленную вне функции, обращающейся к ней, и мне нужно было угадать, что это значение upvalue, и объявить его вне всех функций. Я смог сделать это для одного файла, взглянув на инструкции по ВМ, и начал работать с игрой и всем остальным.\n\nТеперь, однако, я пытаюсь сделать то же самое с другим файлом, который имеет более чем 20 значений, в то время как последний, который я пытался изменить, имел только 1. Это делает предположение намного сложнее, как вы можете себе представить, но я знаю, что можно обойти это, потому что люди модифицировали эту игру, прежде чем делать то же самое, что я делаю. С учетом всего сказанного, как мне узнать, что представляют собой все эти значения, чтобы иметь возможность декомпилировать, модифицировать и перекомпилировать этот двоичный файл Lua?\n\nВот бинарный файл Lua - https://filebin.net/rbukpuiwidkwca5t/lua.scenes.gamePlay.lu\n\nВот что производит декомпиляция unluac.jar - https://filebin.net/e8vridbly4ke8t5u/lua.scenes.gamePlay.lua\n\nЛюбая помощь очень ценится.","title":"Unluac, ошибки декомпиляции и повышения","subreddit_name_prefixed":"r/lua","ups":4,"created":1549611621,"link_flair_background_color":"","id":"aoa8if","author":{"name":"AtheismIsUnstoppable"},"permalink":"/r/lua/comments/aoa8if/unluac_decompilation_errors_and_upvalues/","url":"https://www.reddit.com/r/lua/comments/aoa8if/unluac_decompilation_errors_and_upvalues/","created_utc":1549582821}