{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Всем привет.\n\nЯ планирую использовать Lua в качестве языка сценариев для проекта C, и думаю, что я должен просто использовать его в качестве языка конфигурации.\n\nЯ включил исходный код в проект, так что я могу выбирать, какие функции добавить в песочницу из C, а не из Lua. В [Wiki]  (http://lua-users.org/wiki/SandBoxes)  приведен список функций, которые могут вызвать проблемы с песочницей * от Lua * , Тем не менее, я хотел бы знать, не является ли то, что указано на сайте как небезопасное, небезопасным в изолированной программной среде на основе С.\n\nEx. `` `getmetatable``` безопасен (?), так как я никогда не загружаю библиотеку io, и конфигурация контролируется пользователем, поэтому никаких других действий для других модулей не возникает.\n\nНебезопасные элементы, которые мне любопытно узнать, безопасны ли они в изолированной среде:\n\n- получить доступный\n- setmetatable\n- равный\n- сырье\n- rawset\n- Rawlen\n- строка (т. е. любой модуль с безопасными в противном случае функциями)\n\nЭти функции определенно небезопасны, если программа Lua пытается изолировать Lua-скрипт. Но если мой код C вызывает `` `luaL_newstate ()` ``, `` `luaopen_sandbox_libs (L)` ``, `` `lua_loadfilex (L, f,\" t \")` ``, `` `lua_pcall (L , 0, 0, 0) `` `,` `` lua_close (L) `` `, тогда они безопасны?\n\nЕсть ли выход из песочницы с использованием этих функций? (Предполагается, что все функции, помеченные как небезопасные на веб-сайте, выгружены (включая библиотеку io))\n\nПримечание: я использую Lua 5.3, поэтому `` `setfenv``` там нет, но если бы я использовал Lua 5.1, это тоже безопасно?","title":"Lua как конфигурация - функции из белого списка","subreddit_name_prefixed":"r/lua","ups":7,"created":1553171657,"link_flair_background_color":"","id":"b3ma6c","author":{"name":"skyb0rg"},"permalink":"/r/lua/comments/b3ma6c/lua_as_configuration_whitelisted_functions/","url":"https://www.reddit.com/r/lua/comments/b3ma6c/lua_as_configuration_whitelisted_functions/","created_utc":1553142857}