{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Привет всем!\n\nВернемся снова с другой проблемой.\n\nПрежде всего: я обычно пишу код Lua, используя IDE ZeroBrane Studio, но иногда мне нравится запускать программы, которые я пишу, используя оболочку (MacBook Pro). Моя версия Lua 5.3.5, самая новая.\n\nУ меня довольно длинная программа, не очень сложная, но слишком длинная для публикации, что вызывает у меня некоторые проблемы. Эта программа генерирует только целые числа и в определенный момент записывает их в файл. Когда я запускаю программу из IDE, она записывает их правильно как целые числа, но когда я запускаю ее из командной оболочки, она записывает их все (кроме последней) как числа с плавающей запятой (например, x.0). Я знаю, что это не имеет большого значения, так как, когда он читает их обратно, Lua знает, что они целые числа, и поэтому ошибок не возникает. Однако это крайне неприятно, ИМХО, и я хотел бы, чтобы они были представлены правильно.\n\nЭта проблема возникает, даже если я печатаю следующий номер:\n\n    print (os.date (\"% w\") + 1) - печатает 5.0 на оболочке, но 5 в IDE\n\nКто-нибудь знает в чем может быть причина?\n\nСпасибо заранее тем, кто пытается мне ответить.\n\n\n\n\\ [Решаемые \\]\n\nЧерез день я узнал, в чем проблема. Есть кусок кода, в котором мне нужно взять два числа, скажем, 4 и 2, и мне нужно вернуть их конкатенацию, в данном случае 42. Самый быстрый способ, который я нашел, - это использовать оператор конкатенации ('. «). Этот оператор приводит 4 и 2 к строкам, а затем объединяет их. Поскольку я не использую новый номер для арифметических операций, но мне нужно только записать его в файл, я подумал, что это будет хорошо.\n\nСегодня я решил попробовать создать новый номер так:\n\n    локальная строка, столбец = - функция, которая возвращает два числа\n    возвращаемая строка * 10 + столбец - с 4 и 2 выполняет 4 * 10 + 2 = 42\n\nТаким образом, даже при запуске программы из командной оболочки числа записываются правильно как целые числа, и проблема решается. Но это поднимает более сложный вопрос: преобразует ли io.write строку (представляющую число) в число перед записью? Если вы ответите: «конечно, вы глупый», извините, я действительно не знал (и до сих пор не могу понять, почему это так).","title":"Небольшие проблемы с отображением чисел","subreddit_name_prefixed":"r/lua","ups":2,"created":1553226026,"link_flair_background_color":"","id":"b3uzlr","author":{"name":"Sghebre"},"permalink":"/r/lua/comments/b3uzlr/little_io_troubles_with_numbers_representation/","url":"https://www.reddit.com/r/lua/comments/b3uzlr/little_io_troubles_with_numbers_representation/","created_utc":1553197226}