{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Привет всем,\n\nЯ здесь новенький и ищу помощи, чтобы понять сопрограммы и неблокирующие задержки. Пакет программного обеспечения, с которым я работаю, позволяет создавать сценарии с LUA. Программа для Windows работает на станке с ЧПУ. Сценарий, который я пытаюсь написать, связывается с некоторым промышленным оборудованием, записывая сообщение ASCII через последовательный порт и через некоторое время считывая последовательный буфер, чтобы получить ответ.\n\n\n\nМоя задача - добавить в код небольшую задержку, чтобы дождаться ответа, не блокируя другие функции кода, такие как перерисовка экрана. Будут отправлены разные сообщения, поэтому я пытаюсь сконструировать код таким образом, чтобы разделы, которые необходимо использовать повторно, записывались не более одного раза.\n\n\n\nМой текущий дизайн генерирует строку, когда вызывается такая функция, как servoGetSpeed ​​(address), передает ее через последовательный порт, запускает аппаратный таймер прерывания, затем выдает сопрограмму (позволяющую перерисовать экран). Затем событие прерывания происходит спустя несколько миллисекунд, сопрограмма возобновляется, данные считываются из последовательного буфера и, надеюсь, возвращаются в исходную функцию.\n\n\n\nМоя проблема заключается в том, что оригинальная функция servoGetSpeed ​​() возвращает, когда сопрограмма возвращает результат (а не когда она завершена), поэтому последовательный буфер еще не был прочитан, а данные для возврата недоступны. Когда сопрограмма завершается, она возвращается к функции события прерывания, где сопрограмма возобновляется после задержки. ** Как получить сопрограмму для возврата данных в исходный вызов функции? **\n\n\n\nЯ не программист по профессии, поэтому я немного изо всех сил, чтобы изучить тонкости LUA. Если есть лучший / более простой способ добиться этой неблокирующей задержки, пожалуйста, дайте мне знать. Программное обеспечение - Mach 4, работает под управлением LUA 5.2 и wxWidgets.","title":"Общий вопрос о сопрограммах / неблокирующих задержках","subreddit_name_prefixed":"r/lua","ups":2,"created":1553647021,"link_flair_background_color":"","id":"b5rxs1","author":{"name":"macardoso"},"permalink":"/r/lua/comments/b5rxs1/general_question_about_coroutinesnonblocking/","url":"https://www.reddit.com/r/lua/comments/b5rxs1/general_question_about_coroutinesnonblocking/","created_utc":1553618221}