{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Итак, я изучаю Lua с опытом новичков в C ++. Ради интереса я хотел повторить одно из моих любимых ранних упражнений на C ++ из этой [превосходной книги] <span translate = \"no\"> (https://www.amazon.com/Programming-Principles-Practice-Using-C/dp / 0321543726) </ SPAN>; сделать функцию умножения без использования '\\ *'. Поэтому я пошел на работу и придумал что-то приличное. умножить (х, у)\n\n\n\nНесмотря на то, что это было излишним, я хотел быстро выйти из функции, если у x или y был 0, поэтому я сделал следующее выражение if:\n\n    если x или y == 0 - вернуть 0 для завершения функции\n\nХотя я немного понимаю логические операторы 'и' / 'или' в отношении Lua, я был удивлен, что функция вернет 0 независимо от ввода из-за этого оператора if. *Почему*?\n\n\n\nЕсли бы я изменил «или» на «и», как это:\n\n     если x и y == 0 - вернуть 0 для завершения функции\n\nКажется, он никогда не активирует конкретный оператор if независимо от чего-либо (например, если x или y было 0). *Почему*?\n\n\n\nКак ни странно и по прихоти, ввод работает отлично, когда я изменяю выражение if на следующее:\n\n     if (x или y) == 0 - возврат 0 для завершения функции\n\n*Почему*?\n\n\n\nВ конце концов, я придумал свой собственный способ сделать это, если утверждение, где я мог понять внутреннюю работу:\n\n    если x == 0 или y == 0, то - если x или y равен 0, вернуть 0\n\nДаже после того, как я сделал это, у меня появилось ноющее желание просветления в затылке. Это были самые горячие вопросы, но я также хотел спросить, есть ли более краткий способ написать мое окончательное решение. И если этот путь вращается вокруг моего странного решения. *Почему?*\n\n\n\nИзменить: вот исходный код моего первого нерабочего решения: [https://pastebin.com/m0PHtm8r] (https://pastebin.com/m0PHtm8r) \n\nРедактировать: также в исходном коде есть одна ошибка компиляции с этим конкретным оператором if, не имеющим ключевого слова then. Вы можете игнорировать это","title":"Нужны объяснения и советы для логических операторов (и / или)","subreddit_name_prefixed":"r/lua","ups":0,"created":1559201111,"link_flair_background_color":"","id":"bulugy","author":{"name":"GaiusCorner"},"permalink":"/r/lua/comments/bulugy/looking_for_explanation_and_advice_for_logical/","url":"https://www.reddit.com/r/lua/comments/bulugy/looking_for_explanation_and_advice_for_logical/","created_utc":1559172311}