{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Хочу сначала посмотреть код: [найти его здесь]  (https://gist.github.com/DarkWiiPlayer/682e4ae5cbe3619d4ca320541ab453b6) \n\nНедавно я прочитал [эту статью]  (http://www.mikemarcin.com/post/coroutine_a_million_stacks/) , и это показалось мне действительно интересным. Это заставило меня задуматься, сколько сопрограмм я мог бы реально использовать в Lua.\n\nРезультат: что-то около нескольких миллионов, а создание занимает значительно больше времени, чем возобновление. Это доказывает, что, например, сопрограммы можно легко использовать для каждого объекта в небольших играх, чтобы аккуратно инкапсулировать состояние. Дополнительную информацию о том, почему сопрограммы такие классные, можно найти в [этой замечательной статье] <span translate = \"no\"> (http://www.inf.puc-rio.br/~roberto/docs/MCC15-04.pdf). </ SPAN>.\n\nТогда я задумался ... А как же Руби? Это похожий язык, и я использую оба, так почему бы не сравнить их сразу?\n\nРезультат был ... разочаровывающим.\n\nЯ начал с 1 миллиона сопрограмм в Lua, который прошел хорошо; таким образом, я поднял это до 2 миллионов и просто занял больше времени. Превратить его в 4 миллиона - вот где он окончательно рухнул * на моем ПК *.\n\nПоэтому я решил использовать ту же исходную точку в миллион для Ruby, и она потерпела крах. Итак, я пошел ниже. И ниже. И даже ниже. В конечном итоге я обнаружил, что могу использовать до 32000 волокон; за 33к уже вылетает. Интересно, что он даже не падает при создании волокон, но я впервые пытаюсь возобновить их.\n\nВывод: Ruby потрясающий; только не используйте это для чего-нибудь серьезного.","title":"Lua Coroutines vs. Ruby Fibers (тест)","subreddit_name_prefixed":"r/lua","ups":12,"created":1563903361,"link_flair_background_color":"","id":"cgqfch","author":{"name":"DarkWiiPlayer"},"permalink":"/r/lua/comments/cgqfch/lua_coroutines_vs_ruby_fibers_benchmark/","url":"https://www.reddit.com/r/lua/comments/cgqfch/lua_coroutines_vs_ruby_fibers_benchmark/","created_utc":1563874561}