{"subreddit":{"display_name":"lua"},"subreddit_loc":"принимать","selftext":"Он работает как moonscript, за исключением того, что все в одном переносимом скрипте lua Это может показаться глупым для людей, которые используют скомпилированные языки, но lua подкомпилирован, так что, вероятно, он будет работать нормально, я надеюсь ...\n\nЧто он собирается сделать, так это искать main.lpp, main.lexu и main.lut для загрузки. Все, что вам нужно сделать, это использовать для этого оператор require, и он загрузит первый из тех, что он увидит.\n\nЭто не похоже на c ++, где он добавляет классы к c, он добавляет ++ на данный момент, и я собираюсь работать над + = и прочим.\n\nЕго легко расширить, так как он хранит то, что оператор ищет в таблице в качестве ключа, и что он заменит его как значение, поскольку все, что он на самом деле делает, это получает ваш lpp-файл и преобразует его в lua, а затем выполняет его.\n\nКлюч к ценности реализации может вызвать у всех отвращение, но это просто самый простой способ. По крайней мере, я перебираю красивую аккуратную таблицу вместо того, чтобы рассылать чужие сообщения везде. На самом деле, делай, что хочешь, пока никто не будет полагаться на это.\n\nЯ до сих пор даже не думал о том, как достать файлы, поэтому, наверное, мне следует сделать это до того, как будут сделаны какие-либо обещания: Р, слишком поздно. Поскольку он будет только читать файл и компилировать его в памяти, я использую некоторую функцию io, о которой я кратко прочитал вчера.\n\nЧестно говоря, просто хочу узнать мнение некоторых людей, и да, я сделал собственный лексер и не буду использовать ни одного string.match или gmatch.\n\nЯ начинаю думать, что идея всего одного файла была плохой, но, вероятно, это повредит, как только неизбежно нанесет мне удар в спину. Кроме того, не доверяй мне слишком сильно и не волнуйся. Мне всего 14 лет.","title":"Я работаю над проектом под названием lua ++ для lua 5.1","subreddit_name_prefixed":"r/lua","ups":5,"created":1572703056,"link_flair_background_color":"","id":"dqgbmw","author":{"name":"Ufoul"},"permalink":"/r/lua/comments/dqgbmw/im_working_on_a_project_called_lua_for_lua_51/","url":"https://www.reddit.com/r/lua/comments/dqgbmw/im_working_on_a_project_called_lua_for_lua_51/","created_utc":1572674256}