{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"","title":"Почему крионика имеет смысл | Подождите, но почему","subreddit_name_prefixed":"r/cryonics","ups":38,"created":1458909687,"link_flair_background_color":"","id":"4bv907","author":{"name":"Adam_133"},"permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/","url":"http://waitbutwhy.com/2016/03/cryonics.html","created_utc":1458880887,"replies":[{"ups":2,"link_id":"t3_4bv907","id":"d1do6ka","author":"mach767","parent_id":"t3_4bv907","subreddit_id":"t5_2r11d","body":"This is an excellent post. Thoroughly researched and some beautifully thought provoking paragraphs. However, there is one area I would like to see included. I get a lot of satisfaction knowing my death will mean another person gets a longer experience of life on this planet through the donation of my undamaged organs. I would like to see a few paragraphs weighing the options of the guarantee of helping someone live longer compared to the slight chance I might live longer. Let me save a few comments by saying this, 'why doesn't the person who needs the organ donation sign up for alcor?' Well, alcor isn't a guarantee, what is a guarantee (understand it is not 100%, but not the point of this comment, assume it is basically a guarantee, which in most cases it is) is that my organ donation will let that person live longer. I would like to see a debate on what point does the likelihood of cryonics being effective (amongst other things) need to be for you to be content in selfishly cryonecally freezing yourself instead of donating yourself?","body_html":"<div class=\"md\"><p> Это отличный пост. Тщательно продуманные и красиво продуманные провокационные абзацы. Однако есть одна область, которую я хотел бы видеть включенной. Я получаю огромное удовлетворение, зная, что моя смерть будет означать, что другой человек получит более длительный опыт жизни на этой планете благодаря пожертвованию моих неповрежденных органов. Я хотел бы видеть несколько параграфов, в которых рассматриваются варианты гарантии того, что кто-то сможет жить дольше, по сравнению с небольшим шансом, что я проживу дольше. Позвольте мне сохранить несколько комментариев, сказав: «Почему человек, нуждающийся в донорстве органов, не подписывается на alcor?» Ну, alcor не является гарантией, что является гарантией (понимаю, что это не 100%, но не смысл этого комментария, предположим, что это в основном гарантия, а в большинстве случаев это так), что пожертвование моего органа позволит этот человек живет дольше. Я хотел бы увидеть дебаты о том, какой должна быть вероятность того, что крионика будет эффективной (помимо прочего), чтобы вы были довольны эгоистичным крионекальным замораживанием себя вместо того, чтобы пожертвовать себя? </p></div>","permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/d1do6ka/","name":"t1_d1do6ka","created":1458981083,"created_utc":1458952283,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_4bv907","replies":[{"ups":1,"link_id":"t3_4bv907","replies":[{"ups":2,"link_id":"t3_4bv907","id":"d27qn5u","author":"bigeyedbunny","parent_id":"t1_d27eqt0","subreddit_id":"t5_2r11d","body":"This is just touching the surface. There are many other improvements that are dearly needed in cryonics, and depend mainly only of scientists and Cryonics organizations ","body_html":"<div class=\"md\"><p> Это просто касание поверхности. Есть много других улучшений, которые крайне необходимы в крионике, и зависят в основном только от ученых и организаций крионики </p></div>","permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/d27qn5u/","name":"t1_d27qn5u","created":1461029096,"created_utc":1461000296,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"d279b61","author":"bigeyedbunny","parent_id":"t1_d272gwz","subreddit_id":"t5_2r11d","body":"Sure. \n\nLobbying the cryonics organizations is essential for improving - it means the difference between a let's say 65% chances of successful revival in the future - versus the current 0.2% chances (at the current very low sad standards used for cryopreservations)\n\nI counted about 10 large problems that they must fix.\n\nThe most obvious one is that brain gets severely damaged even from a stroke that lasts few minutes only. Anyone can look at a brain scan of someone who had no blood supply to the brain even for one minute: many times that part of his brain is dead and gone physically. \n\nIf the cryopreservation is done hours after brain death, there is basically nothing much left to preserve at all.\n\nAnd most cryonics organizations claim they do cryopreservations even days after the death!!! Which is very very useless and obvious dishonest pseudo science, to be honest \n\nBecause noone can recover something that don't exist anymore physically \n\nBrain cells die very fast without oxygen, sadly, because brain cells can't breathe by themselves, they only get oxygen from the bloodflow.\n\nThat's why all those millions of people who die because of stroke, they don't get revived ever, even if the rest of their organs were very healthy and even if the CPR revival is successful and it brings back their heart beating.\n\n","body_html":"<div class=\"md\"><p> Конечно. </p><p> Лоббирование организаций крионики необходимо для улучшения - это означает разницу между, скажем, 65% шансов на успешное возрождение в будущем - по сравнению с нынешними 0,2% (при нынешних очень низких печальных стандартах, используемых для криоконсервации) </p><p> Я насчитал около 10 крупных проблем, которые они должны решить. </p><p> Наиболее очевидным является то, что мозг сильно поврежден даже от инсульта, который длится всего несколько минут. Любой может посмотреть на сканирование мозга человека, у которого не было кровоснабжения мозга хотя бы на одну минуту: много раз эта часть его мозга была мертвой и исчезла физически. </p><p> Если криоконсервация выполняется через несколько часов после смерти мозга, то вообще ничего не остается для сохранения. </p><p> И большинство крионических организаций утверждают, что они делают криоконсервации даже через несколько дней после смерти !!! Что очень, очень бесполезно и очевидно, нечестная псевдонаука, если честно </p><p> Потому что никто не может восстановить то, что больше не существует физически </p><p> К сожалению, клетки мозга умирают очень быстро без кислорода, потому что клетки мозга не могут дышать сами по себе, они получают кислород только из кровотока. </p><p> Вот почему все те миллионы людей, которые умирают от инсульта, никогда не возрождаются, даже если остальные их органы были очень здоровы, и даже если возрождение СЛР прошло успешно, и это заставило их сердце биться. </p></div>","permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/d279b61/","name":"t1_d279b61","created":1460990901,"created_utc":1460962101,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"d1f3uki","author":"bigeyedbunny","parent_id":"t3_4bv907","subreddit_id":"t5_2r11d","body":"And improving cryonics with few simple basic scientific steps, will raise the chances of a future successful revival from 0.02% currently to over 60% chances easily. \n\nThat's what all of us should focus on: improving cryonics. It's easy, we only need to care about this and lobby a little bit every week\n\n","body_html":"<div class=\"md\"><p> А улучшение крионики с помощью нескольких простых базовых научных шагов повысит шансы на успешное возрождение в будущем с 0,02% в настоящее время до более 60% шансов. </p><p> Это то, на чем все мы должны сосредоточиться: улучшение крионики. Это просто, нам нужно всего лишь заботиться об этом и еженедельно лоббировать </p></div>","permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/d1f3uki/","name":"t1_d1f3uki","created":1459101206,"created_utc":1459072406,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_4bv907","id":"d1vpfl2","author":"[deleted]","parent_id":"t3_4bv907","subreddit_id":"t5_2r11d","body":"A truly excellent post, engaging and eye opening. In reply to mach767, I too would like to see a debate regarding organ donation and the \"selfishness\" of cryonics - and neuro vs whole body cryopreservation. Personally, if possible, I would very much like to \"live on\" via my donated organs that might possibly save someone's life, so I'm opting for neuropreservation.  ","body_html":"<div class=\"md\"><p> Действительно отличный пост, привлекательный и сенсационный. В ответ на mach767 я также хотел бы увидеть дебаты относительно донорства органов и «эгоизма» крионики - и нейро-криоконсервации всего тела. Лично, если это возможно, я бы очень хотел «жить» через мои пожертвованные органы, которые могли бы спасти чью-то жизнь, поэтому я выбираю нейропреохранение. </p></div>","permalink":"/r/cryonics/comments/4bv907/why_cryonics_makes_sense_wait_but_why/d1vpfl2/","name":"t1_d1vpfl2","created":1460194643,"created_utc":1460165843,"subreddit_name_prefixed":"r/cryonics","depth":0}]}