{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Я читаю [архив отчетов о делах CI на их веб-сайте.] <Span translate = \"no\"> (https://www.cryonics.org/case-reports/) </ span> Как правило, во всех отчетах упоминается прошедшее время до прибытия пациента в институт КИ (сколько времени требуется пациенту, чтобы прибыть в институт после смерти).\n\n\n\nМногие из прошедших времен кажутся мне неразумными. ** Некоторые приходят в институт через несколько дней после смерти, несколько недель. ** Долгосрочное повреждение головного мозга происходит через 15 минут после смерти при комнатной температуре, и кажется, что в некоторых сообщениях у пациентов происходило серьезное повреждение мозга, если не полная информационная энтропия ,\n\n\n\nДва примера, которые полярно противоположны по скорости процесса:\n\n* Пациент 162 прибыл в институт ** через 10 недель ** после смерти, и это не говорит конкретно, но из того, что написано, я бы предположил, что потребовалось много часов, прежде чем пациента положили на лед, если не дней. Это связано с тем, что родственники связались с институтом после смерти, и я думаю, что для телефонного звонка требуется как минимум 1 час, а для покупки сухого льда - много, если не дней. Я верю в науку и научные аномалии, но я не верю в чудеса. Я не думаю, что у этого пациента есть шанс на выздоровление.\n\n\n\n* Пациент 141 прибыл через 5 часов после смерти. Резервная бригада была готова поставить их на лед, поэтому процесс охлаждения начался немедленно. Пациент 145 прибыл через 2 часа после смерти.\n\n\n\nЯ думаю, что случай с Джастином Смитом (в 2015 году реанимированный после смерти в течение 10 часов при -4 \\ * C) является единственным критерием, который существует для того, как долго люди должны находиться на льду до остекления. Так что, возможно, можно с уверенностью сказать, что 10 часов - это разумное количество времени, чтобы быть на льду до консервации. В этом случае, я думаю, что пациент 141 и многие другие, кто прибег к транспортной работе менее чем за 10 часов, вероятно, проснутся через несколько сотен лет.\n\n\n\nДля некоторых крионика имеет репутацию лженауки. Для таких пациентов, как пациент 141, вам необходим процесс отменного витрификации, более совершенные системы жизнеобеспечения и быстрое излечение от болезни, от которой они умерли, - ни один из этих звуков для меня не является псевдонаучным. Для таких пациентов, как пациент 162, вам понадобятся все упомянутые ранее, но также наноботы и квантовый компьютер, который может смотреть на распавшиеся нейронные контуры и пытаться предсказать их исходное состояние до энтропии, и наноботы переводят нейроны в предсказанное. прошлое состояние, и добавить клеточные компоненты ко всем мертвым нейронам. В какой момент, если это возможно даже через несколько миллионов лет, сформировалось ли новое сознание, отличающееся от того, которое умерло из-за быстрых неконсервативных / постепенных изменений? Для меня это звучит как лженаука.\n\n\n\nКажется, существует высокая корреляция между тем, является ли пациент членом КИ и истекшим временем до прибытия. Обычно члены CI имеют более короткое время прибытия, но это не всегда так. Я думаю, это показывает, что планирование является ключом к сокращению времени прибытия. Я где-то читал, что не члены CI (поздние случаи) должны быть одобрены советом CI, и если мозг вскрыт, то они не принимают его. ** Это заставляет меня задаться вопросом, почему они принимают поздние случаи, когда тело лежит на льду в течение нескольких недель, или оно часами не идет на лед. Возможно, через миллион лет такая технология воскрешения восстановит мозг, который не был охлажден в течение часа, поэтому имеет смысл сохранить тела на всякий случай, но я чувствую, что это добавляет репутации крионики как лженауки. **\n\n\n\nМои другие мысли:\n\nЕсли бы я был членом КИ, мой последний час в больнице был бы для меня, если бы я лопатил себя по льду, как ребенок, закапывающий себя в песок на пляже. Я был бы в Мичиганской больнице, желательно ближе всего к CI. Если нет, дом по соседству с доктором, готовым объявить меня мертвым (конечно, это, вероятно, не законно). ** Вероятно, лучший способ умереть от крионики до переохлаждения **, так что температура вашего тела уже понижается в момент вашей смерти.\n\n\n\n","title":"Озабоченность после прочтения архивов отчетов о случаях Института крионики","subreddit_name_prefixed":"r/cryonics","ups":11,"created":1547525929,"link_flair_background_color":"","id":"afzvp1","author":{"name":"Snowybluesky"},"permalink":"/r/cryonics/comments/afzvp1/concerns_after_reading_through_cryonics_institute/","url":"https://www.reddit.com/r/cryonics/comments/afzvp1/concerns_after_reading_through_cryonics_institute/","created_utc":1547497129}