{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Я слышал, что это случилось с моим другом Джерри Сирси, давним активистом крионики и волонтером Alcor, который умер во сне за выходные.\n\nПока во второй раз в этом году крионисты, работавшие в Alcor, умерли без присмотра и получили, вероятно, бесполезные криоконсервации после перенесенной чрезмерной ишемии головного мозга.\n\nДругими словами, жизнь рядом с Alcor и даже развитие отношений с людьми, которые там работают сами по себе, не обязательно обеспечивают защиту от плохой криоконсервации.\n\nЭто может случиться с любым из нас, в том числе с крионистами, которые просто падают на улицу на виду у других людей, таких как Лоуренс Пилгерам и Марвин Мински.\n\nИ это подчеркивает *** неотложность *** разработки эффективного медицинского устройства для крионистов, которое может немедленно уведомить своих поставщиков крионических услуг, когда они приступают к остановке сердца.","title":"Другой крионист умирает незамеченным и получает, вероятно, бесполезную криоконсервацию","subreddit_name_prefixed":"r/cryonics","ups":26,"created":1553558922,"link_flair_background_color":"","id":"b5ck4z","author":{"name":"advancedatheist"},"permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/","url":"https://www.reddit.com/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/","created_utc":1553530122,"replies":[{"ups":8,"link_id":"t3_b5ck4z","replies":[{"ups":5,"link_id":"t3_b5ck4z","id":"ejgacln","author":"Michael-G-Darwin","parent_id":"t1_ejex0lg","subreddit_id":"t5_2r11d","body":"This is not an acceptable (safe, reliable) solution. Sudden Cardiac Arrest Detection Systems (SCADS) must be highly reliable, very easy to use and plug and play. The primary target population is people 60 and over. In this age group compliance drops off sharply with the complexity of the SCADS. So too does the ability to use any but the most seamless system. On average, elderly people (65+) have severely compromised raw cognitive processing power as a result of \"normal\" brain aging. This makes it difficult for them to master even simple new technologies, such as automatic teller machines, the nuances of personal computers, smart phones and the like. This is why the Jitterbug mobile phone has been such a huge success. \n\n&#x200B;\n\nThe problem of SCA among cryonicists is *not* one affecting young, tech savvy individuals (though given the rapidly rising rate of coronary artery disease in this demographic it may well soon be). Rather, it is a problem that primarily affects older and/or chronically ill individuals who have very limited energy, cognitive impairment and often behavioral resistance to all but the simplest to use and most reliable technologies.\n\n&#x200B;\n\nIn the case of Jerry Searcy, and of a number of other cryonicists who have experienced prolonged, undetected SCA, they lived in a household with other individuals. In such cases, an off-the-shelf baby apnea-no motion detection monitor would almost certainly be effective. These devices have undergone countless man-years of testing and have been shown to be reliable under diverse, real-world conditions. For cryonicists at risk who live with another person these off the shelf and easy to use devices represent a huge improvement over nothing at all. \n\n&#x200B;\n\nIt is also the case that if *ad hoc* SCADS fail due to hardware or software problems the individual or organization offering them may well be sued. While it is the case that since cryonics has no standards, no best practices and no \"standards of care\", as soon as someone begins marketing or supplying a technology with well defined performance parameters they expose themselves to litigation. Litigation which, I might add, is very likely to be successful.\n\n&#x200B;\n\nIn short, complicated, ad hoc and un-validated solutions to this problem should be avoided.","body_html":"<div class=\"md\"><p> Это не приемлемое (безопасное, надежное) решение. Системы обнаружения внезапной остановки сердца (SCADS) должны быть очень надежными, очень простыми в использовании и подключаться и играть. Основная целевая группа населения - люди старше 60 лет. В этой возрастной группе соблюдение резко падает со сложностью SCADS. Так же как и способность использовать любую, кроме самой цельной системы. В среднем, пожилые люди (65+) сильно «скомпрометировали» когнитивную вычислительную мощность в результате «нормального» старения мозга. Это мешает им освоить даже простые новые технологии, такие как банкоматы, нюансы персональных компьютеров, смартфонов и тому подобное. Вот почему мобильный телефон Jitterbug пользуется таким огромным успехом. </p><p> </p><p> Проблема SCA среди крионистов - <em>не</em> та, которая затрагивает молодых, технически подкованных людей (хотя, учитывая быстро растущий уровень заболеваемости коронарной артерией в этой демографической ситуации, это вполне может быть вскоре). Скорее, это проблема, которая в первую очередь затрагивает пожилых и / или хронически больных людей, которые имеют очень ограниченную энергию, когнитивные нарушения и часто поведенческую устойчивость ко всем, кроме самых простых в использовании и наиболее надежных технологий. </p><p> </p><p> В случае с Джерри Сирси и рядом других крионистов, которые перенесли длительную, необнаруженную SCA, они жили в домашнем хозяйстве с другими людьми. В таких случаях готовый монитор детского апноэ без движения почти наверняка будет эффективен. Эти устройства прошли бесчисленные испытания в течение нескольких человеко-лет, и было доказано, что они надежны в различных реальных условиях. Для крионистов из группы риска, которые живут с другим человеком, эти готовые к использованию устройства и простые в использовании устройства представляют собой огромное улучшение, а вовсе ничего. </p><p> </p><p> Это также тот случай, когда в случае сбоя <em>специальных</em> SCADS из-за проблем с аппаратным или программным обеспечением на человека или организацию, предлагающую их, вполне может быть предъявлен иск. Хотя в крионике нет стандартов, нет лучших практик и нет «стандартов заботы», как только кто-то начинает продавать или поставлять технологию с четко определенными параметрами производительности, он подвергается судебному разбирательству. Судебный процесс, который, я мог бы добавить, весьма вероятно, будет успешным. </p><p> </p><p> Короче говоря, следует избегать сложных, специальных и неподтвержденных решений этой проблемы. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejgacln/","name":"t1_ejgacln","created":1553667233,"created_utc":1553638433,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ejelzb5","author":"Michael-G-Darwin","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"The problem of prolonged, undetected Sudden Cardiac Arrest (SCA) in cryonicists is not going to be solved by wearable detection devices any time in the foreseeable future. While such devices represent the ideal in SCA detection, achieving a robust, convenient and highly reliable wearable device will takes years to develop, validate and market. It will also not be an inexpensive undertaking. This also presumes that regulatory constraints can be sidestepped by marketing the device as a death detector rather than as a medical device. And BTW, in every jurisdiction that I’m aware of it is not permitted to have such devices directly notify the emergency medical system (EMS). Such alarms must first be vetted through a private service that employs humans to screen the alarm call and then relay it to the EMS. The sooner that cryonicists realize this the better.\n\nSeventeen percent of all SCAs occur during sleep and another ~5% occur while the patient is in bed, but not sleeping.  Thus, approximately 22% of SCAs occur in bed. There have been highly reliable movement –apnea detectors at a low cost ($150 to $200) for at least 20 years. These devices work by monitoring macro and micro-movements from under the mattress in an infant’s crib. I have evaluated two of these, the Babysense and the Angelcare monitors:https://www.amazon.com/New-Babysense-Under-Mattress-Non-Contact/dp/B075XQHMVT/ref=pd_sbs_75_2/164-3738737-9895019?_encoding=UTF8&pd_rd_i=B075XQHMVT&pd_rd_r=03c1750d-4f87-11e9-9988-a90d46ea6b0d&pd_rd_w=8EW51&pd_rd_wg=u3xHq&pf_rd_p=588939de-d3f8-42f1-a3d8-d556eae5797d&pf_rd_r=P7A5D91CFYAX6KR5KWRJ&psc=1&refRID=P7A5D91CFYAX6KR5KWRJ\n\nhttps://www.amazon.com/Angelcare-AC115-Audio-Movement-Monitor/dp/B078SN38F7/ref=sr_1_5?crid=3ME9LU6D0YOID&keywords=angelcare+monitor&qid=1553580550&s=baby-products&sprefix=angelcare%2Cbaby-products%2C196&sr=1-5\n\nThe New Babysense 7 has two detection pads and I have found this unit to be more the reliable of the two for adult use. These monitors do not work well through adult thickness mattresses, but work very well when either inserted under the quilted top tufting of a conventional mattress (this requires cutting into the side-top of the mattress), or when interposed between an egg-crate mattress topper and a conventional mattress. Both of these devices alarm loudly, however they do not connect to an auto-dialer or other remote notification device. Sophisticated, layman programmable auto-dialers are turnkey equipment:  http://www.racoman.com/cellularm.html Engineering monitors like the Babysense or Angelcare to interface with a programmable auto-telephone dialer would be a piece of cake compared to engineering a reliable wearable device. And yet, in the 20+ years I've been harping on this issue, no one has shown the slightest interest in doing this. \n\nIn fact, conventional, off the shelf alarm equipment has the capability of reliably and conveniently detecting 88% of all SCAs in cryonics patients. How is this possible? Well, first of all, of the  383,000 out-of-hospital sudden cardiac arrests that occur annually 88 percent occur at home. Most people spend <90% of their sitting time at home in the same 3 chairs and thus it is possible to instrument these chairs to detect apnea-lack of motion. When the person sits on the chair the sensor is activated and when they get up it is turned off. So, what about the rest of the time the person is in his home but is not monitored by a non-contact motion sensing pad? The answer to that is that conventional motion sensing equipment used in intrusion alarms is be able to detect that the person has *stopped* moving. While these sensors will require comparatively long lag times to detection, on the order of 15 minutes to an hour, they would still be vastly superior to no detection for many hours, or even for days, which is so often the case when people experience SCA alone at home. The only significant caveat here is that individuals with dogs, cats or other free roaming companion animals will be unlikely to be able to use whole-house lack of motion detection. \n\nTo be clear, what I am saying here is that conventional, off the shelf and highly reliable intrusion alarm and infant apnea monitoring technology will do the job of detecting SCA in cryonicists with a delay to notification on the order of 25 seconds to 60 minutes. Only the most basic engineering would be required to implement such a system and it will be effective at detecting and reporting close to 90% of all SCAs. Put another way, this is clearly a case where the best is the enemy of the good. If I had the minimal electronics skills required to implement such a system I would have done it myself long ago.\n\nIt also bears pointing out that most cellular mobile emergency alert systems that are worn as bracelets or pendants contain accelerometer triggered alarms which detect falls: https://www.consumerreports.org/medical-alert-systems/how-to-choose-a-medical-alert-system/  This capability might well fill the gap between bed and chair detectors, and motion sensors to detect the absence of ambulation. Approximately 70% of SCAs occur during light activity in the home, or on the toilet. Fall detection sensors in emergency medical alert devices should thus capture most of these SCAs, since people who are standing or walking when they experience an SCA will necessarily fall to the floor most of the time. Thus, just these two alarm modalities; sensors for the bed and chairs and a commercial medical alert cellular device should detect the majority of at-home SCAs, even in the absence of no-motion detectors in every room of the home. Once again, pursuit of the best may defeat the realization of the good, with many cryonicists experiencing prolonged and unnecessary delays to treatment.\n\nSuch an alarm system will not be useful for emergency medical notification because the elapsed time between cardiac arrest and definitive emergency medical intervention will be too long in the vast majority of cases. Even if the EMS were immediately notified that cardiac arrest had occurred the chances that they would arrive in time and gain access to a person living alone are nearly nil. What's more, the chances of a person surviving a cardiac arrest after 6 or more minutes without definitive medical intervention are negligible and in fact, success in restoring spontaneous circulation in such situations almost always results in failed brain resuscitation and exposure of the patient to prolonged periods of mechanical ventilation until brain death can be determined, or the durable power of attorney for health care (DPAHC) can be located and implemented. Thus, FDA regulatory constraints would not apply. One last point: over 90% of the people who experience SCA will have extensive coronary calcification. This calcification is easily, inexpensively and non-invasively detectable by a \"coronary calcium scan\". In the past, this test involved substantial radiation exposure. Today, at centers with state of the art equipment, radiation exposure has decreased markedly. Certainly for cryonicists who are age 60 or over this test should be a must. Coronary calcium scores over 100 are highly correlated with SCA and scores of 500 or greater are virtually prognostic of SCA unless the patient dies of something else first. If you find you have a high coronary calcium score you have a number of options not otherwise open to you:\n\n1) You can pursue further testing and, if appropriate, undergo coronary revascularization in order reduce or prevent SCA. You can also have your carotid arteries examined by ultrasound to determine if you are at risk for an embolic stroke and if you are, to begin treatment with prophylactic medication or undergo a carotid endarterectomy, as appropriate.\n\n2) You can begin medical (drug) and lifestyle changes to prevent further coronary atherosclerosis or, in some cases, to reverse it.\n\n3) You can acquire and use an SCA detection and alarm system. Even a conventional cellular emergency medical device with a fall detector would be a big improvement over nothing at all. \n\n4) You can document your high risk of SCA and the presence of coronary artery disease and insure that this information is immediately available to your CSO, your next of kin and your DPAHC for immediate transmission to the Coroner or Medical Examiner.  A documented history of heart disease often means the difference between an autopsy or no autopsy. \n\n5) You can relocate closer to your CSO.The next time a cryonicist experiences SCA under conditions like those experienced by Jerry Searcy or Lisa Shock, you should know that this did not happen because of the absence of some super-sophisticated, or otherwise non-available technology. The technology currently exists and is easily affordable and is very capable of detecting most SCAs in cryonics. If it isn't used it will be due to laziness, stupidity, negligence, or a combination of all three. Please think about that.\n\nAnd one more thing, the fact that you didn't get this information from your CSO should speak volumes.I have reviewed the problem of SCA in cryonics and proposed these and other solutions at least as long ago as 7 years. That 5 part series of articles can be accessed here:  http://chronopause.com/chronopause.com/index.php/2012/04/02/much-less-than-half-a-chance-part-1/index.html \n\nMike Darwin","body_html":"<div class=\"md\"><p> Проблема длительного, необнаруженного внезапного останова сердца (SCA) у крионистов не будет решена с помощью носимых устройств обнаружения в обозримом будущем. Хотя такие устройства представляют идеал в обнаружении SCA, для создания надежного, удобного и высоконадежного носимого устройства потребуются годы на разработку, проверку и продажу. Это также не будет недорогим мероприятием. Это также предполагает, что нормативные ограничения можно обойти, продавая устройство как детектор смерти, а не как медицинское устройство. И кстати, во всех юрисдикциях, о которых мне известно, запрещается, чтобы такие устройства непосредственно уведомляли систему неотложной медицинской помощи (EMS). Такие аварийные сигналы должны сначала проверяться частной службой, которая использует людей для проверки аварийного вызова, а затем передает его в EMS. Чем скорее крионисты поймут это, тем лучше. </p><p> Семнадцать процентов всех SCA происходят во время сна, и еще ~ 5% происходят, когда пациент находится в постели, но не спит. Таким образом, примерно 22% SCA происходят в постели. В течение как минимум 20 лет существовали высоконадежные детекторы движения для лечения апноэ по низкой цене (от 150 до 200 долларов). Эти устройства работают, контролируя макро и микроподвижности из-под матраса в детской кроватке. Я оценил два из них, мониторы Babysense и Angelcare: <a href=\"https://www.amazon.com/New-Babysense-Under-Mattress-Non-Contact/dp/B075XQHMVT/ref=pd_sbs_75_2/164-3738737-9895019?_encoding=UTF8&amp;pd_rd_i=B075XQHMVT&amp;pd_rd_r=03c1750d-4f87-11e9-9988-a90d46ea6b0d&amp;pd_rd_w=8EW51&amp;pd_rd_wg=u3xHq&amp;pf_rd_p=588939de-d3f8-42f1-a3d8-d556eae5797d&amp;pf_rd_r=P7A5D91CFYAX6KR5KWRJ&amp;psc=1&amp;refRID=P7A5D91CFYAX6KR5KWRJ\">https://www.amazon.com/New-Babysense-Under-Mattress-Non-Contact/dp/B075XQHMVT/ref=pd_sbs_75_2/164-3738737-9895019? _encoding = UTF</a> - <a href=\"https://www.amazon.com/New-Babysense-Under-Mattress-Non-Contact/dp/B075XQHMVT/ref=pd_sbs_75_2/164-3738737-9895019?_encoding=UTF8&amp;pd_rd_i=B075XQHMVT&amp;pd_rd_r=03c1750d-4f87-11e9-9988-a90d46ea6b0d&amp;pd_rd_w=8EW51&amp;pd_rd_wg=u3xHq&amp;pf_rd_p=588939de-d3f8-42f1-a3d8-d556eae5797d&amp;pf_rd_r=P7A5D91CFYAX6KR5KWRJ&amp;psc=1&amp;refRID=P7A5D91CFYAX6KR5KWRJ\">8 &amp; pd_rd_i = B075XQHMVT &amp; pd_rd_r = 03c1750d-4f87-11e9-9988-a90d46ea6b0d &amp; pd_rd_w = 8EW51 &amp; pd_rd_wg = u3xHq &amp; pf_rd_p = 588939de-d3f8-42f1-a3d8-d556eae5797d &amp; pf_rd_r = P7A5D91CFYAX6KR5KWRJ &amp; PSC = 1 &amp; refRID = P7A5D91CFYAX6KR5KWRJ</a> </p><p> <a href=\"https://www.amazon.com/Angelcare-AC115-Audio-Movement-Monitor/dp/B078SN38F7/ref=sr_1_5?crid=3ME9LU6D0YOID&amp;keywords=angelcare+monitor&amp;qid=1553580550&amp;s=baby-products&amp;sprefix=angelcare%2Cbaby-products%2C196&amp;sr=1-5\">https://www.amazon.com/Angelcare-AC115-Audio-Movement-Monitor/dp/B078SN38F7/ref=sr_1_5?crid=3ME9LU6D0YOID&amp;keywords=angelcare+monitor&amp;qid=1553580550&amp;s=baby-products&amp;sprefix=angelcare%2Cbaby-products%2C196&amp;sr= 1-5</a> </p><p> New Babysense 7 имеет две сенсорные панели, и я обнаружил, что это устройство более надежно для использования взрослыми. Эти мониторы плохо работают с матрасами для взрослых, но работают очень хорошо, когда их вставляют под стеганую верхнюю часть обычного матраса (для этого требуется разрезание боковой поверхности матраса) или когда они помещаются между матрацем с ящиком для яиц Топпер и обычный матрас. Оба эти устройства громко сигнализируют, однако они не подключаются к авто-номеронабирателю или другому устройству удаленного оповещения. Сложные программируемые автонабиратели, предназначенные для непрофессионалов, представляют собой оборудование под ключ: <a href=\"http://www.racoman.com/cellularm.html\">http://www.racoman.com/cellularm.html</a> Инженерные мониторы, такие как Babysense или Angelcare, для взаимодействия с программируемой автонаборной телефонной связью - это просто надежное носимое устройство. И все же, за 20 с лишним лет, которые я занимался этим вопросом, никто не проявил ни малейшего интереса к этому. </p><p> Фактически, обычное, готовое к использованию оборудование для сигнализации имеет возможность надежного и удобного обнаружения 88% всех SCA у пациентов с крионикой. Как это возможно? Ну, во-первых, из 383 000 внезапных остановок сердца вне больницы, которые происходят ежегодно, 88% происходят дома. Большинство людей проводят менее 90% времени сидя дома на тех же 3 стульях, и, таким образом, можно оборудовать эти стулья, чтобы обнаружить отсутствие движения при апноэ. Когда человек сидит на стуле, датчик активируется, а когда он встает, он выключается. Итак, что в остальное время человек находится в своем доме, но не контролируется бесконтактной сенсорной панелью движения? Ответ на этот вопрос заключается в том, что обычное оборудование для обнаружения движения, используемое для сигнализации вторжения, способно обнаружить, что человек <em>прекратил</em> движение. Хотя этим датчикам потребуется сравнительно большое время задержки для обнаружения, порядка от 15 минут до часа, они все равно будут значительно превосходить отсутствие обнаружения в течение многих часов или даже дней, что так часто случается, когда люди испытывают SCA. один дома. Единственным существенным предупреждением здесь является то, что люди с собаками, кошками или другими бесплатными роуминг-компаньонами вряд ли смогут использовать отсутствие обнаружения движения во всем доме. </p><p> Чтобы было ясно, я говорю здесь о том, что обычная, готовая к использованию и высоконадежная технология оповещения о вторжении и мониторинга апноэ у младенцев будет выполнять функцию обнаружения SCA у крионистов с задержкой до уведомлений порядка от 25 секунд до 60 минут. Для реализации такой системы потребуется только самый базовый инжиниринг, и он будет эффективен при обнаружении и составлении отчетов о почти 90% всех SCA. Иными словами, это тот случай, когда лучшее - враг хорошего. Если бы у меня были минимальные навыки работы с электроникой, необходимые для реализации такой системы, я бы сделал это сам давно. </p><p> Следует также отметить, что большинство сотовых мобильных систем экстренного оповещения, которые носят браслеты или подвески, содержат сигналы тревоги, запускаемые акселерометром, которые обнаруживают падения: <a href=\"https://www.consumerreports.org/medical-alert-systems/how-to-choose-a-medical-alert-system/\">https://www.consumerreports.org/medical-alert-systems/how-to-choose-a -medical-alert-system /</a> Эта возможность вполне может заполнить пробел между детекторами кровати и кресла и датчиками движения, чтобы обнаружить отсутствие движения. Примерно 70% SCA происходят во время легкой активности в доме или в туалете. Таким образом, датчики обнаружения падения в устройствах экстренного медицинского оповещения должны регистрировать большинство этих SCA, поскольку люди, которые стоят или ходят, когда они сталкиваются с SCA, в большинстве случаев обязательно упадут на пол. Таким образом, только эти две модальности тревоги; датчики для кровати и стульев и коммерческое медицинское сотовое устройство должны обнаруживать большинство домашних SCA, даже при отсутствии детекторов отсутствия движения в каждой комнате дома. И снова стремление к лучшему может нанести ущерб реализации добра, поскольку многие крионисты испытывают длительные и ненужные задержки с лечением. </p><p> Такая система сигнализации не будет полезна для экстренного медицинского уведомления, потому что прошедшее время между остановкой сердца и окончательным экстренным медицинским вмешательством будет слишком продолжительным в подавляющем большинстве случаев. Даже если EMS немедленно уведомят о том, что произошла остановка сердца, шансы на то, что они прибудут вовремя и получат доступ к человеку, живущему в одиночестве, почти равны нулю. Более того, шансы на то, что человек переживет остановку сердца через 6 и более минут без определенного медицинского вмешательства, ничтожны, и на самом деле успех в восстановлении спонтанного кровообращения в таких ситуациях почти всегда приводит к неудачной реанимации головного мозга и длительному воздействию на пациента. механической вентиляции, пока не будет определена смерть мозга, или может быть найдена и реализована долгосрочная доверенность на здравоохранение (DPAHC). Таким образом, нормативные ограничения FDA не будут применяться. И последний момент: более 90% людей, которые испытывают SCA, будут иметь обширную коронарную кальцификацию. Эта кальцификация легко, недорого и неинвазивно обнаруживается с помощью «сканирования коронарного кальция». В прошлом этот тест включал значительное облучение. Сегодня в центрах с современным оборудованием радиационное облучение заметно снизилось. Конечно, для крионистов старше 60 лет этот тест должен быть обязательным. Показатели кальция в коронарной артерии выше 100 в высокой степени коррелируют с SCA, а показатели 500 или выше фактически прогнозируют SCA, если пациент сначала не умрет от чего-то еще. Если вы обнаружите, что у вас высокий показатель коронарного кальция, у вас есть несколько вариантов, которые вам не доступны: </p><p> 1) Вы можете продолжить дальнейшее тестирование и, при необходимости, пройти коронарную реваскуляризацию, чтобы уменьшить или предотвратить SCA. Вы также можете обследовать сонные артерии с помощью ультразвука, чтобы определить, есть ли у вас риск развития эмболического инсульта и, если да, начать лечение с профилактического лечения или провести каротидную эндартерэктомию, в зависимости от ситуации. </p><p> 2) Вы можете начать медицинские (лекарственные) и изменения образа жизни, чтобы предотвратить дальнейший коронарный атеросклероз или, в некоторых случаях, обратить его вспять. </p><p> 3) Вы можете приобрести и использовать систему обнаружения и сигнализации SCA. Даже обычное сотовое устройство скорой медицинской помощи с детектором падения было бы большим улучшением вообще. </p><p> 4) Вы можете задокументировать свой высокий риск SCA и наличие заболевания коронарной артерии и обеспечить немедленную доступность этой информации для вашей CSO, ваших ближайших родственников и вашего DPAHC для немедленной передачи коронеру или медицинскому эксперту. Документированная история болезни сердца часто означает разницу между вскрытием или отсутствием вскрытия. </p><p> 5) Вы можете переместиться ближе к своему ОГО. В следующий раз, когда крионист испытывает SCA в условиях, подобных тем, которые испытывали Джерри Сирси или Лиза Шок, вы должны знать, что этого не произошло из-за отсутствия какого-то сверхсложного или иным образом -доступная технология. Технология в настоящее время существует и легко доступна, и она способна обнаруживать большинство SCA в крионике. Если он не используется, это будет из-за лени, глупости, небрежности или комбинации всех трех. Пожалуйста, подумайте об этом. </p><p> И еще одна вещь, тот факт, что вы не получили эту информацию от своего ОГО, должен говорить о многом. Я рассмотрел проблему SCA в крионике и предложил эти и другие решения по крайней мере еще 7 лет. С этой серией статей из 5 частей можно ознакомиться здесь: <a href=\"http://chronopause.com/chronopause.com/index.php/2012/04/02/much-less-than-half-a-chance-part-1/index.html\">http://chronopause.com/chronopause.com/index.php/2012/04/02/much-less-than-half-a-chance-part-1/index .html</a> </p><p> Майк Дарвин </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejelzb5/","name":"t1_ejelzb5","created":1553621220,"created_utc":1553592420,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":6,"link_id":"t3_b5ck4z","replies":[{"ups":1,"link_id":"t3_b5ck4z","id":"ejf1edl","author":"zynthalay","parent_id":"t1_ejevitb","subreddit_id":"t5_2r11d","body":"How can I get in touch with them?","body_html":"<div class=\"md\"><p> Как я могу связаться с ними? </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejf1edl/","name":"t1_ejf1edl","created":1553637876,"created_utc":1553609076,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ejcrg43","author":"zynthalay","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"> And this underscores the urgency of developing an effective medical wearable for cryonicists which can notify their cryonics service providers immediately when they go into cardiac arrest.\n\nIs anybody working on this?\n\nIt seems like a smartwatch app should be able to do this?  Obviously you need to tell the program when you take the watch off but if your vital signs stop it should be able to make your phone yell for help.\n","body_html":"<div class=\"md\"><blockquote><p> И это подчеркивает настоятельную необходимость разработки эффективных медицинских принадлежностей для крионистов, которые могут немедленно уведомить своих поставщиков крионических услуг, когда они приступают к остановке сердца. </p></blockquote><p> Кто-нибудь работает над этим? </p><p> Похоже, приложение SmartWatch должно быть в состоянии сделать это? Очевидно, что вы должны сообщить программе, когда вы снимаете часы, но если ваши жизненно важные показатели прекратятся, он сможет заставить ваш телефон кричать о помощи. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejcrg43/","name":"t1_ejcrg43","created":1553565111,"created_utc":1553536311,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":5,"link_id":"t3_b5ck4z","id":"ejciwju","author":"eleitl","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"Sorry for your loss. \n\nI wish this was the exception, rather than the rule.","body_html":"<div class=\"md\"><p> Сожалею о вашей утрате. </p><p> Я бы хотел, чтобы это было скорее исключением, чем правилом. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejciwju/","name":"t1_ejciwju","created":1553559585,"created_utc":1553530785,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":4,"link_id":"t3_b5ck4z","id":"ejci72j","author":"MaximilianKohler","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"Why wasn't he using the CI check-in app? I know it's not ideal, and if you die in your sleep it could still take many hours to alert someone, but it's better than nothing. ","body_html":"<div class=\"md\"><p> Почему он не использовал приложение для регистрации CI? Я знаю, что это не идеально, и если ты умрешь во сне, это может занять много часов, чтобы предупредить кого-то, но это лучше, чем ничего. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejci72j/","name":"t1_ejci72j","created":1553559112,"created_utc":1553530312,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_b5ck4z","id":"ejci665","author":"BetterResurrection","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"this is why i got married (in part).\n\nyou have to have someone close to you around you at all times.\ndamn, jerry searcy, after all the work he did for alcor. Aint right.","body_html":"<div class=\"md\"><p> Вот почему я женился (частично). </p><p> Вы должны всегда иметь кого-то рядом с собой. черт, Джерри Сирки, после всей работы, которую он сделал для Алкора. Не верно. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejci665/","name":"t1_ejci665","created":1553559095,"created_utc":1553530295,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_b5ck4z","id":"ejciek6","author":"BetterResurrection","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"who was the other person who worked and died unattended?","body_html":"<div class=\"md\"><p> Кто был другим человеком, который работал и умер без присмотра? </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejciek6/","name":"t1_ejciek6","created":1553559252,"created_utc":1553530452,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_b5ck4z","id":"ejd1n0z","author":"ARD227","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"https://www.medicalguardian.com/freedom\n","body_html":"<div class=\"md\"><p> <a href=\"https://www.medicalguardian.com/freedom\">https://www.medicalguardian.com/freedom</a> </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejd1n0z/","name":"t1_ejd1n0z","created":1553571833,"created_utc":1553543033,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_b5ck4z","id":"ejcibo2","author":"BetterResurrection","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"how long was the delay?","body_html":"<div class=\"md\"><p> как долго была задержка? </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejcibo2/","name":"t1_ejcibo2","created":1553559198,"created_utc":1553530398,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_b5ck4z","id":"ejcy1ur","author":"JoelMahon","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"> And this underscores the urgency of developing an effective medical wearable for cryonicists which can notify their cryonics service providers immediately when they go into cardiac arrest. \n\nDon't they exist? I mean seriously?","body_html":"<div class=\"md\"><blockquote><p> И это подчеркивает настоятельную необходимость разработки эффективных медицинских принадлежностей для крионистов, которые могут немедленно уведомить своих поставщиков крионических услуг, когда они приступают к остановке сердца. </p></blockquote><p> Разве они не существуют? Я имею в виду серьезно? </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejcy1ur/","name":"t1_ejcy1ur","created":1553569551,"created_utc":1553540751,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_b5ck4z","replies":[{"ups":1,"link_id":"t3_b5ck4z","id":"ejiqpo6","author":"BinaryAlgorithm","parent_id":"t1_ejh15qd","subreddit_id":"t5_2r11d","body":"Thanks for that detailed info! Yes, it seems *possible*, but not medically feasible for most. I am not a biohacker so I await further developments.","body_html":"<div class=\"md\"><p> Спасибо за эту подробную информацию! Да, это кажется <em>возможным</em> , но с медицинской точки зрения неосуществимым для большинства. Я не биохакер, поэтому я жду дальнейшего развития событий. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejiqpo6/","name":"t1_ejiqpo6","created":1553746437,"created_utc":1553717637,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ejfc1o2","author":"BinaryAlgorithm","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"Honestly as I get older I would totally be fine with getting a monitoring implant. I think the convenience factor of wearables is overrated. If you are serious enough to setup cryo, then I'd think you would also be serious enough to get a minor surgery to install a device. At the same time, I'm not sure if it's been developed specifically for this purpose. You need wireless monitoring and the infrastructure to make the sequence of events that needs to happen, happen. You need first responders notified that in the event you cannot be brought back, you need for example a heart/lung device used to maintain oxygenation to the brain, and so forth.","body_html":"<div class=\"md\"><p> Честно говоря, когда я стану старше, у меня будет все в порядке с имплантацией для мониторинга. Я думаю, что фактор удобства носимых устройств переоценен. Если вы достаточно серьезны, чтобы настроить крио, то я думаю, вы также будете достаточно серьезны, чтобы сделать небольшую операцию по установке устройства. В то же время я не уверен, был ли он разработан специально для этой цели. Вам необходим беспроводной мониторинг и инфраструктура, чтобы обеспечить последовательность событий, которые должны произойти. Вам необходимо, чтобы первые респонденты уведомили вас о том, что в случае, если вас не могут вернуть обратно, вам необходимо, например, устройство сердца / легких, используемое для поддержания оксигенации мозга, и так далее. </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ejfc1o2/","name":"t1_ejfc1o2","created":1553645107,"created_utc":1553616307,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_b5ck4z","id":"ekesfk4","author":"goodpoll","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"Can't Apple watch be used as such a wearable device already? I do not have one, but AFAIK, it takes pulse and body temperature readings. So a simple app should be able to detect the moment of your heart stopping (body temp sensor is needed for the app to know that the watch is on your wrist).","body_html":"<div class=\"md\"><p> Разве Apple уже нельзя использовать в качестве такого носимого устройства? У меня его нет, но AFAIK, он измеряет пульс и температуру тела. Таким образом, простое приложение должно быть в состоянии определить момент остановки вашего сердца (датчик температуры тела необходим, чтобы приложение знало, что часы на вашем запястье). </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/ekesfk4/","name":"t1_ekesfk4","created":1554780223,"created_utc":1554751423,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_b5ck4z","id":"eluz54w","author":"MichaelTen","parent_id":"t3_b5ck4z","subreddit_id":"t5_2r11d","body":"They need to have old folks apartment facilities attached to cryonics procedure areas with staff available 24 7. Economies of scale","body_html":"<div class=\"md\"><p> Они должны иметь жилые помещения для пожилых людей, прикрепленные к зонам процедур крионики, с персоналом, доступным 24 7. Экономия от масштаба </p></div>","permalink":"/r/cryonics/comments/b5ck4z/another_cryonicist_dies_unnoticed_and_receives_a/eluz54w/","name":"t1_eluz54w","created":1556337849,"created_utc":1556309049,"subreddit_name_prefixed":"r/cryonics","depth":0}]}