{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Во-первых, по состоянию на 2014 год, последний год, когда я мог найти информацию по этому вопросу, в то время как большинство членов крионических организаций были мужчины, большинство пациентов крионики были женщинами (см. «Замораживание людей - это не легко: мои приключения в крионике», Боб Нельсон, Кеннет Блай и Салли Мангана, опубликованные в 2014 году.) Хотя мы и сегодня видим женщин, которые выступают против прав женщин, они не составляют большинство женщин, и поэтому я считаю справедливым сказать, что большинство женщин возродилось в Будущее будет ценить и поддерживать равные права для женщин в этом будущем обществе. Некоторые утверждают, что антифеминизм обречен на феминизм, и действительно, некоторые антифеминисты посвящают себя тому, чтобы иметь много детей, полагая, что это позволит большинству антифеминисток появиться в ближайшее время. Тем не менее, эта вера предполагает, что те, кто родился и вырос как антифеминистки, навсегда останутся такими и будут воспитывать своих собственных детей как таковых. Предположение, которое мы ясно видим, не всегда сбывается. Поэтому я бы сказал, что если крионика работает, то большинство возрожденных людей будут женщины, и большинство из них будут феминистками, как и большинство женщин, и поэтому для того, чтобы соответствовать этому будущему обществу, сторонники крионики должны быть феминистками.\n\nЕсть и другие причины, по которым сторонники крионики должны быть и феминистками. В дополнение к тому, что в целом это правильно, как я полагаю, это принесет пользу крионике, потому что женщины внесли большой вклад в крионику и сделают еще больше, если им будут предоставлены равные права как в целом, так и в крионике. Сейчас я приведу несколько примеров женского вклада в крионику.\n\nПервый случай Cryo-Care, в апреле 1966 года, был первым случаем в истории человека - неизвестной женщины среднего возраста из Лос-Анджелеса, - замороженной с некоторой мыслью, которую они, возможно, реанимировали в будущем, хотя это не было настоящей криоконсервацией как это было сделано сначала с Джеймсом Бедфордом; скорее ее поместили в жидкий азот через два месяца после бальзамирования. Вскоре ее оттаяли и похоронили родственники.\n\nСамым старым объединенным обществом крионики, которое все еще существует, является Американское общество крионики (ACS), которое было основано в 1969 году как Общество крионики в Заливе (BACS) группой защитников крионики, в которую входил известный врач Зоны Залива Грейс Тэлбот. Также в 1969 году римско-католический священник освятил капсулу крионики Анны ДеБлазио, одной из первых пациентов с крионикой.\n\nВ 1972 году Линда Чемберлен и ее муж Фред создали некоммерческую крионическую организацию Alcor Society for твердотельной гипотермии (в 1977 году ее имя было изменено на Alcor Life Extension Foundation). крионическая корпорация под названием Manrise (к сожалению, имя, ориентированное на мужчин) и написала первое подробное руководство по процедурам для крионики, которое когда-либо существовало. Руководство по процедурам имело решающее значение для привлечения людей с высоким уровнем технических знаний в Alcor, а не в Крионическое общество Калифорнии. Кроме того, мать Линды Арлин Фрид получила криоконсервацию в 1990 году, которая была лучшей в своем роде на тот момент. Чемберлены также написали серию рассказов, связанных с крионикой, и опубликовали эти истории в книге вместе с рассказами других крионистов и трансгуманистов. Книга под названием «LifeQuest: десятки историй о крионике, загрузках и других трансчеловеческих приключениях» была переиздана в 2009 году. Чтобы подвести итоги своих усилий, Mensa написала в своем выпуске бюллетеня Mensa Bulletin за ноябрь / декабрь 2005 года, второй после Человек, которому приписывают оригинальную идею крионики (Роберт Эттингер), Чемберлены, как никто другой, внесли свой вклад в область крионики.\n\nСреди основателей Института крионики в 1976 году была Мэй А. Джунод, вторая жена Роберта Эттингера, которая в конечном итоге была подвергнута криоконсервации. Первой пациенткой CI была мать Роберта Эттингера Рея Эттингер в 1977 году, и до начала 1990-х годов, кроме Реи, единственной другой пациенткой была первая жена Эттингера Элейн в 1987 году. В 2015 году Дю Хонг, 61-летняя писательница детской литературы , стал первым известным человеком из Китая, который был криоконсервирован. Также в этом году двукратный лауреат Пулитцеровской премии Эми Хармон опубликовала в «Нью-Йорк Таймс» статью о криоконсервации Ким Суоцци (озаглавленную «Надежда умирающей молодой женщины в крионике и будущем»), а другую - в «Нейронауке бессмертия». », Включая крионику. По состоянию на 2015 год (последний год, который я мог найти информацию по этому вопросу), самым старшим пациентом во время клинической смерти, который подвергся процедурам криоконсервации в Фонде продления жизни Alcor, была Роза Селькович, A-2340, которой было почти 102 года в время, и самым молодым был Matheryn Naovaratpong, A-2789, которому в то время было два года. В Лондоне в 2016 году Высокий суд Англии вынес решение в пользу права матери добиваться криоконсервации ее неизлечимо больной 14-летней дочери, как этого хотела девочка, вопреки желаниям ее отца. Тем не менее, решение было принято на основании того, что дело представляло собой обычный спор по поводу распоряжения телом девочки, хотя судья настоятельно призвал министров искать «надлежащее регулирование» для будущего сохранения крионики.\n\nИтак, по этим причинам и потому, что в крионике нет ничего, что могло бы препятствовать феминизму, я считаю, что сторонники крионики должны быть феминистками.","title":"Почему сторонники крионики должны быть феминистками","subreddit_name_prefixed":"r/cryonics","ups":0,"created":1555500457,"link_flair_background_color":"","id":"be349m","author":{"name":"QwertyTyuiop"},"permalink":"/r/cryonics/comments/be349m/why_cryonics_supporters_should_be_feminists/","url":"https://www.reddit.com/r/cryonics/comments/be349m/why_cryonics_supporters_should_be_feminists/","created_utc":1555471657}