{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Я давно был заинтересован в том, чтобы подписаться на крионику, но я откладывал это со всеми типичными оправданиями прокрастинатора - но не более!\n\nЭто, однако, не первый раз, когда я получил это разрешение. Каждый раз, когда я пытался понять, как это сделать, я сталкивался с головой в лабиринте древних веб-сайтов с простым HTML, загадочных и часто устаревших часто задаваемых вопросов, мертвых писем и почти полного отсутствия полезных ответов, которые я чувствую, что могу доверять. Однажды я написал Алькору и был довольно бесполезно проинформирован о том, что мне нужно самостоятельно приобрести соответствующее страхование жизни, а затем снова связаться с ними, но это, честно говоря, не то, что я когда-либо делал, и несколько датских страховых компаний. Я связался тогда, казалось, настолько озадачен идеей, что я нервно отказался от них в качестве вариантов. Возникли другие проблемы в реальной жизни, и моя инициатива снова отошла на второй план.\n\nКороче говоря, я остро нуждаюсь в некоторой помощи и совете. Какую компанию по страхованию жизни лучше всего выбрать и почему? Как мне убедиться, что все в правовом поле настроено правильно? Какая из растущего списка компаний, предоставляющих услуги крионики, будет лучшей для гражданина Дании? Это не маленькая вещь, в конце концов; все должно быть в порядке для чего-то такого важного, и я чувствую себя совершенно не в своей тарелке.\n\nМои два брата, и, возможно, даже моя мать, также проявили интерес к реферату, но также не имеют представления о том, как это сделать, и, похоже, вообще забыли об этом. Я искренне надеюсь, что я смогу стать лидером семьи в этом процессе, чтобы потом помочь в этом и остальным членам моей семьи через лабиринт крионики.\n\nЯ понимаю, что это, может быть, немного вопрос, но, по крайней мере, я надеюсь, что кто-то здесь может помочь мне связаться с кем-то, кто мог бы дать мне некоторый совет и руководство по этому вопросу. Было бы также здорово, если бы я мог связаться с кем-то в Дании (или поблизости), который уже подписан на крионику, чтобы узнать, как они все это настроили.\n\nПоследний, полуотносительный момент, который меня мучил, заключается в следующем: это похоже на потребность, которая не выполняется в сообществе крионики. Интересно, сколько таких людей, как я, хотят подписаться, но которые напуганы, ошеломлены сложностями и просто бросают это. Я подозреваю, что это должно быть довольно много людей - лично я знаю нескольких, в том числе и я. Возможно, должна быть какая-то организация или группа, где бы они давали четкие советы и рекомендации по этому вопросу и держали людей за руки на протяжении всего процесса. И все же мне не удалось найти такую ​​вещь - если она существует, то она недостаточно заметна. Тем временем умирают люди, которым можно было бы помочь - трагедия, которая кажется в высшей степени предотвратимой.","title":"Где можно найти помощь в прохождении (казалось бы, довольно сложного) процесса регистрации в Cryonics?","subreddit_name_prefixed":"r/cryonics","ups":3,"created":1559430129,"link_flair_background_color":"","id":"bvlp3s","author":{"name":"omgimpwned"},"permalink":"/r/cryonics/comments/bvlp3s/where_does_one_find_help_with_going_through_the/","url":"https://www.reddit.com/r/cryonics/comments/bvlp3s/where_does_one_find_help_with_going_through_the/","created_utc":1559401329}