{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Вот пара абзацев Мартина Риса в их [книге «На будущее» [2018]] (https://www.amazon.com/dp/B07CSD5BG9):\n\n> Однажды я давал интервью группе энтузиастов крионики, базирующейся в Калифорнии, под названием «общество за отмену недобровольной смерти». Я сказал им, что скорее закончу свои дни на английском церковном кладбище, чем в калифорнийском холодильнике. Они высмеивали меня как «смертника» - действительно старомодного. Позже я с удивлением узнал, что три академика в Англии (хотя я рад сказать, что не из моего университета) подписались на «крионику». Двое заплатили полный удар; Третий выбрал вариант сокращения цены, чтобы только его голова была заморожена. Контракт заключен с компанией Alcor в Скоттсдейле, штат Аризона. Эти коллеги достаточно реалистичны, чтобы признать, что вероятность воскресения может быть небольшой, но они указывают, что без этих инвестиций шанс равен нулю. Поэтому они носят медальоны с инструкциями, чтобы немедленно заморозить их после смерти и заменить их кровь жидким азотом.\n>\n> Большинству из нас, смертных, трудно воспринимать это стремление всерьез; Более того, если бы крионика имела реальную перспективу успеха, я не думаю, что это тоже было бы достойно восхищения. Если бы Алькор не обанкротился и должным образом поддерживал охлаждение и управление в течение необходимых столетий, трупы были бы возрождены в мир, где они были бы странниками - беженцами из прошлого. Возможно, к ним будут относиться снисходительно, так как мы считаем, что мы должны относиться (например, к лицам, оказавшимся в бедственном положении) или к племенам амазонских племен, которые были вынуждены покинуть свою привычную среду обитания. Но разница в том, что «оттаявшие трупы» будут обременять будущие поколения выбором; поэтому не ясно, сколько внимания они заслуживают. Это напоминает похожую дилемму, которая не всегда может быть научной фантастикой, даже если она должна оставаться таковой: клонирование неандертальца. Один из экспертов (профессор из Стэнфорда) спросил: «Мы посадим его в зоопарк или отправим в Гарвард?»\n\nДавайте оценим это по точкам:\n\n1. ** Полное игнорирование фактических процедур, используемых крионическими организациями **. «Поэтому они носят медальоны с инструкциями, чтобы немедленно заморозить их после смерти и заменить их кровь жидким азотом». Если бы кровь заменили жидким азотом, вы не ошиблись? Это как GPT-2 пытался объяснить крионику. Это распространено. Критики, такие как Рис, как правило, понятия не имеют, что на самом деле делается. Им не нужно, потому что мало кто знает или заботится достаточно, чтобы призвать их к этому.\n2. ** Нет фактического объяснения того, почему крионика вряд ли будет работать: утверждается без доказательств **. «Большинству из нас, смертных, трудно воспринимать это стремление всерьез; более того, если крионика имела реальную перспективу успеха ...» То же, что и [Хэнк Грили] (https://www.reddit.com/r/cryonics/comments/bpx3jw/inside_transtime_cryonics_facility_bodies_frozen/enyhcrt/). Трудно опровергнуть недоверчивый взгляд. (Обычно, когда люди говорят, что крионика не работает, они указывают на «ледяные кристаллы», что, к сожалению, во многих случаях \\ * истинно \\ * из-за юридических ограничений автономии нашего тела, но не касается идеальных или близких в идеальных случаях, когда кристаллы льда кажутся минимальными, как видно на КТ.)\n3. ** Изгнать и высмеивать крионистов за их выбор того, что делать с их телами **. «Я рад сказать, что не из моего университета». Если бы Рис попытался привлечь этот вид ненавистного остракизма к другим темам, где люди делали выбор, что делать со своим телом, их бы резко критиковали. Но поскольку крионика - непопулярное меньшинство, на нее подписалось всего около 3500 человек, они, по-видимому, могут сойти с рук (посмотрите на похвалу за книгу Риса из престижных источников).\n4. ** Утверждение, что крионика неэтична с невероятно изолированным, поверхностным анализом **. «Но разница в том, что« оттаявшие трупы »будут отягощать будущие поколения по своему выбору; поэтому не ясно, сколько внимания они заслуживают». Во-первых, это не учитывает доверие к пациентам в Alcor, что неудивительно, потому что Рис недостаточно заботится о проведении фундаментальных исследований по этой теме. Но помимо этого, это отдельная критика, которая не связана с более широкой системой мышления. Например, все ли люди, которые «решили» обременять других - например, те, кто случайно [попробуют наркотики для наркоманов один раз] (https://www.drugabuse.gov/about-nida/noras-blog/2014/02/addic-free-choice), а затем развивается расстройство, связанное с употреблением психоактивных веществ - тоже не заслуживают нашего рассмотрения? Я сомневаюсь, что Рис сказал бы это, но, возможно, Рис - просто ненавистный человек. В любом случае, эта изолированная критика крионики, которая может быть применена к тысячам других вещей, но не потому, что она должна быть последовательной, типична для биоэтиков.","title":"Мартин Рис о крионике: пример из-за отсутствия уважения к выбору и автономии тела других","subreddit_name_prefixed":"r/cryonics","ups":5,"created":1560277629,"link_flair_background_color":"","id":"bzaqvn","author":{"name":"Synopticz"},"permalink":"/r/cryonics/comments/bzaqvn/martin_rees_on_cryonics_a_case_study_in_lack_of/","url":"https://www.reddit.com/r/cryonics/comments/bzaqvn/martin_rees_on_cryonics_a_case_study_in_lack_of/","created_utc":1560248829}