{
    "subreddit": {
        "display_name": "cryonics"
    },
    "subreddit_loc": "крионика",
    "selftext": "# Некоторый контекст (если вы спешите, перейдите к разделу «Возможные стратегии химиоконсервации после значительных PMI»).\n\nКрионика - безусловно, лучшая «скорая помощь в будущее», доступная в настоящее время, и она, вероятно, останется таковой в обозримом будущем. Одна из причин этого заключается в том, что можно ожидать, что даже прямое замораживание сохранит наиболее важные ультраструктурные и биомолекулярные детали, потому что кристаллы льда разрушают и деформируют ткани, но не стирают их, как, скажем, аутолиз, и как только весь мозг замерзает Твердое все остается на месте. Напротив, химическая консервация в значительной степени зависит от химических веществ, попадающих в каждую часть ткани, которую необходимо сохранить.\n\nС другой стороны, преимущества наличия техники сохранения с нулевым обслуживанием настолько очевидны и ошеломляющи, что IMO должны быть в центре внимания крионических исследований, наравне или, возможно, даже выше приостановленной анимации. В конце концов, обратимая приостановленная анимация уже является активным направлением основных криобиологических исследований (основной задачей является банк органов), тогда как большинство достижений в фиксации (таких как замораживание-замещение) применимы только к крошечным образцам ткани, а нейробиологи - нет. кажется, очень обеспокоены этим ограничением. Так что именно здесь скудные ресурсы лучше всего потратить, и награда в случае успеха стоит того. Еще одна причина, почему акцент на химическую консервацию приобретает все больший смысл, заключается в том, что методы сверхразрешающей микроскопии постепенно становятся все лучше и доступнее. Конечно, без этих методов трудно даже оценить химическую консервацию, в отличие от криоконсервации, где статистика жизнеспособности клеток является основным источником обратной связи.\n\nКриоконсервация, стабилизированная альдегидом, которая сочетает химическую фиксацию и криоконсервацию, уже предлагается крионическими организациями, но есть одна загвоздка: надлежащий ASC делается на живом объекте, в то время как крионика должна быть сделана на законно умерших людях, часто после PMI (после смерти) интервалы) много часов. Из-за явления отсутствия оплавления перфузия становится все более трудной после длительных PMI. То есть, через несколько минут, а не часов, самые маленькие кровеносные сосуды постепенно закрываются и разрушаются, и защитные химические вещества больше не могут перекачиваться в ткани. Это достаточно плохо для криоконсервации, но потенциально катастрофично для химиоконсервации, когда неспособность достичь и обработать ткань означает, что она просто сгниет. Это разочаровывает, потому что сами нейроны, как было показано, остаются живыми в течение нескольких часов и демонстрируют небольшое или нулевое ультраструктурное повреждение в течение еще более длительных интервалов, особенно в типичных условиях холодного хранения морга (4 ºC).\n\nПоразительно, но люди из БНФ, похоже, в порядке с протоколом, который требует закачивания смертельных химикатов в живого человека, и ожидают, что эта процедура будет быстро принята в качестве стандартного медицинского лечения после того, как ответят на несколько сомнений и возражений. Кроме того, они охотно уступают (или даже настаивают), что возрождение потребует разрушительного сканирования и [прямая загрузка сознания] (https://youtu.be/v2scSuw0om8?list=PLi8bYyAkwdRJOHHeJrd16ZEYCxZGaHGz5&t=285), потому что, видимо, эта идея не была достаточно спорным.\n\n& # X200B;\n\n# Возможные стратегии химиоконсервации после значительных PMI\n\n& # X200B;\n\nДаже если законы «смерти с достоинством» на практике приводят к тому, что оптимальная перфузия альдегида становится рутиной, остается проблема, заключающаяся в том, что многие люди просто не умирают в таких контролируемых условиях, и PMI часов еще долго будут оставаться нормой. Таким образом, единственный способ для химической консервации стать жизнеспособным вариантом для большинства людей - это либо вновь открыть закрытые кровеносные сосуды и капилляры, либо каким-либо образом достичь целевых тканей другими способами. Здесь я бы хотел услышать, как многие идеи обсуждаются, обсуждаются и взвешиваются друг против друга.\n\n# BrainEx\n\nДля начала, [эксперимент BrainEx на мозге свиньи] (https://www.nature.com/articles/s41586-019-1099-1), где мозг свиньи, по-видимому, был восстановлен после четырех часов ишемии при комнатной температуре, кажется очень актуальным и отличные новости для крионики. Используя BrainEx или аналогичный, эффективная перфузия может быть достигнута после чего-то ближе к реалистичным PMI. Кстати, кто-то задал [этот самый вопрос] (https://www.nature.com/articles/d41586-019-01289-1) исследователям, но, к сожалению, они, похоже, неправильно поняли вопрос, как если бы речь шла о введении BrainEx в уже замороженных / превращенных в стекло пациентов, чтобы вернуть их к жизни.\n\n# Погружная фиксация\n\nЧасто считается само собой разумеющимся, что простого погружения мозга в формальдегид недостаточно. Мы уверены в этом? Где доказательства? Я видел некоторые статьи, которые, кажется, указывают на обратное.\n\nНапример, в [одном исследовании] (https://www.frontiersin.org/articles/10.3389/fmed.2018.00031/full) два мозга взрослого человека хранили в ** 10% растворе формалина при комнатной температуре в течение 1032 часов * *, регулярно проводя компьютерную томографию и, в конечном итоге, осматривая их с помощью оптической микроскопии. Нейроны, похоже, были в порядке, с ** миелином нетронутым ** (см. Раздел ** «Гистологическое подтверждение целостности WM» **). Конечно, разрешения недостаточно для оценки состояния синапсов, поэтому нам нужны более подробные исследования.\n\nВ [другом исследовании] (https://actaneurocomms.biomedcentral.com/articles/10.1186/2051-5960-2-42) три правых полушария мозга от взрослых людей хранились в ** 10% формалине при 4ºC в течение трех лет * *. Затем образцы брали и хранили в формалине еще 10 лет. Некоторые образцы также были мгновенно заморожены. Сохранение кажется очень хорошим, и доступны ** электронные микроскопические изображения **.\n\nЯ полагаю, что есть исследования, которые противоречат этим результатам. Я хотел бы увидеть их. Честно говоря, я не уверен в том, что доверяю электронной микроскопии, когда говорится, что структура потеряна, потому что подготовка образца к ЭМ может быть очень агрессивной, особенно если структура уже повреждена и ее легко можно смыть. Я знаю, это означало бы, что любая техника химического консервирования, основанная на подобных методах, была бы в равной степени разрушительной, но тогда мы могли бы изучить другие возможности, такие как лиофилизация.\n\nЕсли фиксация погружения сработает, это будет решающей победой, потому что это даст нам время применить различные эффективные, но медленные методы сохранения. Это не значит, что мозг должен храниться в фиксированном растворе бесконечно долго.\n\n# Нарезка\n\nЕсли оказывается, что фиксация погружения слишком медленная, есть еще другие варианты. Например, мы могли бы просто ** разрезать мозг каждым центриметром или около того ** с помощью вибратома или тому подобного, сохраняя при этом мозг погруженным в фиксатор при температуре 1ºC или около того. Таким образом, ** лезвие будет всегда резать твердую, фиксированную часть ткани **, и проникновение фиксатора будет намного быстрее. Основным недостатком была бы неизбежная потеря некоторых тканей, но мозг, похоже, довольно хорошо приспосабливается к такого рода повреждениям (в определенных пределах), поэтому должно быть достаточное количество избыточности. Конечно, это предположение, но я бы хотел, чтобы некоторые исследования подтвердили или отвергли эту идею.\n\n# Сублимационная и вакуумная сушка\n\nЕще одна возможность исследования - ** сушка вымораживанием **. Основное повреждение, по-видимому, происходит от крупных ледяных кристаллов, которые необходимы для того, чтобы сделать образец достаточно пористым, чтобы испарить влагу в разумные сроки. Мы также теряем сам ледяной кристалл, который может содержать информацию о его характере роста. Основными преимуществами являются то, что процесс замораживания является относительно быстрым (по сравнению, скажем, с фиксацией погружением), и процесс сушки не включает никаких жидкостей, поэтому, даже если клеточные мембраны разорваны, ничто не будет смыто. Возможная проблема заключается в том, что лиофилизированные продукты, как правило, являются рыхлыми (легко измельчаемыми), но я не уверен, насколько серьезной будет проблема, если образец будет достаточно амортизирован и защищен для длительного хранения.\n\nЛиофилизированная ткань может затем фиксироваться газообразным формальдегидом или даже гораздо менее летучим [глутаровым альдегидом] (https://www.hindawi.com/journals/ijbm/2017/8947823/). Тогда, возможно, [смолу на водной основе, такую как GACH] (https://www.researchgate.net/publication/19046885_GACH_A_water-miscible_lipid-reeding_embedding_polymer_for_electron_microscopy) можно использовать для сохранения липидов [пластинация] (https: //www.gn. нетто / пластинчатый). Или, может быть, было бы лучше добавить этап постфиксации с тетроксидом осмия, который также является очень летучим и реакционноспособным, чтобы он мог предположительно работать в газовой фазе. Тогда вместо этого можно использовать смолу или каучук на основе ацетона, так же, как в настоящее время проводится стандартная пластикация крупных органов, но без потери липидов.\n\nТогда есть ** вакуумная сушка **. Это немного похоже на сушку вымораживанием, но без надоедливых ледяных кристаллов. Я не нашел много на эту тему, которая может быть непосредственно применена к сохранению мозга, но я думаю, что это стоит исследовать. Обычные рабочие температуры составляют около 20-30ºC и выше, но я полагаю, что он может быть намного ниже при лучшем вакууме, по крайней мере, в начале, а затем постепенно повышать его, когда ткани достаточно сухие, чтобы зафиксировать аутолитические ферменты на месте. , В современных версиях нагрев часто осуществляется с помощью микроволн, в противном случае на поверхности теплопроводности образуется сухой кек, и этот процесс становится очень медленным для крупных образцов. Пузыри могут быть проблемой, но мы всегда можем держать образец немного ниже точки кипения воды при данном давлении, и он все равно будет намного быстрее, чем сушка на воздухе. Я не уверен, как его скорость будет сравниваться со скоростью сушки вымораживанием в этом случае.\n\nЯ думаю, что интересным недорогим вариантом, если нам повезет, может быть фиксация погружением с последующей вакуумной сушкой при повышении температуры до некоторого безопасного предела между 40 и 60ºC, а затем защитная герметичная упаковка. Можем ли мы отказаться от таких возможностей? Я хотел бы увидеть больше доказательств в любом случае.\n\n& # X200B;\n\n# Хирургические методы грубой силы, чтобы открыть и защитить кровеносные сосуды до определенного размера\n\nВ худшем случае, если действительно окажется, что кровеносные сосуды должны оставаться открытыми, ** это не означает, что нам нужны тончайшие капилляры, чтобы они оставались неповрежденными и тоже открывались **. Конечно, восстановление последнего после длительных PMI, вероятно, потребовало бы чего-то, близкого к молекулярной нанотехнологии, что поставило бы точку крионики (или химиопрофилактики) в спор.\n\nНо что, если бы мы могли восстановить доступ к более крупным кровеносным сосудам до таких масштабов, чтобы ** ни одна ткань не находилась на расстоянии более чем нескольких миллиметров от **? Тогда ** осмотические агенты ** (например, маннит), ** фиксаторы **, ** охлаждающие жидкости ** и т. Д. Могут достичь любой ткани в разумные сроки без необходимости разрезать или проколоть мозг.\n\nЭто может быть процедура, аналогичная [катетер-направленному тромболизису] (https://www.radiologyinfo.org/en/info.cfm?pg=thrombo), но та, которая, помимо удаления тромбов, также открывает и усиливает слишком маленькие кровеносные сосуды через стенты или другие средства. Также может быть желательно увеличить их проницаемость, чтобы фиксаторы достигали паренхимы мозга по всему кровеносному сосуду, а не только на кончиках. Лазер может делать микроскопические дыры по всей длине, а затем, возможно, добавить [тонкий слой полиамида] (https://en.wikipedia.org/wiki/Thin-film_composite_membrane#Structure_and_materials), чтобы держать маннит и другие более крупные молекулы внутри кровеносного сосуда, в то время как вода осмотически удаляется из паренхимы. Тогда формальдегид будет довольно легко проникать из-за его небольшого размера, или, возможно, слой полиамида может быть удален, когда отек достаточно обратим и маннит удален.\n\n# Химико-консервативная вики?\n\nЕсть ли место для отслеживания множества возможных путей химиопрофилактики, подтверждающих доказательства для каждого из них, возможных способов их объединения и так далее? Если нет, то я думаю, что было бы здорово иметь его, и особенно держать его в курсе, когда появляются новые исследования, что, кажется, происходит довольно часто.",
    "title": "Мечта: химическая консервация при комнатной температуре после длительных PMI. Это слишком много, чтобы спросить?",
    "subreddit_name_prefixed": "r/cryonics",
    "ups": 5,
    "created": 1565055752,
    "link_flair_background_color": "",
    "id": "cme7f1",
    "author": {
        "name": "Molnan"
    },
    "permalink": "/r/cryonics/comments/cme7f1/the_dream_roomtemperature_chemopreservation_after/",
    "url": "https://www.reddit.com/r/cryonics/comments/cme7f1/the_dream_roomtemperature_chemopreservation_after/",
    "created_utc": 1565026952
}