{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Что «Алкор» оставил в стороне от «призыва к финансированию», так это тот факт, что именно их действия по криоконсервации д-ра Пилгерама ускорили это судебное разбирательство и сделали его настолько опасным и опасным для механизмов криоконсервации членов «Алькор» и для будущего крионики как в целом в Соединенных Штатах. Как я уже давно отмечал в New Cryonet (NCN) и Chronosphere, [http://chronopause.com/chronopause.com/index.html](http://chronopause.com/chronopause.com/index.html) Алкор имеет многолетняя история поведения с грубой небрежностью и пренебрежением к своим обязательствам перед пациентами и с высокомерным безразличием к проблемам многих из его членов\n\nОсновываясь на сообщениях из разных источников, то, что произошло, и что Alcor не говорит своим членам, заключается в том, что президент Alcor Макс Мор произвольно решил превратить доктора Пилгерама из всего тела в неврологию. Слово «произвольно» используется, потому что доктор Пилгерам выполнил контракт как член / пациент всего тела много лет назад, когда минимальные суммы финансирования всего тела в Alcor составляли 120 тысяч долларов. Члены Alcor из этой первоначальной когорты были уверены, что их стоимость криоконсервации не увеличится, и что они были «дедушкины». Чтобы заплатить за это, у Alcor было правило 10%, которое требовало, чтобы 10% валового дохода организации были внесены в фонд ухода за пациентами. Был также большой фактор безопасности, встроенный в плату за криоконсервацию для покрытия этого обязательства, а также другие неопределенности, которые могут возникнуть.\n\nЭта политика должна была быть свернута и, мы надеемся, заменена другими гарантиями. С уходом Джерри Лифа и Майка Дарвина, а также новым руководством Стива Бриджа, Ральфа Уилана и Дейва Пизера, было принято совершенно новое направление. Было принято решение сосредоточить большую часть капитала, не требующегося для операций, на продвижении по службе и расширении членства, чтобы достичь гипотетической фазы «после запуска», и в этот момент Alcor предположительно получит огромную экономию за счет масштаба и быстро расширяет число членов и пациентов. , Эта программа продвижения по службе и основанного на членстве роста стоила больших денег, и решение этой проблемы состояло в том, чтобы отменить правило 10%, радикально пересмотреть пределы безопасности криоконсервации и повысить стоимость нейроиндустрии для субсидирования всего тела.\n\nПричина последнего изменения может показаться неясной до тех пор, пока не станет понятно, что руководство решило, что все тело является ключом к более широкому принятию крионики и, наоборот, что нейро является PR-ответственностью. Новым членам сказали, что нейро предназначен только для людей, которые не могут позволить себе все тело, и, как сообщается, стоимость всего тела была искусственно занижена. Это привело к огромному переходу от нейро к целому телу и с этим увеличивающимся недофинансированным обязательствам. Политика дедовщины формально не прекращалась вплоть до 21 века. Результатом стало то, что к 2010 году у Alcor было ~ 17 млн. Долл. США в виде необеспеченных обязательств, которые возникнут в результате криоконсервации его зарегистрированных и недофинансированных членов. Фактически, ни один из многих миллионов долларов, переданных в качестве завещания Алькору, не попал в фонд ухода за пациентами, и, к сожалению, волшебная «особенность после запуска» так и не материализовалась.\n\nЕсли вы хотите понять фантастические рассуждения, которые привели к этому изменению парадигмы, это подробно описано в статье покойного Ральфа Уилана (который умер без крионики), которая появилась в Крионике в октябре 1993 года: [https://alcor.org /cryonics/cryonics9310.pdf](https://alcor.org/cryonics/cryonics9310.pdf).\n\nКогда Алькор обратился к своим ранним дедушкам и сказал им, что им нужно найти десятки тысяч долларов в ликвидном финансировании для решения проблемы нехватки средств на криоконсервацию, многие оправданно отказались и заявили, что считают это нарушением своего контракта. Отчеты из многочисленных источников указывают на то, что Alcor затем разработал актуарную программу начисления взносов членам, которые не получали достаточного финансирования, чтобы со временем Alcor воспользовалась большей частью дефицита недофинансированных членов. Предположительно, доктор Пилгерам платил эту доплату.\n\nВ то же время, как сообщается, было спорное обсуждение по Алькор совет о принятии политики, при которой дефиците финансовых ресурсов члены всего тела будет преобразованы в нейро в момент их криоконсервации * без предварительного уведомления *. Утверждалось, что экстренное преобразование в пункт о неврологии в документах Alcor, которое было разработано, чтобы спасти всех пациентов всего тела в случае катастрофической угрозы для организации или серьезных финансовых отклонений, которые будут препятствовать дальнейшему уходу за всем телом, должно быть используется для криоконсервации участников, записавшихся как целое тело как неврологические пациенты, * даже если они не давали согласия или даже знали, что это будет сделано *.\n\nЭто положение никогда не предназначалось для решения проблемы недофинансирования отдельных членов и, конечно, не предназначалось для использования в случаях, когда член еще был жив, и его можно было бы попросить дать согласие на переход от всего тела к неврологическому или прекратить их действия по крионике. Доктор Пилгерам жил независимо и был компетентен, пока не перенес внезапную остановку сердца за пределами своего дома. Таким образом, не было никаких причин не консультироваться с доктором Пилгерам о криоконсервации его как нейро.\n\nАлькор застыл у доктора Пилгерама как больного всего тела и вскоре решил перевести его в неврологию. Несколько источников указали, что это было * специальное * решение, принятое президентом Alcor Максом Мором и координатором резервного ожидания Alcor Аароном Дрейком. Затем, по словам его сына Курта, Алькор кремировал останки доктора Пилгерама, а затем отправил их семье, без объяснения того, почему его не лечили как пациента всего тела.\n\nСтоимость защиты от этого судебного процесса, как сообщается, губительна. Несколько месяцев назад Макс Мор начал звонить состоятельным членам Alcor и просить их внести 1 миллион долларов за штуку, чтобы покрыть стоимость этого судебного процесса. Похоже, что процесс раскрытия в этом судебном процессе был длительным, и большая часть запрашиваемых материалов потенциально разрушительна для репутации и доверия Alcor.\n\nНичего из этого не произошло бы, если бы доктора Пилгерама лечили как пациента всего тела, как указано в его контракте с Алькором, и, как, по-видимому, доктор Пилгерам ожидал, что его будут лечить. Тот факт, что Alcor сейчас разослал общие обращения за средствами, в лучшем случае выглядит зловещим. Предположительно, они не смогли покрыть свои финансовые проблемы крупными пожертвованиями богатых людей. Помимо этого, существует очень серьезная проблема в виде риска для механизмов криоконсервации * всех * членов Alcor, которые представляет этот судебный процесс. * Поскольку Alcor владеет полисами страхования жизни своих членов, эти активы могут быть привлечены к судебной ответственности против Alcor, если фактические и штрафные убытки против Alcor превышают денежные средства и активы Alcor. Это оставило бы многие, если не большинство членов, лишенных средств для криоконсервации *. Действительно, больше всего пострадают те участники, которые имеют слабое здоровье или пожилой возраст и не имеют права на страхование жизни. Члены Alcor, чьи полисы принадлежат Alcor, могут пожелать обратиться к юрисконсульту о том, как они могут защитить свои полисы от ликвидации, чтобы удовлетворить любое крупное решение в отношении Alcor.\n\nМайк Дарвин\n\nБывший президент Alcor и директор по исследованиям Alcor","title":"Обращение Alcor за деньги для поддержки судебных процессов","subreddit_name_prefixed":"r/cryonics","ups":18,"created":1565095293,"link_flair_background_color":"","id":"cmm2ig","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/","url":"https://www.reddit.com/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/","created_utc":1565066493,"replies":[{"ups":8,"link_id":"t3_cmm2ig","replies":[{"ups":4,"link_id":"t3_cmm2ig","replies":[{"ups":3,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","id":"ew8yvml","author":"anon_cryo","parent_id":"t1_ew8un4j","subreddit_id":"t5_2r11d","body":"*JOHN WAYNE VOICE*\nthanks!","body_html":"<div class=\"md\"><p><em>JOHN WAYNE VOICE</em>\nthanks!</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew8yvml/","name":"t1_ew8yvml","created":1565245935,"created_utc":1565217135,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"ew7fgqt","author":"[deleted]","parent_id":"t1_ew7c6rx","subreddit_id":"t5_2r11d","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew7fgqt/","name":"t1_ew7fgqt","created":1565219835,"created_utc":1565191035,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"ew6jgmc","author":"MaximilianKohler","parent_id":"t1_ew6jgd6","subreddit_id":"t5_2r11d","body":"> 12)     Create a comprehensive regulatory framework which is applied both within the organization and outside of it. This regulatory framework should be submitted to the legislature of the state where the cryonics organization is located in order to create a state board for oversight and for punitive measures when negligence or misconduct occurs. Be prepared to pay the costs of this oversight and to incorporate said costs in charges to members and patients. This would be an example of an initially “unforeseen” contingency in cryonics. Sooner or later cryonics will be regulated and with such regulation will come added costs.\n> \n>  \n> \n> 13)     Make management transparent to members. The reality is that very little of Board business is required to be conducted in camera. Vice thrives in the dark. It is very unlikely that there would have been serious board discussions about switching whole-body members to neuro without their consent had these discussions been held in the sunlight. Transparent Board meetings also expose the quality of management and of its decisions to ongoing scrutiny by the membership.\n> \n>  \n> \n> Ostensibly Alcor is a biomedical research organization administering an experimental treatment, rather than a business competing with other businesses for a market share of experimental subjects.\n> \n>  \n> \n> Cryonics is not a business undertaking like selling toasters, automobiles or life insurance. It is not a developed product that can be sold to the masses as a package deal for a monthly fee. Unlike developed products, it is riddled with grave uncertainties, is technically complex, impacts public health and individual psychological, emotional and familial wellbeing and has enormous potential to provoke public outrage if done improperly. Perhaps most importantly it has no clear temporal endpoint. It proposes to maintain human beings in uninterrupted cryogenic care over a period of centuries and then restore them to health and revive them. That is an unprecedent and fantastical proposition in the context of today’s business and commercial environment. The late Carl Sagan famously said that “extraordinary claims require extraordinary proof”. Similarly, cryonics is an extraordinary undertaking (to say the least) and as such it requires extraordinary precautions to safeguard it and to make its mission both credible and feasible.\n> \n>  \n> \n> 14)     As an experimental treatment cryonics is not a religious, philosophical, social, political or other enterprise advocating for any given ideology. As such, it should disconnect itself from the dissemination and promotion of specific social, economic or political ideologies. While a majority of those who opt for cryopreservation may have in common the same beliefs and allegiances, the cryonics organizations should remain agnostic and disconnected in this regard. Governments and religions jealousy guard their roles as the creators and gatekeepers of ideologies and often punish those who trespass on their territory; consider the Falun Gong in China, or abortion clinics in the US.\n> \n>  \n> \n> 15)     The Board of Directors of the organization should represent the membership and be selected by the membership. This does not mean that everyone who beco0mes a member has the right to vote. There are many perils associated with such a system, including the takeover, hostile or otherwise, from outsiders as has already been attempted in the case of CI.\n> \n>  \n> \n> The Board should be selected by members who have a vested interest in the organization. At a minimum, this should mean that they must have remained members with cryopreservation arrangements in good standing for a reasonable period of time, at which time they should be accorded one vote. Several additional classes of membership should exist based on well defined and pre-specified achievements in service and personal education about cryonics which are acquired over time. These members may be given additional votes as a result of this higher level of involvement and vetting. A preliminary proposal for the initial vesting interval is 5 years.\n> \n>  \n> \n> Directors can be selected only from the highest, most experienced and well vetted class of members. Additionally, they should undergo thorough background checks to screen not just for criminal behavior, but for financial and personal responsibility and stability. A core objective of such vetting is to screen out sociopathic or psychopathic individuals who would represent a threat to the stability and viability of the organization.\n> \n>  \n> \n> 16)     Personnel involved in the delivery of patient care must either be vetted members or continuously supervised in the field and in the facility by vetted members specially trained for the task. It is not acceptable to have the cryopreservation treatment administered unsupervised by non-cryonicist contractors. In human clinical trials, the principal investigator closely supervises the procedures carried out on patients by everyone, including contractors.\n> \n>  \n> \n> 17)     Defined penalties for errors, negligence or malfeasance must be created, given to personnel and enforced. Serious harm to a patient due to negligence or malfeasance should result in the immediate removal of that person from their job and termination as soon as is practical with no possibility of a return to providing any kind of cryonics service.\n> \n>  \n> \n> 18)     Everyone who has cryonics arrangements is not necessarily a committed cryonicist. A committed cryonicist is someone who has sought out cryonics, completed the necessary legal and financial arrangements and who remains both signed up and engaged with their cryonics organization over a period of years. Currently, cryonics is infested with individuals whose first contact with cryonics was as a job applicant and who have made cryonics arrangements primarily because it improves their scope of authority and credibility within the organization. Hired hands are just that, hired hands; they don’t get to run the ranch. The scope of authority of such opportunistic cryonicists should be severely limited and they should never occupy core administrative, technical or financial positions within the organization. Failure to follow this dictum has already resulted in embezzlement, fraud and grossly deficient patient care.\n> \n>  \n> \n> 19)     Expenditure of research dollars should not be on putative revival technologies for the foreseeable future. The enabling technologies required to revive today’s cryonics patients (even those treated under optimum conditions) will necessarily be the province of mainstream industry, medicine and computing technologies. Much basic science remains to be done that is both broad and deep effort. Such efforts are beyond the resources of any of the current cryonics organizations.\n> \n>  \n> \n> Research should be directed towards improving the quality of the preservation process and especially on reversible brain cryopreservation research. No other technological development offers greater benefit to cryonics, not just in terms of increased credibility, but also in terms of reassurance to those with cryonics arrangements and their loved ones that the procedure is indeed capable of preserving their personhood.\n> \n>  \n> \n> 20)     Instead of cosmetic, PR-driven enhancements to patient storage facilities cryonics organizations should have a plan to continually upgrade and harden their storage operations to protect against natural disaster, civil unrest or focused terrorism.","body_html":"<div class=\"md\"><blockquote>\n<p>12)     Create a comprehensive regulatory framework which is applied both within the organization and outside of it. This regulatory framework should be submitted to the legislature of the state where the cryonics organization is located in order to create a state board for oversight and for punitive measures when negligence or misconduct occurs. Be prepared to pay the costs of this oversight and to incorporate said costs in charges to members and patients. This would be an example of an initially “unforeseen” contingency in cryonics. Sooner or later cryonics will be regulated and with such regulation will come added costs.</p>\n\n<p>13)     Make management transparent to members. The reality is that very little of Board business is required to be conducted in camera. Vice thrives in the dark. It is very unlikely that there would have been serious board discussions about switching whole-body members to neuro without their consent had these discussions been held in the sunlight. Transparent Board meetings also expose the quality of management and of its decisions to ongoing scrutiny by the membership.</p>\n\n<p>Ostensibly Alcor is a biomedical research organization administering an experimental treatment, rather than a business competing with other businesses for a market share of experimental subjects.</p>\n\n<p>Cryonics is not a business undertaking like selling toasters, automobiles or life insurance. It is not a developed product that can be sold to the masses as a package deal for a monthly fee. Unlike developed products, it is riddled with grave uncertainties, is technically complex, impacts public health and individual psychological, emotional and familial wellbeing and has enormous potential to provoke public outrage if done improperly. Perhaps most importantly it has no clear temporal endpoint. It proposes to maintain human beings in uninterrupted cryogenic care over a period of centuries and then restore them to health and revive them. That is an unprecedent and fantastical proposition in the context of today’s business and commercial environment. The late Carl Sagan famously said that “extraordinary claims require extraordinary proof”. Similarly, cryonics is an extraordinary undertaking (to say the least) and as such it requires extraordinary precautions to safeguard it and to make its mission both credible and feasible.</p>\n\n<p>14)     As an experimental treatment cryonics is not a religious, philosophical, social, political or other enterprise advocating for any given ideology. As such, it should disconnect itself from the dissemination and promotion of specific social, economic or political ideologies. While a majority of those who opt for cryopreservation may have in common the same beliefs and allegiances, the cryonics organizations should remain agnostic and disconnected in this regard. Governments and religions jealousy guard their roles as the creators and gatekeepers of ideologies and often punish those who trespass on their territory; consider the Falun Gong in China, or abortion clinics in the US.</p>\n\n<p>15)     The Board of Directors of the organization should represent the membership and be selected by the membership. This does not mean that everyone who beco0mes a member has the right to vote. There are many perils associated with such a system, including the takeover, hostile or otherwise, from outsiders as has already been attempted in the case of CI.</p>\n\n<p>The Board should be selected by members who have a vested interest in the organization. At a minimum, this should mean that they must have remained members with cryopreservation arrangements in good standing for a reasonable period of time, at which time they should be accorded one vote. Several additional classes of membership should exist based on well defined and pre-specified achievements in service and personal education about cryonics which are acquired over time. These members may be given additional votes as a result of this higher level of involvement and vetting. A preliminary proposal for the initial vesting interval is 5 years.</p>\n\n<p>Directors can be selected only from the highest, most experienced and well vetted class of members. Additionally, they should undergo thorough background checks to screen not just for criminal behavior, but for financial and personal responsibility and stability. A core objective of such vetting is to screen out sociopathic or psychopathic individuals who would represent a threat to the stability and viability of the organization.</p>\n\n<p>16)     Personnel involved in the delivery of patient care must either be vetted members or continuously supervised in the field and in the facility by vetted members specially trained for the task. It is not acceptable to have the cryopreservation treatment administered unsupervised by non-cryonicist contractors. In human clinical trials, the principal investigator closely supervises the procedures carried out on patients by everyone, including contractors.</p>\n\n<p>17)     Defined penalties for errors, negligence or malfeasance must be created, given to personnel and enforced. Serious harm to a patient due to negligence or malfeasance should result in the immediate removal of that person from their job and termination as soon as is practical with no possibility of a return to providing any kind of cryonics service.</p>\n\n<p>18)     Everyone who has cryonics arrangements is not necessarily a committed cryonicist. A committed cryonicist is someone who has sought out cryonics, completed the necessary legal and financial arrangements and who remains both signed up and engaged with their cryonics organization over a period of years. Currently, cryonics is infested with individuals whose first contact with cryonics was as a job applicant and who have made cryonics arrangements primarily because it improves their scope of authority and credibility within the organization. Hired hands are just that, hired hands; they don’t get to run the ranch. The scope of authority of such opportunistic cryonicists should be severely limited and they should never occupy core administrative, technical or financial positions within the organization. Failure to follow this dictum has already resulted in embezzlement, fraud and grossly deficient patient care.</p>\n\n<p>19)     Expenditure of research dollars should not be on putative revival technologies for the foreseeable future. The enabling technologies required to revive today’s cryonics patients (even those treated under optimum conditions) will necessarily be the province of mainstream industry, medicine and computing technologies. Much basic science remains to be done that is both broad and deep effort. Such efforts are beyond the resources of any of the current cryonics organizations.</p>\n\n<p>Research should be directed towards improving the quality of the preservation process and especially on reversible brain cryopreservation research. No other technological development offers greater benefit to cryonics, not just in terms of increased credibility, but also in terms of reassurance to those with cryonics arrangements and their loved ones that the procedure is indeed capable of preserving their personhood.</p>\n\n<p>20)     Instead of cosmetic, PR-driven enhancements to patient storage facilities cryonics organizations should have a plan to continually upgrade and harden their storage operations to protect against natural disaster, civil unrest or focused terrorism.</p>\n</blockquote>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew6jgmc/","name":"t1_ew6jgmc","created":1565201308,"created_utc":1565172508,"subreddit_name_prefixed":"r/cryonics","depth":2},{"ups":1,"link_id":"t3_cmm2ig","id":"ewyyfms","author":"ARD227","parent_id":"t1_ew6jgd6","subreddit_id":"t5_2r11d","body":"Mike Darwin....crazy with a side of crazy. Fired from Alcor for doing illegal and unethical procedures on humans but somehow he's the authority on substantive change?! 🤔🤔🤔","body_html":"<div class=\"md\"><p>Mike Darwin....crazy with a side of crazy. Fired from Alcor for doing illegal and unethical procedures on humans but somehow he&#39;s the authority on substantive change?! 🤔🤔🤔</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewyyfms/","name":"t1_ewyyfms","created":1565917442,"created_utc":1565888642,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ew3j19s","author":"MaximilianKohler","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"More discussion here: https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18027\n\nAlcor is soliciting donations to defend the court case. \n\nEveryone that cares about the issues Mike Darwin has been raising for years should do everything they can to get donors to demand reform, as a prerequisite. I think it's an effective strategy. It's a strategy I've been encouraging donors in a particular medical research field to use. And it did seem to have some impact. \n\nIf this mess can result in significant, long-needed reform, that would be great for all cryonicists. And I might just consider signing up with Alcor if it does happen.","body_html":"<div class=\"md\"><p>More discussion here: <a href=\"https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18027\">https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18027</a></p>\n\n<p>Alcor is soliciting donations to defend the court case. </p>\n\n<p>Everyone that cares about the issues Mike Darwin has been raising for years should do everything they can to get donors to demand reform, as a prerequisite. I think it&#39;s an effective strategy. It&#39;s a strategy I&#39;ve been encouraging donors in a particular medical research field to use. And it did seem to have some impact. </p>\n\n<p>If this mess can result in significant, long-needed reform, that would be great for all cryonicists. And I might just consider signing up with Alcor if it does happen.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew3j19s/","name":"t1_ew3j19s","created":1565110189,"created_utc":1565081389,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_cmm2ig","id":"ew95uqm","author":"ARD227","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"Hello pot, meet kettle......🙄🙄🙄🙄🙄","body_html":"<div class=\"md\"><p>Hello pot, meet kettle......🙄🙄🙄🙄🙄</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew95uqm/","name":"t1_ew95uqm","created":1565248918,"created_utc":1565220118,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_cmm2ig","replies":[{"ups":2,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","replies":[{"ups":5,"link_id":"t3_cmm2ig","id":"ewxj2ri","author":"Michael-G-Darwin","parent_id":"t1_ewxj1xj","subreddit_id":"t5_2r11d","body":"The latest generation of PFC OTs has almost unbelievable properties and will constitute a huge advance, not only as an OT for blood loss, but in cancer, stroke and cerebral ischemia – for which it is now in clinical trials. Dodecafluoropentane is a pentane-based PFC which should be a gas at body temperature. In fact, it was originally developed as a contrast agent for ultrasonography, (where it has to form bubbles to create contrast) and is FDA approved for that purpose, which is hugely important to its chances for FDA approval as an OT. It is administered in the form of nanoparticles that are 250 to 300 nm in size when below 29°C. There are, broadly, two theories as to how DDFPe achieves gas transport in vivo. The first is that although DDFP has a boiling point of 29°C, due to intravascular pressure it may not shift to microbubble form in the body at 37 degrees C. Rather, the particle size may increase only slightly allowing the facilitation of gas exchange. The second theory is that at body temperature it forms submicron gas bubbles, which it was designed to do, which remain in suspension with the sizes of the gas microbubbles being determined by their surface tension and the partial pressure of gases inside the microbubble. While it seems wildly counter-intuitive that a gas could absorb and transport other gases, the solubility of nonpolar gases in DDFP is so high that the bubbles transport high levels of oxygen and other gases: 100 times greater than all other liquid-phase OT PFCs: [https://cancerres.aacrjournals.org/content/62/13/3626.long](https://cancerres.aacrjournals.org/content/62/13/3626.long) I side with the second theory.\n\nThis where the “nearly unbelievable” enters the picture because it is so good at transporting oxygen and carbon dioxide that the estimated (theoretical) dose  of a 2% emulsion required to  support a 75 kg human’s resting oxygen demand would be 0.8 mL(!): [https://www.ncbi.nlm.nih.gov/pubmed/16893811](https://www.ncbi.nlm.nih.gov/pubmed/16893811) In reality, a dose of 0.05 – 0.07ml/kg mL is what is being used in clinical trials for stroke, with similar dosing for the virulent brain malignancy glioblastoma multiforme. OTs have tremendous potential in solid tumor cancers because the bulk of the tumor is severely hypoxic (and even necrotic) and this hypoxia is profoundly protective against both radiation and chemotherapy: [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6177375/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6177375/) and [https://cancerres.aacrjournals.org/content/62/13/3626.long](https://cancerres.aacrjournals.org/content/62/13/3626.long).\n\nAnother phenomenal advantage DDFPe is that it is stored as a freeze-dried powder at room temperature with a very long shelf life. It easily reconstitutes with added electrolyte solution. In addition to its myriad civilian applications, it's military potential is staggering. A sing dose of 5-10 mL has the potential of being able to restore adequate oxygen carrying capacity to a soldier who has lost half his blood volume. This capability would likely greatly augment the phenomenal battlefield lifesaving that has been achieved with the aggressive use of tourniquets.\n\nA major mystery concerning the action of DDFPe is that it shouldn’t work anywhere near as long as it does; which is in the range of 90-120 minutes. In humans, the particles are rapidly cleared from the circulation with a mean half-life value of 1.45±0.17 min for DDFP in blood after a single 0.6 mL/kg dose (with an accompanying elimination rate of 98% 2 hours following administration). Animal studies have shown no detectable residues in multiple organ systems 2-hours post-administration even with repeated dosing: [https://www.ncbi.nlm.nih.gov/pubmed/28028728](https://www.ncbi.nlm.nih.gov/pubmed/28028728)\n\nOne of the banes of all previous OT PFCs is that they are retained in the body for long periods of time. The FDA is extremely averse to approving any therapeutic molecule that is retained in tissues for periods ranging from weeks to years. In addition to their phenomenal gas transport properties, the PFCs have the double-edged effect of being potent anti-inflammatory drugs acting by novel and incompletely understood means. They are effective at paralyzing some types of white blood cells even when present in picogram quantities! This is, in fact, at least one mechanism by which they moderate inflammation since this action on WBCs is immunosuppressive. The rapid clearance of DDFP from blood and tissues provides the frequently highly desirable immunosuppressive advantages of the liquid PFCs without the long-term immunosuppression that is likely to result from extended retention in tissues. The liquid PFCs, when used for partial liquid ventilation to treat respiratory distress, or to facilitate rapid induction of hypothermia, are similarly retained in the body long-term and it has been speculated that this was a major factor in the FDA’s refusal to approve the PFCs in acute respiratory distress. PFC suppression of acute inflammation is a major therapeutic benefit respiratory distress and stroke, however, beyond the acute phase, such inhibition of the immune system is counterproductive.\n\nDDFPe is being developed as an OT by Nuvox Pharma of Tuscon, AZ under the name NVX-208 [http://www.nuvoxpharma.com/](http://www.nuvoxpharma.com/)","body_html":"<div class=\"md\"><p>The latest generation of PFC OTs has almost unbelievable properties and will constitute a huge advance, not only as an OT for blood loss, but in cancer, stroke and cerebral ischemia – for which it is now in clinical trials. Dodecafluoropentane is a pentane-based PFC which should be a gas at body temperature. In fact, it was originally developed as a contrast agent for ultrasonography, (where it has to form bubbles to create contrast) and is FDA approved for that purpose, which is hugely important to its chances for FDA approval as an OT. It is administered in the form of nanoparticles that are 250 to 300 nm in size when below 29°C. There are, broadly, two theories as to how DDFPe achieves gas transport in vivo. The first is that although DDFP has a boiling point of 29°C, due to intravascular pressure it may not shift to microbubble form in the body at 37 degrees C. Rather, the particle size may increase only slightly allowing the facilitation of gas exchange. The second theory is that at body temperature it forms submicron gas bubbles, which it was designed to do, which remain in suspension with the sizes of the gas microbubbles being determined by their surface tension and the partial pressure of gases inside the microbubble. While it seems wildly counter-intuitive that a gas could absorb and transport other gases, the solubility of nonpolar gases in DDFP is so high that the bubbles transport high levels of oxygen and other gases: 100 times greater than all other liquid-phase OT PFCs: <a href=\"https://cancerres.aacrjournals.org/content/62/13/3626.long\">https://cancerres.aacrjournals.org/content/62/13/3626.long</a> I side with the second theory.</p>\n\n<p>This where the “nearly unbelievable” enters the picture because it is so good at transporting oxygen and carbon dioxide that the estimated (theoretical) dose  of a 2% emulsion required to  support a 75 kg human’s resting oxygen demand would be 0.8 mL(!): <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/16893811\">https://www.ncbi.nlm.nih.gov/pubmed/16893811</a> In reality, a dose of 0.05 – 0.07ml/kg mL is what is being used in clinical trials for stroke, with similar dosing for the virulent brain malignancy glioblastoma multiforme. OTs have tremendous potential in solid tumor cancers because the bulk of the tumor is severely hypoxic (and even necrotic) and this hypoxia is profoundly protective against both radiation and chemotherapy: <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6177375/\">https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6177375/</a> and <a href=\"https://cancerres.aacrjournals.org/content/62/13/3626.long\">https://cancerres.aacrjournals.org/content/62/13/3626.long</a>.</p>\n\n<p>Another phenomenal advantage DDFPe is that it is stored as a freeze-dried powder at room temperature with a very long shelf life. It easily reconstitutes with added electrolyte solution. In addition to its myriad civilian applications, it&#39;s military potential is staggering. A sing dose of 5-10 mL has the potential of being able to restore adequate oxygen carrying capacity to a soldier who has lost half his blood volume. This capability would likely greatly augment the phenomenal battlefield lifesaving that has been achieved with the aggressive use of tourniquets.</p>\n\n<p>A major mystery concerning the action of DDFPe is that it shouldn’t work anywhere near as long as it does; which is in the range of 90-120 minutes. In humans, the particles are rapidly cleared from the circulation with a mean half-life value of 1.45±0.17 min for DDFP in blood after a single 0.6 mL/kg dose (with an accompanying elimination rate of 98% 2 hours following administration). Animal studies have shown no detectable residues in multiple organ systems 2-hours post-administration even with repeated dosing: <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/28028728\">https://www.ncbi.nlm.nih.gov/pubmed/28028728</a></p>\n\n<p>One of the banes of all previous OT PFCs is that they are retained in the body for long periods of time. The FDA is extremely averse to approving any therapeutic molecule that is retained in tissues for periods ranging from weeks to years. In addition to their phenomenal gas transport properties, the PFCs have the double-edged effect of being potent anti-inflammatory drugs acting by novel and incompletely understood means. They are effective at paralyzing some types of white blood cells even when present in picogram quantities! This is, in fact, at least one mechanism by which they moderate inflammation since this action on WBCs is immunosuppressive. The rapid clearance of DDFP from blood and tissues provides the frequently highly desirable immunosuppressive advantages of the liquid PFCs without the long-term immunosuppression that is likely to result from extended retention in tissues. The liquid PFCs, when used for partial liquid ventilation to treat respiratory distress, or to facilitate rapid induction of hypothermia, are similarly retained in the body long-term and it has been speculated that this was a major factor in the FDA’s refusal to approve the PFCs in acute respiratory distress. PFC suppression of acute inflammation is a major therapeutic benefit respiratory distress and stroke, however, beyond the acute phase, such inhibition of the immune system is counterproductive.</p>\n\n<p>DDFPe is being developed as an OT by Nuvox Pharma of Tuscon, AZ under the name NVX-208 <a href=\"http://www.nuvoxpharma.com/\">http://www.nuvoxpharma.com/</a></p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewxj2ri/","name":"t1_ewxj2ri","created":1565887857,"created_utc":1565859057,"subreddit_name_prefixed":"r/cryonics","depth":8},{"ups":1,"link_id":"t3_cmm2ig","id":"ex3viq8","author":"TouchyTheFish","parent_id":"t1_ewxj1xj","subreddit_id":"t5_2r11d","body":"Remarkable. But you couldn’t have known all this in the early 2000s when you worked with it. Even now most of the literature is available only in Russian, if you can find it all. How much of this is retrospective?\n\nYes, Perftoran. I remember that at some point they were able to improve the consistency of particle sizes and everything else kind of lined up. Ostwald ripening is naturally a runaway process so the effect of a seemingly modest change is not linear. As often happens, removing one obstacle makes the rest easier to tackle. \n\nMuch of this stuff came out of Cold War-era research programs into military applications, with some of it making its way to the civilian world later. Like that British company F2 Chemicals. So I half suspect that the Russians may have been familiar with some of the problems from earlier research that was only circulated internally. Maybe somewhere out there there’s a Russian Journal of Tube Alloys.","body_html":"<div class=\"md\"><p>Remarkable. But you couldn’t have known all this in the early 2000s when you worked with it. Even now most of the literature is available only in Russian, if you can find it all. How much of this is retrospective?</p>\n\n<p>Yes, Perftoran. I remember that at some point they were able to improve the consistency of particle sizes and everything else kind of lined up. Ostwald ripening is naturally a runaway process so the effect of a seemingly modest change is not linear. As often happens, removing one obstacle makes the rest easier to tackle. </p>\n\n<p>Much of this stuff came out of Cold War-era research programs into military applications, with some of it making its way to the civilian world later. Like that British company F2 Chemicals. So I half suspect that the Russians may have been familiar with some of the problems from earlier research that was only circulated internally. Maybe somewhere out there there’s a Russian Journal of Tube Alloys.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ex3viq8/","name":"t1_ex3viq8","created":1566021244,"created_utc":1565992444,"subreddit_name_prefixed":"r/cryonics","depth":8}],"id":"ewwxnxj","author":"TouchyTheFish","parent_id":"t1_ewwt626","subreddit_id":"t5_2r11d","body":"Yes!","body_html":"<div class=\"md\"><p>Yes!</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewwxnxj/","name":"t1_ewwxnxj","created":1565866869,"created_utc":1565838069,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"ewqf0tw","author":"TouchyTheFish","parent_id":"t1_ewnffjo","subreddit_id":"t5_2r11d","body":"Mike, you ever see what the Russians have done with fluorocarbon blood substitutes? It seems like every podunk town in Siberia has had the stuff lying around for years and people have survived with 50%+ blood loss. That’s not a typo.","body_html":"<div class=\"md\"><p>Mike, you ever see what the Russians have done with fluorocarbon blood substitutes? It seems like every podunk town in Siberia has had the stuff lying around for years and people have survived with 50%+ blood loss. That’s not a typo.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewqf0tw/","name":"t1_ewqf0tw","created":1565692986,"created_utc":1565664186,"subreddit_name_prefixed":"r/cryonics","depth":4},{"ups":1,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","id":"f4arkrn","author":"Hobbit-Habit","parent_id":"t1_f49j58q","subreddit_id":"t5_2r11d","body":"\"the incredible satisfaction of offering the same hope and joy to other mortals.\"\n\nHa!\n\nYou have previously described the fascination you had with the power of turning life on and off, which is probably closer to the mark.","body_html":"<div class=\"md\"><p>&quot;the incredible satisfaction of offering the same hope and joy to other mortals.&quot;</p>\n\n<p>Ha!</p>\n\n<p>You have previously described the fascination you had with the power of turning life on and off, which is probably closer to the mark.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/f4arkrn/","name":"t1_f4arkrn","created":1571528908,"created_utc":1571500108,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f499jzn","author":"Hobbit-Habit","parent_id":"t1_ewnffjo","subreddit_id":"t5_2r11d","body":">Wernher von Braun\n\n..both served his country in wartime and created a technology of great lasting benefit, unlike Tom Lehrer and perhaps (it remains to be seen) Mike Darwin. Mike, on the other hand, might easily have a future historical significance similar to that of Charles Babbage, whose computer was theoretically workable but entirely the wrong way to build a computing device - or maybe like Claudius Ptolemy, whose system of epicycles did at least serve to predict planetary motion until Copernicus devised something better.","body_html":"<div class=\"md\"><blockquote>\n<p>Wernher von Braun</p>\n</blockquote>\n\n<p>..both served his country in wartime and created a technology of great lasting benefit, unlike Tom Lehrer and perhaps (it remains to be seen) Mike Darwin. Mike, on the other hand, might easily have a future historical significance similar to that of Charles Babbage, whose computer was theoretically workable but entirely the wrong way to build a computing device - or maybe like Claudius Ptolemy, whose system of epicycles did at least serve to predict planetary motion until Copernicus devised something better.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/f499jzn/","name":"t1_f499jzn","created":1571488874,"created_utc":1571460074,"subreddit_name_prefixed":"r/cryonics","depth":4},{"ups":1,"link_id":"t3_cmm2ig","id":"f49b1kx","author":"Hobbit-Habit","parent_id":"t1_ewnffjo","subreddit_id":"t5_2r11d","body":"That quote from Pomerantsev could just as easily be about the United States with a few name changes and if we allow for the greater privatization and outsourcing of political control that is the norm here.","body_html":"<div class=\"md\"><p>That quote from Pomerantsev could just as easily be about the United States with a few name changes and if we allow for the greater privatization and outsourcing of political control that is the norm here.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/f49b1kx/","name":"t1_f49b1kx","created":1571489943,"created_utc":1571461143,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"ewcvuxu","author":"Portrait_Prophecies","parent_id":"t1_ewcr0l8","subreddit_id":"t5_2r11d","body":"The danger in seeking cryopreservation in Russia or China is that at any point their governments could decide cryonics is profane, and terminate the institute on a whim. At least in America, if the government wanted to do something like that they would need to go through significantly more red tape and backlash.\n\nSeeking cryopreservation in Russia or China also is potentially dangerous to LGBT people due to the current states of both nations. It would not be improbable for an LGBT person to be desecrated after preservation, or refused future revival, if the institute or government discovered that they were LGBT. This is a risk in general for LGBT people seeking cryopreservation but at least in America it is unlikely the future government itself will contest their revival all because of their romantic or gender alignment.\n\nWhat is really needed here is the establishment of a cryonics institution in a relatively safe place like America, with the institute being founded and funded by an extremely wealthy and passionate supporter of cryonics. So that any legal battles like these could be easily fought using a mere pittance of the founders mass wealth. Versus what seems to be happening here where, Alcor is forced to scrape up whatever it can from its members and donors all to fight a single legal battle. An institute that is supposed to be protecting the helpless, suspended lives of its members from oblivion needs to be a financial bulwark.","body_html":"<div class=\"md\"><p>The danger in seeking cryopreservation in Russia or China is that at any point their governments could decide cryonics is profane, and terminate the institute on a whim. At least in America, if the government wanted to do something like that they would need to go through significantly more red tape and backlash.</p>\n\n<p>Seeking cryopreservation in Russia or China also is potentially dangerous to LGBT people due to the current states of both nations. It would not be improbable for an LGBT person to be desecrated after preservation, or refused future revival, if the institute or government discovered that they were LGBT. This is a risk in general for LGBT people seeking cryopreservation but at least in America it is unlikely the future government itself will contest their revival all because of their romantic or gender alignment.</p>\n\n<p>What is really needed here is the establishment of a cryonics institution in a relatively safe place like America, with the institute being founded and funded by an extremely wealthy and passionate supporter of cryonics. So that any legal battles like these could be easily fought using a mere pittance of the founders mass wealth. Versus what seems to be happening here where, Alcor is forced to scrape up whatever it can from its members and donors all to fight a single legal battle. An institute that is supposed to be protecting the helpless, suspended lives of its members from oblivion needs to be a financial bulwark.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewcvuxu/","name":"t1_ewcvuxu","created":1565319923,"created_utc":1565291123,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ewabzks","author":"Portrait_Prophecies","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"You make it sound like now is a good time to seek cryopreservation elsewhere as Alcor is at risk of dissolution all over a single legal case. But where else would people go for cryopreservation? Alcor seems to be the largest and most reputable cryonics organization, with the actual Cryonics Institute trailing behind in popularity but being significantly more vulnerable and less professional by comparison. What other stable cryopreservation institutes even exist beyond those two?","body_html":"<div class=\"md\"><p>You make it sound like now is a good time to seek cryopreservation elsewhere as Alcor is at risk of dissolution all over a single legal case. But where else would people go for cryopreservation? Alcor seems to be the largest and most reputable cryonics organization, with the actual Cryonics Institute trailing behind in popularity but being significantly more vulnerable and less professional by comparison. What other stable cryopreservation institutes even exist beyond those two?</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewabzks/","name":"t1_ewabzks","created":1565269340,"created_utc":1565240540,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_cmm2ig","id":"ewmvwyu","author":"ARD227","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"How much did you donate, Mike?","body_html":"<div class=\"md\"><p>How much did you donate, Mike?</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewmvwyu/","name":"t1_ewmvwyu","created":1565590664,"created_utc":1565561864,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_cmm2ig","id":"ew7hgq3","author":"[deleted]","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew7hgq3/","name":"t1_ew7hgq3","created":1565220707,"created_utc":1565191907,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_cmm2ig","id":"ew3iulo","author":"starmanjones101","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"there is some concern about these matters, but you are being alarmist here","body_html":"<div class=\"md\"><p>there is some concern about these matters, but you are being alarmist here</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew3iulo/","name":"t1_ew3iulo","created":1565109913,"created_utc":1565081113,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_cmm2ig","id":"ewz2lgg","author":"ARD227","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"\"several sources?\" What a joke. You're not a journalist protecting a source. Your shizo ex-alcor employee is a terrible \"source\" just an FYI.","body_html":"<div class=\"md\"><p>&quot;several sources?&quot; What a joke. You&#39;re not a journalist protecting a source. Your shizo ex-alcor employee is a terrible &quot;source&quot; just an FYI.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewz2lgg/","name":"t1_ewz2lgg","created":1565919095,"created_utc":1565890295,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","replies":[{"ups":1,"link_id":"t3_cmm2ig","id":"ezbm2uc","author":"TouchyTheFish","parent_id":"t1_ewyetlm","subreddit_id":"t5_2r11d","body":"What was the issue in the Henderson case? The link to SA’s report doesn’t work. While the technical issues went over my head, I gather the problems with the initial perfusion were avoidable.","body_html":"<div class=\"md\"><p>What was the issue in the Henderson case? The link to SA’s report doesn’t work. While the technical issues went over my head, I gather the problems with the initial perfusion were avoidable.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ezbm2uc/","name":"t1_ezbm2uc","created":1567851106,"created_utc":1567822306,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"ewxoqos","author":"cryo-curious","parent_id":"t1_ew3nbd1","subreddit_id":"t5_2r11d","body":"> wildly disproportionate number of narcissists, sociopaths and even psychopaths who have swelled the ranks of cryonics over the years. And this does not even include those on the Asperger's spectrum (a low grade of sociopathy) and those with various personality disorders. \n\nThese people (especially the autism/aspergers lot) have what are essentially yet-incurable brain disorders. It's hardly their fault, and some of them no doubt recognize they are abnormal and are drawn to cryonics as a potential second chance at the normal, healthy existence their genes/environment deprived them of.\n\nI respect you very much, Mike, but this part of your post struck me as uncharacteristically short of empathy.","body_html":"<div class=\"md\"><blockquote>\n<p>wildly disproportionate number of narcissists, sociopaths and even psychopaths who have swelled the ranks of cryonics over the years. And this does not even include those on the Asperger&#39;s spectrum (a low grade of sociopathy) and those with various personality disorders. </p>\n</blockquote>\n\n<p>These people (especially the autism/aspergers lot) have what are essentially yet-incurable brain disorders. It&#39;s hardly their fault, and some of them no doubt recognize they are abnormal and are drawn to cryonics as a potential second chance at the normal, healthy existence their genes/environment deprived them of.</p>\n\n<p>I respect you very much, Mike, but this part of your post struck me as uncharacteristically short of empathy.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ewxoqos/","name":"t1_ewxoqos","created":1565893388,"created_utc":1565864588,"subreddit_name_prefixed":"r/cryonics","depth":2},{"ups":1,"link_id":"t3_cmm2ig","id":"f500g9v","author":"Hobbit-Habit","parent_id":"t1_ew3nbd1","subreddit_id":"t5_2r11d","body":"> Many, now maybe even most cryonicists, do not care about anyone but themselves. By this I mean that they have no, or minimal loving relationships with other human beings, or even with animals. They are loners, not because there are no people in the world who can understand and appreciate them, but because they are incapable of the deep empathy that is required to love and cherish others.  The recent discussion here of the revelations about Jeffery Epstein comes as no surprise to me, and I'm sure as no surprise to some others here. In fact, just a few days ago I was discussing Epstein by phone with another member of this list. He had raised the topic, not me. Similarly, it was he who pointed out the long and sordid history of sexual predators in cryonics -- people, not a few of whom make Jeffery Epstein look like a Boy Scout. As I noted in our conversation, the sexual predators are merely one manifestation of the wildly disproportionate number of narcissists, sociopaths and even psychopaths who have swelled the ranks of cryonics over the years. And this does not even include those on the Asperger's spectrum (a low grade of sociopathy) and those with various personality disorders. \n\nI only just saw this comment today! It makes my previous characterization of cryonicists a couple of days ago look like I was parotting Mike but I certainly was not. I learned of this subreddit early this week and my remarks were the first time I've expressed thoughts that I've had for many years now. I didn't know about the sexual predation, though.\n\nSo we *agree* on the nature of cryonicists but differ in our conclusions. Glad we settled that.\n\nMike has not argued against my conclusions:\n\nI claim that:\n\n1. Such human material cannot form any sort of community, let alone one lasting for the centuries required of the cryonics project.\n\n2. The motivations of cryonicists are also insufficient for community formation, even if the people were normal.\n\n3. Therefore the cryonics project will fail.\n\nMy conclusions are corroborated by the abundant *deja vu* I see on this forum. The discussions and hypotheticals are the same as on old cryonet. Now, according to eleitl, new cryonet is closing for the same reasons as the old one. The CCI people hardly talk to each other, let alone anyone outside their organization? Alcor is hemorraging members and the leadership's response is finger pointing? Mike's answer to me is rebuke me for my tone and try to identify me? Does anyone dispute my statement that cryonicists hardly ever look in the mirror for the source of their problems with other people?\n\nWhere we differ is that Mike is a \"coincidence theorist\" (think of the opposite of a conspiracy theorist): all of these problems just happen seemingly out of nowhere.\n\nBy contrast, my conclusion is that the problems are baked-in as a result of the types of people attracted to cryonics.","body_html":"<div class=\"md\"><blockquote>\n<p>Many, now maybe even most cryonicists, do not care about anyone but themselves. By this I mean that they have no, or minimal loving relationships with other human beings, or even with animals. They are loners, not because there are no people in the world who can understand and appreciate them, but because they are incapable of the deep empathy that is required to love and cherish others.  The recent discussion here of the revelations about Jeffery Epstein comes as no surprise to me, and I&#39;m sure as no surprise to some others here. In fact, just a few days ago I was discussing Epstein by phone with another member of this list. He had raised the topic, not me. Similarly, it was he who pointed out the long and sordid history of sexual predators in cryonics -- people, not a few of whom make Jeffery Epstein look like a Boy Scout. As I noted in our conversation, the sexual predators are merely one manifestation of the wildly disproportionate number of narcissists, sociopaths and even psychopaths who have swelled the ranks of cryonics over the years. And this does not even include those on the Asperger&#39;s spectrum (a low grade of sociopathy) and those with various personality disorders. </p>\n</blockquote>\n\n<p>I only just saw this comment today! It makes my previous characterization of cryonicists a couple of days ago look like I was parotting Mike but I certainly was not. I learned of this subreddit early this week and my remarks were the first time I&#39;ve expressed thoughts that I&#39;ve had for many years now. I didn&#39;t know about the sexual predation, though.</p>\n\n<p>So we <em>agree</em> on the nature of cryonicists but differ in our conclusions. Glad we settled that.</p>\n\n<p>Mike has not argued against my conclusions:</p>\n\n<p>I claim that:</p>\n\n<ol>\n<li><p>Such human material cannot form any sort of community, let alone one lasting for the centuries required of the cryonics project.</p></li>\n<li><p>The motivations of cryonicists are also insufficient for community formation, even if the people were normal.</p></li>\n<li><p>Therefore the cryonics project will fail.</p></li>\n</ol>\n\n<p>My conclusions are corroborated by the abundant <em>deja vu</em> I see on this forum. The discussions and hypotheticals are the same as on old cryonet. Now, according to eleitl, new cryonet is closing for the same reasons as the old one. The CCI people hardly talk to each other, let alone anyone outside their organization? Alcor is hemorraging members and the leadership&#39;s response is finger pointing? Mike&#39;s answer to me is rebuke me for my tone and try to identify me? Does anyone dispute my statement that cryonicists hardly ever look in the mirror for the source of their problems with other people?</p>\n\n<p>Where we differ is that Mike is a &quot;coincidence theorist&quot; (think of the opposite of a conspiracy theorist): all of these problems just happen seemingly out of nowhere.</p>\n\n<p>By contrast, my conclusion is that the problems are baked-in as a result of the types of people attracted to cryonics.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/f500g9v/","name":"t1_f500g9v","created":1571948413,"created_utc":1571919613,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"ew3jacu","author":"[deleted]","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ew3jacu/","name":"t1_ew3jacu","created":1565110571,"created_utc":1565081771,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_cmm2ig","id":"ex16fix","author":"ARD227","parent_id":"t3_cmm2ig","subreddit_id":"t5_2r11d","body":"If you say so. I say otherwise.","body_html":"<div class=\"md\"><p>If you say so. I say otherwise.</p>\n</div>","permalink":"/r/cryonics/comments/cmm2ig/alcors_appeal_for_money_to_support_litigation/ex16fix/","name":"t1_ex16fix","created":1565961150,"created_utc":1565932350,"subreddit_name_prefixed":"r/cryonics","depth":0}]}