{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Старший медицинский советник Alcor, д-р Стивен Б. Харрис, доктор медицинских наук, покинул пост старшего медицинского советника Фонда продления жизни Alcor. Доктор Харрис занимал этот пост в течение многих лет. Работа SMA заключается в том, чтобы консультироваться с Alcor, ее членами и их уполномоченным представителем по медицинским вопросам, связанным с крионикой, а также удовлетворять требованиям для приема своих пациентов в соответствии с [Законом об анатомических подарках Аризоны] (https: //uniformacts.uslegal). .com / Анатомический-дар-акт / Аризона-анатомический-дар-закон /) (AAGA). AAGA указывает, кто может получать анатомические подарки, и ограничивает их «организацией, занимающейся закупками органов, больницей, аккредитованной медицинской школой, стоматологической школой, колледжем, университетом, организацией, занимающейся закупками, или любым другим соответствующим лицом для исследований или образования». Поскольку Alcor не является таковым из них врач использовался в качестве легитимизирующего «любого другого подходящего человека». Интересно, что по состоянию на 24:00 29 августа 2019 года доктор Харрис все еще числится на веб-сайте Alcor как SMA.\n\nОтставка доктора Харриса наступила на фоне [судебного процесса] (https://www.vice.com/en_us/article/kzmkwn/this-man-is-suing-a-cryonics-organization-for-his-fathers-frozen- 1 миллион долларов) против Алькора, привезенного Куртом Пилгерамом, сыном одного из их пациентов с криоконсервацией, неизвестно, в какой степени иск Пилгерама учел решение доктора Харриса расстаться с Алькором, поскольку, как сообщается, было спорные разногласия с доктором Харрисом и доктором [Томом Вулвосом] (https://www.sharecare.com/doctor/dr-tom-a-wolvos), доктором медицины, общим хирургом, практикующим в Скоттсдейле, которого Алькор нанял более года назад, чтобы выполнить операцию по его криоконсервации пациентов.\n\nДоктор Харрис ранее ушел из Alcor и был одним из главных в расколе Alcor в [CryoCare] (http://www.cryocare.org/index.cgi), который произошел в 1993 году. Непосредственная причина для доктора Харриса отставка в то время была делом с участием члена Alcor и хорошо известного активиста по СПИДу. Участник, хотя ему был поставлен диагноз СПИД, все еще находился в добром здравии, когда его госпитализировали во Флориду с сепсисом. Врач, ухаживающий за этим пациентом, произвольно решил не лечить его от бактериальной инфекции, к которой он был допущен «потому что пациент в любом случае умрет от СПИДа»!\n\nДоктор Харрис стал участвовать в деле по просьбе Алькор и быстро определил, что у пациента было излечимое заболевание с возможностью дополнительного, неопределенного периода выживания до того, как СПИД покончил с собой. Однако Алькор уже развернул резервную группу, которая была создана в комнате пациента, и в этот момент стало известно, что пациент не имеет достаточного финансирования. В то время Таня Джонс, руководитель группы по отстранению от должности Алкора, решила, что решение о срочном лечении этого пациента угрожает целостности его процедур криоконсервации. Таким образом, этот случай представляет значительный интерес, поскольку в нем ставятся вопросы о том, какую роль крионические организации должны играть в здравоохранении своих членов, и обязан ли он действовать, пытаясь продлить жизнь своих членов / пациентов в медицинской ситуации, в которой член имеет разумные перспективы полного выздоровления и возможность, если не вероятность, прожить много месяцев или даже лет в достаточно хорошем здоровье. В этом случае пациент выздоровел, прожил еще два года и реализовал одну из своих главных жизненных целей, которая заключалась в завершении книги о лечении СПИДа под землей. Тем не менее, в результате этого инцидента он стал глубоко недоверчиво относиться к Алькору и крионике и не подвергался криоконсервации, когда в конце концов умер от осложнений, связанных со СПИДом.\n\nЗакулисное обсуждение этого дела между доктором Харрисом, представителями Alcor и Майком Дарвином доступно здесь: [https://drive.google.com/file/d/1BETQyz6hPdkd2ePVy5PrJRjh3gm-\\_n4t/view](https: //drive.google.com/file/d/1BETQyz6hPdkd2ePVy5PrJRjh3gm-_n4t/view)\n\nЭтот случай выдвинул на первый план одно из вторжений с медицинской и этической точек зрения, которые Алькор начал совершать в 1990-х годах, и первый из них подробно описан здесь: [https://alcor.org/cryonics/cryonics9304.pdf] (https: // alcor. org / cryonics / cryonics9304.pdf% 20pp.% 2016-19% 20and% 2019-21) С. 16-19 и 19-21.\n\nНиже приведен отрывок из того, что доктор Харрис сказал о деле в то время.\n\n* «Таким образом, когда дошло до того, что этот человек умирал в больнице от довольно излечимой (но не вылеченной) бактериальной инфекции, Алькор не знал, что вряд ли ему заплатят, если он умрет, и они заморозят его, и поэтому они послали команду крионики по всей стране, чтобы поддержать ее. * * Поскольку пациент был бессвязным, представитель Alcor попросил меня, как тогдашнего члена Alcor, поговорить (на большом расстоянии) с врачами мужчины и *\n\n* затем к его матери. * * Я сделал это. * * После чего я сказал матери правду, которая заключалась в том, что врачи Флориды (не имеющие отношения к Алькору) ничего не делали для ее сына, и что, если она хочет, чтобы ее сын покинуть больницу живым, ей придется внести изменения в его уход. * * Что она тогда и сделала, что позволило ему пережить эпизод. *\n\n* Я не виноват, что, когда представители «Алькора» прибыли в больницу после перелета через всю страну, мать пришла к выводу, что они были стервятниками в сговоре с бездетными врачами. Я, как член Alcor в то время, не говорил и не подразумевал этого. * * Если бы мать много лет назад имела возможность прочитать пост Козенцы 1996 года о том, что я «в то время не соглашался с людьми Alcor по поводу ценности получения» этот человек заморожен против получения *\n\n* ему медицинское обслуживание, - она, возможно, была бы более оправданной в отношении того, что она сделала. * * На самом деле, ничего более близкого к такому разногласию не было до позднего времени, и это задним числом. * * В то время Алкор был просто смущен тем, что был выброшенный из больничной палаты (и смутно сердитый на меня из-за этого), и еще позже еще более смущенный, что они почти заморозили человека без финансирования (что-то, что они сделали по ошибке несколько раз). * * Если правда была сказал, что в то время, когда обсуждаемый больной СПИДом находился в больнице, Алькор не знал достаточно, чтобы добиваться лучшего медицинского обслуживания *\n\n* этот человек, или еще хуже. * * Они были просто не в курсе. *\n\n* Это не означает, что Алькор когда-либо благодарил меня, хотя именно они попросили меня узнать правду и взять на себя роль врача. * * Но мама поблагодарила меня, и пациент позже тоже, после он вышел из больницы, как по телефону, так и в длинном письме с критикой поведения Алькора. * * Этот человек был автором, который был благодарен за возможность опубликовать свою книгу, книгу, которая, как он думал, даст ему немного денег. и немного жизни. * * Когда Алькор позже естественным образом потребовал, чтобы он исправил свое финансирование, чтобы в будущем им не пришлось иметь дело с его матерью, он полностью отказался от своей крионической политики. * * Я советовал, даже просил, чтобы он оставался подписанным с Alcor (CryoCare тогда еще не существовало), но он сказал, что ему осталось жить еще немало, и что для этого будет много времени. * * Я сказал ему как врачу, что это нереально, но он не верил мне. Так и происходит. * * Он умер примерно год спустя и не был заморожен. *\n\n* Некоторые партии в Алькоре, как и Козенца, обвиняли \\ * меня \\ * в том, что человек со СПИДом отказался от членства в Алькоре (не говоря уже о том, что нет никаких веских доказательств того, что у него когда-либо был разумный шанс быть, и оставайся замороженным). * * И они обвиняли меня тем более поздно, когда он не замерз. * * Deja vu-- это дело Лири снова и снова. * * Проблема в том, что как врач - врач крионики или не ... это моя этическая работа - давать людям выбор, и Алкору иногда не нравились выборы, которые сделали эти люди. * * Подобные вещи более трех лет назад были частью того, что в конечном итоге дало мне знать, что я и те, кто управлял Алькором, пришел к философскому разделению путей. * * Стало ясно, что мы никогда не можем смотреть на крионику одинаково, и мы должны были бы быть частью различных крионических организаций, если кто-то из нас высказал свое мнение. о крионике в *\n\n* all. * * И это часть истории основания CryoCare осенью 1993 года, которая произошла через много месяцев после инцидента, о котором мы говорим (и, кстати, в то время, когда человек со СПИДом, о котором говорил Козенца, все еще был жив и чувствует себя хорошо, наслаждаясь вечеринками по подписанию книг). * * - * * Steven B. Harris, MD ”*","title":"Старший медицинский советник Alcor подал в отставку","subreddit_name_prefixed":"r/cryonics","ups":13,"created":1567092777,"link_flair_background_color":"","id":"cwxlcr","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/cwxlcr/alcors_senior_medical_adviser_resigns/","url":"https://www.reddit.com/r/cryonics/comments/cwxlcr/alcors_senior_medical_adviser_resigns/","created_utc":1567063977}