{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"5 сентября 2019 года член Alcor A-1100 получил медицинскую и юридическую смерть в отсутствие какой-либо группы поддержки и стабилизации, несмотря на то, что Suspended Animation, Inc. заключил договор на оказание этой услуги. A-1100 был членом Alcor в течение 38 лет и выдал Alcor сотни тысяч долларов, чтобы поддержать хорошие местные возможности во Флориде. До прихода в Alcor он был одним из основателей Общества крионики Флориды и одним из сокращающихся числа первых когортных крионистов, которые зарегистрировались в конце 1960-х и начале 1970-х годов. Если кто-то и заслуживал быстрой и всесторонней стабилизации, это был А-1100. Вместо этого он получил не антикоагулянтные или церебропротективные препараты ** и, что самое шокирующее, фактически не охлаждение в промежутке между остановкой сердца и его прибытием в центр Скоттсдейл в Алькоре после отправки воздушным транспортом из аэропорта Майами-Дейд в учреждения Алькор в Скоттсдейл, Аризона. Температура его прибытия в Алькор была 20 градусов по Цельсию (68 градусов по Фаренгейту) немного ниже комнатной температуры! **\n\nЭто произошло из-за того, что сотрудники «Алькора» отвергли суждение давнего криониста Р.Н., который присутствовал в морге, когда пациент готовился к отправке. Ее призывы полностью погрузить пациента в лед были проигнорированы, чтобы «как можно скорее вылететь рейсом авиакомпании». Говоря более кратко, этот пациент Alcor был помещен в неизолированный металлический воздушный транспортный контейнер с только двумя десятифунтовыми (4,5 кг) пакетами водяного льда с обеих сторон его головы. В результате этого пациента перенесли приблизительно 8,5 часов \\ * часов сердечной ишемии.\n\nЭти случаи являются лишь верхушкой почти рутинных тяжелых ятрогенных событий, которым пациенты Алькор подвергались в течение последних 25 лет. Особенно раздражающим аспектом этого ятрогенеза является то, что одни и те же «ошибки» совершаются многократно, год за годом. Эти серьезные ятрогенные события происходили и продолжают происходить, потому что как в Alcor, так и в Suspended Animation работает персонал, чья нехватка подготовки и знаний о компетентной практике крионики превышает только их плохое суждение. До тех пор, пока приверженность профессионализму крионики не будет достигнута путем установления строгих, объективных априорных критериев для каждой фазы лечения, а также реализации углубленных (многолетних) программ обучения и сертификации для SST, криопротективной перфузии и долгосрочной криогенной помощи, ситуация будет только ухудшаться.\n\nЕще одна проблема - потрясающе некомпетентный менеджмент, который Alcor пережил за последние два с половиной десятилетия. Говорят, что рыба гниет с головы вниз, а в случае Алькора гниль явно прогрессировала до такой степени, что они не только часто оттаивают пациентов во время транспортировки, они даже не охлаждают их. A-1100 и все другие пациенты Alcor, которые подверглись ненужному и небрежному вреду, заслуживают лучшего. Как недавно заметил один давний участник Alcor, «не имеет значения, кто вы, какой вклад вы внесли в крионику, насколько вы любимы в сообществе Alcor или крионике, с кем вы дружили или даже если Вы - президент Alcor, ваши шансы получить даже достойную работу по криоконсервации являются как стохастическими, так и очень низкими ».\n\nЕще одна проблема - потрясающе некомпетентный менеджмент, который Alcor пережил за последние два с половиной десятилетия. Говорят, что рыба гниет с головы вниз, а в случае Алькора гниль явно прогрессировала до такой степени, что они не только часто оттаивают пациентов во время транспортировки, они даже не охлаждают их. A-1100 и все другие пациенты Alcor, которые были подвергнуты иглам и небрежному вреду, заслуживают лучшего. Как недавно заметил один давний член Alcor: «Неважно, кто вы, какой вклад вы внесли в крионику, насколько вы любимы в сообществе Alcor или крионике, с кем вы дружили или даже если Вы - президент Alcor, ваши шансы получить даже достойную работу по криоконсервации являются как стохастическими, так и очень низкими ».\n\nНа протяжении десятилетий известно, что проблема отсутствия обратной связи является проблемой для крионики. Тем не менее, в этих случаях у Alcor была определенная обратная связь, о чем свидетельствует перечисление их некомпетентных ошибок в их собственных отчетах и резюме. ** Нет, проблема не в отсутствии обратной связи, а в отсутствии наказания и дорогостоящей обратной связи, как это было бы в случае, если бы эти ошибки были причинены пациентам в больнице. ** Победа или поражение, иск Пилгерама является вторым дорогостоящим и получение обратной связи, которая пришла на пути Алькора, предыдущий был разгромом Теда Уильямса. Таким образом, вопрос заключается не в том, переживет ли Alcor еще один дорогостоящий и разрушающий имидж кризис из-за их небрежности и некомпетентности, а в том, когда. Как я сказал Совету Alcor во время их Ежегодного открытого заседания Совета директоров несколько дней назад: «Если бы вы сделали то, что сделали со своими пациентами-криониками, с живыми людьми в медицинских учреждениях, вы бы все были в тюрьме!»\n\n\\ * \\ [Грубые оценки минимального времени доставки на объекты Alcor с момента объявления судебно-медицинской смерти: время объявления до вылета рейса оценивается как минимум в 1,5 часа. Предполагая беспосадочный перелет из Майами в Феникс, предполагаемое время полета составляет 5 часов, и еще 2 часа требуется, чтобы забрать пациента из воздушного транспорта и доставить его в Алькор, где может начаться охлаждение. Это составляет в сумме минимум 8,5 часов нормотермического и теплого ишемического времени. \\]","title":"Может ли Алькор ухудшиться?","subreddit_name_prefixed":"r/cryonics","ups":34,"created":1568998549,"link_flair_background_color":"","id":"d6s41b","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/","url":"https://www.reddit.com/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/","created_utc":1568969749,"replies":[{"ups":12,"link_id":"t3_d6s41b","replies":[{"ups":4,"link_id":"t3_d6s41b","id":"f0xf3tv","author":"Cryonics-01","parent_id":"t1_f0x04dx","subreddit_id":"t5_2r11d","body":"I agree. This is the least real cryonics members should do who want to literally become immortal in the future and experience the future. Especially if they are old. Even if the areas suck or whatever. When I'm old, I'd be willing to be cryopreserved alive. It's like when warriors end their own lives just before they would be tortured for whatever reason. It's the better and more honorable option.","body_html":"<div class=\"md\"><p>I agree. This is the least real cryonics members should do who want to literally become immortal in the future and experience the future. Especially if they are old. Even if the areas suck or whatever. When I&#39;m old, I&#39;d be willing to be cryopreserved alive. It&#39;s like when warriors end their own lives just before they would be tortured for whatever reason. It&#39;s the better and more honorable option.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0xf3tv/","name":"t1_f0xf3tv","created":1569059461,"created_utc":1569030661,"subreddit_name_prefixed":"r/cryonics","depth":2},{"ups":2,"link_id":"t3_d6s41b","replies":[{"ups":5,"link_id":"t3_d6s41b","id":"f0xdqwh","author":"Michael-G-Darwin","parent_id":"t1_f0xc3sv","subreddit_id":"t5_2r11d","body":"What makes you think things would be any better for *you* if you lived close proximity to Alcor? The decision not pack this patient in ice was made *by Alcor* in Scottsdale. It always amazes me when \"the patient is always at fault\" apologists, such as you, fail to see that repeated errors of this magnitude are an inescapable sign that something, indeed many things, are profoundly wrong at Alcor. This blaming the patient is reminiscent of what quacks and faith healers do when their \"miracles\" fail to materialize. \"You didn't have enough faith\", \"You didn't do this treatment soon enough or you did it wrong\". That's the standard party line for trying to escape responsibility for your own bad acts.","body_html":"<div class=\"md\"><p>What makes you think things would be any better for <em>you</em> if you lived close proximity to Alcor? The decision not pack this patient in ice was made <em>by Alcor</em> in Scottsdale. It always amazes me when &quot;the patient is always at fault&quot; apologists, such as you, fail to see that repeated errors of this magnitude are an inescapable sign that something, indeed many things, are profoundly wrong at Alcor. This blaming the patient is reminiscent of what quacks and faith healers do when their &quot;miracles&quot; fail to materialize. &quot;You didn&#39;t have enough faith&quot;, &quot;You didn&#39;t do this treatment soon enough or you did it wrong&quot;. That&#39;s the standard party line for trying to escape responsibility for your own bad acts.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0xdqwh/","name":"t1_f0xdqwh","created":1569058274,"created_utc":1569029474,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f0xb3ck","author":"WarAndGeese","parent_id":"t1_f0x04dx","subreddit_id":"t5_2r11d","body":"No way, it shouldn't be a requirement that people live and die in Arizona near the Alcor facility for them to be cryopreserved. There will always be reasons to leave the area and risks people have to take, whether it's to visit family or something else, and we need ways to ensure that even they can be cared for properly. Even if he was far from Arizona it looks like his body was not handled properly at all. Of course chances would be better if people were in Scottsdale and spent all of their time there, but the blame here isn't on him.","body_html":"<div class=\"md\"><p>No way, it shouldn&#39;t be a requirement that people live and die in Arizona near the Alcor facility for them to be cryopreserved. There will always be reasons to leave the area and risks people have to take, whether it&#39;s to visit family or something else, and we need ways to ensure that even they can be cared for properly. Even if he was far from Arizona it looks like his body was not handled properly at all. Of course chances would be better if people were in Scottsdale and spent all of their time there, but the blame here isn&#39;t on him.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0xb3ck/","name":"t1_f0xb3ck","created":1569055962,"created_utc":1569027162,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f0ves83","author":"WarAndGeese","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"Maybe we need more organisations doing this, and to establish a rigorous set of standards to follow from when someone is close to death until they are preserved.","body_html":"<div class=\"md\"><p>Maybe we need more organisations doing this, and to establish a rigorous set of standards to follow from when someone is close to death until they are preserved.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0ves83/","name":"t1_f0ves83","created":1569007835,"created_utc":1568979035,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":8,"link_id":"t3_d6s41b","id":"f0vshhq","author":"prestigeworldwyd","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"I mean, I think it boils down to the living don't care about the \"dead\". From all the horror stories I've heard about this stuff it just sounds like these places employ people who really don't care about any of this. They probably took it cause it was a job and they don't have any other options and or they are trashy people who only care about themselves. Like a dbag working the night shift at a morgue, he doesn't care about them, they're just meat. That's how you end up hiring people who don't take their job seriously and don't even believe in any of this stuff. \n\nI've often wondered what it would take to set up a private cryo facility just for yourself. I imagine you'd have to have a lot of money to set it up and have it in a private location that cannot be legally disturbed even after your death. Then you'd still have the problem of paying someone to watch it and maintain it, which means you still run the risk of getting someone who doesn't really care in the end. Maybe if it could be a private hidden facility that it 100 percent automated it could work, but nothing is that reliable, plus no one would know to revive you.","body_html":"<div class=\"md\"><p>I mean, I think it boils down to the living don&#39;t care about the &quot;dead&quot;. From all the horror stories I&#39;ve heard about this stuff it just sounds like these places employ people who really don&#39;t care about any of this. They probably took it cause it was a job and they don&#39;t have any other options and or they are trashy people who only care about themselves. Like a dbag working the night shift at a morgue, he doesn&#39;t care about them, they&#39;re just meat. That&#39;s how you end up hiring people who don&#39;t take their job seriously and don&#39;t even believe in any of this stuff. </p>\n\n<p>I&#39;ve often wondered what it would take to set up a private cryo facility just for yourself. I imagine you&#39;d have to have a lot of money to set it up and have it in a private location that cannot be legally disturbed even after your death. Then you&#39;d still have the problem of paying someone to watch it and maintain it, which means you still run the risk of getting someone who doesn&#39;t really care in the end. Maybe if it could be a private hidden facility that it 100 percent automated it could work, but nothing is that reliable, plus no one would know to revive you.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0vshhq/","name":"t1_f0vshhq","created":1569019491,"created_utc":1568990691,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":8,"link_id":"t3_d6s41b","replies":[{"ups":4,"link_id":"t3_d6s41b","replies":[{"ups":5,"link_id":"t3_d6s41b","replies":[{"ups":1,"link_id":"t3_d6s41b","id":"f1d5m33","author":"Althea_Garrison","parent_id":"t1_f1d54jg","subreddit_id":"t5_2r11d","body":"You sold me","body_html":"<div class=\"md\"><p>You sold me</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1d5m33/","name":"t1_f1d5m33","created":1569403295,"created_utc":1569374495,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f1d4wji","author":"Michael-G-Darwin","parent_id":"t1_f1d4oj7","subreddit_id":"t5_2r11d","body":"Part 4 of 6\n\n<MD: “\\[Wolvos\\]” reportedly has a reputation for arrogance, brusque and rude treatment of Alcor personnel and little if any knowledge about the theory and practice of cryonics.”\n\nFALSE. Wolvos recently received a prize in surgical leadership at Harvard. He has done numerous surgeries at Alcor. He has never shown arrogance and rudeness. You are probably thinking of an incident that someone illegally leaked to you in which Dr. Wolvos and Dr. Harris disagreed about a relatively minor matter. Dr. Harris had a fit and terminated the call.>\n\nWhat you said is NOT inconsistent with what I said. Wolvos can be a great surgeon and have no idea of how to properly conduct cryopreservations. I have had several people say the same thing about Wolvos’ behavior at Alcor and I believe them in no small measure because of the ugly specifics. I also could care less if he was awarded the Mother Teresa Seal of Compassion and Kindness. You’re in dialogue with a guy who has worked with surgeons and who still knows many well. Try selling that soap to someone who might buy it.\n\n<MS: “Wolvos was on the phone to the local mortician and ordered him to ship the patient with or without additional ice.”\n\nFALSE. That is not remotely true.>\n\nI believe that you are likely correct and that I was most likely given incorrect information about this. I’ve checked with my source and have been told that they may have misinterpreted what they observed. If this is the case, then I apologize for the error. I would also point out that had Alcor’s second closed session of the that “open” Board meeting not have been held in private, and were not Alcor personnel in fear of reprisal by Alcor for the all-encompassing NADs they have signed, neither you or I would be speculating about any of this, *because it would all be out in the open. Note to Alcor: It’s still not too late put it out in the open.*\n\n<“It had to do with an old man who would not move to arizona, where alcor is located. Why did he not do that? Probably because of family pressures.”\n\nMD: “No, it was not due to \"family pressures\", his sons are long-time cryonicists.”\n\nWRONG.\n\nBeing long-time cryonicists does not mean they don’t do things wrong, i.e. not in the interests of the patient. He was seriously underfunded, and the family refused to take care of it. They would not move him to Scottsdale. And they directly refused to pay for a charter flight. That would have removed any time pressure (to make the commercial flight) and allowed proper medication – and hopefully cooling.>\n\nThis sounds so reasonable until you know that this member had been in declining health and suffering from dementia for years. Why should he have felt the need to move to Scottsdale, when Alcor has SA, or even known that Alcor has begun recommending this? Does Alcor keep in touch with its members, even its high profile, high loyalty, and highly contributing ones, in order to have the barest idea of what their health and cognitive status is? No. Pick your DPAHC (aka power of attorney for health care) and your family *carefully* because that’s all you’ve got. And that, I would add, is a damn difficult thing to do.\n\nIf Alcor had any ongoing outreach and communication with its members, especially with its elderly and high-risk members, then it is more likely than not that “that would have removed any time pressure” when situations like this occur. It would allow for Alcor to counsel its elderly members in the earliest stages of their decline and to begin building a relationship with their families and/or DPAHCs thus allowing them to gradually build trust and confidence in Alcor and giving them time to absorb the reasons for requests for tens of thousands of dollars in additional funding, or for \\~$40K air ambulance services. Cryonicists or not, no one is well-positioned to be confronted with such requests/demands when the member is dying. This is common sense stuff and it was what Alcor used to do.\n\nFive years ago, I asked the Alcor Membership Coordinator if Alcor maintained a spreadsheet cataloging their early elderly (65 through 74 years old), their late elderly (75+) and their high-risk members and if they had a procedure for regular wellness checks on these members? She looked at me as if I was out of my mind. Thus, it’s a good bet that Alcor has no idea what fraction of their members even fall into one of these categories, and if they know don’t know, then none of the rest of us do either. Eight of Alcor’s eleven employees are administrative. If we arbitrarily assume that 20% of Alcor’s 1,269 members fall into one of these categories, which is 254 members (a very high estimate), and it is further assumed that doing this kind of interface requires \\~3 man-hours per member per year, then that would work out to 762 man-hours, or 19.05 5-day man-work weeks per year. Round that up to a month of full-time work and it is still eminently do-able. Alcor once did this and it used a mix of trained volunteers and full-time staff (for the high-risk members). This used to be something that older Alcor members enjoyed doing. Now it’s doubtful that anyone at Alcor even remembers this.\n\nI am a medical-technical person, so I see most and focus most on Alcor’s deficiencies in these areas. It be would a mistake to assume that those things are all that is wrong with Alcor. As I’ve said repeatedly here and elsewhere, Alcor’s problems are deep and **multisystemic**; the technical issues are just the tip of a much larger iceberg of problems.\n\n<MD: “If all of Alcor has a lick of sense you would ask for my help in solving these horrific problems rather than considering me \"the enemy trying to destroy your cryonics organization\".”\n\nDarwin has not been able to help cryonics organizations for decades. No one can tolerate working with him. Darwin has declared himself as the enemy. He has threatened to destroy Alcor. He has sided with the evil relative of a patient who wants to exact revenge on his father by thawing him out and destroying him. He has publicly stated that he will “take you down”. Darwin is not here to help.\n\nDarwin mentions only the worst outcomes. Never mention the many good outcomes or the major effort required to bring them about. That should tell you something about his agenda.>\n\nWhat I said was that I was intent upon stopping Alcor from continuing to misrepresent what they are and to do the harm they are doing. Brian Wowk hysterically told me that I was “trying to destroy Alcor”. That’s not what I said and certainly not what I meant. What I believe must be done is to stop Alcor from recruiting members and patients under false pretenses as the fee-for-service organization it has become. The genuine scientific-educational work that Alcor does is negligible per its own financials and I certainly don’t see much evidence that they are charitable – **you’d better have the money, or else**, as this case clearly demonstrates. Doing this only equates to the destruction of Alcor if Alcor continues on its present course. **Only Alcor can destroy Alcor.**","body_html":"<div class=\"md\"><p>Part 4 of 6</p>\n\n<p>&lt;MD: “[Wolvos]” reportedly has a reputation for arrogance, brusque and rude treatment of Alcor personnel and little if any knowledge about the theory and practice of cryonics.”</p>\n\n<p>FALSE. Wolvos recently received a prize in surgical leadership at Harvard. He has done numerous surgeries at Alcor. He has never shown arrogance and rudeness. You are probably thinking of an incident that someone illegally leaked to you in which Dr. Wolvos and Dr. Harris disagreed about a relatively minor matter. Dr. Harris had a fit and terminated the call.&gt;</p>\n\n<p>What you said is NOT inconsistent with what I said. Wolvos can be a great surgeon and have no idea of how to properly conduct cryopreservations. I have had several people say the same thing about Wolvos’ behavior at Alcor and I believe them in no small measure because of the ugly specifics. I also could care less if he was awarded the Mother Teresa Seal of Compassion and Kindness. You’re in dialogue with a guy who has worked with surgeons and who still knows many well. Try selling that soap to someone who might buy it.</p>\n\n<p>&lt;MS: “Wolvos was on the phone to the local mortician and ordered him to ship the patient with or without additional ice.”</p>\n\n<p>FALSE. That is not remotely true.&gt;</p>\n\n<p>I believe that you are likely correct and that I was most likely given incorrect information about this. I’ve checked with my source and have been told that they may have misinterpreted what they observed. If this is the case, then I apologize for the error. I would also point out that had Alcor’s second closed session of the that “open” Board meeting not have been held in private, and were not Alcor personnel in fear of reprisal by Alcor for the all-encompassing NADs they have signed, neither you or I would be speculating about any of this, <em>because it would all be out in the open. Note to Alcor: It’s still not too late put it out in the open.</em></p>\n\n<p>&lt;“It had to do with an old man who would not move to arizona, where alcor is located. Why did he not do that? Probably because of family pressures.”</p>\n\n<p>MD: “No, it was not due to &quot;family pressures&quot;, his sons are long-time cryonicists.”</p>\n\n<p>WRONG.</p>\n\n<p>Being long-time cryonicists does not mean they don’t do things wrong, i.e. not in the interests of the patient. He was seriously underfunded, and the family refused to take care of it. They would not move him to Scottsdale. And they directly refused to pay for a charter flight. That would have removed any time pressure (to make the commercial flight) and allowed proper medication – and hopefully cooling.&gt;</p>\n\n<p>This sounds so reasonable until you know that this member had been in declining health and suffering from dementia for years. Why should he have felt the need to move to Scottsdale, when Alcor has SA, or even known that Alcor has begun recommending this? Does Alcor keep in touch with its members, even its high profile, high loyalty, and highly contributing ones, in order to have the barest idea of what their health and cognitive status is? No. Pick your DPAHC (aka power of attorney for health care) and your family <em>carefully</em> because that’s all you’ve got. And that, I would add, is a damn difficult thing to do.</p>\n\n<p>If Alcor had any ongoing outreach and communication with its members, especially with its elderly and high-risk members, then it is more likely than not that “that would have removed any time pressure” when situations like this occur. It would allow for Alcor to counsel its elderly members in the earliest stages of their decline and to begin building a relationship with their families and/or DPAHCs thus allowing them to gradually build trust and confidence in Alcor and giving them time to absorb the reasons for requests for tens of thousands of dollars in additional funding, or for ~$40K air ambulance services. Cryonicists or not, no one is well-positioned to be confronted with such requests/demands when the member is dying. This is common sense stuff and it was what Alcor used to do.</p>\n\n<p>Five years ago, I asked the Alcor Membership Coordinator if Alcor maintained a spreadsheet cataloging their early elderly (65 through 74 years old), their late elderly (75+) and their high-risk members and if they had a procedure for regular wellness checks on these members? She looked at me as if I was out of my mind. Thus, it’s a good bet that Alcor has no idea what fraction of their members even fall into one of these categories, and if they know don’t know, then none of the rest of us do either. Eight of Alcor’s eleven employees are administrative. If we arbitrarily assume that 20% of Alcor’s 1,269 members fall into one of these categories, which is 254 members (a very high estimate), and it is further assumed that doing this kind of interface requires ~3 man-hours per member per year, then that would work out to 762 man-hours, or 19.05 5-day man-work weeks per year. Round that up to a month of full-time work and it is still eminently do-able. Alcor once did this and it used a mix of trained volunteers and full-time staff (for the high-risk members). This used to be something that older Alcor members enjoyed doing. Now it’s doubtful that anyone at Alcor even remembers this.</p>\n\n<p>I am a medical-technical person, so I see most and focus most on Alcor’s deficiencies in these areas. It be would a mistake to assume that those things are all that is wrong with Alcor. As I’ve said repeatedly here and elsewhere, Alcor’s problems are deep and <strong>multisystemic</strong>; the technical issues are just the tip of a much larger iceberg of problems.</p>\n\n<p>&lt;MD: “If all of Alcor has a lick of sense you would ask for my help in solving these horrific problems rather than considering me &quot;the enemy trying to destroy your cryonics organization&quot;.”</p>\n\n<p>Darwin has not been able to help cryonics organizations for decades. No one can tolerate working with him. Darwin has declared himself as the enemy. He has threatened to destroy Alcor. He has sided with the evil relative of a patient who wants to exact revenge on his father by thawing him out and destroying him. He has publicly stated that he will “take you down”. Darwin is not here to help.</p>\n\n<p>Darwin mentions only the worst outcomes. Never mention the many good outcomes or the major effort required to bring them about. That should tell you something about his agenda.&gt;</p>\n\n<p>What I said was that I was intent upon stopping Alcor from continuing to misrepresent what they are and to do the harm they are doing. Brian Wowk hysterically told me that I was “trying to destroy Alcor”. That’s not what I said and certainly not what I meant. What I believe must be done is to stop Alcor from recruiting members and patients under false pretenses as the fee-for-service organization it has become. The genuine scientific-educational work that Alcor does is negligible per its own financials and I certainly don’t see much evidence that they are charitable – <strong>you’d better have the money, or else</strong>, as this case clearly demonstrates. Doing this only equates to the destruction of Alcor if Alcor continues on its present course. <strong>Only Alcor can destroy Alcor.</strong></p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1d4wji/","name":"t1_f1d4wji","created":1569402769,"created_utc":1569373969,"subreddit_name_prefixed":"r/cryonics","depth":4},{"ups":1,"link_id":"t3_d6s41b","replies":[{"ups":1,"link_id":"t3_d6s41b","id":"f1i7m41","author":"anon_cryo","parent_id":"t1_f1hhia8","subreddit_id":"t5_2r11d","body":"if what you say is correct, then both alcor and CI are looking at a bust sometime in the future...or they would have to terminate a large number of underfunded member...media scandal in the making...\n\nso what would the costs be under this hypothetical alternative model:\na group of 32 cryonics members (some or many of them age 62 or older) put $20k each into a pool.\n\nThat gives them a total of $640k.\n\nWith the funds they buy an old house for $25k, which they convert to a church. Eastern oklahoma has many such homes for sale. Older homes that have a basement or crawlspace.\n\nThey then spend $200k to buy 8 houses in the nearby area. The members then live 4 to a house. The over-62 age group use their social security money to fund the basic operation of the church and the food and utilities etc of the house.  The younger members do the labor and care for the older members when they are incapacitated, elderly, bedridden, etc.\n\nWhat labor? Whatever needs to be done. Such as excavating the basement of the church. That is where the neuro patients will be stored. Down low where the tornadoes etc cannot get to them.\n\nThis cryo-monastery with cryo-monks would take advantage of home burial laws in oklahoma and other red states. Decapitate the body, do a neuro, and burn the body. Spread the ashes in the nearby river. All legal, perhaps. \n\nThe tenets of this cryonics religion adhere to certain bible verses that command christians to raise the dead and die like jesus (without decay). The decapitation, cremation, cryopreservation etc are all mandated rituals of this proposed religion.\n\nThe rest of the approx $400k initial funds pool is used to cheaply purchase the equipment needed to do a basic neuro cryopreservation, and the rest would be invested conservatively in treasury bonds, allowing for the purchase of LN2 etc.\n\nThe church operations would be to a great degree shielded by laws and tradition which favor churches and religion.\n\nSimilar churches could be in operation in favorable states all over america...new members would have to buy in with $20k or whatever...","body_html":"<div class=\"md\"><p>if what you say is correct, then both alcor and CI are looking at a bust sometime in the future...or they would have to terminate a large number of underfunded member...media scandal in the making...</p>\n\n<p>so what would the costs be under this hypothetical alternative model:\na group of 32 cryonics members (some or many of them age 62 or older) put $20k each into a pool.</p>\n\n<p>That gives them a total of $640k.</p>\n\n<p>With the funds they buy an old house for $25k, which they convert to a church. Eastern oklahoma has many such homes for sale. Older homes that have a basement or crawlspace.</p>\n\n<p>They then spend $200k to buy 8 houses in the nearby area. The members then live 4 to a house. The over-62 age group use their social security money to fund the basic operation of the church and the food and utilities etc of the house.  The younger members do the labor and care for the older members when they are incapacitated, elderly, bedridden, etc.</p>\n\n<p>What labor? Whatever needs to be done. Such as excavating the basement of the church. That is where the neuro patients will be stored. Down low where the tornadoes etc cannot get to them.</p>\n\n<p>This cryo-monastery with cryo-monks would take advantage of home burial laws in oklahoma and other red states. Decapitate the body, do a neuro, and burn the body. Spread the ashes in the nearby river. All legal, perhaps. </p>\n\n<p>The tenets of this cryonics religion adhere to certain bible verses that command christians to raise the dead and die like jesus (without decay). The decapitation, cremation, cryopreservation etc are all mandated rituals of this proposed religion.</p>\n\n<p>The rest of the approx $400k initial funds pool is used to cheaply purchase the equipment needed to do a basic neuro cryopreservation, and the rest would be invested conservatively in treasury bonds, allowing for the purchase of LN2 etc.</p>\n\n<p>The church operations would be to a great degree shielded by laws and tradition which favor churches and religion.</p>\n\n<p>Similar churches could be in operation in favorable states all over america...new members would have to buy in with $20k or whatever...</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1i7m41/","name":"t1_f1i7m41","created":1569535847,"created_utc":1569507047,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f1ddxng","author":"anon_cryo","parent_id":"t1_f1d4oj7","subreddit_id":"t5_2r11d","body":"> First of all, unless there is now a legal precedent that I'm unaware of, Alcor should be bound by the agreements of the payment that it signed when it accepted these members however, this requires a separate discussion if you want to get into why this isn't or shouldn't be the case. I know for a fact that Alcor’s past CEOs gave members their assurance \"they would never raise prices\" on them and would take care of them, regardless of prices changes over the years.\n\nwhich raises a good question: is/was there a clause in member contracts allowing alcor to unilaterally raise the 'benefit payable on death' amount?","body_html":"<div class=\"md\"><blockquote>\n<p>First of all, unless there is now a legal precedent that I&#39;m unaware of, Alcor should be bound by the agreements of the payment that it signed when it accepted these members however, this requires a separate discussion if you want to get into why this isn&#39;t or shouldn&#39;t be the case. I know for a fact that Alcor’s past CEOs gave members their assurance &quot;they would never raise prices&quot; on them and would take care of them, regardless of prices changes over the years.</p>\n</blockquote>\n\n<p>which raises a good question: is/was there a clause in member contracts allowing alcor to unilaterally raise the &#39;benefit payable on death&#39; amount?</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1ddxng/","name":"t1_f1ddxng","created":1569409844,"created_utc":1569381044,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f1d4bpr","author":"Michael-G-Darwin","parent_id":"t1_f1d3pn9","subreddit_id":"t5_2r11d","body":"Part 2 of 5\n\nSo, what actually happened to A-1100 and who is responsible? The easiest and most righteous answer to that question is that Alcor is responsible, not only because they are in fact where the buck stops, but also because they employed SA to care for this patient despite being fully aware of SA’s grossly unsatisfactory performance in virtually every SA case where SST was performed. If performing blood washout on a whole-body cryopreservation patient using a 20 L bag of perfusate [perched atop a step ladder](https://alcor.org/Library/pdfs/AlcorCaseReportA2889MarkLeeMiller.pdf) isn’t reason enough to conclude that SA is incompetent, negligent, or both, then what is? As I said at the start here, I don’t need to lie because the truth is so absurdly incompetent and negligent that I couldn’t make it up if I tried. I don’t have that wild of an imagination.\n\nBeyond this basic observation, responsibility can only be assigned on the basis of the few facts I have, in addition to your own sad account given here. I’ve made a lot of calls and done a lot of research and this narrative is what I believe reasonably reflects the facts. Since you claim to have inside information (which could only come from Alcor or SA) I trust you will correct or expand on anything I have gotten wrong.\n\nTaking some certainties I know about the timeline, and working backward and forwards, it seems likely that the patient was pronounced around 12 pm EDT with no one in attendance but family. After countless calls, I’ve been able to determine that the patient was removed from the hospice unit of the hospital where he was pronounced at approximately 12:45 pm PDT and arrived at the Kallis Funeral Home in Willow Manor, FL, at about 1:15 pm PDT. There were only two flights out of MIA to PHX which could have accommodated this patient after 1:00 pm and both would have required departure from the mortuary not much later than 2:00 pm PDT. The most likely fight would have arrived at PHX at 7:15 pm MST.\n\nWhile it is true that the FRN was only instructed to get either 20, or 40 pounds of ice, depending upon whether you believe Alcor’s Hugh Hixon, or you, the context of that order and who gave it have not been made clear. I have been told, reliably I believe, that the FRN arrived at funeral home either a few minutes before or after the patient did. The bags of ice she was instructed to procure were never meant to be the sole source of refrigeration because the SA vehicle, which had been accessed and was driven to the mortuary by a relative of the patent’s son, contained at least 120 lbs. of ice, in addition to the stabilization medications. It was thus clearly the plan that the FRN would administer the medications, probably via SA’s preferred route of intraosseous access, do some chest compressions and then pack the patient in ice for air shipment to Alcor.\n\nWho countermanded these orders?  There are at least two accounts of who was responsible: Chris Divvers, Alcor’s Medical Response Director, or Sayer Johansen of SA. Divvers, BTW, must have been terminated (for cause) by Alcor right around the time he issued the instructions to proceed with shipping the patient “as is” and not to wait for the arrival of the SA vehicle that could have been no more than a few minutes behind the patient’s arrival (which indeed turned out to be the case). Even if the patient had been packed in the combined 120 lbs. (54 kg), or 160 lbs. (73 kg) of ice, it is unlikely it would have kept him adequately refrigerated in an uninsulated metal air-shipper sitting inside a standard cardboard and wood airline air-shipping tray. For instance, it takes 28-30 kg of ice to cool a 70 kg man who is at \\~36 degrees C to 2-4 degrees C and the ice consumption due to the heat leak into the shipper over an 8-9-hour period would have required in the vicinity of another 70 kg of ice, for a total of \\~100 kg of ice versus the 73 kg of ice that SA had acquired for the shipping of this patient, see: [http://chronopause.com/chronopause.com/index.php/2011/06/28/commercial-air-transport-of-the-cryopreservation-patient/index.html](http://chronopause.com/chronopause.com/index.php/2011/06/28/commercial-air-transport-of-the-cryopreservation-patient/index.html)I have reason to believe that Alcor's Board, because of a previous patient having been thawed out during a flight to Phoenix, has forbidden shipping patients in spur-of-the-moment shipping containers, demanding instead that the perfused and frozen patient be held at the local facility until a proper shipping container can be overnighted to them. How many times do they have to keep repeating these mistakes?\n\nI can only imagine the chaos of the communications between these three functionally, geographically and, in the case of SA and Alcor, highly antagonistic entities. I know the latter because I was sitting in the restaurant in the Thunderbird and overhead the discussion between the FRN, Ben Best, Houston Westfall and Ryan Levesque about their upcoming negotiations vis a vis SA and Alcor’s contract renewal with Alcor’s Brian Wowk. Judging from the conversation (which I could hear clearly) these three were to be the ones setting terms and conditions with Alcor, not because they were SA Officers or Directors, but because they (or at least Best, Westfall and the FRN) represented BRLS, which is clearly higher up on the food chain than whoever putatively controls SA. It was very clear to me from this conversation that neither side had much use for the other and the negotiations were expected to difficult at best.\n\nThis is all relevant because it shows that A-1100 was being handled by multiple entities that were either adversarial and/or were clearly not in good communication, and none of which were following their own SOPs. Not even the wonder-communication facilitation app that Divvers recently touted in Alcor News [Slack](https://slack.com/) could have done much to resolve the snarl in this situation, where everybody was the boss, and thus no one was. This is the classic [“Swiss cheese” failure model](https://en.wikipedia.org/wiki/Swiss_cheese_model), except on steroids. If only there hadn’t been hurricane Dorian (but there was), if only Divvers or Johansen had known that the patient had only 20 (or 40) pounds of ice on him when the order was given to ship him (but they didn’t), if only the family had been willing to move a dying in man in hospice care to an unspecified “somewhere safe” and to do so under their own steam in the midst of the trauma attending his dying, not mention and a cat5 hurricane that was bearing down on them (but they weren’t), and if only the order hadn’t been given by Westfall to evacuate the SA SST personnel and disable SA’s STT capability for the duration (but it was), *then everything would have turned out OK*. Really, you expect us to believe that as a credible escape from the responsibility for what happened to A-1100? Really?\n\nCONTINUED","body_html":"<div class=\"md\"><p>Part 2 of 5</p>\n\n<p>So, what actually happened to A-1100 and who is responsible? The easiest and most righteous answer to that question is that Alcor is responsible, not only because they are in fact where the buck stops, but also because they employed SA to care for this patient despite being fully aware of SA’s grossly unsatisfactory performance in virtually every SA case where SST was performed. If performing blood washout on a whole-body cryopreservation patient using a 20 L bag of perfusate <a href=\"https://alcor.org/Library/pdfs/AlcorCaseReportA2889MarkLeeMiller.pdf\">perched atop a step ladder</a> isn’t reason enough to conclude that SA is incompetent, negligent, or both, then what is? As I said at the start here, I don’t need to lie because the truth is so absurdly incompetent and negligent that I couldn’t make it up if I tried. I don’t have that wild of an imagination.</p>\n\n<p>Beyond this basic observation, responsibility can only be assigned on the basis of the few facts I have, in addition to your own sad account given here. I’ve made a lot of calls and done a lot of research and this narrative is what I believe reasonably reflects the facts. Since you claim to have inside information (which could only come from Alcor or SA) I trust you will correct or expand on anything I have gotten wrong.</p>\n\n<p>Taking some certainties I know about the timeline, and working backward and forwards, it seems likely that the patient was pronounced around 12 pm EDT with no one in attendance but family. After countless calls, I’ve been able to determine that the patient was removed from the hospice unit of the hospital where he was pronounced at approximately 12:45 pm PDT and arrived at the Kallis Funeral Home in Willow Manor, FL, at about 1:15 pm PDT. There were only two flights out of MIA to PHX which could have accommodated this patient after 1:00 pm and both would have required departure from the mortuary not much later than 2:00 pm PDT. The most likely fight would have arrived at PHX at 7:15 pm MST.</p>\n\n<p>While it is true that the FRN was only instructed to get either 20, or 40 pounds of ice, depending upon whether you believe Alcor’s Hugh Hixon, or you, the context of that order and who gave it have not been made clear. I have been told, reliably I believe, that the FRN arrived at funeral home either a few minutes before or after the patient did. The bags of ice she was instructed to procure were never meant to be the sole source of refrigeration because the SA vehicle, which had been accessed and was driven to the mortuary by a relative of the patent’s son, contained at least 120 lbs. of ice, in addition to the stabilization medications. It was thus clearly the plan that the FRN would administer the medications, probably via SA’s preferred route of intraosseous access, do some chest compressions and then pack the patient in ice for air shipment to Alcor.</p>\n\n<p>Who countermanded these orders?  There are at least two accounts of who was responsible: Chris Divvers, Alcor’s Medical Response Director, or Sayer Johansen of SA. Divvers, BTW, must have been terminated (for cause) by Alcor right around the time he issued the instructions to proceed with shipping the patient “as is” and not to wait for the arrival of the SA vehicle that could have been no more than a few minutes behind the patient’s arrival (which indeed turned out to be the case). Even if the patient had been packed in the combined 120 lbs. (54 kg), or 160 lbs. (73 kg) of ice, it is unlikely it would have kept him adequately refrigerated in an uninsulated metal air-shipper sitting inside a standard cardboard and wood airline air-shipping tray. For instance, it takes 28-30 kg of ice to cool a 70 kg man who is at ~36 degrees C to 2-4 degrees C and the ice consumption due to the heat leak into the shipper over an 8-9-hour period would have required in the vicinity of another 70 kg of ice, for a total of ~100 kg of ice versus the 73 kg of ice that SA had acquired for the shipping of this patient, see: <a href=\"http://chronopause.com/chronopause.com/index.php/2011/06/28/commercial-air-transport-of-the-cryopreservation-patient/index.html\">http://chronopause.com/chronopause.com/index.php/2011/06/28/commercial-air-transport-of-the-cryopreservation-patient/index.html</a>I have reason to believe that Alcor&#39;s Board, because of a previous patient having been thawed out during a flight to Phoenix, has forbidden shipping patients in spur-of-the-moment shipping containers, demanding instead that the perfused and frozen patient be held at the local facility until a proper shipping container can be overnighted to them. How many times do they have to keep repeating these mistakes?</p>\n\n<p>I can only imagine the chaos of the communications between these three functionally, geographically and, in the case of SA and Alcor, highly antagonistic entities. I know the latter because I was sitting in the restaurant in the Thunderbird and overhead the discussion between the FRN, Ben Best, Houston Westfall and Ryan Levesque about their upcoming negotiations vis a vis SA and Alcor’s contract renewal with Alcor’s Brian Wowk. Judging from the conversation (which I could hear clearly) these three were to be the ones setting terms and conditions with Alcor, not because they were SA Officers or Directors, but because they (or at least Best, Westfall and the FRN) represented BRLS, which is clearly higher up on the food chain than whoever putatively controls SA. It was very clear to me from this conversation that neither side had much use for the other and the negotiations were expected to difficult at best.</p>\n\n<p>This is all relevant because it shows that A-1100 was being handled by multiple entities that were either adversarial and/or were clearly not in good communication, and none of which were following their own SOPs. Not even the wonder-communication facilitation app that Divvers recently touted in Alcor News <a href=\"https://slack.com/\">Slack</a> could have done much to resolve the snarl in this situation, where everybody was the boss, and thus no one was. This is the classic <a href=\"https://en.wikipedia.org/wiki/Swiss_cheese_model\">“Swiss cheese” failure model</a>, except on steroids. If only there hadn’t been hurricane Dorian (but there was), if only Divvers or Johansen had known that the patient had only 20 (or 40) pounds of ice on him when the order was given to ship him (but they didn’t), if only the family had been willing to move a dying in man in hospice care to an unspecified “somewhere safe” and to do so under their own steam in the midst of the trauma attending his dying, not mention and a cat5 hurricane that was bearing down on them (but they weren’t), and if only the order hadn’t been given by Westfall to evacuate the SA SST personnel and disable SA’s STT capability for the duration (but it was), <em>then everything would have turned out OK</em>. Really, you expect us to believe that as a credible escape from the responsibility for what happened to A-1100? Really?</p>\n\n<p>CONTINUED</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1d4bpr/","name":"t1_f1d4bpr","created":1569402338,"created_utc":1569373538,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f1a2n7q","author":"[deleted]","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":" Darwin is right to be concerned about failures to cool or maintain temperatures of Alcor patients in transport. He’s wrong about just about EVERYTHING else. I have some inside input backing my contrary claims. \n\nDarwin continues his crusade of attacking Alcor, highlighting suboptimal performance, exaggerating things, and outright fabricating other things. \n\nMD: “This occurred because Alcor personnel overrode the judgment of a long-time cryonicist R.N., who was present at the mortuary when the patient was being prepared for shipment. Her exhortations to pack the patient completely in ice were ignored in order to “make the shortly to be departing airline flight”.”\n\nFALSE. \n\nThe R.N. said nothing of the sort during the public board meeting. She was honest enough and courageous enough to state that perhaps she could have done more. She was the only one to take responsibility. The real responsibility lies with the \\*\\*S.A. leaders\\*\\* who instructed her to get only four ten pound bags of ice. Alcor had NO INPUT on this and did not know about it. \n\nSA had one of its two people right there in Florida. They also had the R.N. although she is not formally an SA staff member. But she is paid by BRLS to attend members – especially A-1100 – in Florida. The SA personnel provided her with no med kit (in fact they took it away) and INSTRUCTED HER to bring far too little ice. Another 120 lbs. could have been added. SA says otherwise, but the shipping weight and the 500 lb limit do not lie. \n\nMD: “A-1100 easily spent $250,000 to ensure that he had an optimum local capability to care for him.” \n\nFALSE. \n\nThe member was underfunded. The family made no effort to bring the father’s funding up the current minimum. They were asked more than once to fund a charter flight, but declined to do so. If they had, even though SA took the med kit away, there would have been no excuse about rushing to get the flight, and meds and circulation could have happened. There would also be more time for Alcor personnel to learn what was happening (outside their control and advice) and to ensure proper construction of a shipper and adequate ice. Alcor’s Max More pushed to find out about the feasibility of giving meds but was told by SA that it was too late. (It wasn’t.) \n\nMD: “When Hurricane Dorian appeared to be likely to rake the coast of Florida, the current overseer of SA, Houston Westfall, decided to evacuate the SA personnel.”\n\nThis may be true and is in line with the R.N.’s statement that her employer asked her to leave. That would be BRLS. However, she was subcontracted to SA. So it’s not certain who gave the order. NOTE: Westfall has NO formal authority over SA. \n\nMD: “No PIB, heart-lung resuscitator or medications that could be administered by the hospice nurse were made available to the patients family and caregivers when SA pulled out.” \n\nTHAT is CORRECT and definitely a BIG problem. That is not an Alcor error. It’s an SA error. \n\nMD: “The R.N., who was present when the patient was being prepared for shipment returned to where the patient was, arriving on the scene just before the patient arrived at the mortuary. She attempted to administer to Stabilization medications and to undertake a brief period of chest compressions to circulate them but was overridden by Alcor and the mortician.” \n\nFALSE. There were no medications to administer. Alcor did NOT override that attempt. Alcor was told that it was too late. It was SA who refused to do this, despite their being enough time (had they brought the meds). Alcor would never override an attempt to administer meds in that kind of situation. \n\nMD: “\\[Wolvos\\]”reportedly has a reputation for arrogance, brusque and rude treatment of Alcor personnel and little if any knowledge about the theory and practice of cryonics.” \n\nFALSE. Wolvos recently received a prize in surgical leadership at Harvard. He has done numerous surgeries at Alcor. He has never shown arrogance and rudeness. You are probably thinking of an incident that someone illegally leaked to you in which Dr. Wolvos and Dr. Harris disagreed about a relatively minor matter. Dr. Harris had a fit and terminated the call. \n\nMS: “Wolvos was on the phone to the local mortician and ordered him to ship the patient with or without additional ice.” \n\nFALSE. That is not remotely true. \n\n“It had to do with an old man who would not move to arizona, where alcor is located. Why did he not do that? Probably because of family pressures.”\n\nMD: “No, it was not due to \"family pressures\", his sons are long-time cryonicists.” \n\nWRONG. Being long-time cryonicists does not mean they don’t do things wrong, i.e. not in the interests of the patient. He was seriously underfunded, and the family refused to take care of it. They would not move him to Scottsdale. And they directly refused to pay for a charter flight. That would have removed any time pressure (to make the commercial flight) and allowed proper medication – and hopefully cooling. \n\nMD: “If all of Alcor has a lick of sense you would ask for my help in solving these horrific problems rather than considering me \"the enemy trying to destroy your cryonics organization\".” \n\nDarwin has not been able to help cryonics organizations for decades. No one can tolerate working with him. Darwin has declared himself as the enemy. He has threatened to destroy Alcor. He has sided with the evil relative of a patient who wants to exact revenge on his father by thawing him out and destroying him. He has publicly stated that he will “take you down”. Darwin is not here to help. \n\nDarwin mentions only the worst outcomes. Never mention of the many good outcomes or the major effort required to bring them about. That should tell you something about his agenda. \n\nAlcor is upfront about its limitations. Darwin even grants the point with a reference to the agreement. \n\nMD: “It is outrageous of you to suggest that Alcor is transparent when you and the rest of the Board and management know that virtually no members read the case histories or case summaries” \n\nIf people don’t want to read them, whose fault is that? It certainly doesn’t show that Alcor is not transparent. Darwin is being dishonest. \n\nThe importance of members improving their own odds and understanding Alcor’s limitations HAS appeared in the magazine. Max More talked about it at one of the last two conferences. \n\nWarAndGeese:” “If they treated him this poorly from Florida then they could have treated him poorly in Scottsdale, it still takes people minutes if not hours to find out that someone is dead, chill the body, move the body, etc. If that process isn't nailed down then they can and will mess it up even in Scottsdale.” \n\nWRONG. The actual cases in Scottsdale show completely the contrary. \n\nMD: “A particularly galling aspect of this iatrogenesis is that the same “mistakes” are made repeatedly, year after year.” \n\nA similar outcome but DIFFERENT causes. Alcor has addressed multiple causes. (Used up ALL the dry ice in an entire European country? Unbelievable! Noted. Emphasized to a New York funeral director NOT TO SHIP until proper construction and loading of a dry ice shipper WAS PROVEN BY PHOTOGRAPHIC AND VIDEOGRAPHIC MEANS? Despite apparently sincere desire to cooperate, they guy shipped anyway without following EXTREMELY CLEAR instructions. Failure modes are numerous. Alcor Continues to figure out how to prevent recurrences and new failure modes. What IS true is that Alcor DOES need to take harsher measures with contractors who fuck up. These should be written into contracts. \n\nThe truth will come out. Darwin has an agenda. \n\nThis is a corrective statement. It will not be followed by an interminable argument with Mr. Federowicz “Darwin”.","body_html":"<div class=\"md\"><p>Darwin is right to be concerned about failures to cool or maintain temperatures of Alcor patients in transport. He’s wrong about just about EVERYTHING else. I have some inside input backing my contrary claims. </p>\n\n<p>Darwin continues his crusade of attacking Alcor, highlighting suboptimal performance, exaggerating things, and outright fabricating other things. </p>\n\n<p>MD: “This occurred because Alcor personnel overrode the judgment of a long-time cryonicist R.N., who was present at the mortuary when the patient was being prepared for shipment. Her exhortations to pack the patient completely in ice were ignored in order to “make the shortly to be departing airline flight”.”</p>\n\n<p>FALSE. </p>\n\n<p>The R.N. said nothing of the sort during the public board meeting. She was honest enough and courageous enough to state that perhaps she could have done more. She was the only one to take responsibility. The real responsibility lies with the **S.A. leaders** who instructed her to get only four ten pound bags of ice. Alcor had NO INPUT on this and did not know about it. </p>\n\n<p>SA had one of its two people right there in Florida. They also had the R.N. although she is not formally an SA staff member. But she is paid by BRLS to attend members – especially A-1100 – in Florida. The SA personnel provided her with no med kit (in fact they took it away) and INSTRUCTED HER to bring far too little ice. Another 120 lbs. could have been added. SA says otherwise, but the shipping weight and the 500 lb limit do not lie. </p>\n\n<p>MD: “A-1100 easily spent $250,000 to ensure that he had an optimum local capability to care for him.” </p>\n\n<p>FALSE. </p>\n\n<p>The member was underfunded. The family made no effort to bring the father’s funding up the current minimum. They were asked more than once to fund a charter flight, but declined to do so. If they had, even though SA took the med kit away, there would have been no excuse about rushing to get the flight, and meds and circulation could have happened. There would also be more time for Alcor personnel to learn what was happening (outside their control and advice) and to ensure proper construction of a shipper and adequate ice. Alcor’s Max More pushed to find out about the feasibility of giving meds but was told by SA that it was too late. (It wasn’t.) </p>\n\n<p>MD: “When Hurricane Dorian appeared to be likely to rake the coast of Florida, the current overseer of SA, Houston Westfall, decided to evacuate the SA personnel.”</p>\n\n<p>This may be true and is in line with the R.N.’s statement that her employer asked her to leave. That would be BRLS. However, she was subcontracted to SA. So it’s not certain who gave the order. NOTE: Westfall has NO formal authority over SA. </p>\n\n<p>MD: “No PIB, heart-lung resuscitator or medications that could be administered by the hospice nurse were made available to the patients family and caregivers when SA pulled out.” </p>\n\n<p>THAT is CORRECT and definitely a BIG problem. That is not an Alcor error. It’s an SA error. </p>\n\n<p>MD: “The R.N., who was present when the patient was being prepared for shipment returned to where the patient was, arriving on the scene just before the patient arrived at the mortuary. She attempted to administer to Stabilization medications and to undertake a brief period of chest compressions to circulate them but was overridden by Alcor and the mortician.” </p>\n\n<p>FALSE. There were no medications to administer. Alcor did NOT override that attempt. Alcor was told that it was too late. It was SA who refused to do this, despite their being enough time (had they brought the meds). Alcor would never override an attempt to administer meds in that kind of situation. </p>\n\n<p>MD: “[Wolvos]”reportedly has a reputation for arrogance, brusque and rude treatment of Alcor personnel and little if any knowledge about the theory and practice of cryonics.” </p>\n\n<p>FALSE. Wolvos recently received a prize in surgical leadership at Harvard. He has done numerous surgeries at Alcor. He has never shown arrogance and rudeness. You are probably thinking of an incident that someone illegally leaked to you in which Dr. Wolvos and Dr. Harris disagreed about a relatively minor matter. Dr. Harris had a fit and terminated the call. </p>\n\n<p>MS: “Wolvos was on the phone to the local mortician and ordered him to ship the patient with or without additional ice.” </p>\n\n<p>FALSE. That is not remotely true. </p>\n\n<p>“It had to do with an old man who would not move to arizona, where alcor is located. Why did he not do that? Probably because of family pressures.”</p>\n\n<p>MD: “No, it was not due to &quot;family pressures&quot;, his sons are long-time cryonicists.” </p>\n\n<p>WRONG. Being long-time cryonicists does not mean they don’t do things wrong, i.e. not in the interests of the patient. He was seriously underfunded, and the family refused to take care of it. They would not move him to Scottsdale. And they directly refused to pay for a charter flight. That would have removed any time pressure (to make the commercial flight) and allowed proper medication – and hopefully cooling. </p>\n\n<p>MD: “If all of Alcor has a lick of sense you would ask for my help in solving these horrific problems rather than considering me &quot;the enemy trying to destroy your cryonics organization&quot;.” </p>\n\n<p>Darwin has not been able to help cryonics organizations for decades. No one can tolerate working with him. Darwin has declared himself as the enemy. He has threatened to destroy Alcor. He has sided with the evil relative of a patient who wants to exact revenge on his father by thawing him out and destroying him. He has publicly stated that he will “take you down”. Darwin is not here to help. </p>\n\n<p>Darwin mentions only the worst outcomes. Never mention of the many good outcomes or the major effort required to bring them about. That should tell you something about his agenda. </p>\n\n<p>Alcor is upfront about its limitations. Darwin even grants the point with a reference to the agreement. </p>\n\n<p>MD: “It is outrageous of you to suggest that Alcor is transparent when you and the rest of the Board and management know that virtually no members read the case histories or case summaries” </p>\n\n<p>If people don’t want to read them, whose fault is that? It certainly doesn’t show that Alcor is not transparent. Darwin is being dishonest. </p>\n\n<p>The importance of members improving their own odds and understanding Alcor’s limitations HAS appeared in the magazine. Max More talked about it at one of the last two conferences. </p>\n\n<p>WarAndGeese:” “If they treated him this poorly from Florida then they could have treated him poorly in Scottsdale, it still takes people minutes if not hours to find out that someone is dead, chill the body, move the body, etc. If that process isn&#39;t nailed down then they can and will mess it up even in Scottsdale.” </p>\n\n<p>WRONG. The actual cases in Scottsdale show completely the contrary. </p>\n\n<p>MD: “A particularly galling aspect of this iatrogenesis is that the same “mistakes” are made repeatedly, year after year.” </p>\n\n<p>A similar outcome but DIFFERENT causes. Alcor has addressed multiple causes. (Used up ALL the dry ice in an entire European country? Unbelievable! Noted. Emphasized to a New York funeral director NOT TO SHIP until proper construction and loading of a dry ice shipper WAS PROVEN BY PHOTOGRAPHIC AND VIDEOGRAPHIC MEANS? Despite apparently sincere desire to cooperate, they guy shipped anyway without following EXTREMELY CLEAR instructions. Failure modes are numerous. Alcor Continues to figure out how to prevent recurrences and new failure modes. What IS true is that Alcor DOES need to take harsher measures with contractors who fuck up. These should be written into contracts. </p>\n\n<p>The truth will come out. Darwin has an agenda. </p>\n\n<p>This is a corrective statement. It will not be followed by an interminable argument with Mr. Federowicz “Darwin”.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1a2n7q/","name":"t1_f1a2n7q","created":1569312654,"created_utc":1569283854,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":6,"link_id":"t3_d6s41b","replies":[{"ups":1,"link_id":"t3_d6s41b","id":"f0xg7k0","author":"anon_cryo","parent_id":"t1_f0xb58k","subreddit_id":"t5_2r11d","body":"https://www.legacy.com/obituaries/sunsentinel/obituary.aspx?n=austin-w-tupler&pid=193835766","body_html":"<div class=\"md\"><p><a href=\"https://www.legacy.com/obituaries/sunsentinel/obituary.aspx?n=austin-w-tupler&amp;pid=193835766\">https://www.legacy.com/obituaries/sunsentinel/obituary.aspx?n=austin-w-tupler&amp;pid=193835766</a></p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0xg7k0/","name":"t1_f0xg7k0","created":1569060454,"created_utc":1569031654,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f0v8urh","author":"MaximilianKohler","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"So it sounds like they made a decision between longer on-ice delay vs shorter off-ice delay. And you're saying their decision was the wrong one. \n\nI guess there's still nothing most members can do about these shortcomings? \n\nIt would be up to the big boys with lots of money to make their donations dependent on Alcor fixing these issues, or by funding a new cryonics outfit?","body_html":"<div class=\"md\"><p>So it sounds like they made a decision between longer on-ice delay vs shorter off-ice delay. And you&#39;re saying their decision was the wrong one. </p>\n\n<p>I guess there&#39;s still nothing most members can do about these shortcomings? </p>\n\n<p>It would be up to the big boys with lots of money to make their donations dependent on Alcor fixing these issues, or by funding a new cryonics outfit?</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0v8urh/","name":"t1_f0v8urh","created":1568999258,"created_utc":1568970458,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":5,"link_id":"t3_d6s41b","id":"f0w1kul","author":"Cryonics-01","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"Thanks for posting. How did the Alcor member die? Where did the Alcor member die? Old age? Car crash? On the street? In a hospital? Why wasn't SA there on standby? Did the Alcor member fly on a private plane or commercial airline? Why wasn't the Alcor member in the vicinity of Alcor? Cryonics members contracted with SA who die unexpectedly appear to me to get much worse stabilization and transportation and that seems to be the issue that needs focus. Older people should live in the vicinity of their cryonics facility because obviously their expected to die eventually. SA can't just live with these people. As for younger and healthier people who die very abruptly without notice, those should be the only random cases with the worse results and all other cases aren't really SA's fault. A lot of cryonics members themselves apperently don't care or at least don't think about what will happen to them once they die and SA can't control them to make every case perfect. Again, younger people who die unexpectedly should be the only random cases and those healthier people should always be with another cryonics member who can act as a first responder in the event of death. Optimal cryopreservations happen when the Cryonics member is strategic and actually cares about experiencing the future hundreds of years from now.","body_html":"<div class=\"md\"><p>Thanks for posting. How did the Alcor member die? Where did the Alcor member die? Old age? Car crash? On the street? In a hospital? Why wasn&#39;t SA there on standby? Did the Alcor member fly on a private plane or commercial airline? Why wasn&#39;t the Alcor member in the vicinity of Alcor? Cryonics members contracted with SA who die unexpectedly appear to me to get much worse stabilization and transportation and that seems to be the issue that needs focus. Older people should live in the vicinity of their cryonics facility because obviously their expected to die eventually. SA can&#39;t just live with these people. As for younger and healthier people who die very abruptly without notice, those should be the only random cases with the worse results and all other cases aren&#39;t really SA&#39;s fault. A lot of cryonics members themselves apperently don&#39;t care or at least don&#39;t think about what will happen to them once they die and SA can&#39;t control them to make every case perfect. Again, younger people who die unexpectedly should be the only random cases and those healthier people should always be with another cryonics member who can act as a first responder in the event of death. Optimal cryopreservations happen when the Cryonics member is strategic and actually cares about experiencing the future hundreds of years from now.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0w1kul/","name":"t1_f0w1kul","created":1569025673,"created_utc":1568996873,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":5,"link_id":"t3_d6s41b","id":"f0x56kq","author":"Cryonics-01","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"Interesting. I live in South Florida and have been through all the hurricanes. They have never really caused that much damage. Dorian never even came here. The Alcor member should have been cooled properly. That's crazy.","body_html":"<div class=\"md\"><p>Interesting. I live in South Florida and have been through all the hurricanes. They have never really caused that much damage. Dorian never even came here. The Alcor member should have been cooled properly. That&#39;s crazy.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0x56kq/","name":"t1_f0x56kq","created":1569050833,"created_utc":1569022033,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_d6s41b","replies":[{"ups":1,"link_id":"t3_d6s41b","replies":[{"ups":2,"link_id":"t3_d6s41b","id":"f133yo8","author":"MaximilianKohler","parent_id":"t1_f133vj2","subreddit_id":"t5_2r11d","body":"2/2\n\n> However, until that terrestrial capability is mature, there is only one alternative to DIRECTV and that is DISH Network which, unfortunately, does not have the same programming and whose customer service has always sucked. So, many people, my partner and I among them, are staying with DIRECTV because the alternative isn't satisfactory and because DIRECTV punishes you in every way imaginable if you quit them. Clearly, over the long run, this problem will be resolved, however this can and will take years. Meanwhile DIRECTV has customers howling in the night on the Internet: https://www.consumeraffairs.com/cable_tv/directv.htm?page=3#sort=top_reviews&filter=none\n> \n> The situation in cryonics has similarities because customer feedback is much more problematic and bad services and high prices are not as noticeable with cryonics as compared with your TV programming so, it takes a long time before things start to go south.\n> \n> One of the best things you can do to remedy this situation is to inform both Alcor members and potential members of exactly what Alcor really is. Since the Patient Care Trust exists, there are substantial protections in place for existing patients, and if existing and prospective members knew what the score is the odds are very good that Alcor would have a lot less takers. That opens up the market for competition and it is clear that cryonicists are not willing to sign-up with any old organization that pitches a tent even at bargain basement prices. This is why Osiris and Oregon Cryonics have a negligible number of takers.\n> \n> Perhaps the best thing in making Alcor accountable is that it is so just. They have largely escaped the negative consequences of their actions and that just isn't right\n> \n> Mike Darwin","body_html":"<div class=\"md\"><p>2/2</p>\n\n<blockquote>\n<p>However, until that terrestrial capability is mature, there is only one alternative to DIRECTV and that is DISH Network which, unfortunately, does not have the same programming and whose customer service has always sucked. So, many people, my partner and I among them, are staying with DIRECTV because the alternative isn&#39;t satisfactory and because DIRECTV punishes you in every way imaginable if you quit them. Clearly, over the long run, this problem will be resolved, however this can and will take years. Meanwhile DIRECTV has customers howling in the night on the Internet: <a href=\"https://www.consumeraffairs.com/cable_tv/directv.htm?page=3#sort=top_reviews&amp;filter=none\">https://www.consumeraffairs.com/cable_tv/directv.htm?page=3#sort=top_reviews&amp;filter=none</a></p>\n\n<p>The situation in cryonics has similarities because customer feedback is much more problematic and bad services and high prices are not as noticeable with cryonics as compared with your TV programming so, it takes a long time before things start to go south.</p>\n\n<p>One of the best things you can do to remedy this situation is to inform both Alcor members and potential members of exactly what Alcor really is. Since the Patient Care Trust exists, there are substantial protections in place for existing patients, and if existing and prospective members knew what the score is the odds are very good that Alcor would have a lot less takers. That opens up the market for competition and it is clear that cryonicists are not willing to sign-up with any old organization that pitches a tent even at bargain basement prices. This is why Osiris and Oregon Cryonics have a negligible number of takers.</p>\n\n<p>Perhaps the best thing in making Alcor accountable is that it is so just. They have largely escaped the negative consequences of their actions and that just isn&#39;t right</p>\n\n<p>Mike Darwin</p>\n</blockquote>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f133yo8/","name":"t1_f133yo8","created":1569181955,"created_utc":1569153155,"subreddit_name_prefixed":"r/cryonics","depth":4},{"ups":1,"link_id":"t3_d6s41b","id":"f133xp8","author":"MaximilianKohler","parent_id":"t1_f133vj2","subreddit_id":"t5_2r11d","body":"1/2\n\n> You have to start with an organizational culture that genuinely values patients and members, not just in theory, but in practice. What this means is that there is no substitute for caring, competent people of integrity. If you don't start with that, you'll get what we already have. Next, you have to have an institutional structure that is set-up in a way that is designed to support those values, select for management that is committed to them, and provides for meaningful feedback from qualified members. **This means that management must be selected by the membership provided that protections are put in place to ensure that he members who have voting rights are both informed and committed**. The first step to doing that is to require an adequate delay between signing up and voting. This also protects the organization against a a flood of new members with an agenda swarming the organization quickly and then taking control of it. This has happened many times with charitable organizations, it's the rough equivalent of a hostile takeover in stock companies. In fact, there was attempt some years ago to do this to CI.\n> \n> As to my 20 theses nailed to Alcor and CI's door, they come into play at the start of the process outlined above. If management isn't committed to these principles, then again, you will get the same results that have been gotten for the past half century. The \"n\" isn't very large but the outcome is 100% consistent.\n> \n> As to how to change existing organizations, that's a much tougher proposition. In  fact, based on my research, it is extremely rare to be able to do this, even in organizations that have members electing their management. f you want an example just look at the NRA. The only ways I know of to do this are to make the organization accountable for its bad acts, inform existing and prospective members  of the reality, as opposed to the sales pitch, and to cut off the air, food and water that the organization needs to function. A major strategy of the Pilgeram litigation to \"put cryonics completely out of business is to the latter. They are not only looking for large punitive damages, they are trying to shred the credibility of cryonics in a highly pubic way, such that it becomes problematic for the organizations to continue to function. For instance, if they could get a court ruling that the Alcor members' life insurance policies could be taken in a judgement (because Alcor owns them), that would send a clear message that that mechanism for paying for cryonics is no longer viable.\n> \n> I am one of the few people still around in cryonics who has had first-hand experience with this because I got involved in cryonics as a 13-year-old. Most of my cohorts are either cryopreserved, old and inactive, or dead..My unfortunate experience with the \"starve them out approach\" was as a result of what happened after Chatsworth. Before Chatsworth, major cryogenic manufacturers would make dewars for us, hospitals would allow us on premises, mortuaries were happy to act as our agents and the California DHS would issue us VS-9 disposition permits. After Chatsworth, all that changed and not for the better. In fact, the fiberglass cryostats that CI uses to this day are a direct result of their being unable to buy whole body dewars for decades. Alcor wasn't under that same pressure because most of  its initial members and patients were neuro and those patients could be stored in off the shelf dewars available to anyone with the money. In fact, for ~10 years the only way we (Alcor) got whole body dewars was by being exceedingly sneaky so that the vendor did not know what we ordering them for (shell company).\n> \n> Of course, that is relatively easy to do when you are a tiny operation, have ~30 members, very low demand for your services and can respond rapidly and dynamically to such challenges, including under the table deals and so on. Neither Alcor or CI can operate that way now -- they're too big, too bureaucratic and also, most importantly,, very ex[posed to public scrutiny. In the 1970s and '80s we were so small that we could and did fly under the radar in many areas. Uber and Lyft are perfect examples of how once you become established, all sorts of regulations and restrictions (and unforeseen problems) start to materialize and, more importantly,existing regulations start to be applied to you. Alcor and CI now have a lot of patients, many of them whole-body, and they are critically dependent upon their image remaining good, or at least acceptable in order to recruit members.\n> \n> This is particularly important for Alcor because they losing members at a phenomenal rate -- something completely unprecedented in cryonics. So, while they gained 52 members over the past 8 months they also lost 33. Thus, they are critically dependent upon getting new suckers, er uh, I mean members. In fact, one of the things disclosed at the Board meeting is that a significant fraction of the members Alcor is losing are long-time members. In one case mentioned, the member had been signed up with Alcor 32 years! I personally know 5 long-time members who either quit Alcor and cryonics, or switched to CI. In fact, I visited a very, long term, elderly and ill cryonicist and Alcor member (50 years in cryonics and 20+ years in Alcor) who is going to switch to CI for both financial reasons and due to lack of confidence in the organization.\n> \n> This mix of factors has been operational in all of the people I know first-hand who have left Alcor. So, one way of looking at Alcor is that they are becoming a Ponzi-like operation, wherein members pay dues and insurance premiums for decades, only to eventually loose or discard their membership. What was really surreal was to hear the report from the person who is the hardship committee saying that they had very few requests for assistance and so had provided little. There was speculation that Alcor members in extremis were \"too proud to take charity\". This was completely unbelievable to me because I know of people who really are in financial extremis due to, age or illness and they were given no assistance beyond deferring their dues. The long-time member I visited is frail, in poor health,  was vomiting blood and was headed to the emergency room the next day (he quite sensibly didn't want to wait all night long to be seen when he was already exhausted and was not losing significant amounts of blood).\n> \n> So, you can see that anything that blows the confidence and prestige that Alcor currently enjoys has the potential to send them into a death spiral. No growth isn't good but heavy losses in membership pretty unequivocally means that the rats are leaving the ship.\n> \n> This may seem terrible (and it is), but this is not necessarily bad for cryonics in the long run. Right now, public perception of Alcor is clearly good enough that they can add members faster than they are losing them (imagine what their growth rate would be if they could keep their existing members as well!). However, the hidden costs to this situation which make it unacceptable are that a) Alcor will continue to generate litigation and to do harm to its patients, members and their families, not to mention to their own staff and contractors, and b)because Alcor is perceived as successful, stable, competent and reliable they serve as a spoiler to the creation of alternatives to their mark niche, which is quite different than CI's. People have no incentive to go elsewhere if they believe they are getting good service from an organization that has been around for 50+ years and appears stable. This situation happens less frequently and doesn't last as long in most markets because the customers quickly become dissatisfied or outraged and leave.\n> \n> An example that bears some similarity to Alcor is what is happening with DIRECTV. DIRECTV was once a phenomenally good business that provided superb customer care, a wide menu of stations and was generally a pleasure to deal with. Several years ago AT&T bought DIRECTV and it is an understatement to say that everything has gone to hell. They are now a nightmare company to deal with that makes cable seem like a dream by comparison. However, because it takes millions of dollars to launch satellites there is a high barrier to entry in this business. However, even that would not have stopped DIRECTV from going promptly out of business (they are hemorrhaging customers) because this is, or was a lucrative market. The problem is that the era of satellite programming appears to be coming to an end due to the rapid and extensive growth and improvement in land-based content distribution.\n> \n\ncont..","body_html":"<div class=\"md\"><p>1/2</p>\n\n<blockquote>\n<p>You have to start with an organizational culture that genuinely values patients and members, not just in theory, but in practice. What this means is that there is no substitute for caring, competent people of integrity. If you don&#39;t start with that, you&#39;ll get what we already have. Next, you have to have an institutional structure that is set-up in a way that is designed to support those values, select for management that is committed to them, and provides for meaningful feedback from qualified members. <strong>This means that management must be selected by the membership provided that protections are put in place to ensure that he members who have voting rights are both informed and committed</strong>. The first step to doing that is to require an adequate delay between signing up and voting. This also protects the organization against a a flood of new members with an agenda swarming the organization quickly and then taking control of it. This has happened many times with charitable organizations, it&#39;s the rough equivalent of a hostile takeover in stock companies. In fact, there was attempt some years ago to do this to CI.</p>\n\n<p>As to my 20 theses nailed to Alcor and CI&#39;s door, they come into play at the start of the process outlined above. If management isn&#39;t committed to these principles, then again, you will get the same results that have been gotten for the past half century. The &quot;n&quot; isn&#39;t very large but the outcome is 100% consistent.</p>\n\n<p>As to how to change existing organizations, that&#39;s a much tougher proposition. In  fact, based on my research, it is extremely rare to be able to do this, even in organizations that have members electing their management. f you want an example just look at the NRA. The only ways I know of to do this are to make the organization accountable for its bad acts, inform existing and prospective members  of the reality, as opposed to the sales pitch, and to cut off the air, food and water that the organization needs to function. A major strategy of the Pilgeram litigation to &quot;put cryonics completely out of business is to the latter. They are not only looking for large punitive damages, they are trying to shred the credibility of cryonics in a highly pubic way, such that it becomes problematic for the organizations to continue to function. For instance, if they could get a court ruling that the Alcor members&#39; life insurance policies could be taken in a judgement (because Alcor owns them), that would send a clear message that that mechanism for paying for cryonics is no longer viable.</p>\n\n<p>I am one of the few people still around in cryonics who has had first-hand experience with this because I got involved in cryonics as a 13-year-old. Most of my cohorts are either cryopreserved, old and inactive, or dead..My unfortunate experience with the &quot;starve them out approach&quot; was as a result of what happened after Chatsworth. Before Chatsworth, major cryogenic manufacturers would make dewars for us, hospitals would allow us on premises, mortuaries were happy to act as our agents and the California DHS would issue us VS-9 disposition permits. After Chatsworth, all that changed and not for the better. In fact, the fiberglass cryostats that CI uses to this day are a direct result of their being unable to buy whole body dewars for decades. Alcor wasn&#39;t under that same pressure because most of  its initial members and patients were neuro and those patients could be stored in off the shelf dewars available to anyone with the money. In fact, for ~10 years the only way we (Alcor) got whole body dewars was by being exceedingly sneaky so that the vendor did not know what we ordering them for (shell company).</p>\n\n<p>Of course, that is relatively easy to do when you are a tiny operation, have ~30 members, very low demand for your services and can respond rapidly and dynamically to such challenges, including under the table deals and so on. Neither Alcor or CI can operate that way now -- they&#39;re too big, too bureaucratic and also, most importantly,, very ex[posed to public scrutiny. In the 1970s and &#39;80s we were so small that we could and did fly under the radar in many areas. Uber and Lyft are perfect examples of how once you become established, all sorts of regulations and restrictions (and unforeseen problems) start to materialize and, more importantly,existing regulations start to be applied to you. Alcor and CI now have a lot of patients, many of them whole-body, and they are critically dependent upon their image remaining good, or at least acceptable in order to recruit members.</p>\n\n<p>This is particularly important for Alcor because they losing members at a phenomenal rate -- something completely unprecedented in cryonics. So, while they gained 52 members over the past 8 months they also lost 33. Thus, they are critically dependent upon getting new suckers, er uh, I mean members. In fact, one of the things disclosed at the Board meeting is that a significant fraction of the members Alcor is losing are long-time members. In one case mentioned, the member had been signed up with Alcor 32 years! I personally know 5 long-time members who either quit Alcor and cryonics, or switched to CI. In fact, I visited a very, long term, elderly and ill cryonicist and Alcor member (50 years in cryonics and 20+ years in Alcor) who is going to switch to CI for both financial reasons and due to lack of confidence in the organization.</p>\n\n<p>This mix of factors has been operational in all of the people I know first-hand who have left Alcor. So, one way of looking at Alcor is that they are becoming a Ponzi-like operation, wherein members pay dues and insurance premiums for decades, only to eventually loose or discard their membership. What was really surreal was to hear the report from the person who is the hardship committee saying that they had very few requests for assistance and so had provided little. There was speculation that Alcor members in extremis were &quot;too proud to take charity&quot;. This was completely unbelievable to me because I know of people who really are in financial extremis due to, age or illness and they were given no assistance beyond deferring their dues. The long-time member I visited is frail, in poor health,  was vomiting blood and was headed to the emergency room the next day (he quite sensibly didn&#39;t want to wait all night long to be seen when he was already exhausted and was not losing significant amounts of blood).</p>\n\n<p>So, you can see that anything that blows the confidence and prestige that Alcor currently enjoys has the potential to send them into a death spiral. No growth isn&#39;t good but heavy losses in membership pretty unequivocally means that the rats are leaving the ship.</p>\n\n<p>This may seem terrible (and it is), but this is not necessarily bad for cryonics in the long run. Right now, public perception of Alcor is clearly good enough that they can add members faster than they are losing them (imagine what their growth rate would be if they could keep their existing members as well!). However, the hidden costs to this situation which make it unacceptable are that a) Alcor will continue to generate litigation and to do harm to its patients, members and their families, not to mention to their own staff and contractors, and b)because Alcor is perceived as successful, stable, competent and reliable they serve as a spoiler to the creation of alternatives to their mark niche, which is quite different than CI&#39;s. People have no incentive to go elsewhere if they believe they are getting good service from an organization that has been around for 50+ years and appears stable. This situation happens less frequently and doesn&#39;t last as long in most markets because the customers quickly become dissatisfied or outraged and leave.</p>\n\n<p>An example that bears some similarity to Alcor is what is happening with DIRECTV. DIRECTV was once a phenomenally good business that provided superb customer care, a wide menu of stations and was generally a pleasure to deal with. Several years ago AT&amp;T bought DIRECTV and it is an understatement to say that everything has gone to hell. They are now a nightmare company to deal with that makes cable seem like a dream by comparison. However, because it takes millions of dollars to launch satellites there is a high barrier to entry in this business. However, even that would not have stopped DIRECTV from going promptly out of business (they are hemorrhaging customers) because this is, or was a lucrative market. The problem is that the era of satellite programming appears to be coming to an end due to the rapid and extensive growth and improvement in land-based content distribution.</p>\n</blockquote>\n\n<p>cont..</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f133xp8/","name":"t1_f133xp8","created":1569181932,"created_utc":1569153132,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f133uod","author":"MaximilianKohler","parent_id":"t1_f10o1i3","subreddit_id":"t5_2r11d","body":"> This is true. However, the problem with maintaining continuity exists in large measure because Alcor refuses to accept input or help from people who they bring on as consultants, or who they have driven out. Even after the Ted Williams debacle I've sent countless letters offering technical and scientific advice. This information was given freely with no requirement for any quid pro quo. I would say that there are no thanks for this, but that would be beside the point, because not only don't they accept such inputs, they drag you into prolonged, ignorant and foolish debates about them. For example, I think that any thoughtful person would agree that it would be useful to know how well closed chest cardipopulmnary support is working during patient stabilization. Are you perfusing  and ventilating the patient adequately? Not only would this be useful to know on the face of it, it is useful to know because there are simple, inexpensive interventions that can be done to improve it,or to make it work at all. The technology to do this called oceanography and it couldn't be simpler to implement. In fact,a simple litmus paper-type qualitative device called the Easy-Cap was once routinely used on all Alcor patients receiving CPS: https://alcor.org/Library/pdfs/1990manual05.pdf\n> \n> Over 20 years ago Alcor simply stopped using this $15.00 device. In the ensuring 30 years since use of the Easy-Cap was implemented there have been phenomenal advances in electronics, computing, software and sensor design which have made quantitative hand held or in-line capnographs both possible and affordable. What could be more important than knowing if you are perfusing  and ventilating your patient effectively with CPS? Recognition of the importance of capnography is not only obvious, it is the standard of care for EMS, ER and hospital personnel who administer CPR. It's a no-brainer, right?\n> \n> Not with Alcor. I was told that capnography is not useful,  which required my gathering many papers, the current AHA guidelines and on and on. Then I was told that Stabilization was already so complex (and being done so poorly) that they didn't want to add another monitoring modality to it. That got a good laugh from me because the only monitoring modality they use is the patient's temperature, which they fail to record with frequency. Otherwise, they don't monitor anything about the patient or procedure. I suppose that they have a point, because if you can't put a temperature probe up (at least) a patient's nose and let an automated, logging thermometer capture the data for you which, BTW, you pay no attention to in real-time well then, it's probably true that you can't handle interposing a sensor between the patient's airway and the ventilator. These devices are as simple to use and as uncomplicated as this:\n> \n> EMMA Mainstream Capnograph\n> \n> or this:\n> \n> Image result for capnographs\n> \n> Even when I provided Alcor good advice for free, and even though they didn't follow it and I kept trying to provide them with it, they not only didn't pay attention, they engaged me in time-consuming and draining debates.\n> \n> My experience here is not unique, far from it. The difference is that, unlike most people who try to help them, I didn't walk away shaking my head in disbelief and/or disgust. So, the point here that the lack of continuity, the constant hiring and firing of mission-critical personnel, these are SIGNS and SYMPTOMS of the underlying deep dysfunction. Continuity of knowledge and skills can only occurs in a rational, structured and stable environment that respects the people who work in it. It is that which is missing from Alcor and until it is restored it will be bad business, as usual.\n> \n> Mike Darwin","body_html":"<div class=\"md\"><blockquote>\n<p>This is true. However, the problem with maintaining continuity exists in large measure because Alcor refuses to accept input or help from people who they bring on as consultants, or who they have driven out. Even after the Ted Williams debacle I&#39;ve sent countless letters offering technical and scientific advice. This information was given freely with no requirement for any quid pro quo. I would say that there are no thanks for this, but that would be beside the point, because not only don&#39;t they accept such inputs, they drag you into prolonged, ignorant and foolish debates about them. For example, I think that any thoughtful person would agree that it would be useful to know how well closed chest cardipopulmnary support is working during patient stabilization. Are you perfusing  and ventilating the patient adequately? Not only would this be useful to know on the face of it, it is useful to know because there are simple, inexpensive interventions that can be done to improve it,or to make it work at all. The technology to do this called oceanography and it couldn&#39;t be simpler to implement. In fact,a simple litmus paper-type qualitative device called the Easy-Cap was once routinely used on all Alcor patients receiving CPS: <a href=\"https://alcor.org/Library/pdfs/1990manual05.pdf\">https://alcor.org/Library/pdfs/1990manual05.pdf</a></p>\n\n<p>Over 20 years ago Alcor simply stopped using this $15.00 device. In the ensuring 30 years since use of the Easy-Cap was implemented there have been phenomenal advances in electronics, computing, software and sensor design which have made quantitative hand held or in-line capnographs both possible and affordable. What could be more important than knowing if you are perfusing  and ventilating your patient effectively with CPS? Recognition of the importance of capnography is not only obvious, it is the standard of care for EMS, ER and hospital personnel who administer CPR. It&#39;s a no-brainer, right?</p>\n\n<p>Not with Alcor. I was told that capnography is not useful,  which required my gathering many papers, the current AHA guidelines and on and on. Then I was told that Stabilization was already so complex (and being done so poorly) that they didn&#39;t want to add another monitoring modality to it. That got a good laugh from me because the only monitoring modality they use is the patient&#39;s temperature, which they fail to record with frequency. Otherwise, they don&#39;t monitor anything about the patient or procedure. I suppose that they have a point, because if you can&#39;t put a temperature probe up (at least) a patient&#39;s nose and let an automated, logging thermometer capture the data for you which, BTW, you pay no attention to in real-time well then, it&#39;s probably true that you can&#39;t handle interposing a sensor between the patient&#39;s airway and the ventilator. These devices are as simple to use and as uncomplicated as this:</p>\n\n<p>EMMA Mainstream Capnograph</p>\n\n<p>or this:</p>\n\n<p>Image result for capnographs</p>\n\n<p>Even when I provided Alcor good advice for free, and even though they didn&#39;t follow it and I kept trying to provide them with it, they not only didn&#39;t pay attention, they engaged me in time-consuming and draining debates.</p>\n\n<p>My experience here is not unique, far from it. The difference is that, unlike most people who try to help them, I didn&#39;t walk away shaking my head in disbelief and/or disgust. So, the point here that the lack of continuity, the constant hiring and firing of mission-critical personnel, these are SIGNS and SYMPTOMS of the underlying deep dysfunction. Continuity of knowledge and skills can only occurs in a rational, structured and stable environment that respects the people who work in it. It is that which is missing from Alcor and until it is restored it will be bad business, as usual.</p>\n\n<p>Mike Darwin</p>\n</blockquote>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f133uod/","name":"t1_f133uod","created":1569181857,"created_utc":1569153057,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f10mjio","author":"MaximilianKohler","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"> It is my sincere opinion, that as long as the Alcor Board of Directors continues to elect and re-elect the Alcor Directors, (in other words - themselves), there is such a lack of accountability that critical mistakes with consequences for patients and members will continue.\n> \n> Also, I believe that as long as the present way of allowing the closed Board Meetings, (Closed to the public and general membership), the public and general membership will not know 0f all of the mistakes that have been made and may continue to be made.\n> \n> Yes, there are times when a company must have closed meetings, but Alcor should have a written policy of the only subjects closed meetings can be held for. And, each time there is a closed meeting, the general subject should be revealed.\n> \n> It is my understanding that in the beginning of Alcor, the Alcor Directors were elected by a group from the membership either directly or indirectly. I am not sure about this exact process, even though it was attempted to be explained to me at least twice. However, I do believe that the Directors did not have the sole and exclusive power to elect themselves and re-elect themselves when Alcor first started up.\n> \n> I sincerely believe that the single most effective thing that Alcor could do to increase the company's chances of surviving and therefore the patients chances of survival would be to change back the way Directors are to be elected and have Directors stand before the membership for election and re-election every year or two. And, I believe that until this has been done, critical mistakes will probably continue, until Alcor changes the election system or something very bad happens.\n> \n> I served as Treasurer and Vice President under 4 different Alcor Presidents (I mostly was involved in business management decisions), and I served on the Board during that time. From that experience, I believe that: 1) if Directors really want to know what is going on at Alcor, they have to be there at the facility often; 2) When people feel they cannot be held accountable, they will make more mistakes.\n> \n> If someone wants to copy this message to the other discussion places this important discussion is being continued, you have my permission.\n> \n> Lastly, I believe it would be very hard for members who might have knowledge about improper things that may be going on at Alcor to make them public. Since the Board election system gives a Board Member so much unaccountable power it might be hard for any member to say something they think a Board Member might not like disclosed.\n> \n> David Pizer \n\nhttps://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18259","body_html":"<div class=\"md\"><blockquote>\n<p>It is my sincere opinion, that as long as the Alcor Board of Directors continues to elect and re-elect the Alcor Directors, (in other words - themselves), there is such a lack of accountability that critical mistakes with consequences for patients and members will continue.</p>\n\n<p>Also, I believe that as long as the present way of allowing the closed Board Meetings, (Closed to the public and general membership), the public and general membership will not know 0f all of the mistakes that have been made and may continue to be made.</p>\n\n<p>Yes, there are times when a company must have closed meetings, but Alcor should have a written policy of the only subjects closed meetings can be held for. And, each time there is a closed meeting, the general subject should be revealed.</p>\n\n<p>It is my understanding that in the beginning of Alcor, the Alcor Directors were elected by a group from the membership either directly or indirectly. I am not sure about this exact process, even though it was attempted to be explained to me at least twice. However, I do believe that the Directors did not have the sole and exclusive power to elect themselves and re-elect themselves when Alcor first started up.</p>\n\n<p>I sincerely believe that the single most effective thing that Alcor could do to increase the company&#39;s chances of surviving and therefore the patients chances of survival would be to change back the way Directors are to be elected and have Directors stand before the membership for election and re-election every year or two. And, I believe that until this has been done, critical mistakes will probably continue, until Alcor changes the election system or something very bad happens.</p>\n\n<p>I served as Treasurer and Vice President under 4 different Alcor Presidents (I mostly was involved in business management decisions), and I served on the Board during that time. From that experience, I believe that: 1) if Directors really want to know what is going on at Alcor, they have to be there at the facility often; 2) When people feel they cannot be held accountable, they will make more mistakes.</p>\n\n<p>If someone wants to copy this message to the other discussion places this important discussion is being continued, you have my permission.</p>\n\n<p>Lastly, I believe it would be very hard for members who might have knowledge about improper things that may be going on at Alcor to make them public. Since the Board election system gives a Board Member so much unaccountable power it might be hard for any member to say something they think a Board Member might not like disclosed.</p>\n\n<p>David Pizer </p>\n</blockquote>\n\n<p><a href=\"https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18259\">https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18259</a></p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f10mjio/","name":"t1_f10mjio","created":1569143435,"created_utc":1569114635,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_d6s41b","id":"f1kcmc7","author":"SunSunnnnn","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"This is a terrifying story. Was considering joining Alcor but this shows how delusional and wishful-thinking it would be to put your trust / money / future into this corporation. Will make sure to share this with all people interested in cryonics. Actually, sending this to Tim Urban ([https://waitbutwhy.com/2016/03/cryonics.html](https://waitbutwhy.com/2016/03/cryonics.html)) as we speak.\n\n**@Mike**, do you think there's any other meaningful cryonics option? If not, how can we solve that?","body_html":"<div class=\"md\"><p>This is a terrifying story. Was considering joining Alcor but this shows how delusional and wishful-thinking it would be to put your trust / money / future into this corporation. Will make sure to share this with all people interested in cryonics. Actually, sending this to Tim Urban (<a href=\"https://waitbutwhy.com/2016/03/cryonics.html\">https://waitbutwhy.com/2016/03/cryonics.html</a>) as we speak.</p>\n\n<p><strong>@Mike</strong>, do you think there&#39;s any other meaningful cryonics option? If not, how can we solve that?</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f1kcmc7/","name":"t1_f1kcmc7","created":1569563039,"created_utc":1569534239,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_d6s41b","id":"f0x6jnn","author":"Lakejamescabin","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"First time a ever heard mike Darwin say CI tells it like it is and honest.We are a group that is run by nonpayed people,try to get you help and get the funeral guy to put you on ice and get you to Detroit as soon as possible,for a fair price.way to much time put into what everyone is doing wrong cause no one knows.\nBottom line is this like another post said,:IF YOU ARE SERIOUS ABOUT DEANIMATION AT THE END MOVE THERE!","body_html":"<div class=\"md\"><p>First time a ever heard mike Darwin say CI tells it like it is and honest.We are a group that is run by nonpayed people,try to get you help and get the funeral guy to put you on ice and get you to Detroit as soon as possible,for a fair price.way to much time put into what everyone is doing wrong cause no one knows.\nBottom line is this like another post said,:IF YOU ARE SERIOUS ABOUT DEANIMATION AT THE END MOVE THERE!</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f0x6jnn/","name":"t1_f0x6jnn","created":1569051996,"created_utc":1569023196,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_d6s41b","id":"f13qx3z","author":"Lakejamescabin","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"Mike,Interesting how you say how many old time members are coming over to CI because of bad management and costs.\nIt’s about time!Everyone is complaining about no say with Alcor directors and at least at CI the members vote and elect there own directors that drive the group.\nIt almost seems to me the big difference to me is how each group operates with Alcor expenses annually over $1.5 million while CI less than 1/3 of that with around the same number of patients.\nIt’s seems like Alcor is for profit and CI really are great money savers making them lasting many years longer.\nSomething not know by many people is body transport permit out of county could be your biggest holdback on quick responding to CI\nor other providers.If you die on Saturday,good chance you wouldn’t get permit till Monday,especially in low populated areas","body_html":"<div class=\"md\"><p>Mike,Interesting how you say how many old time members are coming over to CI because of bad management and costs.\nIt’s about time!Everyone is complaining about no say with Alcor directors and at least at CI the members vote and elect there own directors that drive the group.\nIt almost seems to me the big difference to me is how each group operates with Alcor expenses annually over $1.5 million while CI less than 1/3 of that with around the same number of patients.\nIt’s seems like Alcor is for profit and CI really are great money savers making them lasting many years longer.\nSomething not know by many people is body transport permit out of county could be your biggest holdback on quick responding to CI\nor other providers.If you die on Saturday,good chance you wouldn’t get permit till Monday,especially in low populated areas</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f13qx3z/","name":"t1_f13qx3z","created":1569192756,"created_utc":1569163956,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_d6s41b","id":"f3vzt4h","author":"YENT69","parent_id":"t3_d6s41b","subreddit_id":"t5_2r11d","body":"After reading this expansive thread, my answer would be yes! As long as the Alcor board keeps bringing cronies and lackeys onto the board and as long as the Coward, the Bully, the Liar, and the Cunt work at Alcor, nothing will ever change. Seems like a terrible place to join and have to rely on them to give you a \"good\" cryopreservation.","body_html":"<div class=\"md\"><p>After reading this expansive thread, my answer would be yes! As long as the Alcor board keeps bringing cronies and lackeys onto the board and as long as the Coward, the Bully, the Liar, and the Cunt work at Alcor, nothing will ever change. Seems like a terrible place to join and have to rely on them to give you a &quot;good&quot; cryopreservation.</p>\n</div>","permalink":"/r/cryonics/comments/d6s41b/can_alcor_get_any_worse/f3vzt4h/","name":"t1_f3vzt4h","created":1571217421,"created_utc":1571188621,"subreddit_name_prefixed":"r/cryonics","depth":0}]}