{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Итак, недавняя криоконсервация во Флориде вызвала довольно горячую «дискуссию» здесь ... так что я подумал, что, может быть, это хороший шанс поговорить о какой-то большой картине здесь ... потому что большая картина важна ..\n\nтеперь, несмотря на обвинения в другой ветке, я думаю, что крио парень Флориды получил приемлемую криоконсервацию ... Я не просматривал пост Дарвина для деталей, но я помню, что у парня Флориды было около 8 часов при комнатной температуре, или что-то в этом роде ... который не конец света .. Я думаю, что парень Флориды когда-нибудь возродится ... почему? потому что его мозг не был превращен в суп на 24 или более часов при комнатной температуре ... или на 2 дня, или на какое-то другое теоретическое значение, когда мозг превращается в суп после посмертного временного хранения в комнате ...\n\nно этот случай несколько сбивает с толку ... этот парень из Флориды был богатым двигателем и шейкером в крионике на протяжении десятилетий ... и тот факт, что его мозг почти превратился в суп после смерти, должен заставить нас всех задуматься ... Я уверен, что в конце концов его семья поступила правильно ... его крионическая активность помогла многим людям ...\n\nи прежде чем я расскажу о том, как я не согласен с Дарвином, я думаю, что должен сказать, что я благодарен ему за то, что он опубликовал это здесь, и я благодарю его за его самоотверженность и тяжелую работу на арене крионики ...\nЯ читал Дарвина почти 25 лет ... он, наверное, самый знающий крионист в мире ... хорошо, что у нас есть кто-то с его знаниями и умением ...\n\nтем не менее, в последние несколько лет он начал стремиться снова влиять на крионику ... и этот квест заставил его сказать то, что он не должен говорить ... давайте просто оставим это в покое ...\n\nТеперь, почему я думаю, что его крионическая модель несовершенна и не должна быть принята:\n\nМайк Дарвин сосредоточен на том, чтобы сделать криоконсервацию лучше технически ... меньше льда в криоконсервированном мозге, лучший сбор данных и т. д. и он, несомненно, мог бы значительно улучшить крионику, если бы у него был свой путь ... но я держу пари, что число членов крионики будет быть значительно уменьшенным, если бы у него был свой путь ... и это неправильно ... я хочу, чтобы больше людей замерзли, а не меньше ... я не хочу отказываться от цифр для достижения технических улучшений ...\n\nпочему это?\n\nпотому что технические усовершенствования Дарвина бледнеют по важности по сравнению с личным положением членов крионики ... насколько они близки к месту фактического криоконсервации ... какие люди в своей жизни? Нет крио членов поблизости? БОЛЬШАЯ ПРОБЛЕМА!\n\nСколько раз мы видели, как активисты крионики нарушали закон Мерфи? Все, что может пойти не так, пойдет не так ...\n\nСнова и снова давние криоактивисты получают неоптимальные заморозки ... даже самое лучшее оборудование и самые хорошо обученные члены команды не могут остановить закон Мерфи ... все, что может пойти не так, пойдет не так ...\n\nтак что личное положение участников гораздо важнее идеалов Дарвина для технического совершенства.\n\nне то, чтобы техническое совершенство само по себе вредно ... но оно стоит больше денег ... разве это не имеет смысла? А расходы - это самая главная причина, по которой крионика не взлетела ... если бы цены были очень низкими, то они приходили ... и как только цифры росли, тогда следовали массы ... они стадное животное ... ..никогда этого не забывай...\n\nно однажды я поверил так, как верил Дарвин - когда я впервые начал серьезно относиться к крионике более двух десятилетий назад, я выбрал cryocare, а не alcor, потому что я принял дарвинское видение нетронутой криоконсервации ... но, когда я стал старше, и да, мудрее, Я вижу, что я был не прав тогда ... и что он не прав ..\n\nпока мозг не превращен в суп, у нас все будет хорошо. Это то, что я думаю сейчас.\n\nДарвин и его помощники заставят вас поверить в то, что если бы мы могли улучшить технические аспекты крионики, тогда ученые полюбили бы нас, и тогда бы пришли массы ... да, Майк, когда-нибудь мы сможем сделать идеальный крио и даже оживить животных ... и да тогда тогда ученые будут любить нас ... слава, слава, аллилуйя ... учитель ударил меня рулой ...\n\nНо эта техническая страна чудес крио-науки не за горами, как говорили Дарвин и другие ... еще много десятилетий ... время, чтобы осознать, что это техническое совершенство далеко не так ... и если это действительно так дело, то нам нужно уменьшить, переосмыслить, переоборудовать ...\n\nВместо науки нам теперь нужно обратиться к психологии и социологии, к общественным наукам. Знание этих наук может защитить нас, помочь удержать нас от сценария «мозгового супа» ... Религия может помочь нам ...\n\nда, Дарвин ответит здесь и скажет, что есть много технических улучшений, которые будут стоить немного ... и он прав ..\n\nно его общее видение не поможет нам завоевать членство .. и, как и вся пропаганда научной / медицинской рекламы в средствах массовой информации, мы далеко не близки к святому Граалю крионики ... или науки в целом .. Мы просто спотыкаемся ... и едва добираемся куда-то ... время, чтобы осознать это и принять меры в нашей личной жизни, чтобы улучшить наши ситуации, чтобы свести к минимуму закон Мерфи ...\n\nи стремление Дарвина к техническому совершенству может сделать крионику слишком дорогой и убить членов ... уничтожить крионику в поисках технического совершенства ...\n\n\nТеперь Дарвин ответит здесь и назовет меня гитлеровским криоником ... или кем угодно ... так что позвольте мне немного рассказать о себе и о том, что я думаю ...\n\nЯ нахожусь на моей второй чашке кофе ... дешевый магазинный бренд ... потому что ... ну, именно этим я и занимаюсь ... мой папа был дешевым, а я дешевле ... моя жена спит, хотя солнце уже взошло ... пора смотреть футбол сегодня и, возможно, заняться цифровым искусством ... когда я уйду на пенсию, я надеюсь сделать анимацию, чтобы донести до детей идеи крионики ... но это в будущем ... как долго в будущем? Год? 2? 3?\nИ вернемся к рутинному понедельнику ... у меня хорошая работа и много денег ... и я надеюсь, что все остальные крионисты преуспевают ... они мои братья, даже если они ошибаются ...\n\nА может я ошибаюсь ... А может Дарвин прав? Может быть, нам нужно искать массовое научное признание?\n\nМожет быть ... но я смотрю на мошенничество в сфере здравоохранения и здравоохранения, которое доминирует в Америке ... Я вижу, как фармацевтический картель покупает научные исследования, как если бы они были яблоками на обочине дороги ... и думаю про себя ... вы хотите Принятие из этого афера картеля?\n\nвот что я думаю: американская основная наука - это мошенническая операция, финансируемая глобальным капитализмом ... и главная цель не в развитии науки, а в том, чтобы сделать богатых богаче ...\n\nЧто ж, свободные маркетологи скажут, что жадность в конечном итоге гарантирует, что наука возродит крионику и даст нам бессмертие ... хорошо, может быть ... возможно, когда-нибудь ... в отдаленном будущем ... но если мы отдадим крионику сегодняшние научные мошенники, мы можем убить много криоников и помешать миллионам потенциальных членов когда-либо присоединиться ... почему это так? Потому что господствующий истеблишмент будет давить на нас за деньги ... увеличивать расходы ... и тем самым убивать многих из нас, лишая нас шансов на крионику.\n\nПозвольте мне повторить, что - переходя к мейнстриму, мы полностью отдаем себя истеблишменту и его правилам и его непрекращающейся жажде способа выжать людей с целью получения прибыли ... если глобальный капитализм получит в свои руки крионику, он так окупит политиков они могут выжать нас за все ...\n\nВот оно ... так что давайте вместо этого пойдем за пределы заведения ... Я не доверяю жадному заведению ... все, что хотят эти карьеристы, - это большой дом и социальный статус ... хрен их ...\n\nизбегать мошеннического мейнстрима ... и это ставит модель Дарвина под сомнение, если то, что я говорю, правда ...\n\nИ я не хочу быть слишком критичным по отношению к alcor или CI. Что-то лучше, чем ничего ... лучшее - враг хорошего, как однажды написал Майк Дарвин ...","title":"Будет ли план Майкла Дарвина по крионике уничтожить крионику, какой мы ее знаем? Давайте разберемся!","subreddit_name_prefixed":"r/cryonics","ups":0,"created":1569099380,"link_flair_background_color":"","id":"d7a5au","author":{"name":"anon_cryo"},"permalink":"/r/cryonics/comments/d7a5au/would_mike_darwins_plan_for_cryonics_destroy/","url":"https://www.reddit.com/r/cryonics/comments/d7a5au/would_mike_darwins_plan_for_cryonics_destroy/","created_utc":1569070580}