{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"> Я переживаю за нынешних и будущих пациентов и членов Alcor. Вот то, во что я сейчас верю по этому вопросу:\n>\n> Я считаю, что если директора Alcor будут и впредь отказываться от ответственности за свои действия, иными словами, отказывать своим членам в отстранении от должности и переизбирать директоров, то критические ошибки будут продолжаться.\n>\n> Я полагаю, что есть вероятность того, что менеджеры в любой компании, которые не несут строгой ответственности (в этом случае члены Совета директоров Alcor) перед другими (в данном случае это будут члены приостановления), и что эти директора не должны стоять в стороне на выборах и переизбрание каждые несколько лет будет выполнять работу хуже, чем люди в любой идентичной компании, которые работают в идентичных ситуациях, но которые должны отвечать кому-то, кроме себя, когда и если они делают ошибки.\n>\n> Я полагаю, что, похоже, существует тенденция, что иногда, когда новая ошибка Alcor действительно становится известной, она кажется хуже, чем многие из предыдущих.\n>\n> Я считаю, что совершается больше ошибок, чем узнает публика.\n>\n> Я считаю, что большинство членов Alcor не осознают, сколько ошибок совершается.\n>\n> Я считаю, что если и когда в Соединенных Штатах в конечном итоге откроется некоммерческая крионическая компания, и ее руководит совет директоров, который выступает за избрание и переизбрание акционерами, большинство из которых также будут членами отстранения, и имеет тип политики приостановки и хранения пациентов, который был у Alcor в лучшие времена, эта компания станет крупнейшей крионической компанией, и ее пациенты будут иметь лучшие шансы когда-нибудь реанимироваться.\n>\n> Я все еще надеюсь, что директора Alcor поймут и примут ситуацию, и внесут некоторые изменения, чтобы директора могли быть привлечены к ответственности и заменены за ошибки, если и когда они их допустят. Я думаю, что это улучшит Alcor, и я являюсь членами Alcor очень долгое время, я проделал большую работу для Alcor без оплаты, я сделал вещи для Alcor, которые привели к тому, что они значительно улучшили свое положение. Я хочу остаться членом Alcor, но их недавние действия начинают беспокоить меня.\n>\n> Я полагаю, что новая коммерческая компания, которая могла бы выполнять лучшую работу и с меньшими затратами для своих членов, могла бы быть сформирована и внедрена, если бы она привлекла лучшее управление бизнесом и лучшее приостановление и управление хранением пациентов и не столкнулась с какими-либо неизбежными основные ошибки в первые несколько лет.\n>\n> Я не думаю, что люди, которые говорили о создании новой компании, должны начинать с менее чем 3-4 миллионов долларов. Я думаю, что это можно было бы поднять, если бы заинтересовались некоторые богатые люди.\n>\n>\n> Я не верю, что директора делают ошибки нарочно. Но я считаю, что ошибки, совершенные людьми с хорошими намерениями, могут быть столь же разрушительными, как и ошибки, совершенные злыми людьми нарочно.\n\n> Дэвид Пизер\n\nСлужил казначеем и вице-президентом при 4 разных президентах Alcor\n\nЯ, Максимилиан Колер, не писал этого. Я скопировал его с: https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18341","title":"Что касается недавнего \"Алькор может убить тебя\". сообщений","subreddit_name_prefixed":"r/cryonics","ups":10,"created":1569696311,"link_flair_background_color":"","id":"daegqx","author":{"name":"MaximilianKohler"},"permalink":"/r/cryonics/comments/daegqx/regarding_recent_alcor_might_kill_you_posts/","url":"https://www.reddit.com/r/cryonics/comments/daegqx/regarding_recent_alcor_might_kill_you_posts/","created_utc":1569667511}