{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Нить на new_cryonet была удалена модератором из-за того, что Стефан опубликовал мое официальное имя и фотографию в качестве попытки \"изгнать меня\" как способ напасть на меня. Он сделал это после отказа от критики по поводу КИ.\n\nЯ буду публиковать удаленную ветку публично в качестве доказательства моих первоначальных утверждений о том, что нынешняя структура CI не ставит компетентных людей в ее руководство. Это также хороший пример того, как большинство членов CI относятся к своему лидерству, поскольку только небольшая часть членов CI прочтет это здесь или в new_cryonet.\n\nЯ хочу отметить для всех, для кого это было не очень очевидно, насколько непрофессионально и ненаучно поведение Стефана Борегара.\n\nТо, как он интерпретирует критику и критические вопросы о КИ как враждебные атаки, - это поведение религиозных фанатиков. Отсутствие способности обрабатывать критику. Отсутствие способности к спокойному, рациональному анализу. Отсутствие научной грамотности. Относиться к членам КИ как к злым троллям, чтобы получить его / КИ.\n\nПо иронии судьбы он не стесняется делать многочисленные, частые критические замечания и требования Алькор. Он любит подавать это, но не может принять это даже немного.\n\nСпособ, которым профессиональный, компетентный, научный ум подходит к такой критике и вопросам, заключается в том, чтобы сначала проанализировать, есть ли у них заслуга. Если они этого не делают, то следующим шагом является использование доказательств и / или логических доводов для противодействия обвинениям. Если они действительно имеют свои достоинства, то следующим шагом будет попытаться выяснить, как можно исправить проблемы, и предложить эти средства для критики.\n\nИз того, что я могу сделать вывод из поведения Стефана, он является частью проблемы в CI.\n\nОсновываясь на своем последнем ответе, который он дал, когда он, казалось, обнаружил мое юридическое имя и фотографию и «из меня», он не только утроил свою незрелость и логические ошибки * (кажется, он даже не знает, что они учитывая, как часто он их использует) *, но он продемонстрировал крайнюю некомпетентность.\n\nМое юридическое имя и фотография были предоставлены ему и другим членам правления CI, когда я писал им об этих проблемах в 2016 году, а затем снова в 2018 году. У него либо настолько плохая память, что он может считаться психически больным, либо он является совершенно некомпетентным и не читает никаких электронных писем, адресованных доске CI, и удаляет их. Что объясняет отсутствие ответов, которые я получил, когда связался с советом по информационным технологиям. Это означало бы, что он не понимает преимуществ демократии или ответственности выборных должностных лиц.\n\nЭто также происходит после того, как его коллега-член Совета директоров по информационным технологиям изложил набор правил для участия в new_cryonet, который включал уважение желаний людей оставаться анонимными.\n\nЧестно говоря, я очень удивлен, что он упал до этого нового минимума. В прошлом он подвергался критике, и я защищал его, по крайней мере, один раз, после чего он в частном порядке послал мне по электронной почте свои пожелания (и в этом письме использовалось мое официальное имя, как и я). Но мне никогда не казалось, что он ведет себя так нерационально, эмоционально и незрело.\n\n& # X200B;\n\n## Исходное сообщение:\n\n> Комментировать комментарии Стефана в этой теме: https://groups.yahoo.com/neo/groups/New_Cryonet/conversations/topics/18279\n>\n> Я смотрел, как Китай освещается в PBS https://www.youtube.com/watch?v=BIvtHOGykBk, и до меня дошло, насколько похож CI (Институт крионики) на Китай.\n>\n> Один руководитель CI контролирует все коммуникации между членами CI. И регулярно использую эту должность для личной выгоды.\n>\n> Фарс это выборы CI. Где участники получают 1 абзац информации, написанной кандидатом, по которому необходимо принять решение. Встроенный дизайн, который позволяет плате переизбирать себя.\n\n> В КИ нет мер по обеспечению честности выборов. Нет никаких доказательств того, что выборы являются честными и свободными от мошенничества. В подзаконных актах CI нет конкретных правил подсчета голосов или честности выборов.\n>\n> Нехватка информации, которую члены получают о решениях совета директоров и какова позиция каждого члена совета директоров по различным решениям.\n>\n> Даже Майк Герстнер играет роль пропагандиста и сеятеля дезинформации и выкладывает в открытую чрезвычайно опасные, коррумпированные и авторитарные заявления, которые, безусловно, вызовут существенную негативную реакцию у человека, который их скажет, если бы этот человек был у власти во времена КИ. Но скорее чиновники КИ просто позволяют «полезному идиоту» распространять эти понятия, и не возражают против них и не наказывают его за то, что он сказал их. Но если их оспаривать, они могут легко сказать: «Я не сказал / не одобрил эти заявления».\n>\n> У CI могут быть компетентные сотрудники в Энди Заваки и Хиллари Мартенсон, но сотрудники не управляют шоу. Китай имеет аналогичную структуру власти.\n>\n> КИ такая же демократия, как и Китай.\n>\n> Я никогда не просил КИ быть демократией. Но меня действительно раздражает то, что этот фарс постоянно рекламируется.\n>\n> Я вижу 3 основных варианта:\n>\n> 1. Неизбранная доска, как у Алькора.\n> 2. Демократия.\n> 3. Текущий микс, выбранный CI.\n>\n> Я считаю, что ужасная смесь КИ, где у вас есть эта притворная, непрозрачная и коррумпированная версия демократии, является худшим из возможных вариантов.\n>\n> Хватит притворяться тем, кем ты не являешься. Прекратите говорить членам одно, а делать другое. Это вредно, оскорбительно и опасно. Вы будете продолжать делать врагов из людей, которые должны быть союзниками.\n\nЯ добавлю ответы в комментариях.\n\n---\n\n** РЕДАКТИРОВАТЬ **: Тот факт, что Майкл Герстнер получил 59 голосов на выборах 2019 года, подтверждает мою точку зрения. https://www.cryonics.org/resources/board-minutes","title":"Заявление Стефана Борегара (члена правления CI) о том, что CI (Институт крионики) является демократией, и последующее обсуждение привело к удалению темы, свидетельствующей о моем первоначальном утверждении, что нынешняя структура CI не ставит компетентных людей в ее руководство.","subreddit_name_prefixed":"r/cryonics","ups":4,"created":1569869323,"link_flair_background_color":"","id":"db9qnh","author":{"name":"MaximilianKohler"},"permalink":"/r/cryonics/comments/db9qnh/stephan_beauregards_ci_board_member_claim_about/","url":"https://www.reddit.com/r/cryonics/comments/db9qnh/stephan_beauregards_ci_board_member_claim_about/","created_utc":1569840523}