{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"В 2016 году в The Ringer была опубликована длинная и очень проницательная статья о направлении развития крионики и продления жизни [https://www.theringer.com/2016/9/15/16038284/searching-for-deaths-cure- 834a02124ef5] (https://www.theringer.com/2016/9/15/16038284/searching-for-deaths-cure-834a02124ef5) Эта статья осталась практически незамеченной в сообществе крионистов, возможно, потому, что она была помечена как еще один неосведомленный нападение журналиста на крионику и продление жизни. Однако это не тот случай, и за три года, прошедшие с момента публикации этой статьи, картина крионики, которая была захвачена псевдонаучными религиозными мошенниками, стала более ясной, и необходимость что-то предпринять в связи с этим возросла. Эта статья в первую очередь о RAADfest и его спонсорах - Коалиции за радикальное продление жизни, которая, в свою очередь, является творением странного Скоттсдейла, AZ, «культа бессмертия», People Unlimited.\n\nВ значительной степени Алкор Макс Мор и Наташа Вита Море являются ключевыми фигурами на RAADfest, и за несколько месяцев до того, как RAADfest кто-нибудь, подписавшийся на список рассылки Humanity +, получает еженедельные электронные письма «X% скидка» от Наташа и криониста Жозе Кордьеро, соблазняющие их посетить \"возрождение\". RAADfest, People Unlimited считает, что они * уже бессмертны * и что любой может стать бессмертным, более или менее желая себе «клеточного пробуждения». Основатель группы, лаунж-певец по имени Чарльз Пол Браун, очевидно, не верил достаточно, поскольку несколько лет назад он умер от осложнений от диабета. Основой верований культа является книга, которую он написал, которую вы можете получить за $ 1,75 от Amazon: [https://www.amazon.com/Together-Forever-Invitation-Physically-Immortal/dp/1875281037] (https: / /www.amazon.com/Together-Forever-Invitation-Physically-Immortal/dp/1875281037)\n\nЭто интервью Ларри Кинга с двумя нынешними руководителями культа, Джеймсом Стролем и Берна Дином, даст вам лишь один намек на то, насколько сумасшедшими и лженаучными являются эти люди:\n\n[Https://www.youtube.com/watch?v=gAUtR-oAGOU](https://www.youtube.com/watch?v=gAUtR-oAGOU)\n\nМакс Мор был, по всем сообщениям, «поражен» людьми People Unlimited и неоднократно говорил окружающим, что Строл и БернаДин - «хорошие люди», которые заботятся о своих членах и достигли того, чего у Алкора никогда не было - создать дружную семью. Несколько человек в Alcor и за его пределами пытались рассуждать с Максом, говоря ему, что то, что он продвигал, было псевдонаучным культом и что это была полная противоположность тому, что представляют Alcor и крионика. Брайан Воук попытался убедить Совет Alcor, что Максу не разрешат участвовать в «Коалиции» или выступать на RAADfest из-за лженауки, которой он испортил Alcor, но он потерпел неудачу. Итак, Макс и Наташа остаются в «Коалиции» уже три года, а также рассылают спам своим соответствующим организациям (членство в Alcor первый год и с тех пор членство в H +) для участия в RAADfest. Таким образом, RAADfest предоставляет сцену, на которой можно представить свои презентации аудитории, готовой топать, хлопать и свистеть всем, кто говорит им то, что они хотят услышать, то есть бессмертие уже здесь, и вы можете его купить или, альтернативно, взять вдохновение от святого Бернадина Люди Неограниченного, * который уже будет жить вечно *; и все, что ей нужно было сделать, это петь, глядя в зеркало.\n\nЯ действительно понимаю, что многие крионики подумают, что я это придумываю, или что я участвовал в дикой гиперболе, но это не так, и есть множество свидетельств того, что всего в нескольких щелчках мыши в Интернете подтвердит то, что я говорю.\n\n** Просто посмотрите, что по этим ссылкам: **\n\n[Https://www.youtube.com/watch?v=jvXktrQQ-5M](https://www.youtube.com/watch?v=jvXktrQQ-5M)\n\n[Https://www.youtube.com/watch?v=jvXktrQQ-5M](https://www.youtube.com/watch?v=jvXktrQQ-5M)\n\n[https://culteducation.com/group/923-people-unlimited/7099-never-say-die-.html](https://culteducation.com/group/923-people-unlimited/7099-never-say -die-.html)\n\n[https://www.theringer.com/2016/9/15/16038284/searching-for-deaths-cure-834a02124ef5](https://www.theringer.com/2016/9/15/16038284/searching- для-смерти-панацея 834a02124ef5)\n\n** Билл Фалун из Фонда продления жизни и его «Церковь вечной жизни» (CPL) активно поддерживают People Unlimited и считают их образцом для продвижения крионики и продления жизни в будущем. ** Не случайно, что Фалун создал свою собственную церковь, и он настойчиво набирает всех, кого может, в крионике, чтобы придать ей авторитет, проповедуя там. На самом деле, я могу быть достаточно уверен, что Нил Ван Ди Ри из Церкви Вечной Жизни, которую он возглавляет. и сама Церковь хорошо принята и хорошо продумана большинством тех крионистов, которые знают о них, вероятно потому, что большинство крионистов не имеют ни малейшего представления, о чем они на самом деле или каков их конечный результат **, который превращает крионику в религиозную ( не квазирелигиозное) начинание как средство его быстрого роста **. Если вы сомневаетесь в отношениях между People Unlimited и CPL, просто посмотрите на это интервью с БернаДианом и Стролом, рядом с которым сидит Ван Дер Ри: [https://www.youtube.com/watch?v=jvXktrQQ-5M](https : //www.youtube.com/watch? v = jvXktrQQ-5M)\n\nили этот Билл Фалун, рекламирующий их на CPL: [https://www.youtube.com/watch?v=E62fC5fH1cA](https://www.youtube.com/watch?v=E62fC5fH1cA)\n\nЕсли все это не было достаточно плохо, Макс и Наташа недавно купились на еще один сумасшедший культовый курс, The Finder's Course, который Наташа рекламировала членам H +:\n\n** От: ** Наташа, Наташавита - больше. com [natasha@natashavita-more.com] (mailto: natasha@natashavita-more.com)\n\n** Кому: ** [hplusmembers@googlegroups.com] (mailto: hplusmembers@googlegroups.com)\n\n** Отправлено: ** Понедельник, 2 сентября 2019 г., 20:17:38 GMT-4\n\n** Тема: ** \\ [H + M \\] Мир и благополучие\n\nПользователи,\n\nМногие из наших друзей практикуют то, что интегрировано в повседневную жизнь. Это один из способов. Делай так, как тебе лучше. Наслаждайтесь: [https://www.youtube.com/watch?time\\_continue=23&v=Xnw-PdAsmuQ](https://www.youtube.com/watch?time_continue=23&v=Xnw-PdAsmuQ)\n\nНаташа\n\nПосле того, как вы посмотрели их рекламный ролик, который Наташа ссылается выше, я предлагаю вам прочитать эту блестящую деконструкцию Курса Искателей, которая была размещена на Reddit не так давно:\n\n[https://www.reddit.com/r/streamentry/comments/62ev8b/community\\_the\\_finders\\_course\\_techniques\\_and/](https://www.reddit.com/r/streamentry/comments/62ev8b / community_the_finders_course_techniques_and /)\n\nКурс «Finders» - это мошенничество с опорожнением от кошелька, которое представляет собой «схему быстрого просвещения», которая использует вид науки в качестве инструмента маркетинга, продает сомнительные формы духовности нового века (то есть закон притяжения, синхронность) и принимает психологическую обусловливание во многих формах 1) привлекать клиентов 2) продавать им дорогой продукт 3) убеждать их, что они достигли какого-то духовного пробуждения \". \\ [цитата из обзора Reddit выше. \\] Он заставляет замолчать большинство тех, кто критикует его, подписав соглашение о неразглашении (NDA), которое запрещает им говорить о курсе! У каждого поколения или около того есть новая схема сосания денег, «быстро-просвещенный-быстрый», которая использует видимость науки, чтобы продать себя. Я видел Саентологию, Трансцендентальную Медитацию (ТМ) (заплатили им ~ $ 250 в середине 1970-х), EST и Lifespring вспыхивают и умирают в течение последних полувека. Курс Искателя - просто другая такая вспышка в кастрюле. Чтобы быть ясным, я не говорю, что будет нехватка людей, которые утверждают, и даже чувствуют себя действительно лучше, чтобы потратить свои деньги таким образом, но это было (и верно) в отношении ТМ, Lifespring и т. Д. Для меня самой полезной вещью в деньгах, которые я заплатил за ТМ, было понимание того, как работают эти «движения» и как работают люди на разных уровнях организации, как психологически, так и прагматично. Я получил дешево.\n\nИтак, вот к чему это привело: крионику систематически угоняют кучка псевдонаучных психов, которых поддерживает Билл Фалун, который на сегодняшний день является основным источником больших денег в крионике. Для тех, кто высоко ценит Билла (не считая его денег), я думаю, что этот анекдот очень уместен. В конце 1970-х меня пригласили во Флориду, чтобы узнать, хочу ли я переехать туда и стать частью общества крионики Южной Флориды, стремящегося получить высококачественные услуги крионики. В тот день, когда я приехал, мне сказали, чтобы я обязательно услышал интервью Билла о крионике на местной радиостанции в Южной Флориде. Когда я слушал, я обнаружил, что Билл говорил слушателям, что собаки были восстановлены от криогенного замораживания и что человеческие органы для трансплантации обычно замораживаются и хранятся! Когда я столкнулся с этим Биллом, он небрежно сказал: «Если бы вы не говорили людям такие вещи, они бы никогда не восприняли крионику всерьез». В течение многих лет Сол Кент не давал Биллу избегать крионики, однако, как только что заметила Джаппи Хукстра на «Новой крионете», Саул болен и стар, и с 2000 года у него постоянно снижается способность делать это. Зебра не изменилась его полосы, его только что выпустили из ручки.\n\nНесколько недель назад кто-то прислал мне ссылку на одну из проповедей Билла на CPL [https://www.youtube.com/watch?v=jArXyb-pNcQ&feature=youtu.be](https://www.youtube.com /watch?v=jArXyb-pNcQ&feature=youtu.be), в котором он рассказал об исследовании, которое мы с Джерри Лифом провели в Cryovita, Inc., по поводу продолжительной асангиновой (бескровной) перфузии собак при +4 градусах C в течение 4 часов в 1980-е годы и то, что я и другие провели в 21-м веке в области исследований в области медицины и интенсивной терапии в середине и в конце 1990-х годов, в ходе которых мы смогли вылечить собак после 15-16 минут глобальной нормотермической ишемии последовательно и без какого-либо неврологического дефицита 75% времени. Эта работа была поддержана Фондом продления жизни, недавно переименованным в BRLS (Biomedical Research and Longevity Society, Inc.) через агентство Сола Кента. Билл рассказывает об этой работе в своей проповеди (с 4:25 до 4:52 по этой проповеди: [https://www.youtube.com/watch?v=jArXyb-pNcQ&feature=youtu.be](https://www. youtube.com/watch?v=jArXyb-pNcQ&feature=youtu.be)) было невероятно неверно. Я с ужасом слушал, когда мне сказали, что мы успешно восстановили собак после 6 часов простуды * остановки кровообращения * и 1 часа нормотермической ишемии! Это тот же самый BS, который он давал о крионике 40 лет назад. Похоже, тот, у кого есть золото, не только устанавливает правила; он также должен определить, что есть истина. Реальные истории того, чего мы достигли, находятся здесь:\n\n[Https://www.alcor.org/Library/html/tbwcanine.html](https://www.alcor.org/Library/html/tbwcanine.html)\n\nи здесь:\n\n[Https://www.youtube.com/watch?v=kUIVaM1Uahs&t=6s](https://www.youtube.com/watch?v=kUIVaM1Uahs&t=6s)\n\nЭто реальность Alcor и крионики сегодня.\n\nМайк Дарвин","title":"Как крионика превращается в псевдонаучный религиозный культ","subreddit_name_prefixed":"r/cryonics","ups":22,"created":1570269728,"link_flair_background_color":"","id":"ddh39j","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/","url":"https://www.reddit.com/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/","created_utc":1570240928,"replies":[{"ups":5,"link_id":"t3_ddh39j","id":"f2z2947","author":"KurtSchoedel","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":" I  just looked at both the PU and RaadFest websites. PU is definitely a  sponsor of Raadfest along with LEF (Bill Falloon).So, Mike's  characterization of PU linked with RaadFest seems correct to me.  \n I  have essentially no contact with the life extension \"community\" these  days. So I have no idea who's who any more.  But I can tell you that the  PU website definitely gives off the \"flaky\" vibe to me. I've been vaguely aware of CPL for some years. However, I've never paid any attention to them as I've viewed it as rather flaky. I get CPL emails  in my email feed and generally ignore and delete them.  \n\n\nThis  stuff may have appealed to me when I was young and impressionable  (early 20's). But I'm in my mid 50's today, with a career in hard  engineering (not IT or internet related stuff) and am thusly really put  off by this kind of flakiness today. I DO NOT, DO NOT, DO NOT want  cryonics to be sold as a \"religious\" thing or even associated with any  such thing. The problem with this stuff is that it attracts flakes and  flakes do not do real work.  \n\n\nIt  must be rooted in hard science and engineering and cannot be hyped up  or sold as anything different from that. I didn't even know what PU was  until I read mention of it here. They look like a real bunch of flakes  to me.\n\nI've never met Max's wife. But I have heard she came out of the entertainment industry (Hollywood). She is an artist. Some of this stuff may well appeal to her.\n\n&#x200B;\n\nLike I said, I have not been in the life extension/cryonics milieu for nearly 3 decades (I read papers and do stuff on my own). I am not well-versed as to what's going on. But the PU and CPL websites do not make a good impression on me. They radiate too much of the \"Dr. Phil\" touchy feely flakiness that I really believe is inappropriate for cryonics in general.","body_html":"<div class=\"md\"><p>I  just looked at both the PU and RaadFest websites. PU is definitely a  sponsor of Raadfest along with LEF (Bill Falloon).So, Mike&#39;s  characterization of PU linked with RaadFest seems correct to me.<br/>\n I  have essentially no contact with the life extension &quot;community&quot; these  days. So I have no idea who&#39;s who any more.  But I can tell you that the  PU website definitely gives off the &quot;flaky&quot; vibe to me. I&#39;ve been vaguely aware of CPL for some years. However, I&#39;ve never paid any attention to them as I&#39;ve viewed it as rather flaky. I get CPL emails  in my email feed and generally ignore and delete them.  </p>\n\n<p>This  stuff may have appealed to me when I was young and impressionable  (early 20&#39;s). But I&#39;m in my mid 50&#39;s today, with a career in hard  engineering (not IT or internet related stuff) and am thusly really put  off by this kind of flakiness today. I DO NOT, DO NOT, DO NOT want  cryonics to be sold as a &quot;religious&quot; thing or even associated with any  such thing. The problem with this stuff is that it attracts flakes and  flakes do not do real work.  </p>\n\n<p>It  must be rooted in hard science and engineering and cannot be hyped up  or sold as anything different from that. I didn&#39;t even know what PU was  until I read mention of it here. They look like a real bunch of flakes  to me.</p>\n\n<p>I&#39;ve never met Max&#39;s wife. But I have heard she came out of the entertainment industry (Hollywood). She is an artist. Some of this stuff may well appeal to her.</p>\n\n<p>&#x200B;</p>\n\n<p>Like I said, I have not been in the life extension/cryonics milieu for nearly 3 decades (I read papers and do stuff on my own). I am not well-versed as to what&#39;s going on. But the PU and CPL websites do not make a good impression on me. They radiate too much of the &quot;Dr. Phil&quot; touchy feely flakiness that I really believe is inappropriate for cryonics in general.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2z2947/","name":"t1_f2z2947","created":1570533133,"created_utc":1570504333,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_ddh39j","id":"f2r526l","author":"Lakejamescabin","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"Mike,\n  You are so right that cryonics is the opposite of religion and to mix the two should be criminal.The crazy religious cryonic people spouting scripture supporting it is nuts and religion is so far from facts and science it’s totally two different things.Just like the white people that hate blackpeople because of the one paragraph about blacks being “ the beast in the woods” means they are not humans but wild animals.Hate,hate,hate, that’s all religion teaches and for sure no science.mixing the two is like trying to mix oil and water!Knowing Dennis i am sure he only went to talk about CI and doesn’t believe there garbage.They probably started the church to get the nonprofit taxes status and not pay taxes on there money.","body_html":"<div class=\"md\"><p>Mike,\n  You are so right that cryonics is the opposite of religion and to mix the two should be criminal.The crazy religious cryonic people spouting scripture supporting it is nuts and religion is so far from facts and science it’s totally two different things.Just like the white people that hate blackpeople because of the one paragraph about blacks being “ the beast in the woods” means they are not humans but wild animals.Hate,hate,hate, that’s all religion teaches and for sure no science.mixing the two is like trying to mix oil and water!Knowing Dennis i am sure he only went to talk about CI and doesn’t believe there garbage.They probably started the church to get the nonprofit taxes status and not pay taxes on there money.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2r526l/","name":"t1_f2r526l","created":1570398617,"created_utc":1570369817,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_ddh39j","replies":[{"ups":2,"link_id":"t3_ddh39j","id":"f2lf1mj","author":"anarkrite","parent_id":"t1_f2l7hww","subreddit_id":"t5_2r11d","body":"What do you know about the stasis/timeship place in texas?\nAre they legit?\nI feel like i remember at one time they had some sort of tour for visitors available on their website but maybe that was just wishful thinking. They never seem to update their website and i never hear anything about them. Its always alcor alcor alcor.","body_html":"<div class=\"md\"><p>What do you know about the stasis/timeship place in texas?\nAre they legit?\nI feel like i remember at one time they had some sort of tour for visitors available on their website but maybe that was just wishful thinking. They never seem to update their website and i never hear anything about them. Its always alcor alcor alcor.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2lf1mj/","name":"t1_f2lf1mj","created":1570323127,"created_utc":1570294327,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f2kh79f","author":"Lakejamescabin","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"So true mike,but there is nothing us as customers can do.\nI sure hate to see it headed in this direction but nothing with Max More surprises me.\nHow does he stay running Alcor?","body_html":"<div class=\"md\"><p>So true mike,but there is nothing us as customers can do.\nI sure hate to see it headed in this direction but nothing with Max More surprises me.\nHow does he stay running Alcor?</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2kh79f/","name":"t1_f2kh79f","created":1570314319,"created_utc":1570285519,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_ddh39j","replies":[{"ups":2,"link_id":"t3_ddh39j","id":"f2u9jjx","author":"advancedatheist","parent_id":"t1_f2otcu5","subreddit_id":"t5_2r11d","body":"On the other hand, Mike, many religions have traditions of being friendly to the practice of medicine, such as it was in the past. The Jewish polymath Maimonides was a physician, for example, and to this day observant Jews hold medicine in high regard, as do most Christian sects. Religionists generally meddle where medicine intersects with the terminal points of human life, namely, conception and death, while they leave medicine free to do its thing in between. The challenge is to change religionists' thinking about the death side of health care to create some elbow room for cryonicists.  \n\nI don't see religion going away anytime soon, though I could see it evolving in the general direction of ethical-philosophical-meditative systems which downplay the woo-woo. It's interesting to me that both Stoicism and Buddhism are becoming influential in the West again, for example, though men prefer the former and women the latter. Seems like every month I see new one-off magazines for sale at supermarkets about \"mindfulness\" and the like. The marketing exploits the fact that women usually buy groceries for the family.\n\nIt's also possible that we could see something like a new Axial Age, where new kinds of religions emerge and flourish. Barring a catastrophe which extinguishes human life, the dominant world religion a thousand years from now probably hasn't even started yet.","body_html":"<div class=\"md\"><p>On the other hand, Mike, many religions have traditions of being friendly to the practice of medicine, such as it was in the past. The Jewish polymath Maimonides was a physician, for example, and to this day observant Jews hold medicine in high regard, as do most Christian sects. Religionists generally meddle where medicine intersects with the terminal points of human life, namely, conception and death, while they leave medicine free to do its thing in between. The challenge is to change religionists&#39; thinking about the death side of health care to create some elbow room for cryonicists.  </p>\n\n<p>I don&#39;t see religion going away anytime soon, though I could see it evolving in the general direction of ethical-philosophical-meditative systems which downplay the woo-woo. It&#39;s interesting to me that both Stoicism and Buddhism are becoming influential in the West again, for example, though men prefer the former and women the latter. Seems like every month I see new one-off magazines for sale at supermarkets about &quot;mindfulness&quot; and the like. The marketing exploits the fact that women usually buy groceries for the family.</p>\n\n<p>It&#39;s also possible that we could see something like a new Axial Age, where new kinds of religions emerge and flourish. Barring a catastrophe which extinguishes human life, the dominant world religion a thousand years from now probably hasn&#39;t even started yet.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2u9jjx/","name":"t1_f2u9jjx","created":1570439640,"created_utc":1570410840,"subreddit_name_prefixed":"r/cryonics","depth":2},{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","id":"f5plr2y","author":"[deleted]","parent_id":"t1_f5plo79","subreddit_id":"t5_2r11d","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f5plr2y/","name":"t1_f5plr2y","created":1572391197,"created_utc":1572362397,"subreddit_name_prefixed":"r/cryonics","depth":8}],"id":"f5oqczd","author":"[deleted]","parent_id":"t1_f2u3m1a","subreddit_id":"t5_2r11d","body":"[deleted]","body_html":"<div class=\"md\"><p>[deleted]</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f5oqczd/","name":"t1_f5oqczd","created":1572355724,"created_utc":1572326924,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f2qqt3j","author":"politicalcryo","parent_id":"t1_f2q3eo0","subreddit_id":"t5_2r11d","body":"accept cryoJesus as your savior, mike.\n\nPlease!","body_html":"<div class=\"md\"><p>accept cryoJesus as your savior, mike.</p>\n\n<p>Please!</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2qqt3j/","name":"t1_f2qqt3j","created":1570394549,"created_utc":1570365749,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f2pta5z","author":"cryonicschurch","parent_id":"t1_f2otcu5","subreddit_id":"t5_2r11d","body":"In Matthew 10 8 of the Weymouth New Testament, Jesus told his disciples to raise the dead:\n   “Cure the sick, **raise the dead to life**, cleanse lepers, drive out demons: you have received without payment, give without payment.”\n\n\n\nThe Decay of the Grave Cannot Inherit Immortality\n\nCorinthians 15 50 (Berean Literal Bible ) addresses the issue of whether we can live forever if we decay in the grave after death:\n\n\n50 Now I say this, brothers, that flesh and blood is not able to inherit the kingdom of God, **nor does decay inherit immortality**.\n\nJesus did not decay, and he was resurrected from the dead. Avoid decay to inherit immortality. Avoid the grave. Keep the information in your brain safe from decay.  Decay cannot inherit immortality. And decay is what awaits you in the grave.\n\nFrom Romans 8 21 (World English Bible), we see that:\n\n“creation itself also will be delivered from the **bondage of decay** into the liberty of the glory of the children of God.”\n\nCryonics Stops The Decay of the Grave So That We Might Die Like Jesus, Without Decay\n\n\nThat is what the life extension movement, transhumanism and cryonics are all about–ending our bondage to decay, ending our slavery to death, defeating death for God and ensuring immortality on earth for mankind, or at least for those who have preserved and guarded the Word of God even after death–thus preserving God’s vital information until the second coming and the resurrection. By baptizing ourselves in liquid nitrogen at death for cryopreservation, we avoid decay.\n\n\nThe Bible tells us about how Jesus fought against the decay of death. Acts 2 27 (World English Bible) tells us that\n“because you will not leave my soul in Hades, **neither will you allow your Holy One to see decay.**”\n\n\n\nThe Holy One here is Jesus.  Acts 2 31 (World English Bible) explains how Jesus fought against decay and thus was able to be resurrected:\n\n“he foreseeing this spoke about the resurrection of the Christ, that neither was his soul left in Hades, **nor did his flesh see decay.”**\n\nWe cryonicists want to die like Jesus–without decaying, and thus preserving our memories inside us for all time, including the Word of God that is the Bible verses stored in our memories. The Bible says that Jesus did not decay and that Jesus is associated with being imperishable–while man decays, and is perishable.\n\n\nGod Wants Us To Avoid The Decay Of The Grave\n\n\nAs further evidence of how God is commanding us to avoid the decay of the grave, let’s look at Acts 13 35 (World English Bible):  \n\n“Therefore he says also in another psalm, ‘**You will not allow your Holy One to see decay**.’”\n\n\nAnother version of this same verse, Acts 13, verse 35, from the New Living Translation bible, says:\n“You will not allow your Holy One to **rot in the grave**.” (NLT)\n\nAs for more evidence regarding the resurrection of Jesus and how he did not undergo decay, see Acts 13 37 (World English Bible):\n\n“But he whom God raised up saw **no decay.**”\n\n\nAnd from Psalm 16 10 (New American Standard Bible):\n\n“For You will not abandon my soul to Sheol; Nor will You allow Your Holy One to undergo **decay.**”","body_html":"<div class=\"md\"><p>In Matthew 10 8 of the Weymouth New Testament, Jesus told his disciples to raise the dead:\n   “Cure the sick, <strong>raise the dead to life</strong>, cleanse lepers, drive out demons: you have received without payment, give without payment.”</p>\n\n<p>The Decay of the Grave Cannot Inherit Immortality</p>\n\n<p>Corinthians 15 50 (Berean Literal Bible ) addresses the issue of whether we can live forever if we decay in the grave after death:</p>\n\n<p>50 Now I say this, brothers, that flesh and blood is not able to inherit the kingdom of God, <strong>nor does decay inherit immortality</strong>.</p>\n\n<p>Jesus did not decay, and he was resurrected from the dead. Avoid decay to inherit immortality. Avoid the grave. Keep the information in your brain safe from decay.  Decay cannot inherit immortality. And decay is what awaits you in the grave.</p>\n\n<p>From Romans 8 21 (World English Bible), we see that:</p>\n\n<p>“creation itself also will be delivered from the <strong>bondage of decay</strong> into the liberty of the glory of the children of God.”</p>\n\n<p>Cryonics Stops The Decay of the Grave So That We Might Die Like Jesus, Without Decay</p>\n\n<p>That is what the life extension movement, transhumanism and cryonics are all about–ending our bondage to decay, ending our slavery to death, defeating death for God and ensuring immortality on earth for mankind, or at least for those who have preserved and guarded the Word of God even after death–thus preserving God’s vital information until the second coming and the resurrection. By baptizing ourselves in liquid nitrogen at death for cryopreservation, we avoid decay.</p>\n\n<p>The Bible tells us about how Jesus fought against the decay of death. Acts 2 27 (World English Bible) tells us that\n“because you will not leave my soul in Hades, <strong>neither will you allow your Holy One to see decay.</strong>”</p>\n\n<p>The Holy One here is Jesus.  Acts 2 31 (World English Bible) explains how Jesus fought against decay and thus was able to be resurrected:</p>\n\n<p>“he foreseeing this spoke about the resurrection of the Christ, that neither was his soul left in Hades, <strong>nor did his flesh see decay.”</strong></p>\n\n<p>We cryonicists want to die like Jesus–without decaying, and thus preserving our memories inside us for all time, including the Word of God that is the Bible verses stored in our memories. The Bible says that Jesus did not decay and that Jesus is associated with being imperishable–while man decays, and is perishable.</p>\n\n<p>God Wants Us To Avoid The Decay Of The Grave</p>\n\n<p>As further evidence of how God is commanding us to avoid the decay of the grave, let’s look at Acts 13 35 (World English Bible):  </p>\n\n<p>“Therefore he says also in another psalm, ‘<strong>You will not allow your Holy One to see decay</strong>.’”</p>\n\n<p>Another version of this same verse, Acts 13, verse 35, from the New Living Translation bible, says:\n“You will not allow your Holy One to <strong>rot in the grave</strong>.” (NLT)</p>\n\n<p>As for more evidence regarding the resurrection of Jesus and how he did not undergo decay, see Acts 13 37 (World English Bible):</p>\n\n<p>“But he whom God raised up saw <strong>no decay.</strong>”</p>\n\n<p>And from Psalm 16 10 (New American Standard Bible):</p>\n\n<p>“For You will not abandon my soul to Sheol; Nor will You allow Your Holy One to undergo <strong>decay.</strong>”</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2pta5z/","name":"t1_f2pta5z","created":1570378808,"created_utc":1570350008,"subreddit_name_prefixed":"r/cryonics","depth":2},{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","id":"f5conxg","author":"Hobbit-Habit","parent_id":"t1_f57nebf","subreddit_id":"t5_2r11d","body":"A. Stuart Otto is the pastor I was thinking of. I said that some cryonicists read his newsletter, which is, surely, indisputable, while you claim that no-one took him seriously, a mind-read on your part, I'd say.\n\nYour distinction between hope and faith is of little value in practice, since many cryonicists pay their dues and maintain their whole of life-insurance policy in the expectation that they have thereby \"taken care of it.\" But wait: doing those things does not actually buy one a cryonic suspension if by that we mean prompt perfusion and cool-down; instead, it merely buys the *option* on a cryonic suspension, a distinction that hardly any of the membership seem to think about or act upon. Therefore, their approach to the matter is indeed similar to the idea of doing good works or paying an indulgence in this life in the hope of earning a place in the next world.\n\nRereading the above, I get the uh-oh feeling that you might once again accuse me of repeating some of your words. But no, I'm doing just what I stated: publishing some thoughts that have incubated for many years. Although I've been a longtime observer of \"cryonics\" the project, my interest in it has been on hiatus for at least ten years and I've never looked at New Cryonet. I sometimes have read papers in cryobiology and even a cryonics suspension report or two because I'm intellectually curious about everything.\n\nSome people flatter themselves that they're free of the \"mystical thinking\" of their ancestors. I don't disrespect the methods and models my ancestors used to explain and cope with the world and pass on practical lessons to their children, in the form of fairy tales, for example.","body_html":"<div class=\"md\"><p>A. Stuart Otto is the pastor I was thinking of. I said that some cryonicists read his newsletter, which is, surely, indisputable, while you claim that no-one took him seriously, a mind-read on your part, I&#39;d say.</p>\n\n<p>Your distinction between hope and faith is of little value in practice, since many cryonicists pay their dues and maintain their whole of life-insurance policy in the expectation that they have thereby &quot;taken care of it.&quot; But wait: doing those things does not actually buy one a cryonic suspension if by that we mean prompt perfusion and cool-down; instead, it merely buys the <em>option</em> on a cryonic suspension, a distinction that hardly any of the membership seem to think about or act upon. Therefore, their approach to the matter is indeed similar to the idea of doing good works or paying an indulgence in this life in the hope of earning a place in the next world.</p>\n\n<p>Rereading the above, I get the uh-oh feeling that you might once again accuse me of repeating some of your words. But no, I&#39;m doing just what I stated: publishing some thoughts that have incubated for many years. Although I&#39;ve been a longtime observer of &quot;cryonics&quot; the project, my interest in it has been on hiatus for at least ten years and I&#39;ve never looked at New Cryonet. I sometimes have read papers in cryobiology and even a cryonics suspension report or two because I&#39;m intellectually curious about everything.</p>\n\n<p>Some people flatter themselves that they&#39;re free of the &quot;mystical thinking&quot; of their ancestors. I don&#39;t disrespect the methods and models my ancestors used to explain and cope with the world and pass on practical lessons to their children, in the form of fairy tales, for example.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f5conxg/","name":"t1_f5conxg","created":1572167148,"created_utc":1572138348,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f559dn2","author":"Hobbit-Habit","parent_id":"t1_f2otcu5","subreddit_id":"t5_2r11d","body":"> This whole cult religion thing in cryonics is very recent. Up until this started the last thing any cryonics organization wanted to be associated with was religion of any kind. There were plenty of good reasons for this:\n\nThat's simply not true, although it was small. I recall a periodical newsletter from the 80s, read by some cryonicists, from a pastor who wrote that immortality was a state of mind, and who also spoke favorably of cryonics. Infuriatingly, that data and even the name isn't now available to me, but I'm sure other longtime observers know who I'm referring to.","body_html":"<div class=\"md\"><blockquote>\n<p>This whole cult religion thing in cryonics is very recent. Up until this started the last thing any cryonics organization wanted to be associated with was religion of any kind. There were plenty of good reasons for this:</p>\n</blockquote>\n\n<p>That&#39;s simply not true, although it was small. I recall a periodical newsletter from the 80s, read by some cryonicists, from a pastor who wrote that immortality was a state of mind, and who also spoke favorably of cryonics. Infuriatingly, that data and even the name isn&#39;t now available to me, but I&#39;m sure other longtime observers know who I&#39;m referring to.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f559dn2/","name":"t1_f559dn2","created":1572031769,"created_utc":1572002969,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f2n7qwm","author":"advancedatheist","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"Speaking of cryonics-adjacent cults, there is also Martine Rothblatt's Terasem. I gather that the Chamberlains were involved with that.\n\nA profile about Rothblatt a few years ago listed among \"her\" accomplishments the founding of a new religion. I cringed when I read that, because you just can't found a religion like you can start a company. Oh, plenty of people can start cults and attract followers. I couldn't do that myself because I don't have the right sort of personality; but we have plenty of real examples of individuals who show that strange ability. \n\nHowever, a new religion has to grow organically from a cult over several generations through family transmission after the cult's founders have died, as we've seen with the standard example of Mormonism. \n\nI don't think Terasem, People Unlimited and the Church of Perpetual Life have that kind of potential after their respective founders and gurus pass from the scene.\n\nAnd this gets to another thing that has been bothering me about cryonicists for quite awhile now. For people who talk a lot about \"living forever,\" we don't seem to think about the effects of time very well. Perhaps that's because a lot of us don't read much history, though I've read a whole stack of books about the Enlightenment in recent years which has given me much think about. Reading about the transformation in the European mind a few centuries back has gotten me to wondering what could happen in the next 300-400 years.","body_html":"<div class=\"md\"><p>Speaking of cryonics-adjacent cults, there is also Martine Rothblatt&#39;s Terasem. I gather that the Chamberlains were involved with that.</p>\n\n<p>A profile about Rothblatt a few years ago listed among &quot;her&quot; accomplishments the founding of a new religion. I cringed when I read that, because you just can&#39;t found a religion like you can start a company. Oh, plenty of people can start cults and attract followers. I couldn&#39;t do that myself because I don&#39;t have the right sort of personality; but we have plenty of real examples of individuals who show that strange ability. </p>\n\n<p>However, a new religion has to grow organically from a cult over several generations through family transmission after the cult&#39;s founders have died, as we&#39;ve seen with the standard example of Mormonism. </p>\n\n<p>I don&#39;t think Terasem, People Unlimited and the Church of Perpetual Life have that kind of potential after their respective founders and gurus pass from the scene.</p>\n\n<p>And this gets to another thing that has been bothering me about cryonicists for quite awhile now. For people who talk a lot about &quot;living forever,&quot; we don&#39;t seem to think about the effects of time very well. Perhaps that&#39;s because a lot of us don&#39;t read much history, though I&#39;ve read a whole stack of books about the Enlightenment in recent years which has given me much think about. Reading about the transformation in the European mind a few centuries back has gotten me to wondering what could happen in the next 300-400 years.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2n7qwm/","name":"t1_f2n7qwm","created":1570341835,"created_utc":1570313035,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":3,"link_id":"t3_ddh39j","id":"f2sjusa","author":"TouchyTheFish","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"As Eric Hoffer described in The True Believer, some people are predisposed to join cults and mass movements. Fanatic Nazis would often become equally fanatic Communists, almost as if the organizations themselves were interchangeable. \n\nThis can affect otherwise intelligent and rational people, presumably even those introspective enough to realize that they are so affected. Consider Steve Harris, the techno-Mormon, who went from one form of ancestor worship to another. Instead of secret underwear and ancestors in heaven he gets the possibility of revival by future anthropologists to learn about their past.","body_html":"<div class=\"md\"><p>As Eric Hoffer described in The True Believer, some people are predisposed to join cults and mass movements. Fanatic Nazis would often become equally fanatic Communists, almost as if the organizations themselves were interchangeable. </p>\n\n<p>This can affect otherwise intelligent and rational people, presumably even those introspective enough to realize that they are so affected. Consider Steve Harris, the techno-Mormon, who went from one form of ancestor worship to another. Instead of secret underwear and ancestors in heaven he gets the possibility of revival by future anthropologists to learn about their past.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2sjusa/","name":"t1_f2sjusa","created":1570412576,"created_utc":1570383776,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":2,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","id":"f55am6w","author":"Hobbit-Habit","parent_id":"t1_f4wnbbi","subreddit_id":"t5_2r11d","body":"> the collapse of civilization in Mexico won't stop at the border\n\nThat's quite a euphemism to unpack, right there; it's hilarious the mind-pretzels that some people tie themselves into to keep up their facade of respectability, of saying one thing and doing something quite different, of exhorting us to tolerate 'diversity' while working hard to move to less 'diverse' areas. How long will it be before the Arizonan cryonicists will be planning a move to Utah? Where does it end? Alberta? With global warming, not out of the question..\n\nAnd that's another problem","body_html":"<div class=\"md\"><blockquote>\n<p>the collapse of civilization in Mexico won&#39;t stop at the border</p>\n</blockquote>\n\n<p>That&#39;s quite a euphemism to unpack, right there; it&#39;s hilarious the mind-pretzels that some people tie themselves into to keep up their facade of respectability, of saying one thing and doing something quite different, of exhorting us to tolerate &#39;diversity&#39; while working hard to move to less &#39;diverse&#39; areas. How long will it be before the Arizonan cryonicists will be planning a move to Utah? Where does it end? Alberta? With global warming, not out of the question..</p>\n\n<p>And that&#39;s another problem</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f55am6w/","name":"t1_f55am6w","created":1572032517,"created_utc":1572003717,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f32qlfk","author":"Cryonics-01","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"After skimming through. IMO religious people are nothing other than crazy people. Also, everyone alive on Earth today will likely expire, because these LE supplements are primitive science and the only way to live indefinitely is to alter the very cellular mechanisms of which we are comprised in literally every single cell in the body. As for the Timeship, it will probably never be built, because it is too expensive right now and all these peoples mentioned money is going to their current CSOs after death.","body_html":"<div class=\"md\"><p>After skimming through. IMO religious people are nothing other than crazy people. Also, everyone alive on Earth today will likely expire, because these LE supplements are primitive science and the only way to live indefinitely is to alter the very cellular mechanisms of which we are comprised in literally every single cell in the body. As for the Timeship, it will probably never be built, because it is too expensive right now and all these peoples mentioned money is going to their current CSOs after death.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f32qlfk/","name":"t1_f32qlfk","created":1570651554,"created_utc":1570622754,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","replies":[{"ups":2,"link_id":"t3_ddh39j","replies":[{"ups":2,"link_id":"t3_ddh39j","replies":[{"ups":1,"link_id":"t3_ddh39j","id":"f2rmfhw","author":"TouchyTheFish","parent_id":"t1_f2q3aev","subreddit_id":"t5_2r11d","body":"Who was the audience for that presentation?","body_html":"<div class=\"md\"><p>Who was the audience for that presentation?</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2rmfhw/","name":"t1_f2rmfhw","created":1570403225,"created_utc":1570374425,"subreddit_name_prefixed":"r/cryonics","depth":8},{"ups":1,"link_id":"t3_ddh39j","id":"f2tszfb","author":"TouchyTheFish","parent_id":"t1_f2q3aev","subreddit_id":"t5_2r11d","body":"This is advanced alien technology, though. You don’t understand how far the place has regressed. It’s like they experienced a complete reversion to primitive superstition, only to lose that, too. They lack an awareness of something beyond oneself, without which even superstition is meaningless. \n\nThey are like beasts who know no gods or saints. They worship neither fire nor the sun, not even the chariot which draws it across the sky. They make no toast before drinking, and neither do they pour out libations in honor of their dead homies. They keep cats, not for worship as the Egyptians did, but as mere pets, for companionship, as they fear and distrust other humans. They have no custom of gift exchange or hospitality, stealing from host and guest alike.\n\nThe lowest of savages, Mike. Even ritual is lost to them.","body_html":"<div class=\"md\"><p>This is advanced alien technology, though. You don’t understand how far the place has regressed. It’s like they experienced a complete reversion to primitive superstition, only to lose that, too. They lack an awareness of something beyond oneself, without which even superstition is meaningless. </p>\n\n<p>They are like beasts who know no gods or saints. They worship neither fire nor the sun, not even the chariot which draws it across the sky. They make no toast before drinking, and neither do they pour out libations in honor of their dead homies. They keep cats, not for worship as the Egyptians did, but as mere pets, for companionship, as they fear and distrust other humans. They have no custom of gift exchange or hospitality, stealing from host and guest alike.</p>\n\n<p>The lowest of savages, Mike. Even ritual is lost to them.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2tszfb/","name":"t1_f2tszfb","created":1570428832,"created_utc":1570400032,"subreddit_name_prefixed":"r/cryonics","depth":8}],"id":"f2oxc93","author":"TouchyTheFish","parent_id":"t1_f2na8it","subreddit_id":"t5_2r11d","body":"Seeing that video from CCR/21CM and knowing it all went down the tubes is profoundly depressing. It’s like seeing some kind of advanced alien technology. Sectioning the brain and pin-pointing the infarcts that caused ataxia? Christ, I was lucky if I could get them to label the wires so I knew which thermocouple was which.","body_html":"<div class=\"md\"><p>Seeing that video from CCR/21CM and knowing it all went down the tubes is profoundly depressing. It’s like seeing some kind of advanced alien technology. Sectioning the brain and pin-pointing the infarcts that caused ataxia? Christ, I was lucky if I could get them to label the wires so I knew which thermocouple was which.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2oxc93/","name":"t1_f2oxc93","created":1570363446,"created_utc":1570334646,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f2mvpse","author":"advancedatheist","parent_id":"t1_f2kwlj8","subreddit_id":"t5_2r11d","body":"So what happens to Faloon's projects when he expires and presumably goes into cryo? I doubt his heirs will be so generous to cryonics organizations and nutty cults with whatever money they inherit from him.","body_html":"<div class=\"md\"><p>So what happens to Faloon&#39;s projects when he expires and presumably goes into cryo? I doubt his heirs will be so generous to cryonics organizations and nutty cults with whatever money they inherit from him.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2mvpse/","name":"t1_f2mvpse","created":1570337942,"created_utc":1570309142,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f2ki8mb","author":"Deku-shrub","parent_id":"t1_f2jo9y1","subreddit_id":"t5_2r11d","body":"It's not worth it for me as a Humanity+ associate to go onto this alas.","body_html":"<div class=\"md\"><p>It&#39;s not worth it for me as a Humanity+ associate to go onto this alas.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2ki8mb/","name":"t1_f2ki8mb","created":1570314648,"created_utc":1570285848,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f2ixg2k","author":"Deku-shrub","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"The relationship between Humanity+ and People Unlimited is more complex than what you have gleaned publicly.","body_html":"<div class=\"md\"><p>The relationship between Humanity+ and People Unlimited is more complex than what you have gleaned publicly.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f2ixg2k/","name":"t1_f2ixg2k","created":1570292935,"created_utc":1570264135,"subreddit_name_prefixed":"r/cryonics","depth":0},{"ups":0,"link_id":"t3_ddh39j","replies":[{"ups":0,"link_id":"t3_ddh39j","replies":[{"ups":0,"link_id":"t3_ddh39j","replies":[{"ups":0,"link_id":"t3_ddh39j","id":"f582fg5","author":"[deleted]","parent_id":"t1_f5812rl","subreddit_id":"t5_2r11d","body":"[removed]","body_html":"<div class=\"md\"><p>[removed]</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f582fg5/","name":"t1_f582fg5","created":1572076254,"created_utc":1572047454,"subreddit_name_prefixed":"r/cryonics","depth":6}],"id":"f55d3qc","author":"Hobbit-Habit","parent_id":"t1_f54ym46","subreddit_id":"t5_2r11d","body":"> <Show me where and how I'm wrong and I'll change my mind. I'll cheerfully admit an error if it's pointed out to me.>\n> \n> \n> \n> That's not my burden, it's yours.\n\nIt is yours, because the Truth is infinitely bigger than either of us. When I'm gone, the points I raise will still be on the table for the honest man to see.\n\nAgain, I would like to make the distinction between the technical feasibility of cryonics, which I accept, and \"cryonics\" as a multi-generation project here-and-now. You continue to prevaricate by switching from one to the other.\n\n> your position is nihilistic and there is literally no upside to that because it inherently squelches all efforts at remediation or progress of any kind.\n\nSo your argument for cryonics amounts to Pascal's Wager, a matter of faith, which puts the lie to the claim that \"cryonics\" (the project) is the opposite of religion.\n\nI don't get any \"jollies\" from this. I get a sad peace from articulating the truth, as I see it. I also want to give newcomers another viewpoint, so I'll be around for a little while. It might just save some young person a world of regret.\n\nADDENDUM:\nEven if one is a \"true believer\" in \"cryonics\" (the project) a case can be made that it would be better for Alcor, for example, to be forced by financial failure to be radically reorganized or folded into something else. It would be better to have that happen sooner rather than later and therefore it would be advisable to *discourage* newcomers from joining and to encourage its existing, wealthier members to at least withhold their donations even if they don't abandon it altogether.\n\nIsn't that funny.. Your willingness to prove me wrong is so **deficient** that I have to attempt the job myself.","body_html":"<div class=\"md\"><blockquote>\n<p>&lt;Show me where and how I&#39;m wrong and I&#39;ll change my mind. I&#39;ll cheerfully admit an error if it&#39;s pointed out to me.&gt;</p>\n\n<p>That&#39;s not my burden, it&#39;s yours.</p>\n</blockquote>\n\n<p>It is yours, because the Truth is infinitely bigger than either of us. When I&#39;m gone, the points I raise will still be on the table for the honest man to see.</p>\n\n<p>Again, I would like to make the distinction between the technical feasibility of cryonics, which I accept, and &quot;cryonics&quot; as a multi-generation project here-and-now. You continue to prevaricate by switching from one to the other.</p>\n\n<blockquote>\n<p>your position is nihilistic and there is literally no upside to that because it inherently squelches all efforts at remediation or progress of any kind.</p>\n</blockquote>\n\n<p>So your argument for cryonics amounts to Pascal&#39;s Wager, a matter of faith, which puts the lie to the claim that &quot;cryonics&quot; (the project) is the opposite of religion.</p>\n\n<p>I don&#39;t get any &quot;jollies&quot; from this. I get a sad peace from articulating the truth, as I see it. I also want to give newcomers another viewpoint, so I&#39;ll be around for a little while. It might just save some young person a world of regret.</p>\n\n<p>ADDENDUM:\nEven if one is a &quot;true believer&quot; in &quot;cryonics&quot; (the project) a case can be made that it would be better for Alcor, for example, to be forced by financial failure to be radically reorganized or folded into something else. It would be better to have that happen sooner rather than later and therefore it would be advisable to <em>discourage</em> newcomers from joining and to encourage its existing, wealthier members to at least withhold their donations even if they don&#39;t abandon it altogether.</p>\n\n<p>Isn&#39;t that funny.. Your willingness to prove me wrong is so <strong>deficient</strong> that I have to attempt the job myself.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f55d3qc/","name":"t1_f55d3qc","created":1572033974,"created_utc":1572005174,"subreddit_name_prefixed":"r/cryonics","depth":4}],"id":"f5404ch","author":"Hobbit-Habit","parent_id":"t1_f4ysg07","subreddit_id":"t5_2r11d","body":"> If cryonics is absolutely doomed to fail for the reasons you give, then why do you bother to post?\n\nI'm not interested in a contest. Show me where and how I'm wrong and I'll change my mind. I'll cheerfully admit an error if it's pointed out to me.","body_html":"<div class=\"md\"><blockquote>\n<p>If cryonics is absolutely doomed to fail for the reasons you give, then why do you bother to post?</p>\n</blockquote>\n\n<p>I&#39;m not interested in a contest. Show me where and how I&#39;m wrong and I&#39;ll change my mind. I&#39;ll cheerfully admit an error if it&#39;s pointed out to me.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f5404ch/","name":"t1_f5404ch","created":1571996579,"created_utc":1571967779,"subreddit_name_prefixed":"r/cryonics","depth":2}],"id":"f4uuos8","author":"Hobbit-Habit","parent_id":"t3_ddh39j","subreddit_id":"t5_2r11d","body":"Thanks for relieving my puzzlement at the strange cheer-squad audience I noticed when watching a Liz Parrish video talk.\n\nThis is simply the cryonics type taken flight -- fully-fledged, so to speak.\n\nIt is not an invasive species. It's a natural development.","body_html":"<div class=\"md\"><p>Thanks for relieving my puzzlement at the strange cheer-squad audience I noticed when watching a Liz Parrish video talk.</p>\n\n<p>This is simply the cryonics type taken flight -- fully-fledged, so to speak.</p>\n\n<p>It is not an invasive species. It&#39;s a natural development.</p>\n</div>","permalink":"/r/cryonics/comments/ddh39j/how_cryonics_is_being_turned_into_a/f4uuos8/","name":"t1_f4uuos8","created":1571858504,"created_utc":1571829704,"subreddit_name_prefixed":"r/cryonics","depth":0}]}