{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"https://www.nextgov.com/analytics-data/2019/10/military-algorithm-can-predict-illness-48-hours-symptoms-show/160851/\n\nВоенный алгоритм может предсказать болезнь за 48 часов до появления симптомов\n\nРуководитель программы говорит, что будущие войска могут быть развернуты с носимыми предметами, такими как часы или нагрудные ремни, которые будут знать, когда они заболевают и как долго они будут поправляться.\n\nВоеннослужащие США сильны, но они все еще люди, и люди иногда болеют. Но когда кто-то заболевает в последнюю минуту, это может иметь серьезные последствия для способности их подразделения выполнять критические миссии.\n\nАгентство по уменьшению угрозы обороны, или DTRA, пытается опередить эту проблему, разрабатывая прогностический алгоритм, который знает, заболевает ли военнослужащий - из-за чего-то от холода до воздействия биологического оружия - за 48 часов до того, как он начать показывать какие-либо симптомы.\n\n«Думайте об этом как о механизме проверки человеческого тела», - сказал Nextgov Эдвард Арджента, менеджер по науке и технологиям Объединенного научно-технического управления DTRA.\n\nDTRA заключила партнерское соглашение с подразделением оборонных инноваций, чтобы использовать другие полномочия по совершению сделок - особый метод закупок, выходящий за рамки Федерального регламента закупок, - для разработки алгоритма, тесно связанного с ИТ-компанией Royal Philips, работающей в сфере здравоохранения.\n\nИспользуя собственные глобальные наборы данных, Philips удалось разработать уникальный алгоритм для Министерства обороны. Используя 165 различных биомаркеров в 41 000 случаев, команда Philips смогла создать алгоритм быстрого анализа подверженности угрозам или RATE, который, по словам компании, может «прогнозировать заражение за 48 часов до клинического подозрения» с точностью выше 85%.\n\n«Для сравнения, эти показатели лежат в основе скрининговых тестов на рак молочной железы и рака простаты и первичного теста на болезнь Лайма на основе иммуноферментного анализа», - говорится в официальном сообщении компании.\n\n«Объединив крупномасштабные данные с нашим опытом в области ИИ и дистанционного мониторинга пациентов с стремлением DTRA к инновациям, мы смогли разработать высокопрогнозирующий алгоритм раннего предупреждения, основанный на неинвазивно собранных биомаркерах», - сказал Джо Фрассика, главный врач и руководитель исследований Philips в Северной Америке, говорится в релизе. «Несмотря на то, что данные RATE получены в условиях неотложной помощи, мы считаем, что они адаптированы для сотрудников, работающих в активном режиме».\n\nВ то время как Philips будет хранить свои данные - с проведением первоначального тестирования, правительству не нужны эти проприетарные данные, говорит Арджента, - военные теперь имеют права интеллектуальной собственности на созданный алгоритм, что позволяет DTRA и дальше развивать программу для работы. для всех военнослужащих, от бэк-офиса до поля битвы.\n\nПо словам Ардженты, решение, приобретенное через Philips, является «первым шагом в этом путешествии». «В конце концов, мы хотим, чтобы это было решение, состоящее из целых сил и всех военных действий. Но мы начали в клинических условиях, чтобы оценить состояние науки и посмотреть, сможем ли мы на самом деле туда добраться ».\n\nАрджента объяснил, что тестирование алгоритма в клинических условиях сыграло важную роль, поскольку разработчики смогли контролировать показатели жизнедеятельности пациента до того, как симптомы начали проявляться. Клиницисты увидели, что у пациентов развились такие вещи, как инфекции и сепсис, и смогли сравнить данные до появления симптомов и создать алгоритм, который мог бы предсказать начало заболевания за 48 часов до появления каких-либо внешних признаков.\n\n«В некоторых из этих клинических исследований вы ждете этих явных признаков и симптомов, а затем можете начать мониторинг», - сказал он. «Поскольку мы пытаемся быть прогнозирующими, нам нужно быть впереди любого события, которое мы можем считать биологическим или химическим воздействием или болезнью».\n\nОтсюда команда Argenta планирует усовершенствовать модель в военных госпиталях и клиниках, управляемых Департаментом по делам ветеранов.\n\n«Но в будущем мы стремимся довести это до тактического уровня и сделать это на уровне отдельных солдат», - сказал он.\n\nАлгоритм, разработанный Philips, в настоящее время использует две модели данных: одна использует лабораторные результаты, а другая использует только жизненно важные органы, полученные неинвазивными методами. Арджента сказал, что его команда сосредоточена на последнем.\n\n«Цель моего портфолио - никогда не уколоть, не заколоть и не взять у тебя образец», - сказал он. «Если я смогу сделать все удаленно, в цифровом виде, от наблюдения за вами с помощью носимого устройства, которое может сидеть на вашем теле - например, на часах или на нагрудном ремне - именно на этом было сосредоточено портфолио».\n\nНеинвазивная модель в настоящее время использует биомаркеры, такие как частота сердечных сокращений, насыщение уровня кислорода в крови, кровяное давление и температура.\n\n«Действительно, обычные измерения, которые легко регистрируются благодаря быстрому прогрессу в области носимых технологий», - говорит Арджента.\n\nАрджента сказала, что еще слишком рано говорить о том, должны ли войска присоединиться к программе мониторинга или быть зачислены на основании зачисления. По его словам, по мере развития программы руководителям департаментов придется посмотреть, как программа согласуется с доктриной, организацией, обучением, материально-техническим обеспечением, руководством и образованием, персоналом и оборудованием - процессом военной оценки, известным как DOTMLPF. Прежде чем любая новая технология будет развернута силами, руководство должно сначала изменить DOTMLPF, чтобы учесть новые возможности.\n\nОднако, по словам Ардженты, программе предстоит еще два-три года тестирования в операционных средах, прежде чем она достигнет этого состояния.\n\n«Эта первая попытка действительно является достаточно зрелой наукой», - сказал он. «В течение следующих двух лет мы выйдем на тактический уровень и посмотрим, будет ли этот [ранний] успех проходить через некоторые изменения DOTMLPF».\n\nАрджента добавил, что это мягкий график, хотя он считает, что это консервативная сторона. С учетом того, насколько быстро развивается эта технологическая область, он сказал, что некоторые инновации в частном или государственном секторе могут значительно ускорить реализацию программы.\n\nDTRA планирует продолжить работу с Philips, используя дополнительную опцию для продления OTA-контракта, поскольку департамент начинает эксплуатационные испытания в полевых условиях. Эти первые полевые испытания будут проведены в военных госпиталях и академиях, прежде чем они будут развернуты в бою.\n\nПо мере развития программы Арджента надеется, что алгоритм можно будет расширить, чтобы он был ориентирован на будущее, предсказывая, сколько времени понадобится войскам для восстановления после болезни, и предоставляя командирам достоверные данные о готовности к боевым действиям.\n\n«Мы думаем, что это первое, первоначальное умение действительно впечатляет», - сказал он. «И это открывает нам возможность продолжать выделять ресурсы и продолжать финансировать исследования и разработки, чтобы увидеть, как далеко мы можем зайти».","title":"Придет ли эффективная медицинская одежда для крионистов из военной техники?","subreddit_name_prefixed":"r/cryonics","ups":12,"created":1572088438,"link_flair_background_color":"","id":"dn8bh6","author":{"name":"advancedatheist"},"permalink":"/r/cryonics/comments/dn8bh6/will_an_effective_medical_wearable_for/","url":"https://www.reddit.com/r/cryonics/comments/dn8bh6/will_an_effective_medical_wearable_for/","created_utc":1572059638}