{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Если Алькор наймет еще одного директора по медицинскому реагированию, несмотря на его неудачный опыт работы с предыдущими сотрудниками на этой должности, это сделает штатных сотрудников Алькор, что? Двенадцать человек?\n\nЧто все эти люди делают каждый день, чтобы оправдать свою зарплату?\n\nhttps://www.alcor.org/blog/job-opening-medical-response-director/\n\nВакансия: директор медицинского реагирования\n30 октября 2019 г.\n\nНаписано администратором\n\nДИРЕКТОР МЕДИЦИНСКОГО ОТВЕТА\n\nОписание работы:\n\nAlcor Life Extension Foundation ищет директора медицинского реагирования (MRD), чтобы присоединиться к нашей высокофункциональной команде. Подотчетный непосредственно операционному директору, MRD отвечает за посмертную стабилизацию и транспортировку пациентов Alcor в Скоттсдейл, Аризона. MRD будет координировать свои действия с персоналом и подрядчиками Alcor для улучшения существующих процессов ожидания, стабилизации и транспорта (SST). MRD обеспечит надлежащее обслуживание оборудования для экстренного развертывания и предоставление нашим пациентам самого высокого качества обслуживания.\n\nMRD будет собирать соответствующие данные и обеспечивать составление подробных и своевременных полевых отчетов. MRD будет отвечать за набор подрядчиков, имеющих медицинскую квалификацию, надзор за процессом сертификации подрядчиков и проведение национальных и международных учебных занятий. MRD будет работать с персоналом Alcor, внешними врачами, учеными и консультантами, чтобы гарантировать, что процедуры отражают наилучшие имеющиеся медицинские и научные знания.\n\nДолжностные обязанности включают, но не ограничиваются:\n\n• Установите и поддерживайте контакт с врачом или медицинским учреждением члена Alcor после постановки диагноза и отслеживания состояния участника.\n\n• Сотрудничать с Комитетом по развертыванию, чтобы определить, когда следует активировать команду SST.\n\n• Организовать и контролировать процесс ожидания, в котором технические специалисты ожидают выполнения посмертных процедур стабилизации.\n\n• Установить контакт с местными похоронными бюро, чтобы помочь в стабилизации и подготовке к транспортировке.\n\n• Взаимодействовать с пациентами, семьями и местным медицинским персоналом после объявления юридической смерти.\n\n• Обеспечить своевременное применение протокола SST Alcor; который включает охлаждение поверхности, введение лекарств, поддержку сердечно-легочной системы, управление дыхательными путями и вымывание крови.\n\n• Контролировать транспортировку пациентов в Скоттсдейл, штат Аризона, и оказывать помощь в операционной Alcor.\n\n• Подготовьте подробные полевые отчеты о помощи, оказанной пациенту после завершения транспортировки.\n\nМинимальные квалификации:\n\n• Степень колледжа, предпочтительно связанная со здравоохранением.\n\n• 3+ года опыта работы в сфере здравоохранения.\n\n• Знакомство с правилами HIPAA и соблюдение правила конфиденциальности.\n\n• Способный поднимать, минимально, 50 фунтов.\n\n• Средний уровень владения продуктами MS Office.\n\n• Умение работать в совместной командной среде и должно быть комфортно в конце жизненного процесса.\n\nПредпочитаемые квалификации:\n\n• Зарегистрированная медсестра, фельдшер или сертифицированный перфузионист.\n\n• 5+ лет опыта в сфере здравоохранения.\n\n• 3+ года управленческого опыта.\n\nЛьготы:\n\n• Конкурентоспособная зарплата.\n\n• 401 тыс. С 5% взносов работодателя.\n\n• Медицинское, стоматологическое и визуальное страхование.\n\n• 10 оплачиваемых отпусков в год, а также щедрый отпуск и политика больничного времени.\n\n• Вознаграждение за обучение квалифицированному персоналу.\n\nПутешествие составляет около 30%.","title":"Открытие работы Alcor: директор медицинского реагирования","subreddit_name_prefixed":"r/cryonics","ups":5,"created":1572527103,"link_flair_background_color":"","id":"dpiwb0","author":{"name":"advancedatheist"},"permalink":"/r/cryonics/comments/dpiwb0/alcors_job_opening_medical_response_director/","url":"https://www.reddit.com/r/cryonics/comments/dpiwb0/alcors_job_opening_medical_response_director/","created_utc":1572498303}