{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"«В свои 20 лет я был убежден, что те, кто утверждает, что экзистенциальный риск является заброшенной областью чрезвычайной важности. Я был встревожен тем, что казалось очень важным пробелом в наших знаниях в соответствующих областях. Я был очень обеспокоен следующим наблюдением: ** Там не было такого понятия, как бессмертное человеческое общество. Все они были в конечном счете разрушены или преобразованы до неузнаваемости, не всегда в лучшую сторону. Я думаю, что есть веские аргументы, что конец нашего нынешнего общества, вероятно, повлечет за собой человеческое вымирание. ** Я работаю выяснить, является ли это вероятным. Смежными областями изучения являются институциональный дизайн и институциональная эпистемология. \"- Само Бурджа\n\n** Само Бурджа ** - это первоклассный интеллект, который предлагает уникальное и важное понимание механизмов цивилизационного успеха и неудачи. Я полагаю, что его работа имеет глубокие последствия для крионики и попыток достичь открытого существования как для отдельных лиц, так и для учреждений. Это хорошее видео введение в его стипендию, и я очень рекомендую это!\n\n# Цивилизация: институты, знания и будущее\n\n[https://www.youtube.com/watch?v=ACdYmuFyjWM] (https://www.youtube.com/watch?v=ACdYmuFyjWM) \n\n «История показывает нам, что мы не застрахованы от институционального краха. Достижения в области технологий смягчают некоторые аспекты, но создают свои собственные риски. Гибкие институты, использующие как социальные, так и технические знания, не только смягчают такие риски, но и обещают беспрецедентный рост человеческого потенциала. Мы возлагаем надежды нашего общего человеческого проекта по обновлению и росту всей цивилизации. Хорошо ли идет этот проект - это сложный, но жизненно важный вопрос. Этот доклад был представлен на памятнике Институту предвидения в августе 2018 года. Оригинальный доклад: [https: //foresight.org/event/civilizat...] (https://www.youtube.com/redirect?v=ACdYmuFyjWM&event=video_description&q=https%3A%2F%2Fforesight.org% 2Fevent% 2F Самоцибуржа: институты знаний и будущего - цивилизация% 2F & redir_token = zJ3eNosguD7VvQbD79Qyx9bQ2K98MTU3MjU5MDE5N0AxNTcyNTAzNzk3)  Извлечение из истории или вырождение из буржуазного процесса, в том числе и из-за того, что гражданское расследование или переход на гражданское наследие привели к тому, что гражданское наследие или гражданское наследие перешло в другое русло, в том числе в процессе гражданского или бурного развития несоответствующие традиции знаний и институтов, страдающих от склероза или отмеченных исключительными инновациями. Само Бурджа - социолог и основатель Bismarck Analysis, фирмы, которая анализирует институты от правительств до компаний. Его исследовательская работа сосредоточена на причинах распада и расцвета общества. Он пишет об истории, эпистемологии и стратегии. Больше от Само Бурджи: \"[https://twitter.com/SamoBurja]<span translate =\" no \"> (https://www.youtube.com/redirect?v=ACdYmuFyjWM&event=video_description&q=https%3A%2F% 2Ftwitter.com% 2FSamoBurja & redir_token = zJ3eNosguD7VvQbD79Qyx9bQ2K98MTU3MjU5MDE5N0AxNTcyNTAzNzk3) </ span> [https://medium.com/@samo.burja]<spwe = video_description & q = https% 3A% 2F% 2Fmedium.com% 2F% 40samo.burja & redir_token = zJ3eNosguD7VvQbD79Qyx9bQ2K98MTU3MjU5MDE5N0AxNTcyNTAzNzk3) </ span> http://www.tml> [<trans>> <http> </>> <http> </>> <http> </>> <http> </>> <http> </>> <http> </>> </>> </> </>> </>> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </> </>> .com / переадресация? v = ACdYmuFyjWM & событие = video_description & д = HTTP% 3A% 2F% 2Fsamoburja.com & redir_token = zJ3eNosguD7VvQbD79Qyx9bQ2K98MTU3MjU5MDE5N0AxNTcyNTAzNzk3) </ SPAN>","title":"Что случилось с Alcor (и почему цивилизации терпят неудачу)","subreddit_name_prefixed":"r/cryonics","ups":2,"created":1572533591,"link_flair_background_color":"","id":"dpjtoj","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dpjtoj/what_went_wrong_with_alcor_and_why_civilizations/","url":"https://www.reddit.com/r/cryonics/comments/dpjtoj/what_went_wrong_with_alcor_and_why_civilizations/","created_utc":1572504791}