{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Футуризм Водкасты, хорошие и плохие\n\n1. https://www.youtube.com/watch?v=2vxu6WVCSIk\n\n2. https://www.youtube.com/watch?v=GW6VWGxNfWo\n\nСравните и сопоставьте - запишите явные различия - и посмотрите на количество просмотров.\n\n** Обсуждение: **\n\nЯ мог бы выбрать много примеров из двух каналов: * Институт Форсайта * (FI) и * Наука и футуризм с Исааком Артуром * (SFIA).\n\nFI скрывает свои сабвуферы, но просмотры на его видео показывают, что он очень маленький, может быть, от одной до нескольких тысяч или около того. SFIA составляет более 400 тысяч. Я считаю, что производственные ценности определяют эти цифры.\n\n** Впечатления: **\n\nВ целом, видео FI скучно. У докладчика тихий голос, он начинает бормотать, и требуется время, чтобы добраться до сути. Название скучно. Камера имеет фиксированное расположение в задней части комнаты, где, что наиболее досадно для этого зрителя, можно увидеть, как восемь членов аудитории играют со своими смартфонами, едят и, в одном случае, печатают, пока ее обратно к ведущий. Седовласый человек возле камеры - еще одно оскорбление. Мы знаем, что есть грубые и отвратительные люди, но нет необходимости включать их в видео. Ведущий - фокус, но она далеко на расстоянии.\n\nВидео SFIA гораздо интереснее. Ведущий говорит четко и сразу начинает, задавая тему. Название очень резкое. На самом деле, все эти моменты можно сделать лучше (и я не фанат канала), но они гораздо лучше, чем видео FI. Там нет отвлекающих людей, которые не принадлежат в кадре. Графика приковывает, если она немного банальная и повторяющаяся.\n\n** Видимые цели: **\n\nЯ считаю, что SFIA - это по меньшей мере такой же художественный проект, как и образовательный. По сути, это развлечение.\n\nСайт FI описывает их миссию следующим образом:\n\n«Многие проекты посвящены выявлению угроз человеческому существованию, но очень немногие предлагают руководство по тому, к чему стремиться. Цель этого проекта состоит в том, чтобы отобразить пространство опасности и обещаний, которые предстают перед нами в надежде на то, что такие знания расширяют возможности. каждый из нас должен идти к великому будущему \".\n\nСудя по деятельности, которую они спонсируют, они особенно заинтересованы в поддержке исследований в области нанотехнологий.\n\n**Факторы производства:**\n\nПохоже, что видео FI сняли не более одного или двух человек.\n\nSFIA имеет большую команду добровольцев. Волонтеры жертвуют свое время на создание компьютерной анимации, сценариев и редактирования. Видео также основано на источниках стокового видео и музыки.\n\nОбратите внимание, однако, что SFIA начиналась как производство только одного человека и выросла за почти восемь лет своего существования.\n\n**Вывод:**\n\nВозможно, лучшее сравнение, возможно, было бы FI и Ted Talk, но, в любом случае, я считаю, что мы смотрим на ситуацию \"правило 80:20\" (или правило 90: 10) здесь: FI не нужно много усилий, чтобы резко поднять свою игру, по видео:\n\nОпытный, идущий оператор мог отследить докладчика и заинтересовать аудиторию только реакцией. Докладчик - красивая, молодая женщина, и, приложив немного усилий, она может быть более напористой и держать зрителей на ладони (докладчики-женщины на Youtube обычно получают несколько раз сабвуферы, что и мужчины-докладчики, при прочих равных условиях). ) вместо того, чтобы иметь низкоэнергетическую манеру, которую она имеет. Презентация могла бы быть лучше написана и содержательна, включая основные элементы риторики (эмоции, разум и этика).","title":"\"Футуризм\" Водкасты, хорошие и плохие","subreddit_name_prefixed":"r/cryonics","ups":0,"created":1572758450,"link_flair_background_color":"","id":"dqqo8u","author":{"name":"Hobbit-Habit"},"permalink":"/r/cryonics/comments/dqqo8u/futurism_vodcasts_good_and_bad/","url":"https://www.reddit.com/r/cryonics/comments/dqqo8u/futurism_vodcasts_good_and_bad/","created_utc":1572729650}