{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"крионическая колония в р.в парке в юма а.\n\n- определенное количество вышедших на пенсию крионистов с небольшим доходом, таких как выплаты по социальному обеспечению (SS), решают начать жить в Юме, штат Аризона, в одном или нескольких парках жилых домов и домов на колесах\n\n- каждый из них покупает дешевый трейлер / дом на колесах или Р.В. и живет в дешевом трейлере / трейлере в Юма Аз ... ежемесячная арендная плата за место в трейлере в Юме составляет, возможно, 200 $ в месяц ... для мобильный дом, арендная плата может составлять 400 долларов в месяц.\n\n- средняя стипендия СС составляет 1200 долларов в месяц, и этого вполне достаточно, учитывая, как они в основном живут скромным монахоподобным существованием ... едят бобы и рис и создают интернет-активность для крионики и обучения криоконсервации.\n\n- они все знают, где живут все остальные члены колонии, - у них есть подробные карты, показывающие, как добраться до трейлера всех других колонистов.\n\nЮма - довольно большой город, в котором есть все необходимые услуги. И это в Аризоне и примерно в 3 часах езды от Алкора.\n\nУ некоторых из колонистов есть морозильники для хранения пакетов со льдом в нескольких трейлерах / трейлерах.\n\n- есть детекторы движения, подключенные к веб-камерам в каждом трейлере / трейлере / трейлере, и другие участники отслеживают их каждый день ... они также могут отслеживать другие устройства данных, которые могут носить другие участники, и т. д.\n\n- когда один из них стареет и становится инвалидом, другие присматривают за ним ... нет домов престарелых ...\n\n- когда один из них умирает, все они действуют как команда, чтобы позвонить в alcor и помочь получить лед на голову покойного ... они помогают резервной команде ... тем самым помогают обеспечить хорошую криоконсервацию.\n\n-колонисты имеют медицинские доверенности для других колонистов.\n\n- аргумент здесь заключается в том, что такая крионическая колония гарантирует, что колонисты не получат плохую криоконсервацию и обеспечит (насколько это возможно), что они не будут похоронены / кремированы родственниками или правительством.\n\n-\n\nв качестве возможной альтернативы наличию крионической колонии в юме, азе, она может быть расположена в соединении мезы, аз или апача ац ... которые являются пригородом или фениксом .... ежемесячная арендная плата за парковочное место в этих пригородах составляет немного больше, чем юма - скажем, около 350 долларов в месяц ... или для мобильного дома, это может быть около 550 в месяц, включая канализацию, мусор и воду ... так немного больше, чем юма, но не намного больше , Конечно, выполнимо даже на доход СС. Конечно, Алькор мог добраться туда намного быстрее.\nСуществуют более старые мобильные дома в парковых домах на колесах в трейлерных парках Mesa Az, которые продаются за 10 тысяч долларов или даже значительно дешевле. Фикс-аппер, один предполагает. Старые RVs можно купить за 5–10 тысяч долларов. Просто купите его и отправьте в парк Феникса, и вот вы здесь.\n\nРасположение юмы предлагается в Аризоне как вариант с наименьшими затратами ... если мужчина собирается покинуть свою семью и дом и уехать в крионическую колонию, он должен быть дешевым.","title":"изучение идеи создания крионической колонии в парке трейлеров и автомобилей в Юме.","subreddit_name_prefixed":"r/cryonics","ups":3,"created":1572853136,"link_flair_background_color":"","id":"dr8u8x","author":{"name":"starmanjones101"},"permalink":"/r/cryonics/comments/dr8u8x/exploration_of_the_idea_of_a_cryonics_colony_in_a/","url":"https://www.reddit.com/r/cryonics/comments/dr8u8x/exploration_of_the_idea_of_a_cryonics_colony_in_a/","created_utc":1572824336}