{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Пока нет такой вещи.\n\nЯ думал, что соберу здесь ссылки на мои предыдущие посты и комментарии на эту тему. Я призываю вас дать ссылку на этот пост всем, кто в будущем упоминает интерес к этой или аналогичным идеям.\n\nМайк Дарвин не примет мое предложение о помощи, поэтому у кого-то есть возможность сделать это.\n\nПредложение состоит в том, чтобы запустить канал Youtube, который использует структурированную модель и использует методы, подобные следующему. Не обращайте внимания на содержимое этого канала и рассматривайте канал в целом просто как шаблон для бизнес-модели:\n\nhttps://www.youtube.com/user/JFGariepyVideo\n\nЯ делаю анализ этого канала, как такой шаблон, здесь:\n\nhttps://www.reddit.com/r/cryonics/comments/doqx8i/an_exploration_reddit_user_hobbithabits_comments/f63qiqf/\n\nЯ также коснусь этой идеи в следующих комментариях:\n\nhttps://www.reddit.com/r/cryonics/comments/dkhazm/why_reddit_should_be_the_next_major_public/f5s2dl2/\n\nhttps://www.reddit.com/r/cryonics/comments/dkhazm/why_reddit_should_be_the_next_major_public/f5tizji/\n\nhttps://www.reddit.com/r/cryonics/comments/doqx8i/an_exploration_reddit_user_hobbithabits_comments/f5z3jb6/\n\nhttps://www.reddit.com/r/cryonics/comments/doqx8i/an_exploration_reddit_user_hobbithabits_comments/f6gzmh6/\n\nВ дополнение к личному интересу (см. Ниже) у меня также есть сильная профессиональная мотивация для моего предложения по потоковому видео:\n\nЯ создаю портфель различных связанных с бизнесом услуг, которые я мог бы предложить как фрилансер. В дополнение к разработке программного обеспечения есть и другие услуги, которые я мог бы предложить, каждая из которых требует своего рода портфолио, например, нишевые сервисы для создателей контента Youtube, и работа в качестве продюсера или ассистента по производству является одной из таких услуг, поскольку есть люди, которые может предпочесть передать эту сторону на сторону.\n\nЕсли какой-либо предмет в моем портфолио приносил бы прибыль, то тем лучше, но сам предмет - мощная рекомендация, на которую можно указывать при продвижении своих услуг на сайтах фрилансеров и в социальных сетях.\n\nРеально, это конкретное предложение по потоковому видео никогда не принесет ни копейки. Я просто не знаю. Конечно, дело не в этом.\n\nЯ не должен быть частью реализации. Для всех, кто заинтересован: не стесняйтесь использовать любую часть вышеперечисленного по своему усмотрению!\n\nНа случай, если вы будете заинтересованы в том, чтобы я помог вам в таком проекте, я сделаю несколько замечаний о том, откуда я приехал:\n\nЯ принимаю разумную гипотезу крионики, описанную Робертом Эттингером в его книге «Перспектива бессмертия». Я бы только рассмотрел вопрос о регистрации в организации, которая использует ** медицинскую модель крионики **, выполненную компетентно и профессионально, как инициированные Джерри Лифом и Майком Дарвином, и с реальными, корректирующими отзывами в своих операциях. В настоящее время у меня нет необходимых финансовых средств и я слишком стар, чтобы получить доступное страхование жизни, так что это не ближайшая перспектива.\n\nЯ мог бы упомянуть, что я также являюсь ** национал-социалистом ** и целенаправленным человеком, но я не бью людей по голове этим. Любой, кто, таким образом, считает меня или таких, как я, «радиоактивными», просто [gaslit] (https://en.wikipedia.org/wiki/Gaslighting), но я не буду тратить время на споры с ними.\n\nЕсли вы хотите обсудить идею живого видео, вы можете связаться со мной по IM для получения моего адреса электронной почты.\n\n& NBSP; & NBSP;\n\n** ----------------- **\n** ДОПОЛНЕНИЯ **\n** ----------------- **\n\n& NBSP; & NBSP;\n\n** Почему этот проект произойдет ** в ближайшем будущем:\n\n& NBSP; & NBSP;\n\n  1. ** Преимущество первопроходца **. Если вы ищете на «крионике» на Youtube (который, кстати, является вторым по популярности поисковым движком после Google), то все, что появляется, - это глупые документальные фильмы и часто задаваемые вопросы по Alcor от шести лет назад, и ни у кого нет прямых трансляций, Когда-либо. Это зияющая ниша, ожидающая своего заполнения, особенно в связи с распространением более скоростной наземной широкополосной связи и в скором времени гораздо более дешевой спутниковой широкополосной связи.\n\n  2. ** Сообщество **. Это одна из подчиненных наград за принадлежность к группам общего интереса, а иногда и главная награда. Это основная человеческая потребность, которая до сих пор не удовлетворяется в крионике. Успех канала «шаблона», на который я ссылался, во многом связан с этим явлением.\n\n  3. [** Сетевой эффект **.] (Https://en.wikipedia.org/wiki/Network_effect) То есть среда, которая становится стандартной по умолчанию, потому что все остальные используют ее. Это явление относится как к каналам на платформе, так и к самой платформе. Примером последнего является сам Youtube, а выдающимся примером первого (а также примером первопроходца и, возможно, сообщества) будет [Новый Бостон] (https://www.youtube.com/user/thenewboston). , который в значительной степени изобрел серию обучающих видеороликов на YouTube, посвященных ИТ, и вырос до удивительных 2,34 млн. субтитров, прежде чем внезапно и без объяснений прекратить (самая распространенная теория для этого заключается в том, что ему заплатили за остановку такая учебная фирма, как Udemy) , Это пример эффекта сети, потому что раздел комментариев был местом, где ученики могли задавать вопросы многим людям на канале.\n\n& NBSP; & NBSP;\n\n** Больше идей для контента **:\n\n& NBSP; & NBSP;\n\n  1. Видео с телекамер, видеорегистраторов и стационарных видеокамер с высоким разрешением, из резервного персонала, транспортных средств и операционных залов при развертывании соответственно. Это могут быть живые или отредактированные записи. Он будет служить не только контентом для канала, но и подотчетностью и исторической записью для организаций. Это не та форма контента, которая появится в ближайшее время. Это придет только с революцией.\n\n  2. Объяснение предметов оборудования и демонстрации его использования, будь то специальные вылазки или как часть серии тренингов.\n\n  3. Мои форумы по крионике для интересных цитат и вопросов. Если вы видите, что дебаты продолжаются, пригласите противоборствующие стороны к потоку для живого обсуждения (но держите его гражданским). Это, вероятно, ** заставит ** многих людей смотреть.","title":"Живой видеоканал, посвященный крионике","subreddit_name_prefixed":"r/cryonics","ups":0,"created":1573076153,"link_flair_background_color":"","id":"dsgdy3","author":{"name":"Hobbit-Habit"},"permalink":"/r/cryonics/comments/dsgdy3/live_video_channel_centered_on_cryonics/","url":"https://www.reddit.com/r/cryonics/comments/dsgdy3/live_video_channel_centered_on_cryonics/","created_utc":1573047353}