{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"В последнем выпуске Обновления генерального директора Alcor News от Max More содержится следующее утверждение:\n\n«Мы благодарим тех из вас, кто откликнулся на призыв Alcor о финансовой поддержке. Мы рады сообщить, что десятки членов собрались вместе, чтобы внести более 70 000 долларов. Мы надеемся, что это широкое и сильное проявление поддержки подстегнет наших более состоятельных членов, которым еще предстоит пожертвовать, чтобы внести сумму, необходимую для завершения этой битвы и обеспечения нашей победы ».\n\nЕсли бы это было на самом деле все, что было в этой истории, то это было бы мрачной новостью для Alcor, учитывая, что типичный гонорар для ведущего судебного процесса составляет сейчас ~ $ 1 миллион, и эта почасовая ставка не включает такие расходы, как поддержка адвоката обвинения, вспомогательный персонал, показания, нотариусы, транскрипция, курьеры, частный следователь (-и), расходы на копирование и копирование и так далее. Таким образом, вероятные издержки Alcor довести это судебное разбирательство до завершения, без учета каких-либо апелляций, вероятно, составят от 1 до 2 миллионов долларов США.\n\nОднако это, очевидно, не та ситуация. Мне сказали, что, как и ожидалось, обычные подозреваемые кашляли где-то между $ 500K и $ 1 миллион, чтобы финансировать это судебное разбирательство. Это в дополнение к $ 70K, которые они выдавили из рядовых. Я понимаю, что эти деньги были предоставлены без каких-либо условий, чтобы Alcor изменила свою политику, процедуры или управление. Это важная стратегическая «победа» для Alcor, потому что она позволила им противостоять братьям Pilgeram (Курт и Карл). Это очень вредно, потому что заставляет их защищать этот иск и открывает для них дорогостоящие маневры, такие как обнаружение, ответ на ходатайства и дополнительные судебные издержки. Это также означает, что в случае потери Пилгерам этих исков существует разумная вероятность того, что они будут вынуждены оплатить все судебные издержки Алькор, которые могут легко превысить 2 миллиона долларов. Это ставит пилиграмов в такое положение, что, если они не выиграют свой иск и не победят встречный иск Алкора, они могут обанкротиться, если не смогут получить такой удар.\n\nДо сих пор в судебном процессе произошло то, что суд заставил «Алькор» доказать, что была воля, что соглашение было приложением к завещанию, а пилиграммы нарушают кодициль. Это важно, потому что у доктора Пилгерама была оговорка о лишении наследства в его завещании, в которой говорится, что если кто-либо оспорит его волю, он получит 1,00 $ * и * что, по крайней мере, корпус имущества будет предоставлен Alcor для покрытия их права расходы и не будут, в любом случае, идти на пилиграм. Почти в стороне, Alcor будет выплачен полис страхования жизни за 120 тыс. Долл. На доктора Пилгерама, который находится на счете в Granite Escrow and Settlement Resources.\n\nСудебный процесс начался в 2015 году, когда Pilgermans подала в суд на компанию Jackson National Life Insurance, потребовав выплатить компенсацию в размере 120 000 долларов США по полису вместо Alcor. Alcor оспорил это, Jackson National подала в суд успешно, чтобы выйти из судебного процесса, и деньги от полиса были переданы Granite Escrow, чтобы держать, пока вопрос не был улажен. Пилгерамы также требовали, чтобы Алькор предоставил доказательства, как по ДНК, так и по фотографии, что у них действительно есть головной мозг доктора Пилгерама в криогенном хранилище. Пилгерамы отказались от предложения Алькора выслать представителя Пилгерама в Скоттсдейл, чтобы осмотреть доктора Пилгерама, и вместо этого потребовали, чтобы Алькор отправил адвоката в Санта-Барбару, Калифорния, чтобы лично представить в суде фотографии доктора Пилгермана. Это было сделано 29 ноября 2015 года. В результате все это и решения суда заключаются в том, что «Алькор» должен будет судить дело в Калифорнии.\n\nСлучай Пилиграмса о том, что Алькор прекратил криоконсервацию доктора Пилгерама и вернул ему свой головной мозг, на основании прецедента, как в Калифорнии, так и за ее пределами, представляется крайне слабым. Пока во всех таких случаях Alcor преобладает. Таким образом, наиболее вероятный риск того, что Алькор по-прежнему подвержен риску, связан с утверждением Пилиграмов о том, что Алькор не выполнил свое Соглашение о криоконсервации с доктором Пилгерам, когда они превратили его из всего тела в нейро в морге в Санта-Барбаре, и что они вызвали чрезвычайную эмоциональный стресс, когда они отправили. Доктора Пилгерама хранят его у Курта Пилгерама, не сообщая ему, что они посылают их, и что более важно, что они превратили его из нейро всего тела, опять же, не уведомив братьев Пилгерам.\n\nОбщеизвестно, что побеждать в случаях эмоционального стресса и душевных страданий, при отсутствии серьезных физических травм или финансовых потерь. Вполне разумно, что суды неохотно раздают финансовые пособия за вред, который чрезвычайно трудно измерить или доказать объективно. Таким образом, если Пильгерамы будут преобладать, это, скорее всего, приведет к моральному возмущению в связи с тем, как Алькор вел себя в отношении того, как они поступили с доктором, Пилгерам и, что еще более важно, будет ли Алкор признан виновным в нарушении соглашения о криоконсервации с доктором. Пилгерам (то, что я, как один из соавторов этого контракта и посоветовал доктору Пилгерам о его исполнении, считаю, что они это сделали). Насколько серьезно суд (или суд присяжных) примет эти два вопроса, если они признают, что любой из них, для начала, определят характер и сумму решения и штрафных убытков, если таковые имеются. Это то место, где это помогает иметь сочувствующих и рыдающих ближайших родственников на стенде свидетелей.\n\nВероятно, это будет ключом к делу Пилиграмов, что они показывают, что это не было изолированной ошибкой со стороны Alcor, и что этот вид небрежного и произвольного неправильного обращения с пациентами является как системным, так и продолжающимся. Сколько из таких доказательств суд может считать значительным допустимым?\n\nДля меня совершенно невероятно, насколько я знаю, что ни один из взносов в «Алькор» для защиты этого иска не был в форме займа, при этом выплата по «Алькору» была преобладающей и возмещала его расходы. Таким образом, если Alcor выиграет и возместит свои расходы, они будут щедро вознаграждены за плохое поведение, что и сделало возможным, в первую очередь, неправомерное поведение / нарушение контрактной части этого судебного процесса. И это * есть * мясо этого судебного процесса. В качестве альтернативы, если Алькор проиграет, я практически не сомневаюсь, что те же источники больших (и маленьких) денег для финансирования этого судебного разбирательства будут накапливаться, однако потребуется еще много миллионов долларов, чтобы выкопать Алькор из любой дыры, в которой они оказались. конечно должно быть хорошо, чтобы быть Максом Мором.","title":"Обновленная информация о судебном процессе Пилгерам против Алькор","subreddit_name_prefixed":"r/cryonics","ups":12,"created":1573119844,"link_flair_background_color":"","id":"dsqcx7","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dsqcx7/update_on_pilgeram_v_alcor_litigation/","url":"https://www.reddit.com/r/cryonics/comments/dsqcx7/update_on_pilgeram_v_alcor_litigation/","created_utc":1573091044}