{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Несмотря на то, что он вовсе не критичен в отношении целенаправленной среды обитания крионики \\ *, я не думаю, что то, что было предложено до сих пор, является реалистичным. Послушайте, ребята, очень много тщательного обдумывания и планирования должно быть связано с тем, где вы собираетесь создать магазин, и это включает в себя гораздо больше, чем выбор дешевого, малонаселенного места, которое вам нравится. Некоторые из них уже подняли некоторые законные опасения по поводу доступа к важным услугам, и есть много других. Поверьте мне, я знаю, о чем говорю, потому что около 10 лет я жил в городе с населением 500 человек, и на самом деле у меня там еще есть 2 акра. Это час езды до ближайшего Walmart, как я оцениваю \"цивилизацию\" как таковую.\n\nВо-первых, вам нужно рассмотреть вопрос о доступе к компетентной (забыть о превосходной) медицинской помощи. Одна из этих вещей произошла с людьми, которые внезапно заболели в городе, где я жил; 1) им повезло и они выжили 2) они умерли до того, как смогли получить эффективную медицинскую помощь. EMS были все местные жители-добровольцы, и иногда они могли отвечать, а иногда нет. Они также были не очень хороши в EMS. Им понадобилось 20 минут, чтобы добраться до моего дома, когда он был в огне, и я жил в 4 милях от пожарной части; получить картину? 3) Они получили медицинскую помощь слишком поздно и перенесли ненужную заболеваемость или умерли. Это особенно верно в случае ударов. Пожилые люди все чаще нуждаются в обычной медицинской помощи даже задолго до того, как они откровенно стареют. Мой партнер и я испытываем это из первых рук. Вам не просто нужен врач; вам нужны правильные врачи и вам нужны компетентные. Если у вас почечная недостаточность, вам понадобится диализ 3 раза в неделю. Один из жителей моего бывшего города был вынужден продать свой дом с огромными потерями, потому что он не мог ездить по 1 часу каждый раз три раза в неделю.\n\nУ моего партнера только что была гастроскопия, и он мудро решил проехать 1,5 часа в Риверсайд, чтобы сделать это в больнице с полным спектром услуг, которая выполняет большое количество случаев и нанимает сертифицированного анестезиолога для проведения седации. Медицинская клиника в маленьком городке - хороший способ справиться с осложнениями или умереть. Риск того, что вы будете находиться под сознательным седативным эффектом (пропофолом) или анестезией, очень низок, но с возрастом вам может понадобиться это многократно. Вероятно, самой глупой вещью, которую когда-либо делала Джоан Риверс, было проведение какого-либо вида анестезии в любом месте, кроме как в медицинском учреждении. Ее смерть была столь же ненужной, сколь и небрежной. Одна из причин, по которой люди, особенно богатые люди, уходят на пенсию в Палм-Спрингс, который находится в 30 минутах от моего места жительства, связана с медицинским центром Эйзенхауэра, который так же хорош, как и для сообщества и зоны охвата такого размера. Сделайте инсульт и не получите быстрого доступа к самым современным услугам, и вы окажетесь в инвалидной коляске в доме по уходу.\n\nЯ не знаю каких-либо требований к участию коронера при использовании Калифорнийского опционного закона об окончании жизни. Тем не менее, этот акт очень и очень сложен для отдельного законодательного акта, и его следует согласовать с расческой с мелкими зубьями:\n\n[https://leginfo.legislature.ca.gov/faces/codes\\_displayText.xhtml?lawCode=HSC&division=1.&title=&part=1.85.&chapter=&article=](https://leginfo.legislature.ca.gov /faces/codes_displayText.xhtml?lawCode=HSC&division=1.&title=&part=1.85.&chapter=&article=)\n\nУ него невероятно строгие требования для подтверждения того, что вы являетесь резидентом ЦА; на самом деле мне придется проделать значительную работу, чтобы подготовиться. Вы также должны знать, что закон бесполезен, если у вас нет врача, который знает, как и готов его использовать. Большинство докторов из маленького города не захотят участвовать в умирающих с медицинской помощью (MAD), будут иметь моральные возражения или просто не захотят возиться со значительным объемом документов, которые требуются и которые должны быть заполнены несколько раз , И эта документация должна быть безупречна, иначе ее отбросят назад. Итак, я могу вам сказать прямо сейчас, что вам нужно быть рядом, * очень близко *, с городом какого-то размера, чтобы найти врачей, которые оба хотят и могут это сделать. Это то, что вы хотите проверить *, прежде чем * зафиксировать местоположение.\n\nКуча пожилых крионистов в одном месте хуже, чем бесполезна, если поблизости нет учреждений, укомплектованных молодыми, компетентными людьми для их лечения. И в этом заключается внутренний конфликт между стоимостью и местоположением. Я ненавижу жить там, где я сейчас живу, в городе с населением 23 тысячи человек. Еда отстойная, нет достойных развлекательных заведений, а ближайший хороший (не мам и поп) ресторан находится в 30 минутах езды от Палм-Спрингс, кстати, небольшой город с населением 44 тыс. Человек, но, по крайней мере, с некоторыми удобствами. цивилизации. Я презираю солнце и жару, и 4 месяца в году температура нередко составляет 110 градусов по Фаренгейту. Через 2 часа я нахожусь в Лос-Анджелесе в очень хороший день, а не в час пик.\n\nЯ нашел Риверсайд приемлемым местом для жизни и жил там много лет. У них даже есть вся еда там.\n\nТем не менее, стоимость жилья очень высока, средняя цена на жилье составляет 409 000 долларов, и арендная плата отражает это. Вот почему мы купили дом в глуши. Куча стариков, оставленных в трейлерном парке посреди ниоткуда, - ужасная идея. Помните, что многим людям может понадобиться временный уход на дому (например, после замены тазобедренного или коленного сустава), и эти учреждения также должны быть приличного качества и в непосредственной близости. Люди, которые серьезно относятся к этому (а я еще не видел), начинают с выяснения, где они могут получить возможность крионики находиться в состоянии, в котором доступен MAD, а затем начинают выполнять свою домашнюю работу с помощью таких инструментов: [ https://www.bestplaces.net/](https://www.bestplaces.net/) Обсуждение дешево.\n\nНа тему выполнения вашей домашней работы, SA продает свое роскошное многомиллионное место в Ранчо Маргарита; Нельзя сказать, что предоставляемые ими услуги принесут вам большую пользу, если вы не хотите, чтобы гравитационная перфузия выполнялась с помощью стремянки.\n\n\\ * Я использую слово «среда обитания», которое означает «естественный дом или среду животного, растения или других организмов, и это то, что крионисты действительно должны создать. Случайное определение этого слова -« обычное или предпочтительное окружение человека ». , который также на месте.","title":"О создании крионической среды обитания","subreddit_name_prefixed":"r/cryonics","ups":7,"created":1573136977,"link_flair_background_color":"","id":"dstr67","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dstr67/on_creating_a_cryonics_habitat/","url":"https://www.reddit.com/r/cryonics/comments/dstr67/on_creating_a_cryonics_habitat/","created_utc":1573108177}