{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"В крионике предполагается, что остеклованные ткани, хранящиеся ниже температуры стеклования (Tg), являются молекулярно неподвижными и останутся неизменными в течение столетий или даже тысячелетий. Превращенная в стекло ткань представляет собой комбинацию многокомпонентного химического стекла и химически разнообразных полимеров, состоящих из биологической структуры клеток и тканей, которые встроены в химическое стекло и которые также предположительно подвергались Tg из-за глубокого охлаждения. В этом отношении остеклованные ткани очень похожи на аморфные полимерные стекла, такие как коммерческие пластмассы, и даже на некоторые быстро остывающие (и остеклованные) металлы, такие как металл Вуда.\n\nВ отличие от наших ожиданий молекулярной неподвижности и неопределенно стабилизированных физических свойств все эти материалы претерпевают постоянные изменения, которые известны как «физическое старение». Казалось бы, нет оснований ожидать, что остеклованные ткани, хранящиеся выше точки их β-перехода (температура, при которой физическое старение задерживается для данного материала), будут вести себя иначе. Это явление имеет важные практические последствия в индустрии пластмасс, где, как считается, должно происходить не менее 60 лет. Известно, что независимо от окисления, эндогенных свободных радикалов, света, ультрафиолетового или ионизирующего излучения, все пластики со временем претерпевают серьезные изменения в своих физических свойствах, например, становятся более прочными и жесткими и, следовательно, более хрупкими (теряют пластичность).\n\nВ 1977 году химик-полимерщик Л.С.Э. Струик опубликовал сводную статью [span]  (https://drive.google.com/open?id=1viQM8576Ycg6lmC0MIU00Um3YZhknUVR) , объясняющую, почему происходит физическое старение. Он отметил, что аморфные материалы, включая полимеры, не находятся в состоянии равновесия, когда они находятся ниже Tg из-за высокой скорости, с которой они охлаждаются во время обычной обработки. На молекулярном уровне это означает, что расстояние между полимерными цепями или другими молекулярными компонентами, составляющими стекло, больше, чем было бы, если бы материал находился в равновесном состоянии. Как следствие, подвижность аморфного полимера ниже Tg не совсем равна нулю. Поскольку эти материалы быстро охлаждались (как в случае со стекловатыми органами), существует также очень небольшое количество движения, которое заставляет полимерные цепи или другие материалы, из которых состоит стекло, разрушаться в этот избыточный свободный объем. В результате цепи в аморфном полимере постоянно находятся в процессе сближения. При этом межмолекулярные притяжения между цепями усиливаются, что приводит к снижению свободы движений. На макроуровне это приводит к тому, что материал со временем становится прочнее и жестче, а также теряет пластичность.\n\nФизическое старение зависит от температуры, и если температура падает ниже β-перехода материала, физическое старение полностью прекращается. Тем не менее, в большинстве аморфных полимеров бета-переход является суббиентным. В полистироле (PS) это -5 ° C, в поливинилхлориде (PVC) это -50 ° C, а в поликарбонате (PC) это -100 ° C. Это важно, потому что все эти пластмассы используются в этом диапазоне температур. Отметим также, что разница между Tg и точкой бета-перехода для этих материалов постоянно превышает 100 ° C; Tg для PS составляет 100 ° C. Tg для ПВХ составляет 85 ° C, а Tg для ПК составляет 147 ° C.\n\nЯ не видел явления физического старения, обсуждаемого в литературе по витрификации органов или крионике. В случае с первым, это либо не считалось, либо считалось неуместным, поскольку не предполагалось, что хранение органов для трансплантации будет осуществляться десятилетиями, не говоря уже о столетиях. Я не знаю, какое значение имеет физическое старение для остеклованных биологических тканей, помимо вероятного изменения свойств их материалов (повышенная механическая хрупкость при хранении). Точно так же я не знаю, какая температура β-перехода будет для остеклованных биологических систем или с какой скоростью будет происходить физическое старение в тканях, органах или у пациентов с крионикой, хранящихся ниже Tg, но значительно выше -196 ° C. Если у кого-нибудь есть ответы на эти вопросы, я был бы признателен, если бы вы поделились ими.","title":"Физическое старение в витрифицированных тканях и органах?","subreddit_name_prefixed":"r/cryonics","ups":8,"created":1573586765,"link_flair_background_color":"","id":"dv8p4t","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dv8p4t/physical_aging_in_vitrified_tissues_and_organs/","url":"https://www.reddit.com/r/cryonics/comments/dv8p4t/physical_aging_in_vitrified_tissues_and_organs/","created_utc":1573557965}