{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"Новое для меня явление: внутриклеточная коллоидная витрификация в классических протоколах криоконсервации / медленного замораживания.\n\nКлючевым документом здесь представляется [Zhou et al 2009] (https://www.pnas.org/content/106/26/10632). Цитировать из этой статьи:\n\n«Экспоненциальный способ изменения вязкости в зависимости от объемной доли проливает свет на свойства составляющих частиц и взаимодействия между ними. ** Вязкость коллоидов твердых сфер, приближающихся к стеклованию, изменяется в зависимости от объемной доли, как описано уравнением Муни, тогда как вязкость молекулярной жидкости, приближающейся к стеклованию, изменяется с температурой T, как описано уравнением Фогеля-Фулчера-Таммана (VFT) ** ... Сходство между этими двумя уравнениями предполагает, что в этих системах Φ и 1 / T играют аналогичную роль в Подход к стеклованию. Отметим, в частности, что в определенных пределах уравнение Муни становится экспоненциальным по Ф, то есть подобным Аррениусу, и очень хорошо вписывается в данные для сжатых ячеек (рис. 4А). Таким образом, концепция Хрупкость, которая сыграла важную роль в классификации сильных и хрупких молекулярных стеклообразователей (29), может быть распространена на коллоидные стеклообразные системы ... Хрупкость для твердых sp здесь видно, что он довольно высокий, а хрупкость клеток значительно ниже (рис. 4B). ** Таким образом, наши данные показывают, что осмотически сжатая ячейка ведет себя совершенно иначе, чем суспензия твердых сфер; в то время как последний ведет себя как хрупкий стеклообразователь, эукариотическая клетка напоминает сильный стеклообразователь (29). **\n\nФизическая основа для сильного стекловидного поведения. ** То, что мягкая ячейка при сжимающем напряжении ведет себя как прочное стекло, является очевидным открытием и представляет основной результат этого отчета ** ... Мы обнаружили, что истощение АТФ сильно модулирует поведение стеклования в ячейке, что согласуется с понятием что неравновесные процессы могут модулировать поведение стеклования (35). ** Аналогично, мы обнаружили, что разрушение F-актина существенно увеличивает хрупкость, что согласуется с теоретической работой, демонстрирующей влияние геометрии частиц на поведение при стекловании ** (36). Кроме того, макромолекулы и органеллы в цитоплазме эукариот далеки от компактных твердых сфер. Даже при изотонической объемной доле, вероятно, что они сильно взаимодействуют друг с другом, в отличие от ситуации для суспензий твердых сфер при одинаковой объемной доле, и в этом случае частицы едва взаимодействуют **. ** Такие взаимодействия потенциально объясняют гораздо более высокую вязкость цитоплазмы по сравнению с таковой суспензии твердой сферы в той же концентрации. ** Что еще более важно, эти \"частицы\" деформируемы; Например, было показано, что под влиянием молекулярного краудинга белки деформируются и изменяют конформацию ** (14, 37). Таким образом, в этом отношении цитоплазма напоминает коллоидную систему отталкивающих, деформируемых частиц, примером чего являются суспензии звездчатых полимеров, мицеллы блок-сополимера и частицы мягкого микрогеля. Действительно, эти системы часто демонстрируют более постепенное увеличение вязкости, чем те, которые были обнаружены для коллоидов твердых сфер при приближении к стеклованию (38, 39). Кроме того, Mattsson et al. продемонстрировали прямую связь между деформируемостью отдельных частиц и хрупкостью, характеризующей переход коллоидного стекла ... Хотя механистическая связь между деформируемостью частиц и хрупкостью стекла остается неясной (40–42), сильная стекловидная динамика цитоплазмы очень напоминает обнаруженную в многолюдной суспензии отталкивающих мягких коллоидных частиц (рис. 4) ».\n\nРезультаты этой работы предполагают, что именно внутриклеточные белки, а не электролиты, такие как хлорид натрия, способствуют внутриклеточной коллоидной витрификации. Это имеет больше смысла, потому что кажется, что электролиты, скорее всего, выпадут в осадок или образуют эвтектику, прежде чем они претерпят большую часть коллоидного стеклования.\n\nЧжоу и др. 2009 не имеет ничего общего с криобиологией, но на нее ссылаются три важных документа:\n\nКларк и др. 2013 г .: [https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0066207](https://journals.plos.org/plosone/article?id=10.1371/journal .pone.0066207)\n\nФонсека и др. 2016: [https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0152939](https://journals.plos.org/plosone/article?id=10.1371/journal .pone.0152939)\n\nМенегель и др. 2019: [https://journals.plos.org/plosone/article?id=10.1371/journal.pone.0217304](https://journals.plos.org/plosone/article?id=10.1371/journal .pone.0217304)\n\nВ этих документах приводятся данные, позволяющие предположить, что во время медленного охлаждения клеток происходит внутриклеточное витрификация.\n\nОт Clarke et al 2013: «Второй ключевой фактор, который определяет, что клетка будет стекловаться при низкой активности воды, - это плотно упакованный внутренний слой клетки [26]. Коллоидная природа внутриклеточной среды означает, что при удалении воды увеличенная упаковка замедляет процессы внутриклеточной релаксации. Происходит резкое увеличение внутриклеточной вязкости, и клетка претерпевает переход коллоидного стекла \\ [27 \\]. ** Витрификация внутреннего пространства свободноживущей микробной клетки, подвергшейся воздействию льда в внешняя среда, таким образом, является, главным образом, результатом обезвоживания и аналогична витрификации коллоида, а не стеклованию объемной воды **. Хотя наши данные указывают на то, что витрификация неизбежна для любой свободноживущей микробной клетки, охлаждаемой в присутствии внешнего Во-вторых, диапазон значений Tg, обнаруженных в этом исследовании (таблица 1), указывает на то, что ** точное значение Tg изменяется, предположительно в ответ на изменения баланса между макромолекулами (преимущественно белки) и соединения с малой молекулярной массой, включая криопротекторы **. Относительно высокое значение Tg, обнаруженное у ледяной бактерии Pseudomonas syringae, и низкое значение, обнаруженное в снежной водоросли Chlamydomonas nivalis, позволяют предположить, что Tg можно регулировать в определенных пределах в зависимости от конкретной экологии отдельного организма. Организм, такой как C. nivalis, предположительно получал бы избирательное преимущество от низкой Tg, которая позволяла ему продолжать метаболизм до относительно низкой температуры, поскольку лед обычно всегда присутствует в его естественной среде обитания ».\n\nЕсли внутренняя часть клеток действительно претерпевает переход коллоидного стекла, то это, вероятно, важный вклад в то, что произойдет в следующих типах протоколов крионики:\n\n\\ - Незащищенное охлаждение, также известное как «прямое замораживание» - немного неясно, как / если оно действительно будет применяться, поскольку в этих исследованиях используются криопротекторы, но учитывая, что переход из коллоидного стекла может быть основной причиной того, что какие-либо компоненты клеток не разрушаются льдом.\n\n\\ - Классическая криоконсервация ака \"Заморозка\"\n\n\\ - Неполная перфузия криопротекторов в протоколах витрификации\n\nОчень открыты для мыслей или критики того, что я написал, или основополагающих данных, когда я пытаюсь понять эту литературу.","title":"Внутриклеточная коллоидная витрификация в протоколах криоконсервации - имеет ли это отношение к крионике?","subreddit_name_prefixed":"r/cryonics","ups":5,"created":1573636581,"link_flair_background_color":"","id":"dvk1kx","author":{"name":"Synopticz"},"permalink":"/r/cryonics/comments/dvk1kx/intracellular_colloid_vitrification_in/","url":"https://www.reddit.com/r/cryonics/comments/dvk1kx/intracellular_colloid_vitrification_in/","created_utc":1573607781}