{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":" Кросспост из cryonet3\n\n<Из того, что я видел до сих пор в своих заявлениях и решениях, братья Пилгерам (Pilgerams) - это неблагодарные, неуважительные, невнимательные приставания в отношении своего отца и его желаний. Одно дело - думать, что крионика не сработает, и совсем другое - решать, что твой собственный отец не имеет права выбирать его, особенно учитывая его пожизненную приверженность и интерес к криоконсервации. Он также не страдал от каких-либо психических дефектов в течение этого десятилетия. Точно так же, это верх высокомерия и неуважение к правам и суждениям других, чтобы попытаться запретить и уничтожить крионику в целом, только потому, что вы думаете, что это неправильно. Курт Пилгерам, в частности, кажется высокомерным и голодным, чтобы разрушить свободу действий других и, возможно, обогатиться в сделке.>\n\nТем не менее, Alcor совершил несколько очень серьезных ошибок, которые, отнюдь не будучи изолированной ошибкой, соответствуют другим небрежным и небрежным решениям в области ухода за пациентами, которыми они занимались на протяжении десятилетий. Кризис недофинансирования никогда бы не наступил, если бы Алькор не сделал:\n\nа) отказались от фонда непредвиденных расходов, существовавшего до 1993 года\n\nб) не придерживался политики решительного поощрения новых членов к выбору всего тела (ВБ) вместо нейро по причинам, связанным с общественностью, что снова было сделано начиная с 1993 года. Это изменило соотношение между ВБ и нейро\n\nc) намеренно держал минимальные значения ВБ значительно ниже предельных затрат на предоставление услуги. Действительно, ВБ сегодня поддерживаются только из-за перевеса в финансировании, созданного неврозами. Проще говоря, невропатенты несут пациентов всего тела на своих спинах, к которым я бы добавил, что у неврозов нет спины, чтобы их переносить.\n\nЭти вещи были сделаны на основе чрезвычайно оптимистичной и глубоко ошибочной новой операционной парадигмы, которая стала политикой Alcor в 1993 году: https://drive.google.com/open?id=1UOo5PxYIfmzUqMjzBL734HN\\_vwEGq8J3\n\nЭта новая парадигма сместила приоритеты Alcor в сторону увеличения числа членов и пациентов как ключа к достижению ожидаемой эффектной экономии за счет масштаба. На приведенном ниже графике, взятом из этой позиции, показана проекция (черные линии) и реальность (красные и желтые линии):\n\n[Https://drive.google.com/open?id=1RZrELl3uhycpkgQSFO4\\_cY34sZAInM3-](https://drive.google.com/open?id=1RZrELl3uhycpkgQSFO4_cY34sZAInM3-)\n\nПосле того, как эта политика была принята, жребий был брошен. Не упомянутый в статье, но неотъемлемая часть плана состояла в том, чтобы начать агрессивно продвигать ВБ и характеризовать нейро как «альтернативу бедняку», все потому, что считалось, что ВБ можно было бы легче продвигать в обществе.\n\nг) продолжали, как и сегодня, принимать страховые полисы, которые не защищены от инфляции. ** Такие политики защиты от инфляции не только широко доступны, они стоят всего на несколько долларов дороже в месяц. ** Alcor должен был прекратить принимать полные или долгосрочные политики от участников без защиты от инфляции много лет назад, или, в качестве альтернативы, установить надбавку к членам которые использовали такие финансовые инструменты, которые «наверняка обанкротятся», чтобы компенсировать неизбежное недофинансирование, вызванное инфляцией.\n\nОсознание того, что это должно было произойти, вряд ли является новым пониманием. Эттингер оценил стоимость крионики (ВБ) в 15 000 долларов США в 1968 году, что сегодня обойдется в 115 574,55 долларов США при совокупном уровне инфляции в 670,5%. В то время, когда Эттингер продвигал эти цифры, такие люди, как Кертис Хендерсон, который на самом деле провел несколько грубых вычислений, считали, что Эттингер был низок как минимум вдвое и достаточно уверен, если вы вложите 30 000 долларов в инфляцию [калькулятор] (https: // www .usinflationcalculator.com /) вы получаете $ 231 149,10, что, вероятно, достаточно близко к тому, что фактически стоит ВБ сегодня.\n\nВ 1981 году сбор Alcor за ВБ составлял 100 000 долларов, что с учетом инфляции составит 283 108 910,89 долларов сегодня при совокупном уровне инфляции 181,3%. Плата за нейро в то время составляла 35 000 долларов, что с учетом инфляции теперь составило бы 99 088,11 при совокупном уровне инфляции 181,3% в 181,3%. В 1991 году Alcor взяла с SST 56 000 долларов за неврологию, что в сегодняшних долларах обойдется в 105 569,05 доллара при 88,5% при кумулятивном уровне инфляции, что опять-таки составляет ~ 20 000 долларов по сравнению с фактическими затратами на сегодняшний день. Аналогичным образом, в 1991 году ВБ стоил 135 тыс. Долл. США, что с учетом инфляции составляет 254 496,81 долл. США при совокупном уровне инфляции 88,5%. Как можно видеть, темпы фактического увеличения по сравнению с прогнозируемым увеличением затрат только на основе инфляции являются удивительно постоянными в течение 50-летнего периода времени. Инфляция практически патогномична для национальных государств. Разница лишь в том, насколько серьезна болезнь. Создание крионической программы без учета инфляции и других непредвиденных обстоятельств - игра дурака, чистая и простая. Таким образом, всего этого страдания можно было бы избежать, если бы Алькор оставил на месте свой фонд непредвиденных расходов (* и * увеличил его), если бы он не преднамеренно спровоцировал переход от WB к neuo большинством своих новых членов, и если бы они перешли на требование страхования жизни от инфляции.\n\n\ne) не удалось решить очевидную и широко указанную проблему недостаточного финансирования задолго до 2011 года. Это, конечно, не было неожиданностью, и внутренний анализ выявил масштабы проблемы за годы до этого.\n\n<В семье это подозрительно, так как они хотят «убить» своего родственника (забрать сохранившуюся голову) и забрать деньги. Они выглядят как снова относительные, желающие всех активов, которые должны быть их собственностью. Если бы Алькор просто сохранил все тело, у них было бы меньше рычагов, чтобы подать в суд. Это постоянное бездумное поведение Alcor угрожает нам как членам. Правление, избираемое членами, звучит как отличный способ добиться некоторого оборота сейчас, когда я знаю, что есть другие, которые могут быть квалифицированы для работы в этом районе. Мы можем подумать о численности персонала и зарплатах, в частности, о производительности. У меня есть результаты и обзоры производительности моего шестизначного оклада. Почему сотрудники Alcor, включая Мура, не несут никакой ответственности?>\n\nОтчасти ответ на этот вопрос - «что бы мы сделали, если бы мы потеряли Макса» (или любого другого человека, критически важного для их работы). Совет директоров Alcor исторически был не просто обеспокоен, но глубоко обеспокоен потерей генерального директора. Это потому, что в течение десятилетий он выбирал скандально некомпетентных, таких как Лемлер и Вейник, которые, как они утверждают, было трудно найти в первую очередь. Они делают это потому, что не имеют ни малейшего представления о том, что требуется для того, чтобы стать генеральным директором крионической организации, и поскольку не было компетентного генерального директора, который бы наставлял и готовил сотрудников, которых Правление могло бы оценить на предмет пригодности, прежде чем передать ответственность за работу, катастрофа неизбежно наступает. Нет ** уникального **, высокорискового, высокотехнологичного бизнеса, который разместил бы рекламу на [Monster.com] (http://monster.com/) или выбрал бы кого-то из числа кандидатов, не имевших истории, чтобы что-то делать хорошо, и вручил бы им управленческий контроль за их работой. Как и в случае с техническими вопросами в Alcor и крионике, для того, чтобы хорошо управлять такой организацией, как Alcor, требуются годы бортового опыта, и это то, что вы не можете просто нанять из трудового фонда в целом.\n\n\nМногие люди считают, что я «управлял Alcor», когда я был президентом, но это не совсем так, потому что мои решения были на практике пересмотрены и наложены вето Джерри Лифом, а мы, в свою очередь, сильно повлияли на других, кто имел опыт в тех областях, где мы этого не сделали, например, Сол Кент, Стив Бридж и Карлос Мондрагон. Таким образом, потребовалось несколько человек, чтобы слаженно работать вместе, чтобы управлять Alcor до 1990 года, и это было возможно, потому что связь компетентных людей требовала быть в основном местными или тесно вовлеченными на расстоянии, таких как Стив Бридж. У них также был многолетний опыт работы в крионике с общим количеством чуть менее 50 лет, что является большой суммой для дисциплины, которая началась только в 1967 году, 14 лет назад. Они также были глубоко вовлечены; они не просто появлялись или проводили телеконференции на заседаниях Совета один раз в месяц; они были заняты на ежедневной основе и часто присутствовали, чтобы наблюдать за повседневной работой персонала Alcor.\n\n<Если бы Алькор просто сохранил все тело, у них было бы меньше рычагов, чтобы подать в суд.>\n\nЕсли говорить прямо, у Пилиграмов не было бы ноги, на которой можно было бы стоять, если бы у Алкора был криоконсервированный доктор Пилгерам в качестве ВБ. Суды крайне редко отменяют указание бенефициара в полисе страхования жизни и практически не знают, где, как в этом случае, был выдан полис для компенсации бенефициару, и это было сделано, пока застрахованный был * compos mente * и полис действовал в течение десятилетий без каких-либо признаков изменения страхователя. Вот почему крионика использует страхование жизни, потому что бенефициар практически никогда не оспаривается. Это то, что заставляет страховую компанию работать, потому что если бы это было иначе, страховые компании прекратили бы свою деятельность, и суды были бы завалены судебными процессами в стиле завещания.","title":"Alcor - судебная тяжба с пильгерам и проблема недофинансирования","subreddit_name_prefixed":"r/cryonics","ups":11,"created":1573828625,"link_flair_background_color":"","id":"dwmukc","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dwmukc/alcor_pilgeram_litigation_and_the_problem_of/","url":"https://www.reddit.com/r/cryonics/comments/dwmukc/alcor_pilgeram_litigation_and_the_problem_of/","created_utc":1573799825}