{"subreddit":{"display_name":"cryonics"},"subreddit_loc":"крионика","selftext":"  * <Какое это имеет отношение к проблемам крионистов? Я подозреваю, что многие социальные инновации Просвещения в конечном итоге потерпят неудачу, даже если некоторые общества все еще могут оставаться экономически компетентными и могут добиться прогресса в науке, медицине и технике. Другими словами, «социальный прогресс» не является устойчивым, потому что человеческая природа является упрямой, и вы не можете произвольно изменить ее, как глину, чтобы она вписывалась в вашу утопическую социальную инженерию. *\n\n* Другими словами, предполагая, что некоторые крионисты, если таковые имеются, могут преодолеть все узкие места неудач и возродиться в будущем мире, они могут оказаться в знакомом обществе, но основанном на моделях, которые они читают о его книгах по истории. Мир феодализма, монархии, аристократии, иерархии, трибализма, патриархата, религии, семейной жизни и всех других якобы дурных вещей, от которых хотели избавиться более радикальные мыслители Просвещения, но в сочетании с впечатляюще развитой медициной, наукой и технологии.> - Марк Плюс *\n\nЯ думаю, что ваша точка зрения хорошо принята относительно неопределенности того, в каком мире могут появиться крионисты, но я думаю, что вы, возможно, упускаете важный момент в отношении Просвещения к идеалам Западной Цивилизации и к научно-технической революции, которую она породила. , Есть два широких взгляда на Просвещение, и они заключаются в том, что научная революция создала Просвещение или что Просвещение вызвало научную революцию. Кажется, это классическая проблема с курицей и яйцом. Тем не менее, я думаю, что реальность такова, что каждый позволил другому, но не было бы классической либеральной цивилизации без научного метода или, в более широком смысле, без западной цивилизации.\n\nТоталитарные общества имеют мрачную историю научных достижений. Они могут быть хороши в технологическом прогрессе, как и некоторые из древних китайских цивилизаций, но они ужасны из-за парадигмы, разрушающей научное понимание, которое трансформирует наше понимание мира и позволяет появиться фундаментальным новым технологиям. Основные научные достижения называются «революционными», потому что они полностью разрушают существовавшую ранее парадигму. Эволюция, теория относительности и тектоника плит - это лишь несколько примеров. Проблема этих революционных достижений состоит в том, что они всегда бросают вызов и дестабилизируют социальный статус-кво. Это анафема для тоталитарных обществ. Даже отдаленно невозможно, чтобы Интернет появился в современном Китае или России. Он был изобретен на Западе, и это серьезная проблема для тоталитарных режимов повсюду.\n\nТакже удивительно, что люди, которые создают крупные научные достижения (и, таким образом, внедряют новые технологии), являются социальными аутсайдерами, которые мало внимания уделяют социальным ограничениям, которые мешают их исследованиям. Тоталитарные общества раздавливают таких людей и в любом случае делают чрезвычайно трудным получение физических, финансовых и интеллектуальных ресурсов, необходимых им для создания своей магии. Коммунистический Китай - чудо промышленности и технических инноваций, но они все еще полагаются на массовые кражи интеллектуальной собственности с Запада. Более того, они собираются внедрить свою «систему социального кредитования», которая является оруэлловским кошмаром наблюдения и контроля над человеком таким образом, которого даже не видели в Румынии Чаушеску (потому что технологии не существовало). Это то, что тоталитарные цивилизации неизбежно делают с технологиями. Диктаторы не диктуют исследование космоса, фундаментальную науку или широкие исследования. Они также, по определению, не имеют отношения к человеку за пределами его утилитарной ценности для государства. Таким образом, хотя Китай поражает воображение, вопрос, который необходимо задать, заключается в следующем: «Как бы это было, через 100 лет после ухода Запада?».\n\nОдна из проблем с покупкой в научном методе состоит в том, что невозможно выборочно применять его. Он применяется не только к оружейной технологии, но и к социальным вопросам. Смертельный удар, который Просвещение нанесло тоталитарным квазирелигиозным монархиям, которые прежде господствовали в мире, стал результатом вызовов в значительной степени иррациональной и неэффективной социальной политики этих систем. Рабство неэффективно, широко распространенная бедность и болезни не эффективны *, потому что * они мешают научно-техническому и промышленному прогрессу. Нет ценностей Просвещения = нет фундаментальных научных достижений = технологическая стагнация * и * создание большого низшего класса очень несчастных людей. Чтобы держать этих людей в курсе, вы должны тратить много времени и сил на то, чтобы держать их на своих местах. Могут ли быть какие-либо сомнения в том, что Конфедерация была обречена, выиграли ли они войну или нет? Но, конечно, они не выиграли войну, потому что их статичное, консервативное, рабовладельческое общество не могло начать конкурировать с коварной, социально хаотической индустриализацией Севера; промышленный и экономический центр, который был прямым продуктом Просвещения\n\nКлассическая греческая цивилизация, существовавшая всего 350 лет, породила феноменальное количество новых научных и интеллектуальных идей. Они были настолько могущественны, что слава, которая была у Рима, управляла им тысячу лет. Греческая цивилизация включала в себя многие ключевые элементы Просвещения, в том числе обоснованный подход к решению проблем, высокую степень личной свободы своих граждан, признание ценности личности и разумно демократического правительства. Я считаю, что не случайно римская цивилизация поразительно лишена научного прогресса; даже при наличии сложных технологий. Как будто огни фундаментального научного прогресса погасли щелчком выключателя.\n\nЕдинственные известные нам цивилизации, которые совместимы с крионикой, сейчас или в будущем, основаны на принципах Просвещения, и я бы сказал, что они являются продуктом научного метода, поскольку они были его причиной. Ясно, что существует напряжение между контролем и свободой, и неясно, какая часть из них несовместима с другой. Американские СМИ ужасны в освещении соответствующих международных новостей, и поэтому о факте, что ежегодно в Китае происходит более 200 000 случаев гражданских беспорядков (и их рост), не сообщается. В конце концов, сверкающий технологический монолит не так уж монолитен. Китайцы собираются использовать лучшее компьютерное и программное обеспечение, чтобы навязать полный контроль над своими людьми. Это будет проверкой неустановленной гипотезы Оруэлла о том, что, если технология достаточно хороша, она позволит государству делать это с гражданами на неопределенный срок или, как выразился Оруэлл, создать «отпечаток ботинка на человеческом лице - навсегда».\n\nВозможно ли возрождение некоторых крионистов в тоталитарной цивилизации? Конечно, и это то, что каждый намерен сделать этот прыжок должен тщательно рассмотреть. Тем не менее, имеется мало доказательств того, что жестокие тиранические цивилизации совместимы либо с научным прогрессом, либо с ценностями, которые, вероятно, мотивируют возрождение пациентов с крионикой, будь они альтруистическими, капиталистическими или какой-либо их комбинацией.\n\nЖесткая реальность заключается в том, что у нас почти нет доказательств того, что любая цивилизация, не говоря уже о высокотехнологичной, может долго существовать. Найл Фергюсон дает панорамный обзор природы и долговечности цивилизаций в своем томе на 432 страницы «Цивилизация: Запад и остальные», и это не обнадеживающая картина для крионики. Кажется, что цивилизации управляются механизмами, которые похожи и столь же неизбежны, как и те, которые определяют старение и смерть в сложных многоклеточных организмах. Если они не уничтожены макро- или микропаразитизмом или изменением климата и окружающей среды, они следуют дуге всех сложных организмов; они рождаются, они быстро растут, они взрослеют, они стареют и умирают. В этом важном отношении крионика, возможно, ставит телегу впереди лошади, поскольку у нее, вероятно, практически нет шансов на успех при отсутствии * стабильной * цивилизации, которая воплощает ценности Просвещения в течение веков. Возможно, имеется больше «доказательств» того, что развитие биомедицинской науки и техники сможет оживить некоторых пациентов с крионикой, чем то, что непрерывно стабильная научно-техническая цивилизация может существовать в течение времени, необходимого для этого.\n\nТо, что я говорю, заключается в том, что наша главная забота на этом этапе, кроме криоконсервации, заключается в том, что у нас нет примеров того, как такие научно-технические цивилизации существуют достаточно долго, чтобы позволить возрождение. Напротив, наша высокотехнологичная (полунаучная?) Цивилизация находится на грани уничтожения или разрушения в худшем случае и крайне нестабильна в лучшем случае. Я думаю, что «среднестатистический Джо или Джилл» знают это на интуитивном уровне и что это является важным фактором в их недоверии к потенциальной работоспособности крионики, и в результате они не могут воспринимать это всерьез.\n\nЭта проблема относится к той, с которой Циолковский столкнулся в 1903 году, пытаясь убедить население России не только в том, что (теоретически) вполне возможно (на практике) полететь на Луну, но и в том, что задача будет решена всего за 60 лет. , Когда он вывел свое «уравнение ракеты», он был всего в двух годах от первой русской революции, которая продолжалась до второй в 1917 году, когда большевики пришли к власти. По иронии судьбы Циолковский и его федоровские когорты были поддержаны большевистской революцией и созданием Советского государства, потому что они верили, что оно воплотит их ценности гуманистического научно-технического прогресса. В то время как советское государство относилось к Циолковскому достаточно хорошо, и он завещал ему свое имение, после его смерти в 1935 году ему должно было быть ясно, что это не будет научно-технологическая утопия, о которой он мечтал.\n\nРусские покорили космос, а Соединенные Штаты отправились на Луну. Однако реальность того, как все это произошло, была бы невероятной, шокирующей и, возможно, даже ужасающей для Циолковского и его попутчиков. Если мы сделаем это из морозильника *, это будет шок и смятение, к которым, я бы сказал, мы должны быть готовы. Будущее, о котором я мечтал и ожидал жить, теперь уже мертво или, в лучшем случае, призрак в моей памяти. Это было будущее, в которое я был влюблен, и все же это никогда не будет. Вполне вероятно, что мне всегда будет немного грустно из-за этой потери, но тогда я никогда не ожидал, что выживание будет чем-то другим, кроме борьбы. Утопические сны - это материал детских сказок. Нам будет необоснованно повезло жить \"когда-нибудь\". К счастью, когда-нибудь после этого придет гораздо более высокая цена, если это вообще возможно.","title":"Просвещение и будущее крионики","subreddit_name_prefixed":"r/cryonics","ups":8,"created":1573831454,"link_flair_background_color":"","id":"dwn9yj","author":{"name":"Michael-G-Darwin"},"permalink":"/r/cryonics/comments/dwn9yj/on_the_enlightenment_and_the_future_of_cryonics/","url":"https://www.reddit.com/r/cryonics/comments/dwn9yj/on_the_enlightenment_and_the_future_of_cryonics/","created_utc":1573802654}