{"subreddit":{"display_name":"FastingNerds"},"subreddit_loc":"FastingNerds","selftext":"","title":"Эффективность прерывистого голодания для снижения индекса массы тела и метаболизма глюкозы: систематический обзор и метаанализ. (2019)","subreddit_name_prefixed":"r/FastingNerds","ups":36,"created":1570984367,"link_flair_background_color":"","id":"dh7xvk","author":{"name":"AtaraxicMegatron"},"permalink":"/r/FastingNerds/comments/dh7xvk/the_effectiveness_of_intermittent_fasting_to/","url":"https://www.ncbi.nlm.nih.gov/pubmed/31601019","created_utc":1570955567,"replies":[{"ups":1,"link_id":"t3_dh7xvk","id":"f49c8o2","author":"Bikesandkittens","parent_id":"t3_dh7xvk","subreddit_id":"t5_34kng","body":"> Аннотация\n> Последствия прерывистой диеты натощак (IFD) для населения в целом по-прежнему противоречивы. В этом исследовании мы стремились систематически оценивать эффективность IFD для снижения индекса массы тела и метаболизма глюкозы в общей популяции без сахарного диабета. Поиск по базам данных Cochrane, PubMed и Embase позволил выявить рандомизированные контролируемые испытания и контролируемые клинические испытания, в которых сравнивали IFD с обычной диетой или диетой с постоянной калорийностью. Эффективность IFD оценивалась по средневзвешенной разнице (WMD) для нескольких переменных, связанных с глюкометаболическими параметрами, включая индекс массы тела (BMI) и уровень глюкозы натощак. Сводные средние различия результатов были рассчитаны с использованием модели случайных эффектов. Из 2814 исследований, выявленных в результате поиска литературы, мы, наконец, отобрали 12 статей (545 участников). По сравнению с контрольной диетой, IFD был связан со значительным снижением ИМТ (ОМУ, -0,75 кг / м2; 95% ДИ, от -1,44 до -0,06), уровнем глюкозы натощак (ОМП, -4,16 мг / дл; 95% ДИ от -6,92 до -1,40) и гомеостатическая модель оценки инсулинорезистентности (ОМУ -0,54; 95% ДИ от -1,05 до -0,03). Масса жира (ОМУ -0,98 кг; 95% ДИ от -2,32 до 0,36) имела тенденцию к снижению в группе ИФР со значительным увеличением адипонектина (ОМУ 1008,9 нг / мл; 95% ДИ от 140,5 до 1877,3) и уменьшению в уровнях лептина (ОМУ, -0,51 нг / мл; ДИ 95%, от -0,77 до -0,24). IFD может обеспечить значительный метаболический эффект за счет улучшения гликемического контроля, инсулинорезистентности и концентрации адипокинов со снижением ИМТ у взрослых.","body_html":"<div class = \"md\"> <blockquote>\n<Р> Абстрактный\nЭффекты прерывистой диеты натощак (IFD) для населения в целом все еще противоречивы. В этом исследовании мы стремились систематически оценивать эффективность IFD для снижения индекса массы тела и метаболизма глюкозы в общей популяции без сахарного диабета. Поиск по базам данных Cochrane, PubMed и Embase позволил выявить рандомизированные контролируемые испытания и контролируемые клинические испытания, в которых сравнивали IFD с обычной диетой или диетой с постоянной калорийностью. Эффективность IFD оценивалась по средневзвешенной разнице (WMD) для нескольких переменных, связанных с глюкометаболическими параметрами, включая индекс массы тела (BMI) и уровень глюкозы натощак. Сводные средние различия результатов были рассчитаны с использованием модели случайных эффектов. Из 2814 исследований, выявленных в результате поиска литературы, мы, наконец, отобрали 12 статей (545 участников). По сравнению с контрольной диетой, IFD был связан со значительным снижением ИМТ (ОМУ, -0,75 кг / м2; 95% ДИ, от -1,44 до -0,06), уровнем глюкозы натощак (ОМП, -4,16 мг / дл; 95% ДИ от -6,92 до -1,40) и гомеостатическая модель оценки инсулинорезистентности (ОМУ -0,54; 95% ДИ от -1,05 до -0,03). Масса жира (ОМУ -0,98 кг; 95% ДИ от -2,32 до 0,36) имела тенденцию к снижению в группе ИФР со значительным увеличением адипонектина (ОМУ 1008,9 нг / мл; 95% ДИ от 140,5 до 1877,3) и уменьшению в уровнях лептина (ОМУ, -0,51 нг / мл; ДИ 95%, от -0,77 до -0,24). IFD может обеспечить значительный метаболический эффект за счет улучшения гликемического контроля, инсулинорезистентности и концентрации адипокинов со снижением ИМТ у взрослых. </P>\n</BLOCKQUOTE>\n</DIV>","permalink":"/r/FastingNerds/comments/dh7xvk/the_effectiveness_of_intermittent_fasting_to/f49c8o2/","name":"t1_f49c8o2","created":1571490823,"created_utc":1571462023,"subreddit_name_prefixed":"r/FastingNerds","depth":0}]}