{"subreddit":{"display_name":"gerontology"},"subreddit_loc":"геронтология","selftext":"Привет р / геронтология!\n\nЯ хочу получить работу / карьеру, работая с пожилыми людьми, и я хотел бы знать, как это сделать.\n\nЕдинственный опыт, который у меня есть, - забота о моей бабушке, у которой несколько раз была болезнь Альцгеймера. Мне приходилось наблюдать за ней только один раз, но в остальное время это было в течение нескольких часов и самое большее весь день. Она могла нормально гулять и есть сама, но я должен был помочь ей в ванной и одеть ее. Она жила с моими кузиной и тетей, и они выполнили 90% работы, включая купание, приемы и лекарства.\n\nОна скончалась в 2012 году, и после более года безработицы я продолжаю думать о работе с пожилыми людьми. Я хочу сделать что-то со своей жизнью в ее честь, а не застрять в розничной торговле, что является довольно неблагодарной и невыгодной работой. Я хочу реально помочь людям и изменить их жизнь.\n\nЯ планирую вернуться в школу на год, чтобы взять уроки геронтологии и получить несколько сертификатов. Школа - 4-я лучшая программа в США, и мне посчастливилось жить поблизости! [ссылка на программу]  (http://www.arc.losrios.edu/Programs_of_Study/BSS/Gerontology.htm) \n\nТакже в какой-то момент я планирую принять СЛР и курс первой помощи со своим женихом. Я недавно подписался на care.com, и я посмотрел на профили других людей, они настолько опытны и имеют много сертификатов и так далее, и это пугает. Я также планирую заниматься йогой и силовыми упражнениями, чтобы быть сильнее, чтобы поднимать людей по мере необходимости.\n\nЯ нуждаюсь в совете и мнении о том, что делать, к чему я должен подготовиться, чего ожидать и т. Д. Также я не уверен, подходит ли это даже для этого субредита, поэтому, пожалуйста, извините, если это неуместно.\n\nСпасибо за чтение и помощь заранее: D","title":"Мне нужен совет по попаданию в поле :)","subreddit_name_prefixed":"r/gerontology","ups":2,"created":1395222451,"link_flair_background_color":"","id":"20rvbk","author":{"name":"meganbrihu"},"permalink":"/r/gerontology/comments/20rvbk/i_need_advice_on_getting_into_the_field/","url":"https://www.reddit.com/r/gerontology/comments/20rvbk/i_need_advice_on_getting_into_the_field/","created_utc":1395193651}