{"subreddit":{"display_name":"gerontology"},"subreddit_loc":"геронтология","selftext":"В 99% случаев я говорю о победе над смертью и старением для кого-либо, они начинают утверждать, что смерть - это хорошо, очищает мир, пожелания Бога, сказки и т. Д.\n\nИсходя из своего жизненного опыта, я начинаю верить, что самая большая проблема здесь, чтобы победить смерть, не техническая, а социальная.\n\nСмерть ужасна Это настолько ужасно, что люди считают это нормальным, неизменным и приемлемым. Это так же, как 5 фаз потери и горя (http://psychcentral.com/lib/the-5-stages-of-loss-and-grief/000617), и на данный момент мы находимся на стадии 5.\n\nНаука была для нас великим учителем, особенно учит нас тому, что ничто в этой вселенной не является неизменным. Там нет такого понятия, как неизменный. Это искусственная концепция. Я также вынужден верить, что природа даже позволяет (каким-то образом) вернуть мертвых людей к жизни. Насколько я знаю, ничто не доказывает обратное.\n\nХотя победить смерть и старение - очень сложная и сложная задача. Но это чертовски выполнимо !!\n\nДорогие редонтологи геронтологов, как мы можем показать миру, что смерть больше не является обязательством, а просто старая история перед сном, которая пугает детей. Давайте заставим всех увидеть, что это Путешествие, это наш прыжок веры, это кульминация всех наших знаний, это то, над чем мы работали с тех пор, как начали думать как люди.\n\nПобеда над смертью - это будущее.\n\nПожалуйста, помогите мне, помогите вам, помогите нам всем.\n\nСпасибо!\n\n-------------------\n** Короткие видео о старении **\n\n* Что такое старение? Анимация PhD Comics с Жоао Педро де Магальесом: * https://www.youtube.com/watch?v=-hCkVHioBVA\n\n* Наука старения: * https://www.youtube.com/watch?v=BkcXbx5rSzw\n\n* Почему мы стареем - и как мы можем это остановить: * https://www.youtube.com/watch?v=jqCo-McgHLw\n\n-------------------\n** мифы о бессмертии **\n\n* Должны ли мы лечить старение?: * Http://senescence.info/physical_immortality_myths.html\n\n* Обри отвечает на множество вопросов, которые у вас могут возникнуть на симпозиуме в Санкт-Галлене 3 месяца назад: * https://www.youtube.com/watch?v=DkBfT_EPBIo&list=UUGWIO2rimxjYPzhPvWq-Yqw (Спасибо, пронзительный крик)\n\n-------------------\n** Прохладные вдохновляющие цитаты **\n\n«Мы владеем почти всеми нашими знаниями не тем, кто согласился, а тем, кто не согласен».\n\nЧарльз Калеб Колтон\n\n-------------------\n\n* «Я не думаю, что человеческая раса выживет в следующую тысячу лет, если мы не распространимся в космос». *\n\nСтивен Хокинг\n\n-------------------\n\n* «Разумные человек приспосабливается к миру;. Неразумные упорно пытается приспособить мир к себе Поэтому весь прогресс зависит от неразумных людей.» *\n\nДжордж Бернард Шоу\n\n-------------------\n\n* \"Сотню раз в день я напоминаю себе, что моя внутренняя и внешняя жизнь зависит от труда других людей, живых и мертвых, и что я должен приложить усилия, чтобы отдать в той же мере, в какой я получил и все еще получаю \". *\n\nАльберт Эйнштейн\n\n------------------\n«Старение - это варварское явление, которое нельзя терпеть в вежливом обществе».\n\nОбри де Грей\n\n------------------\n* «Всегда слушайте экспертов. Они скажут вам, что нельзя сделать и почему. Затем сделать его.\"*\n\nРоберт А. Хайнлайн","title":"Как убедить людей, что победить смерть - это не плохо? (2014)","subreddit_name_prefixed":"r/gerontology","ups":4,"created":1409016348,"link_flair_background_color":"","id":"2ejo9g","author":{"name":"[deleted]"},"permalink":"/r/gerontology/comments/2ejo9g/how_to_convince_people_that_defeating_death_is/","url":"https://www.reddit.com/r/gerontology/comments/2ejo9g/how_to_convince_people_that_defeating_death_is/","created_utc":1408987548}