{"subreddit":{"display_name":"gerontology"},"subreddit_loc":"геронтология","selftext":"Профессор Ясухико Сайто, главный докладчик на Азиатской конференции по проблемам старения и геронтологии 2015 (AGen2015) в Кобе, Япония, рассказал об истории японского продольного исследования старения при Университете Нихон (NUJLSOA). Его аннотация читается ниже.\n\n«NUJLSOA - это продольное исследование национально репрезентативной выборки населения в возрасте 65 лет и старше в Японии. Первая волна данных была собрана в ноябре 1999 года, вторая в ноябре 2001 года, третья волна в ноябре 2003 года, а четвертая волна в настоящее время находится в стадии разработки. Исследование было разработано в первую очередь для изучения состояния здоровья пожилых японцев и изменения состояния здоровья с течением времени. Дополнительной целью является изучение влияния системы страхования на случай длительного ухода на использование услуг пожилыми людьми в Японии и изучение взаимосвязи между совместным проживанием и использованием долгосрочного ухода. В то время как в центре внимания обследования находится здоровье и использование медицинских услуг, в него включены и другие темы, относящиеся к опыту старения, такие как обмен между поколениями, условия жизни, уход и участие в рабочей силе. Обследование NUJLSOA предоставляет данные, сопоставимые с данными, собранными в Соединенных Штатах и ​​других странах. Опрос включает вопросы о ряде аспектов здоровья и функционирования каждого респондента: наличие хронических заболеваний, нарушений (зрения и слуха), здоровья зубов и функциональных ограничений (мероприятия по повседневной жизни, инструментальная деятельность по повседневной жизни и измерения NAGI) , Также были включены такие результаты, как моральное состояние (моральная шкала PGC) и депрессия. Информация о рисках для здоровья включала образ жизни (курение, употребление алкоголя, физические упражнения, вес). Информация об основных характеристиках и семейных обстоятельствах также включена. Социально-экономическая информация включает образование и доход с ограниченной информацией об активах. Также были включены данные об использовании медицинских услуг, страховании на случай длительного ухода и информация об обмене поколениями, а также о нормах и ценностях, связанных со старением. Аналогичные вопросы задавались на двух волнах, а во вторую волну добавлен ряд вопросов, касающихся долгосрочного ухода. Поскольку японская национальная система страхования по долгосрочному уходу началась 1 апреля 2000 года, первые две волны опроса дают представление об использовании системы до и после изменения. Дополнительные вопросы об экономическом статусе также были добавлены ко второй волне сбора данных. Рекомендованный ВОЗ подход к измерению депрессии, вторая форма CIDI для депрессии (CIDI-SF) была добавлена ​​ко второй волне, в то время как CES-D был сохранен. Вопросы, заданные на первом собеседовании, которые отражают фиксированные признаки (например, характеристики родителей), не задавались предыдущим респондентам ».\n\nЯсухико Сайто - профессор Университета Нихон, Исследовательский центр университета. Его основными областями деятельности являются демография и геронтология в целом, а также ожидаемая продолжительность жизни, старение и здоровье в частности. За последние 25 лет он принимал участие в деятельности исследовательской сети по ожидаемой продолжительности здоровья под названием REVES. Он заинтересован в изучении как существенных, так и методологических вопросов, касающихся ожидаемой продолжительности здоровья. В последние годы он проводил продольные исследования в Японии и использовал продольные исследования в Азии для своей исследовательской деятельности.\n\nЧтобы посмотреть презентацию профессора Сайто в полном объеме, посетите веб-сайт IAFOR:\n\nhttp://iafor.org/nujlsoa-prof-saito/\n\nДля получения дополнительной информации о IAFOR, пожалуйста, посетите веб-страницу IAFOR:\n\nhttp://iafor.org/","title":"IAFOR: японское продольное исследование старения в университете Нихон (NUJLSOA) - история и новые направления проф. Ясухико Сайто","subreddit_name_prefixed":"r/gerontology","ups":2,"created":1466768141,"link_flair_background_color":"","id":"4pks2b","author":{"name":"[deleted]"},"permalink":"/r/gerontology/comments/4pks2b/iafor_the_nihon_university_japanese_longitudinal/","url":"https://www.reddit.com/r/gerontology/comments/4pks2b/iafor_the_nihon_university_japanese_longitudinal/","created_utc":1466739341}