{"subreddit":{"display_name":"ExistentialRisk"},"subreddit_loc":"Экзистенциальный риск","selftext":"Когда мы думаем об ИИ как о Черном шаре, у большинства людей возникает интуиция, которая звучит примерно так: «К тому времени, когда мы полностью коллективно осознаем разрушительную проблему, будет слишком поздно»\n\nТем не менее, когда речь идет о распространении идей или мемов в виде черных шаров, кажется, что существует больше возможностей для этого смещения, в частности, временного смещения. Поскольку сознание, которое часто не может напомнить себе, что оно более размыто в пространстве-времени и меньше движется по нему, легко забыть, что идеи и мемы действительно вряд ли будут явными черными шарами, пока не станет слишком поздно, но то же самое может быть правдой для технологий. Кажется, что все считают само собой разумеющимся, что все идеи, мемы и технологии, действующие сегодня, ** не ** черные шары, но их эффект как черные шары не обязательно реализуется в короткий промежуток времени. Черные шары уже могут функционировать, или даже функционировать в течение достаточно долгого времени, только потому, что их эффекты проявляются только таким образом, что человечество пытается понять из-за временного смещения.\n\nРедактировать: оказывается, я имел в виду «нечувствительность к объему». Я должен был использовать этот термин вместо «временного смещения». Такие слова, как «временный» или «пространство-время», по-прежнему полезны, потому что наша интуиция с черными шарами, вероятно, оформлена как определенное событие (изобретение / открытие) или критичность (технология, идущая из содержания-> не содержащаяся), когда это может не быть, как черный шар проявляется вообще. Нет ничего, что действительно мешало бы черному шару, выражающемуся в течение тысячи лет или миллиарда лет, и никогда не быть действительно очевидным в любой данный момент в течение этого длительного промежутка времени *, если * сфера действия не учитывается.","title":"Бостромский «Черный шар» и когнитивный уклон","subreddit_name_prefixed":"r/ExistentialRisk","ups":3,"created":1556198432,"link_flair_background_color":"","id":"bh4vod","author":{"name":"Compassionate_Cat"},"permalink":"/r/ExistentialRisk/comments/bh4vod/bostroms_black_ball_and_cognitive_bias/","url":"https://www.reddit.com/r/ExistentialRisk/comments/bh4vod/bostroms_black_ball_and_cognitive_bias/","created_utc":1556169632}