{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Меня недавно наняли в качестве младшего инженера по тестированию программного обеспечения. Я не очень-то работал с разработчиком Android до того, как готовился к этой работе, поэтому я прошел [бесплатные учебники по основам Android от Udacity] <span translate = \"no\"> (https://www.udacity.com/ курс / андроид-основа-пользовательский интерфейс - ud834) </ SPAN>. Я обнаружил, что это довольно хорошая серия с хорошим и постепенным введением в новые системы для включения в ваши приложения.\n\nОднако на работе мне приходилось узнавать о разных вещах. Оказывается, мне нужно было бы начать создавать приложение, используя принципы MVVM (модель-представление-представление-модель) и TDD (разработка через тестирование), или, по крайней мере, достойное покрытие модульными тестами. К сожалению, это было похоже на то, как меня бросили в глубокий конец; Есть много учебных пособий и ресурсов по ним, но не во всех из них есть хорошие примеры нужных мне систем, некоторые говорят о тестировании без MVVM, а некоторые наоборот, и у них много разных стилей кода, не говоря уже о половине они на Яве, а другие на Котлине.\n\nСинтезировать всю эту разрозненную информацию в шаблон, с которым я могу работать, было непросто, но, думаю, я наконец-то решил это. Есть еще несколько систем, которые мне нужно узнать о включении, но я уверен, что я разберусь с ними вовремя.\n\nИтак, я подумываю о том, чтобы в конце концов написать серию учебных пособий, которые в значительной степени основаны на бесплатных курсах Udacity, чтобы сохранить постепенное развитие простых и сложных приложений, но на этот раз с включением в них паттернов MVVM и TDD. (Также они будут на Kotlin, а не на Java.) Но я хотел бы задать сообществу несколько вопросов:\n\n- Насколько я могу судить, это разрешено мне лицензией на программное обеспечение Apache, под которой выпускаются примеры кода Udacity. Но все же рекомендовано ли мне использовать похожие, но разные концепции приложений? Если это так, мне может понадобиться помощь, чтобы придумать их, так как на данный момент у меня не хватает идей.\n- Как называется учебник? Я немного волнуюсь, что я \"кричу\" Udacity с этим текущим рабочим именем.\n- Насколько интересен такой сериал?","title":"Оценка интереса и предложения имени для курса «Рефакторинг Udacity для Android» (с использованием принципов MVVM и TDD, а также, конечно, Kotlin)","subreddit_name_prefixed":"r/Kotlin","ups":9,"created":1543739762,"link_flair_background_color":"","id":"a28lza","author":{"name":"Spheniscine"},"permalink":"/r/Kotlin/comments/a28lza/gauging_interest_and_name_suggestion_for_a/","url":"https://www.reddit.com/r/Kotlin/comments/a28lza/gauging_interest_and_name_suggestion_for_a/","created_utc":1543710962}