{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Я знаю, примерно год назад, Андрей сделал сообщение в блоге о своих идеях относительно будущего Котлина. Одним из его ключевых моментов была разработка игр. Теперь я знаю, что вы можете использовать Libgdx для создания игр, но я думаю о реальном движке над фреймворком. Я также знаю о jMonkeyEngine, но я не вижу много информации об этом движке. Кажется, у него довольно маленькая база пользователей.\n\n\n\nПоэтому моей другой мыслью был Годо. Сейчас он невероятно популярен и быстро набирает обороты. Это 3-й самый быстрорастущий проект с открытым исходным кодом ([Source]  (https://octoverse.github.com/projects.html)  \\ - прокрутите вниз до 2-й категории, о которой сообщается) , Его можно использовать для 2D-игр и 3D-игр, плюс он рассматривает Linux как первоклассных граждан. Они недавно внедрили C # и Mono (как в начале этого года) благодаря гранту от Microsoft. Используемый в настоящее время язык сценариев - это GDScript (пользовательский язык сборки для движка), который смоделирован по принципу python. Здесь я думаю, что Kotlin вступает в игру. Если Андрей и команда смогут внедрить Kotlin в Godot, я думаю, это будет отличным дополнением. Вероятно, пройдет немного времени, прежде чем люди полностью перейдут на Kotlin, но как только они увидят преимущества Kotlin над GDScript, я думаю, что это не будет проблемой. Одна из причин, по которой людям действительно нравится GDScript, заключается в том, что его действительно легко написать. Котлин разделяет ту же самую привилегию все же. Кроме того, Kotlin, скорее всего, будет гораздо более производительным, чем GDScript. Я знаю много оговорок, которые есть у других людей (хотя это только от того, что я с ними разговаривал или что они говорили), что им не нравится, что Годо использует собственный язык, который не применим в других местах. Что-то еще Котлин может помочь с :)\n\n\n\nВозможно, это будет еще один хороший испытательный стенд для Kotlin Native? Какие-нибудь мысли? Или это действительно не окажется достойным предприятием?","title":"Котлин для игр?","subreddit_name_prefixed":"r/Kotlin","ups":29,"created":1544398352,"link_flair_background_color":"","id":"a4lqv8","author":{"name":"AbhorDeities"},"permalink":"/r/Kotlin/comments/a4lqv8/kotlin_for_games/","url":"https://www.reddit.com/r/Kotlin/comments/a4lqv8/kotlin_for_games/","created_utc":1544369552}