{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Привет дорогой Котлин сообщества,\n\nЯ знаю, что Reddit - это прежде всего не самореклама. Тем не менее, я думаю, что это молодое сообщество всегда стремится познакомиться с новым интересным программным обеспечением, написанным на Kotlin, возможно, даже в области обработки естественного языка. Если я полностью ошибаюсь в этом предположении, тогда извините. Я прежде всего ищу советы и мнения о том, как улучшить мою самую первую библиотеку Kotlin, особенно когда речь идет о качестве кода.\n\nЯ вычислительный лингвист, работаю инженером программного обеспечения Java. В свободное время я сейчас изучаю Kotlin. Для одной из моих личных потребностей я написал небольшую библиотеку по имени * Lingua *, которая определяет язык письменного текста, подходящий как для длинных, так и для коротких текстов. Код и подробные инструкции можно найти здесь:\n\n[https://github.com/pemistahl/lingua] (https://github.com/pemistahl/lingua) \n\nЯ пытался анализировать сообщения Twitter и другие довольно короткие документы, но другие библиотеки определения языка надежно работают только с длинными текстами. Поэтому я подумал, что смогу практиковать свои навыки Kotlin и написать собственную библиотеку, которая пытается исправить проблемы с обнаружением коротких фрагментов текста. Он находится на очень ранней стадии разработки, но я планирую постоянно двигаться вперед.\n\nЛюбые конструктивные комментарии к коду и API приветствуются. Кроме того, если вы найдете эту библиотеку полезной, я был бы очень рад услышать о вашем опыте работы с ней. Прямые вклады через проблемы или запросы извлечения также приветствуются. Однако, если это совершенно не то место, по моему мнению, не стесняйтесь удалить этот пост.\n\nБольшое спасибо и привет из Германии, Питер\n\n\n\n[https: \\ / \\ / github.com \\ / pemistahl \\ / lingua] <span translate = \"no\"> (https://preview.redd.it/6wi07v97b1521.png?width=314&format=png&auto=webp&s=9049af08a126ea70db7b400e0d0707b87) 0702b082b0750e0d0r0b0r0d0b0b0r0b0r0b0r0b0b0r0b0b0b0b0b0b0b0b0b0b0r0b0b0b0r0b0p0r0r0b0r0r0b0r0b8b8b0d1 </ SPAN>\n\n","title":"Обнаружение письменного естественного языка с использованием Kotlin","subreddit_name_prefixed":"r/Kotlin","ups":39,"created":1545166463,"link_flair_background_color":"","id":"a7at54","author":{"name":"pemistahl"},"permalink":"/r/Kotlin/comments/a7at54/written_natural_language_detection_using_kotlin/","url":"https://www.reddit.com/r/Kotlin/comments/a7at54/written_natural_language_detection_using_kotlin/","created_utc":1545137663}