{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Я нахожусь в процессе преобразования некоторых моих обратных вызовов в сопрограммы с помощью suspendCoroutine.\n\nКак я понимаю, если бы я должен был сделать:\n\n        приостановить веселье UploadTask.await (): Long {\n            return suspendCoroutine {продолжение ->\n                addOnProgressListener {progress ->\n                    cont.resume (progress.bytesTransferred)\n                }\n                addFailedListener {e ->\n                    cont.resumeWithException (е)\n            }\n        }\n\nЯ бы получил IllegalStateException, так как вполне возможно, что оба из этих обратных вызовов могут произойти и возобновить продолжение. Согласно документации, это приведет к исключению.\n\nВ этом случае это означает, что мне нужно написать функцию расширения для каждого отдельного обратного вызова? В этом случае я вижу две проблемы:\n\n- Предполагается, что имя расширения обратного вызова называется await (), чтобы оно сочеталось с собственными асинхронными вызовами сопрограммы. Использование нескольких вызовов для обратного вызова делает это невозможным.\n\n\n- Если тип сети / вызов имеет несколько прослушивателей событий обратного вызова, например. (завершено, успешно, не удалось, отменено, обновлено), тогда мне нужно создать забаву для расширения suspendCoroutine для каждого, а также не иметь возможности элегантно вызвать await (), чтобы получить мое значение или возможное исключение.\n\nЛюбые мысли или способы я могу исправить это? На данный момент кажется, что мне лучше использовать обратные вызовы и преобразовывать их в suspendCoroutine, если это единственный тип обратного вызова с различными событиями (success, fail), содержащимися в нем.","title":"Правильное использование функции suspendCouroutine с несколькими обратными вызовами.","subreddit_name_prefixed":"r/Kotlin","ups":9,"created":1545445049,"link_flair_background_color":"","id":"a8cqnr","author":{"name":"The_One_True_Lord"},"permalink":"/r/Kotlin/comments/a8cqnr/proper_usage_of_the_suspendcouroutine_function/","url":"https://www.reddit.com/r/Kotlin/comments/a8cqnr/proper_usage_of_the_suspendcouroutine_function/","created_utc":1545416249}