{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Итак, в прошлом году я решил изучать Kotlin. Вот моя маленькая история до сих пор:\n\nВ прошлом году в свободное время я пытался разработать язык программирования высокого уровня и компилятор для него, нацеленный на старые 8-битные CPU 6502 skool, как, например, в Commodore-64. Я писал это на Python, но мне не нравилось, куда он шел, и у меня были проблемы с реструктуризацией и рефакторингом растущей базы кода (скорость выполнения никогда не была проблемой).\n\nПоэтому я переключился на Kotlin, чтобы посмотреть, подойдет ли он для моего проекта лучше, и в то же время выучить этот многообещающий язык.\n\nНа этой неделе была выпущена первая бета-версия моего компилятора (если вы заинтересованы, вы можете найти ее здесь [https://github.com/irmen/prog8] (https: // github. ru / irmen / prog8)  документация находится здесь [https://prog8.readthedocs.io/] (https://prog8.readthedocs.io/) )\n\nПосле всех усилий, предпринятых за последние несколько месяцев в свободное время, я должен сделать вывод, что Котлин довольно крутой. Обучение основам не заняло много времени, и советы по рефакторингу в IDE (я использую IDEA) также многому меня научили. Как и ожидалось, реструктуризация и рефакторинг очень просты. Мне очень нравится язык, но есть несколько вещей, которые кажутся мне немного проблематичными:\n\n* время компиляции неожиданно велико. На моем устройстве ryzen 2700x уходит около 50 секунд, чтобы собрать все в банку. Я не уверен, что делаю что-то не так здесь. (к счастью, при использовании инкрементных сборок из среды IDE эта проблема отсутствует)\n* Удивительно и прискорбно, когда Kotlin работает на JVM. Интеграция Java-кода почти тривиальна (и я использую это для парсера, сгенерированного antlr4). Однако иногда я сталкивался с ограничениями, которые кажутся произвольными, но вызваны JVM (например: функции никогда не могут возвращать более одного значения, стирание типов в общих коллекциях, вызывающее проблемы в системе типов kotlin)\n\nЯ все еще думаю, что мог бы в конечном итоге преуспеть в моем проекте с Python, но лучшим решением было переключиться на Kotlin.","title":"Я использовал Kotlin для создания кросс-компилятора для 8-битных компьютеров с процессором 6502, таких как Commodore-64","subreddit_name_prefixed":"r/Kotlin","ups":39,"created":1548658340,"link_flair_background_color":"","id":"akguyk","author":{"name":"desertfish_"},"permalink":"/r/Kotlin/comments/akguyk/i_used_kotlin_to_make_a_crosscompiler_for_8_bit/","url":"https://www.reddit.com/r/Kotlin/comments/akguyk/i_used_kotlin_to_make_a_crosscompiler_for_8_bit/","created_utc":1548629540}