{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Сначала немного контекста:\nДля проекта я хочу аутентифицировать пользователей моего веб-приложения, запрашивая у них имя пользователя и пароль. Это веб-приложение хочет получить некоторые данные от определенного сервера ресурсов (разработанного в Ktor / Kotlin), который должен возвращать данные только при получении действительного токена JWT из веб-приложения.\nКогда они вводят свои учетные данные, процесс OAuth2.0 должен стартовать.\nВеб-приложение должно отправить запрос на пользовательский сервер авторизации (API, разработанный на Ktor) и проверить, действительны ли учетные данные. Если учетные данные действительны, этот сервер авторизации должен создать JWT, используя секрет, который используется совместно с сервером ресурсов. Этот токен должен быть отправлен обратно в веб-приложение и сохранен в cookie-файлах клиента (я буду использовать HttpOnly и, если возможно, флажок Secure для предотвращения XSS). Сервер ресурсов должен знать, какие токены он должен считать действительными. Обычно это делается путем просмотра секрета, с которым токен был подписан во время его выдачи.\nСервер авторизации не является тем же сервером, что и сервер ресурсов; это два разных сервера.\n\n\nУ меня вопрос: возможно ли реализовать в Ktor такой пользовательский сервер авторизации, который будет генерировать токены, которые могут использоваться только сервером ресурсов? У вас есть какие-либо ссылки? Документация? Полезные уроки или несколько советов, как это сделать? Я действительно не мог найти руководство или что-нибудь обсуждающее эту проблему или что-то подобное в Ktor. Я мог найти документацию о том, как * потреблять * JWT, но не о том, как выдать указанный токен.\n\n\nЯ также опубликовал этот пост на r / learnprogramming.","title":"Реализация собственного сервера авторизации в Ктор.","subreddit_name_prefixed":"r/Kotlin","ups":5,"created":1549919033,"link_flair_background_color":"","id":"apg1yp","author":{"name":"IP14Y3RI"},"permalink":"/r/Kotlin/comments/apg1yp/implementing_my_own_authorization_server_in_ktor/","url":"https://www.reddit.com/r/Kotlin/comments/apg1yp/implementing_my_own_authorization_server_in_ktor/","created_utc":1549890233}