{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"**История:**\n\nЯ работаю в довольно крупной организации, которая в основном занимается разработкой программного обеспечения с использованием Java. Однако недавно мы начали изучать Kotlin и разработали несколько небольших проектов, используя его.\n\nВ Java мы использовали наш собственный стиль кодирования, он в основном совпадает с автоматическим форматом Intellij, который поставляется по умолчанию, приправленный здравым смыслом. При переходе на Kotlin мы хотим использовать [опубликованные соглашения Kotlin]  (https://kotlinlang.org/docs/reference/coding-conventions.html) .\n\nКогда мы показали наш проект Kotlin остальной части команды, они были расстроены тем, что мы больше не влияли на наши соглашения Java. Все это вызвало довольно горячие / упрямые дебаты о стилях кодирования, поэтому я хочу поделиться своими мыслями по этому вопросу. В целом они, похоже, хотят иметь гибридное соглашение о коде Kotlin / Java, более похожее на то, которое мы в настоящее время используем с Java.\n\n\n\n**Вопрос:**\n\nКакие у тебя мысли / мнения? Особенно я хотел бы услышать от людей, которые пережили подобные изменения в своей команде / организации.\n\n\n\n**Мое мнение:**\n\nАргументы, которые я слышал в пользу гибридного соглашения Kotlin / Java:\n\n* Быстрее для разработчиков Java, чтобы взять и работать с\n* Выглядите менее шумно при работе в гибридных проектах, в которых есть немного Java и немного Kotlin (так будет до тех пор, пока проекты не будут переписаны)\n* Соглашение о кодировании языка не является законом, им можно следовать, но команда должна, естественно, создать соглашение на основе работы и опыта (aka [Uncle bob] <span translate = \"no\"> (http://wiki.c2.com). /? UncleBobOnCodingStandards) </ SPAN>)\n\nЭто * мои * основные аргументы в пользу использования соглашений Котлина:\n\n* Используя стандарт, мы помогаем новым разработчикам догнать наш способ кодирования, а когда у нас возникают сомнения, мы написали его для нас. (Меньше мнения? Легче найти то, что правильно, а что нет)\n* В будущем, когда у нас будет несколько проектов, полностью разработанных в Kotlin, я бы предпочел, чтобы код, похожий на Kotlin, отличался от кода Kotlin, который пытается выглядеть как Java\n* Это значение по умолчанию в автоматическом формате кода Intellij для Kotlin\n* Котлин не Ява. Хотя Kotlin многое разделяет с Java, в конце концов, это другой язык со своим синтаксическим сахаром, который, на мой взгляд, нуждается в собственном наборе стилей\n\nНи одна из точек зрения объективно не верна, но я сильно склоняюсь к обновлению нашей кодовой базы, а не цепляюсь за прошлое.\n\nЧто ты думаешь? какие-либо аргументы для того, чтобы держать это \"Java-подобным\", которым я пренебрег?\n\n","title":"Соглашения о кодировании при переключении языков (также расстроенные члены команды)","subreddit_name_prefixed":"r/Kotlin","ups":32,"created":1550023782,"link_flair_background_color":"","id":"apw9gf","author":{"name":"_Atomfinger_"},"permalink":"/r/Kotlin/comments/apw9gf/coding_conventions_when_switching_languages_aka/","url":"https://www.reddit.com/r/Kotlin/comments/apw9gf/coding_conventions_when_switching_languages_aka/","created_utc":1549994982}