{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Котлин [Соглашения о кодировании]  (https://kotlinlang.org/docs/reference/coding-conventions.html#source-code-organization)  имеют следующую рекомендацию:\n\n> В чистых проектах Kotlin рекомендуемая структура каталогов должна соответствовать структуре пакета с опущенным общим корневым пакетом (например, если весь код в проекте находится в пакете \"org.example.kotlin\" и его подпакетах, файлы с \"\" org.example.kotlin \"пакет должен быть помещен непосредственно под исходным корнем, а файлы в\" org.example.kotlin.foo.bar \"должны находиться в подкаталоге\" foo / bar \"исходного корня).\n\nТак что некоторое время назад я был воодушевлен этим и начал использовать это в проекте, который на данный момент стал довольно большим.\n\nИнтересно, сколько людей, кроме меня, используют эту рекомендацию и сталкиваются ли они с теми же проблемами, что и я, а именно с проблемами рефакторинга, такими как:\n\n* перемещение файлов между папками внутри одного и того же модуля стирает префикс пакета (`com.example.kotlin.utils` становится` utils`). Это действительно больно.\n* обнаружение поврежденного корневого пакета (особенно когда `src / main` содержит только папки, но не файлы)\n* неработающие предложения по быстрому исправлению неправильного пакета (опять же, рекомендации `utils`)\n\nЯ думал, что все это связано с обнаружением сломанного корня, поэтому я подал [этот отчет об ошибке]  (https://youtrack.jetbrains.com/issue/KT-24347) , который довольно старый и не был рассмотрен.\n\nИнтересно, потому что не многие люди начали использовать это предложение из руководства по стилю? Или есть шанс, что я как-то ошибаюсь?","title":"Используете ли вы официально рекомендованную структуру каталогов для пакетов?","subreddit_name_prefixed":"r/Kotlin","ups":16,"created":1551498653,"link_flair_background_color":"","id":"aw8xdb","author":{"name":"dimsuz"},"permalink":"/r/Kotlin/comments/aw8xdb/do_you_use_officially_recommended_directory/","url":"https://www.reddit.com/r/Kotlin/comments/aw8xdb/do_you_use_officially_recommended_directory/","created_utc":1551469853}