{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Привет, я знаю, что вы, по крайней мере, знаете о [MockK]  (https://github.com/mockk/mockk) , библиотеке насмешек Kotlin.\n\n\n\nTBH, в настоящее время после многих попыток присоединиться к нему я все еще единственный участник и сторонник. Было около 5 попыток разработать хотя бы что-то, и около 3-4 PR с одной-двумя строчками исправлений. Многие люди помогают с разными вещами, некоторые более настойчивы, некоторые просто сообщают об ошибке один или два раза, но в целом я вижу, что основной риск для проекта в настоящее время заключается в устранении [Bus Factor]  (https: // en.wikipedia.org/wiki/Bus_factor)  и, таким образом, иметь хотя бы кого-нибудь еще знающего.\n\nhttps://preview.redd.it/kcyh21ase6l21.png?width=1449&format=png&auto=webp&s=44b708de412e05d434d322a9aa5f78ce0dd4b5cf\n\nКривая обучения сложна по нескольким причинам:\n\n* кодовая база довольно большая (41K LOC)\n* библиотека mocking сама по себе спроектирована с набором «взломов байт-кода и тому подобного», упакованных в красивый пакет\n* качество кода поддерживалось на достаточно хорошем уровне в пользу успеха проекта и предоставления функций\n* Есть несколько инновационных подходов, которые делают его еще более сложным для понимания\n* не много документации о внутренностях\n\n\n\nТеперь мне просто интересно, какие эффективные меры могут быть применены и как привлечь участников с открытым исходным кодом в целом. Существует большой фактор, который мотивирует людей и как позиционировать себя для новичков. Но сначала, прежде чем понять правильный вектор, я бы хотел подготовиться технически.\n\nЯ начал записывать несколько видео с навигацией по коду. Обычно это нормально, но я сомневаюсь, что это приведет к хорошим результатам.\n\nСледующее, что возможно, - это рефакторинг и улучшение качества кода и читабельности. Я предполагаю, что это может немного улучшить ситуацию (примерно на 10-15%), но в целом все еще будут сложные вещи.\n\nНаконец, я думаю, что у меня есть супер-хорошая вики (я начал здесь [https://github.com/mockk/mockk/wiki] (https://github.com/mockk/mockk/ wiki) ) с множеством полезной информации для начальной загрузки и описания сложных тем.\n\nЕсть еще идеи, опыт, предложения?","title":"Как привлечь участников с открытым исходным кодом (в библиотеку Kotlin)?","subreddit_name_prefixed":"r/Kotlin","ups":48,"created":1552202274,"link_flair_background_color":"","id":"az9g09","author":{"name":"oleksiyp"},"permalink":"/r/Kotlin/comments/az9g09/how_to_attract_open_source_contributorsto_kotlin/","url":"https://www.reddit.com/r/Kotlin/comments/az9g09/how_to_attract_open_source_contributorsto_kotlin/","created_utc":1552173474}