{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Привет,\n\nв C # концепция событий в основном абстрагируется как тип члена класса. Наличие такого члена означает, что вы можете подписаться на него извне, но просто позвонить изнутри класса. В Котлине такого нет. Какой, по вашему мнению, лучший подход для абстрагирования концепции событий в Котлине? У меня уже есть способы и мнения:\n\n1. RxJava и т. Д. (Для простых вещей это излишне, но вы, например, должны использовать `PublishSubject` или` BehaviourSubject`)\n2. Обработчики событий (мне это не нравится, потому что обычно вам приходится реализовывать механизм добавления и удаления слушателей самостоятельно)\n3. Каналы сопрограмм (может быть излишним, также нет смысла для трансляций, только эксперимент)\n4. Событие автобуса (худшее на мой взгляд)\n5. Вы также можете использовать `lateinit var`, который содержит лямбда для вызова\n6. Вы можете использовать `val` с` mutableListOf <() -> Unit> () `и в конечном итоге добавить функцию расширения, которая вызывает все лямбда-выражения в списке\n\n** Пример для случая 5 ** (давайте пока проигнорируем тот факт, что вызов события должен происходить из определенного класса, а потребление - извне):\n\n    lateinit var event1: () -> Unit\n    \n    fun main () {\n        event1 = :: someHandler\n        event1 ()\n    }\n    \n    fun someHandler () {println (\"обработчик вызван\")}\n\n** Пример для случая 6 **:\n\n    val event1 = mutableListOf <() -> Unit> ()\n    \n    fun main () {\n        event1 + = :: someHandler\n        event1 ()\n    }\n    \n    fun someHandler () {println (\"обработчик вызван\")}\n    \n    оператор fun List <() -> Unit> .invoke () = forEach {it ()}\n\nПроблема с двумя последними подходами: они не различают, звоните ли вы снаружи или изнутри. Некоторые внешние клиенты класса также могут инициировать событие, хотя на самом деле это не его бизнес. Вы можете обойти это, добавив слой абстракции и отделив защищенный вызов от общедоступной стороны вещи.\n\nКакие подходы вам нравятся чаще всего? Какой случай вы используете для чего? Мне любопытно :-)","title":"Лучший способ абстрагировать события в Котлине?","subreddit_name_prefixed":"r/Kotlin","ups":18,"created":1552264729,"link_flair_background_color":"","id":"azhfxn","author":{"name":"amarcot"},"permalink":"/r/Kotlin/comments/azhfxn/best_way_of_abstracting_events_in_kotlin/","url":"https://www.reddit.com/r/Kotlin/comments/azhfxn/best_way_of_abstracting_events_in_kotlin/","created_utc":1552235929}