{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Я переключился с Eclipse на Intellij несколько лет назад; главным образом по практическим причинам, таким как возможность импортировать проект загрузочной / пружинной загрузки, который с годами становился все более и более утомительным с Eclipse.\n\nВ прошлом году я стал разработчиком Kotlin, и я люблю язык. Но я продолжаю иметь отношения любви и ненависти с Интеллиг. Одна вещь, которую я особенно упускаю, это потрясающе быстрая инкрементная компиляция, которую Eclipse имел обыкновение иметь для Java, которую я никогда не видел, даже приблизительно прибавляя в интеллигентности, что она выключена в 10-100 раз, даже при хороших обстоятельствах, когда, по крайней мере, удается занять менее 5 секунд. ,\n\nКотлин, кажется, усугубил ситуацию с точки зрения производительности. Теперь я обычно сталкиваюсь с задержками от полу до полной минуты при компиляции после тривиальных изменений в 1 строке; хуже иногда. И да, у меня инкрементная компиляция и т. Д., Все включено, как рекомендовано в бесчисленных статьях stackoverflow и т. Д. По этой теме. Это должно быть быстро. Это явно не так. Даже не близко. И это явно переосмысление многих вещей снова и снова. Похоже, что на самом деле это компилятор Kotlin, который всасывает весь процессор, а не другие вещи, такие как компиляция Java (также не быстрая) или перемещение файлов классов. Хуже того, он также постоянно ошибается, и я постоянно сталкиваюсь с тем, что Intellij лжет о том, что все компилируется или нет (оба). И когда для появления красных волнистых линий требуется минута, все становится действительно раздражающим.\n\nПоследний раз, когда я пробовал плагин Kotlin для Eclipse (прошлым летом), был полный провал. Мой проект gradle не импортировался правильно и в основном ничего не работало. Поскольку это был очень простой стандартный проект gradle / kotlin, я пришел к выводу, что эта среда больше не используется. Я только что проверил проект github на плагин kotlin, и он по-прежнему рекомендует Eclipse Oxygen в качестве текущей версии (это с 2017 года). Это не дает мне много уверенности.\n\nПоэтому мой вопрос в том, каково состояние Котлина в других IDE. Netbeans все еще вещь? Есть ли другие вещи, которые люди используют? Просто любопытно на данный момент.\n\n","title":"IDE, кроме intellij?","subreddit_name_prefixed":"r/Kotlin","ups":4,"created":1554387792,"link_flair_background_color":"","id":"b9960l","author":{"name":"jillesvangurp"},"permalink":"/r/Kotlin/comments/b9960l/ides_other_than_intellij/","url":"https://www.reddit.com/r/Kotlin/comments/b9960l/ides_other_than_intellij/","created_utc":1554358992}