{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Привет всем,\n\nТрудно не быть соблазненным славой и шумихой вокруг Котлина. Жесткие сторонники Kotlin говорят, что они захватят мир программирования, потому что он может делать все. Как молодые программисты, подобные заявления меня очень смущают. Основываясь на исследованиях Kotlin, которые я сделал, кажется, что это может быть хорошим вариантом для меня. Ниже я опубликую свой текущий проспект программирования и буду признателен, если кто-нибудь поможет мне понять, как Kotlin может упростить и улучшить его.\n\n** - В настоящее время я изучаю среду Spring, чтобы превратить мои полтора года программирования на Java в веб-разработку. Тем не менее, я постоянно спорю, займет ли реактивный dev пространство, и спорю об изучении node.js и отреагирую. **\n\n** - Если я уверен в своих навыках веб-разработки или через два месяца я бы хотел освоить мобильную разработку, то причиной для того, чтобы придерживаться java для веб-разработки, будет помощь позже, когда я буду изучать разработку под Android. Затем я хотел бы изучить Swift для разработки IOS. **\n\n** - Хотелось бы изучить сетевую безопасность и этический взлом, которые обычно требуют Python, есть ли у Котлина место здесь? **\n\n** - В конечном итоге я хотел бы заняться более продвинутым программированием, чем просто базовая Java-разработка и веб-разработка, например, создание новых технологий, возможно, в области ИИ. **\n\n\n\nМне только что исполнился 21 год, и когда мой семестр закончился, я посвятил все свое лето личному развитию и специально совершенствовал свои знания и навыки программирования, поэтому выбор правильной технологии сейчас, когда у меня есть эта свобода, очень важен для меня.","title":"Почему я должен изучать Kotlin","subreddit_name_prefixed":"r/Kotlin","ups":3,"created":1554870476,"link_flair_background_color":"","id":"bbcx3l","author":{"name":"PhillyD177"},"permalink":"/r/Kotlin/comments/bbcx3l/why_should_i_learn_kotlin/","url":"https://www.reddit.com/r/Kotlin/comments/bbcx3l/why_should_i_learn_kotlin/","created_utc":1554841676}