{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Отказ от ответственности: ранний прототип этого компонента был написан на Go, другие части этой системы заблокированы в JVM. Для преемственности мы хотели бы попытаться сохранить всю систему на JVM, если это возможно. Мой опыт работы с JVM был 5 лет назад или около того, так что я не супер-сырец, но с тех пор, как я в последний раз разрабатывал JVM, все изменилось.\n\n\nМоя команда запускает новую систему обработки трубопроводов. Я хотел бы знать, если мой текущий план для компонента в этой системе в порядке или полностью помешан. Мне кажется, это нормально, но в то же время злоупотребление рамками.\n\nМы планируем использовать: Kotlin, Vert.x, RabbitMQ, SQL Server (выбор БД действительно вне нашего контроля).\n\nТекущая идея для этого компонента:\n\n- Слушайте на канале команды работы.\n- При получении команды запуска введите новый CoroutineVerticle в качестве рабочего (или добавьте задание в существующий текст), где каждый CoroutineVerticle отвечает за подачу ~ 10 заданий или около того.\n- Каждый CoroutineVerticle получает небольшой пул соединений (~ 5 соединений или около того).\n- Каждое задание отвечает за отправку пакетов данных определенного размера в канал MQ, назначенный этому заданию.\n- Задания могут получать команды остановки / паузы / возобновления через EventBus.\n- Так как задания завершены, а Verticle больше не нужны, они не развернуты.\n\nТаким образом, основная вертикаль MQ - это просто отправка сообщений развертывающему вакансии, который управляет версиктами рабочих и их заданиями.\n\n** Это безумие или соответствует предложенным Vert.x вариантам использования? ** В частности, часть о динамическом поддержании дополнительных вершин.","title":"Backend Архитектурная проверка работоспособности","subreddit_name_prefixed":"r/Kotlin","ups":9,"created":1558137479,"link_flair_background_color":"","id":"bpt1ho","author":{"name":"HolyClickbaitBatman"},"permalink":"/r/Kotlin/comments/bpt1ho/backend_architectural_sanity_check/","url":"https://www.reddit.com/r/Kotlin/comments/bpt1ho/backend_architectural_sanity_check/","created_utc":1558108679}