{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Всем привет. Я делаю этот пост, чтобы попросить о помощи. Если это не разрешено, пожалуйста, дайте мне знать, и я буду искать помощь в другом месте.\n\n\n\nЯ не прошу, чтобы люди подробно объясняли, что мне нужно делать, а скорее спрашиваю, куда мне обратиться, чтобы научиться тому, как делать эти вещи наиболее эффективно. Я искал учебники, и кажется, что всегда есть какая-то проблема. Либо качества очень не хватает, либо у них очень сильный акцент, либо он слишком продвинутый, и я не могу понять, о чем они говорят.\n\n\n\nВот что я пытаюсь сделать. Я разрабатываю приложение в Android Studio, которое позволяет пользователю пролистывать экраны, каждый из которых заполняется путем рисования из массива текста.\n\n\n\nЕсть две вещи, которые я пытаюсь научить делать.\n\n\n\n1) Как мне создать механику смахивания, которая рисует из текстового массива? Я нашел учебные пособия, которые показывают, как создавать перелистывающие видовые пейджеры, но они часто используют вкладки или имеют некоторые другие функции, которые не совсем то, что я ищу.\n\n\n\n2) Существует ли структура данных, которая позволяет каждому элементу иметь несколько атрибутов? Сейчас для простоты я извлекаю свои данные из строкового массива, но в конечном итоге мне нужно, чтобы каждый текстовый элемент также имел несколько связанных с ним атрибутов, которые приложение может использовать.\n\n\n\nЗаранее благодарим за любую помощь, которую вы можете оказать, указывая мне в правильном направлении. Я готов уделить время тому, чтобы научиться этому правильно, но я не хочу тратить свое время на некачественные учебные материалы, которых, кажется, много.","title":"Структуры данных и перелистывание страниц","subreddit_name_prefixed":"r/Kotlin","ups":6,"created":1566105821,"link_flair_background_color":"","id":"crs644","author":{"name":"[deleted]"},"permalink":"/r/Kotlin/comments/crs644/data_structures_and_page_swiping/","url":"https://www.reddit.com/r/Kotlin/comments/crs644/data_structures_and_page_swiping/","created_utc":1566077021}