{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Я пытаюсь узнать, как использовать kotlin для создания готового к запуску дистрибутива с готовым дистрибутивом, ориентированного на системы Windows amd64. В идеале я хотел бы использовать MSVC в качестве компилятора, но я не нашел ничего о том, как это сделать.\n\nВ нативном руководстве мы используем MinGW-64 для целей сборки Windows x64. У меня есть две проблемы с использованием набора инструментов MinGW для создания исполняемых файлов для распространения. Если эти проблемы неверны, пожалуйста, укажите мне, поскольку я никогда не использовал MinGW.\n\n1. Я не уверен, будут ли скомпилированные исполняемые файлы работать в системе без некоторых DLL, включенных в MinGW. Я знаю, что возможно было бы распространить требуемые библиотеки DLL вместе с исполняемым файлом или скомпилировать исполняемый файл, чтобы все зависимости были включены в образ. Моя проблема в том, что я хотел бы избежать потенциальных технических и юридических проблем, которые могут возникнуть, если это будет сделано для цепочки производственных инструментов для большой корпорации.\n2. Я не уверен, что MinGW может получить доступ ко всем средствам и библиотекам, предоставляемым Windows для MSVC. Я также хотел бы минимизировать количество переводов из UNIX-подобных вызовов функций в функции Windows. Это в первую очередь для облегчения аудита получаемых двоичных файлов.\n\nТеперь, если в настоящее время невозможно использовать kotlin native с MSVC, где я могу узнать больше о том, как работает kotlin native toolchain и в идеале, как добавить новую цель компилятора? Я еще не до конца понимаю, как это работает, поэтому, пожалуйста, обучите меня, если я задаю неправильный вопрос или если я неправильно понял концепцию.","title":"[Kotlin Native] Цели сборки Windows amd64.","subreddit_name_prefixed":"r/Kotlin","ups":13,"created":1569212332,"link_flair_background_color":"","id":"d7vwxk","author":{"name":"ChrisWsrn"},"permalink":"/r/Kotlin/comments/d7vwxk/kotlin_native_windows_amd64_build_targets/","url":"https://www.reddit.com/r/Kotlin/comments/d7vwxk/kotlin_native_windows_amd64_build_targets/","created_utc":1569183532}