{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Я заранее прошу прощения, если моя терминология все испортила. Я действительно отчаянно хочу понять эту концепцию. Я читал эту статью, которая наверняка говорит мне то, что мне нужно знать, но я просто не могу объединить все точки и использовать ее, чтобы решить то, что я пытаюсь сделать, что, я уверен, смехотворно просто большинству из вас:\n\n[https://www.i-programmer.info/programming/android/11806-android-programming-in-kotlin-events.html]<span translate = \"no\"> (https: //www.i-programmer. Информация / программирование / Android / 11806-андроид-программирование-в-Котлин-events.html) </ SPAN>\n\nЯ собираюсь отбросить мои жалкие неудачные попытки и, надеюсь, найти ясность с помощью очень простого примера:\n\nДопустим, у меня есть класс для автомобиля:\n\n    Автомобиль класса {\n        fun onRedTrafficLightSpotted () {\n            // сделать остановку машины\n        }\n    }\n\nТогда второй класс для светофора:\n\n    class TrafficLight {\n        fun eventTrafficLightGoesRed () {\n            // когда он вызывается, он запускает функцию onRedTrafficLightSpotted внутри\n            // класс автомобиля, который прослушивает это событие. Так что все машины реагируют на\n            // любой красный светофор становится красным.\n        }\n    }\n\nТак что было бы несколько экземпляров светофоров и машин. Когда один светофор загорается красным, все автомобили реагируют, выполняя определенную функцию. Глупый пример, но пытаюсь сделать его максимально простым. Раньше я передавал множество машин каждому светофору, сохранял его там, а затем вызывал соответствующую функцию на автомобилях из класса светофора. Так что все это решение для событий и слушателей кажется куда более уместным и элегантным, если я что-то не упустил?\n\nЯ просто так растерялся, пытаясь сделать следующий шаг, чтобы понять, как это тогда настраивается. Я был бы очень благодарен, если бы кто-нибудь показал мне, как этот простой пример будет закодирован. Я прочитал эту связанную статью несколько раз, но я чувствую себя настолько неуклюже, внедряя, как я думаю, что это должно быть настроено, но не удается.\n\nПожалуйста, кто-нибудь, проявите милосердие к истощенному ученику. Я взволнован, чтобы наконец покорить эту гору, но сейчас у меня нет кислорода, и я чувствую, как уплываю в бесконечное мучительное забвение ... 01101000 01100101 01101100 01110000","title":"Пытаетесь обернуть мою голову вокруг событий и слушателей, используя только Kotlin?","subreddit_name_prefixed":"r/Kotlin","ups":5,"created":1571704365,"link_flair_background_color":"","id":"dl32m9","author":{"name":"kemb0"},"permalink":"/r/Kotlin/comments/dl32m9/trying_to_wrap_my_head_around_events_listeners/","url":"https://www.reddit.com/r/Kotlin/comments/dl32m9/trying_to_wrap_my_head_around_events_listeners/","created_utc":1571675565}