{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"У меня есть куча кода здесь для вашего рассмотрения\n\nhttps://github.com/mercenary-creators\n\nБиблиотека -util - это утилиты для нескольких приятных вещей\n\nhttps://github.com/mercenary-creators/mercenary-creators-kotlin-util\n\n\nОн имеет приличный криптопакет AES 256 CBC и GCM. Он работает с двоичными файлами, текстом, файлами, потоками, URL-адресами и т. Д. И работает очень быстро. Я воссоздал CypherOutputStream с нуля для высокой производительности.\n\nОн имеет что-то похожее на Spring Resources, но не перетаскивает весь ресурс Spring, файлы, URL-адреса, пути к классам и поиск ресурсов. Также опираясь на javax.activation Mime Type Match.\n\nУ него есть реализация ДАЖЕ ВРЕМЯ ВРЕМЕНИ, и я знаю, что это было сделано до смерти, но я нуждался в этом в не экспериментальной реализации. Это может сделать продолжительность и дату математики, Дата () + 4,75 недели - (1 год / 2)\n\nПакет JSON\n\nhttps://github.com/mercenary-creators/mercenary-creators-kotlin-json\n\nВ основном служебный код для типов JSON и расширений Kotlin с помощью встроенных методов. У меня была более ранняя версия этого, прежде чем FasterXML выпустил модуль Kotlin. Раньше у него были сериализаторы и десериализаторы для последовательностей Kotlin, но я отправил заявку в команду FasterXML, и они добавили ее в последнем выпуске 2.10.1.\n\nОн содержит набор расширений Kotlin для библиотеки Jayway JsonPath.\n\nЯ также добавил базовые классы данных для сервисов JSON REST типикода. Это полезно для тестирования\n\nhttps://jsonplaceholder.typicode.com/\n\nhttps://github.com/mercenary-creators/mercenary-creators-kotlin-mail\n\nЭто полная реализация Java Mail API в качестве почтового DSL. Может делать простой текст, HTML, MIME с вложениями или встроенными вложениями. Использует реактивное планирование, работая над версией сопрограмм.\n\nhttps://github.com/mercenary-creators/mercenary-creators-kotlin-boot\n\nhttps://github.com/mercenary-creators/datalake-clusters\n\nЭто тестовое приложение Spring Boot, имеющее Spring Security RBAC для конечных точек привода через пользовательский репозиторий базы данных, управление сеансами Redis, 6 конечных точек JSON REST, в 52 строках кода без комментариев. Внешний интерфейс написан на ReactJS, но публикуется отдельно и загружается через управление ресурсами.\n\nПредстоящие проекты\n\nhttps://github.com/mercenary-creators/mercenary-creators-minio\n\nЭто пакет для доступа к данным Amazon S3, использующий библиотеку Minio Client, но исправляющий некоторые вещи, которые, по моему мнению, нуждались в исправлении, которые я объясняю в README. Это сильно зависит от весны. Повторная реализация в идиоматическом Kotlin на следующей неделе.\n\nReimplement Lienzo, сверхскоростной пакет структурированной графики, основанный на спецификации Canvas. Это моя первая попытка JavaScript Kotlin, попасть туда\n\nhttps://github.com/ahome-it/lienzo-core\n\nДемонстрационное приложение, которое на данный момент не работает для Chrome, это очень старый код ... отлично работает на Safari или Firefox. Это также может выполнять манипуляции с изображениями и фильтры, но эти фильтры также работают с видео-контентом практически в реальном времени.\n\nhttps://lienzo.themodernway.com/lienzo-ks/\n\nВсегда приветствую обратную связь\n\nУра!","title":"Пакеты Kotlin для оценки","subreddit_name_prefixed":"r/Kotlin","ups":10,"created":1574251576,"link_flair_background_color":"","id":"dywhxv","author":{"name":"Dean_S_Jones"},"permalink":"/r/Kotlin/comments/dywhxv/kotlin_packages_for_evaluation/","url":"https://www.reddit.com/r/Kotlin/comments/dywhxv/kotlin_packages_for_evaluation/","created_utc":1574222776}