{"subreddit":{"display_name":"Kotlin"},"subreddit_loc":"Котлин","selftext":"Долгое время читатель, первый постер.\n\nТехническое лидерство в компании, в которой я работаю, - это то, что, будучи старшими архитекторами и главными разработчиками, все люди с 20-летним опытом работы придумали новую техническую стратегию для создания наших внутренних сервисов. Короче говоря, они хотят, чтобы все новые сервисы, созданные в компании, создавались либо на Java, либо на C # / .NET.\n\nИх причины этого следующие:\n\n* Больше документации и онлайн-ресурсов для этих более «традиционных» языков; это обесценивает неизвестное.\n* Рынок для разработчиков на этих более «традиционных» языках / платформах шире - больший круг претендентов может быть нанят в будущем, больше людей с этим опытом.\n* Раньше, позволив всем командам самим решать, какой язык они хотят, это привело к тому, что столько разных команд встраивали в * такое * много разных языков / сред, что, если вы посмотрите на весь отдел в целом, у нас есть Java / Spring, Ruby on Rails, Ruby с Sinatra, Scala, C # /. NET, некоторые другие унаследованные вещи и т. Д. - огромный коктейль из разных вещей - очень трудно разделить людей в разных командах одного и того же отдела. Вы действительно должны быть суперзвездой, разработчиком полного стека.\n* Большая сложность в нашей кодовой базе проистекает не из сложности бизнес-логики, а из-за сложности языка / фреймворка. Итак, зачем беспокоиться о наличии такого количества языков и усложнять бизнес-логику * до * технической сложности? (Например, некоторые вещи написаны на функциональных языках, а другие написаны на ОО-языках). Проще говоря со «старыми» языками, и тогда мы сможем упростить сложность бизнес-логики, поскольку все разработчики будут на одной странице, и все разработчики смогут читать код других команд, с которыми они не работают каждый день. Вы также уменьшаете узкие места у людей с языковыми навыками\n\nПоскольку моя команда в первую очередь предпочитает Java / Spring, мы стремились поэкспериментировать с Kotlin, и некоторые из нас изучают его в свободное время. Лично мне очень нравится язык и определенно вижу его преимущества. После предложения Kotlin, чтобы дополнить это, мы были закрыты по причинам выше.\n\nМожет кто-нибудь предложить какие-либо способы поддержать аргумент, что мы должны включить Kotlin в этот микс? Я просто думаю, что это настолько логично, что мы поддерживаем что-то, что действительно улучшает Java и позволяет нам развиваться бок о бок с Java, * и * позволяет нам постепенно, постепенно, без масштабного переписывания Java в Kotlin. Например, мы могли бы сначала переписать некоторые тесты Java в Kotlin в качестве начального постного куска и показать им, что на самом деле все не так плохо, как они думают.\n\nУ любителей Scala в компании есть своя битва, но это уже другая тема ...","title":"Технические руководители моей компании настаивают на том, чтобы использовать только Java или C # /. NET ... Меня закрыли за предложение Kotlin","subreddit_name_prefixed":"r/Kotlin","ups":27,"created":1574335290,"link_flair_background_color":"","id":"dzd69e","author":{"name":"caldeve"},"permalink":"/r/Kotlin/comments/dzd69e/the_technical_leaders_at_my_company_are_pushing/","url":"https://www.reddit.com/r/Kotlin/comments/dzd69e/the_technical_leaders_at_my_company_are_pushing/","created_utc":1574306490}