{
    "subreddit": {
        "display_name": "Nootropics"
    },
    "subreddit_loc": "ноотропики",
    "selftext": "",
    "title": "Ашваганда имеет обратную толерантность - в отличие от бензодиазепинов, анксиолитический эффект ашваганды усиливается при длительном применении [исследование на крысах] (2011)",
    "subreddit_name_prefixed": "r/Nootropics",
    "ups": 402,
    "created": 1573082336,
    "link_flair_background_color": "#ea0027",
    "id": "dshpg0",
    "author": {
        "name": "Regenine"
    },
    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/",
    "url": "https://i.imgur.com/M820pLJ.png",
    "created_utc": 1573053536,
    "replies": [
        {
            "ups": 35,
            "link_id": "t3_dshpg0",
            "id": "f6pd1ie",
            "author": "Regenine",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Full paper: [Withaferin-A displays enhanced anxiolytic efficacy without tolerance in rats following sub chronic administration](https://academicjournals.org/journal/AJB/article-full-text-pdf/E3B49E936612) (2011)\n\n****\n\nBenzodiazepines are powerful anxiolytics, and are particularly useful for the rapid termination of panic attacks. However, their chronic use results in tolerance and dependence, and abrupt cessation of them can lead to death through withdrawal seizures.\n\nAshwagandha is a plant long known to possess anxiolytic effects, in both rodents and humans. It seems to act through the modulation of GABA receptors, in part, which raised a question - can it lead to tolerance and dependence like classical benzodiazepine anxiolytics?\n\nThis study compared Withaferin A (WA; a major active compound in Ashwagandha) to Valium (Diazepam; a prescription benzodiazepine) in rats. It was found that, with sub-chronic use, Diazepam's anxiolytic effects weakened, which required higher doses for the same decrease in anxiety. However, with Ashwagandha, not only there was no tolerance to the anxiolytic effect, there was even *reverse tolerance* - an increase in the strength of the anxiolytic effect over time.",
            "body_html": "<div class=\"md\"><p> Полная статья: <a href=\"https://academicjournals.org/journal/AJB/article-full-text-pdf/E3B49E936612\">Витхаферин-А демонстрирует повышенную анксиолитическую эффективность без толерантности у крыс после субхронического введения</a> (2011) </p><hr/><p> Бензодиазепины являются мощными анксиолитиками и особенно полезны для быстрого прекращения панических атак. Тем не менее, их хроническое использование приводит к терпимости и зависимости, а их внезапное прекращение может привести к смерти из-за изъятий абстиненции. </p><p> Ашваганда - растение, давно известное как обладающее анксиолитическим действием, как у грызунов, так и у людей. Кажется, что он действует посредством модуляции ГАМК-рецепторов, отчасти, что поднимает вопрос - может ли это привести к толерантности и зависимости, подобно классическим бензодиазепиновым анксиолитикам? </p><p> В этом исследовании сравнивался уровень витамина А (WA; основное действующее вещество в ашваганде) с валиумом (диазепамом, бензодиазепином, отпускаемым по рецепту) у крыс. Было обнаружено, что при субхроническом применении анксиолитические эффекты диазепама ослабевали, что требовало более высоких доз для того же снижения тревожности. Однако в случае с Ашвагандхой не только не было никакой толерантности к анксиолитическому эффекту, но была даже <em>обратная толерантность</em> - увеличение силы анксиолитического эффекта со временем. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pd1ie/",
            "name": "t1_f6pd1ie",
            "created": 1573082369,
            "created_utc": 1573053569,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 53,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_dshpg0",
                    "replies": [
                        {
                            "ups": 2,
                            "link_id": "t3_dshpg0",
                            "id": "f6w1ph3",
                            "author": "KravMagaRengar",
                            "parent_id": "t1_f6tjlit",
                            "subreddit_id": "t5_2r81c",
                            "body": "Qyay at 1 month they was teleporting themselve",
                            "body_html": "<div class=\"md\"><p> Qyay в 1 месяц они телепортировали себя </p></div>",
                            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6w1ph3/",
                            "name": "t1_f6w1ph3",
                            "created": 1573241472,
                            "created_utc": 1573212672,
                            "subreddit_name_prefixed": "r/Nootropics",
                            "depth": 4
                        }
                    ],
                    "id": "f6tiz3d",
                    "author": "KravMagaRengar",
                    "parent_id": "t1_f6rtag5",
                    "subreddit_id": "t5_2r81c",
                    "body": "Yeah, 10g ksm66. Mouse was hella dope. I guess they took 2* theyr weight in muscle mass during the 5 day they was on ashwa due to mTor and testosterone 🙃",
                    "body_html": "<div class=\"md\"><p> Да, 10 г км66. Мышь была хеллой дурочкой. Я предполагаю, что они принимали 2 * их вес в мышечной массе в течение 5 дней, когда они были на ашве из-за mTor и тестостерона. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6tiz3d/",
                    "name": "t1_f6tiz3d",
                    "created": 1573178415,
                    "created_utc": 1573149615,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                },
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "id": "f6tmr9d",
                    "author": "Hieucd97",
                    "parent_id": "t1_f6rtag5",
                    "subreddit_id": "t5_2r81c",
                    "body": "It's quantal dose response. High doses to small numbers of rats reflects low doses to large human population",
                    "body_html": "<div class=\"md\"><p> Это количественный ответ на дозу. Высокие дозы для небольшого количества крыс отражают низкие дозы для большой популяции людей. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6tmr9d/",
                    "name": "t1_f6tmr9d",
                    "created": 1573180070,
                    "created_utc": 1573151270,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pr27f",
            "author": "KravMagaRengar",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "It's only on a 5 days experiment. Would like to know on a 60 day trial like human, and at the end an analysis on the gaba receptors site.\n\nThis study is cool but don't show a IRL approach. Dosage are heavy. It translate to human dose around 10gram ksm66 at day 5 🙃 But sure that's the way to know if a substance cause downregulation, so ina and on that's good.",
            "body_html": "<div class=\"md\"><p> Это только на 5 дней эксперимента. Хотелось бы узнать о 60-дневном испытании, как у человека, и в конце провести анализ на сайте рецепторов ГАБА. </p><p> Это исследование круто, но не показывает подход IRL. Дозировка тяжелая. Это переводит на человеческую дозу около 10 грамм ksm66 в день 5 sure Но, конечно, это способ узнать, вызывает ли вещество понижающую регуляцию, так что это хорошо. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pr27f/",
            "name": "t1_f6pr27f",
            "created": 1573091225,
            "created_utc": 1573062425,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 14,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "id": "f6q7n72",
                    "author": "hypolaristic",
                    "parent_id": "t1_f6pvxot",
                    "subreddit_id": "t5_2r81c",
                    "body": "Th1?",
                    "body_html": "<div class=\"md\"><p> Th1? </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6q7n72/",
                    "name": "t1_f6q7n72",
                    "created": 1573101111,
                    "created_utc": 1573072311,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pnpng",
            "author": "nuwbs",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I just get mindfog using ksm-66. For whatever reason I'm fairly sensitive to it (same with l-theanine). I've tried in the morning and before sleep and I seem to mitigate the effects most when taken before sleep but not entirely. I'd really like to take it because it has so many benefits but even at 50mg my IQ must drop by like 20 because I feel like a complete idiot on it.",
            "body_html": "<div class=\"md\"><p> Я просто получаю mindfog используя ksm-66. По какой-то причине я довольно чувствителен к этому (то же самое с l-теанином). Я пробовал утром и перед сном, и я, кажется, смягчаю эффекты больше всего, когда принимается перед сном, но не полностью. Я бы очень хотел принять его, потому что у него так много преимуществ, но даже при 50 мг мой IQ должен упасть примерно до 20, потому что я чувствую себя полным идиотом. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pnpng/",
            "name": "t1_f6pnpng",
            "created": 1573089174,
            "created_utc": 1573060374,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 13,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_dshpg0",
                    "id": "f6x9by4",
                    "author": "Vivid_Standard",
                    "parent_id": "t1_f6sn0rw",
                    "subreddit_id": "t5_2r81c",
                    "body": "I can totally relate. When I get stressed out I start hearing things, auditory disturbances. Mu-agonists totally shut off any delusions, voices, etc. I use Tianeptine as an anti-psychotic as nicotine and CBD makes me very tired and lazy while a full mu-agonist is energizing and antipsychotic.",
                    "body_html": "<div class=\"md\"><p> Я могу полностью рассказать. Когда я испытываю стресс, я начинаю слышать вещи, слуховые расстройства. Му-агонисты полностью отключают любые заблуждения, голоса и т. Д. Я использую Тианептин в качестве антипсихотического средства в качестве никотина, а КБД делает меня очень уставшим и ленивым, в то время как полный му-агонист заряжает энергией и оказывает антипсихотическое действие. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6x9by4/",
                    "name": "t1_f6x9by4",
                    "created": 1573273776,
                    "created_utc": 1573244976,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pjfl2",
            "author": "Spadeinfull",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Salvia Divinorum has reverse tolerance too.",
            "body_html": "<div class=\"md\"><p> Salvia Divinorum также имеет обратную толерантность. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pjfl2/",
            "name": "t1_f6pjfl2",
            "created": 1573086485,
            "created_utc": 1573057685,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 49,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_dshpg0",
                    "id": "f6qjjwc",
                    "author": "mpbarry46",
                    "parent_id": "t1_f6q3cmk",
                    "subreddit_id": "t5_2r81c",
                    "body": "Yeah it's hard to pinpoint. Could be a bunch of things, increase in T, increased sensitivity of 5-HT2 receptors, interactions with other substances.",
                    "body_html": "<div class=\"md\"><p> Да, это трудно точно определить. Может быть куча вещей, увеличение T, повышение чувствительности 5-HT2 рецепторов, взаимодействия с другими веществами. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qjjwc/",
                    "name": "t1_f6qjjwc",
                    "created": 1573107486,
                    "created_utc": 1573078686,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                },
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "id": "f6q4liz",
                    "author": "Chrisf1998",
                    "parent_id": "t1_f6q3cmk",
                    "subreddit_id": "t5_2r81c",
                    "body": "That’s a very good possibility now that I think about it. I had no libido for at least 2 weeks after I stopped.",
                    "body_html": "<div class=\"md\"><p> Это очень хорошая возможность сейчас, когда я думаю об этом. У меня не было либидо, по крайней мере, 2 недели после того, как я остановился. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6q4liz/",
                    "name": "t1_f6q4liz",
                    "created": 1573099578,
                    "created_utc": 1573070778,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pi62h",
            "author": "Chrisf1998",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Ashwagandha causes me to become very irritated, very easily and then it’s almost impossible to get out of that mindset. I still have yet to try the KSM-66 variety, however.",
            "body_html": "<div class=\"md\"><p> Ашвагандха вызывает у меня сильное раздражение, очень легко, и тогда почти невозможно выйти из этого мышления. Тем не менее, мне еще предстоит попробовать сорт KSM-66. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pi62h/",
            "name": "t1_f6pi62h",
            "created": 1573085686,
            "created_utc": 1573056886,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 24,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_dshpg0",
                    "id": "f6qsqwb",
                    "author": "rmcfar11",
                    "parent_id": "t1_f6pokjq",
                    "subreddit_id": "t5_2r81c",
                    "body": "Reverse tolerance generally means that there's in increase in receptor sensitivity to a ligand (stuff that binds to receptors). This occurs, most commonly, by upregulation of the receptors which results in increased density of the receptors. Hope that helps/makes sense!",
                    "body_html": "<div class=\"md\"><p> Обратная толерантность обычно означает увеличение чувствительности рецепторов к лиганду (материал, который связывается с рецепторами). Это происходит, чаще всего, из-за активизации рецепторов, что приводит к увеличению плотности рецепторов. Надеюсь, что это помогает / имеет смысл! </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qsqwb/",
                    "name": "t1_f6qsqwb",
                    "created": 1573113765,
                    "created_utc": 1573084965,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6plyry",
            "author": "RenewablesAeroponics",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Does reverse tolerance mean=it gets stronger the longer you take it?",
            "body_html": "<div class=\"md\"><p> Означает ли обратная толерантность = она становится сильнее, чем дольше вы ее принимаете? </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6plyry/",
            "name": "t1_f6plyry",
            "created": 1573088073,
            "created_utc": 1573059273,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 19,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "replies": [
                        {
                            "ups": 1,
                            "link_id": "t3_dshpg0",
                            "replies": [
                                {
                                    "ups": 0,
                                    "link_id": "t3_dshpg0",
                                    "replies": [
                                        {
                                            "ups": 0,
                                            "link_id": "t3_dshpg0",
                                            "id": "f705e02",
                                            "author": "SexySodomizer",
                                            "parent_id": "t1_f6wtt9r",
                                            "subreddit_id": "t5_2r81c",
                                            "body": "Your retreat to ad hominems makes you come across as a defensive plebeian who's been backed into a corner. The saddest part is that even your insults lack any congruence with intellect. Allow me to be a role model for you in this.\n\nI'm basing my judgments of your knowledge, or lack thereof, off your own statements in this very thread. If I'm wrong, then by all means link me to your published studies and show what a fool I am. Alas, the thought of someone being published who doesn't even understand basic principles of science is laughable, if not just plain sad. The study was on one active compound, yet your understanding is so limited by lack of intellectual rigor that you conclude all compounds from the same plant will act the same. Let me lay it out for you with a bit of formal logic: \"A\" belongs to group {A,C,D}. A is shown to lead to B. That does not mean C and D lead to B. That would be like saying A black person committed a crime, thus ALL black people are dangerous. \n\nTo even begin with the HED complaint is like suggesting you wear sunscreen on the surface of the sun! .02% of a dose adjusted becomes .125%! It's imbecilic to argue over such minutiae like it's imbecilic to wear a cotton shirt to defend youself from a bullet! Though I suggest you try it and rid us of your uselessness. \n\nTo say you have no cognitive biases is a perfect example of having a cognitive bias! You believe you have a perfect understanding of extremely complex biochemistry when not even the top pharmaceutical scientists studying ashwagandha would blabber such nonsense. At this point, I feel I'm being generous by even considering you literate enough to understand these words! Behold, a redditor who thinks they're smarter than a leading scientist. What a feat of cognitive dissonance!  Were you at all pleasant to engage in discourse, I'd ask my friends in the psychology department to make a case study of you! Alas, your worth in this world will not reach such heights as you continue to subject yourself to uttering unintelligible diatribes.",
                                            "body_html": "<div class=\"md\"><p> Ваше отступление к ad hominems заставляет вас казаться защитником-плебеем, которого загнали в угол. Самое печальное, что даже вашим оскорблениям не хватает согласованности с интеллектом. Позвольте мне быть примером для вас в этом. </p><p> Я основываю свои суждения о ваших знаниях или их отсутствии на ваших собственных заявлениях в этой самой ветке. Если я ошибаюсь, то обязательно свяжите меня с вашими опубликованными исследованиями и покажите, какой я дурак. Увы, мысль о том, что кто-то публикуется и даже не понимает основных принципов науки, смешна, если не просто печальна. Исследование было посвящено одному активному соединению, но ваше понимание настолько ограничено отсутствием интеллектуальной строгости, что вы пришли к выводу, что все соединения одного растения будут действовать одинаково. Позвольте мне изложить это с небольшой формальной логикой: «А» принадлежит группе {A, C, D}. Показано, что A ведет к B. Это не означает, что C и D ведут к B. Это все равно, что сказать, что черный человек совершил преступление, поэтому ВСЕ черные люди опасны. </p><p> Начать даже с жалобы HED - все равно что предложить вам носить солнцезащитный крем на поверхности солнца! 0,02% откорректированной дозы становится 0,125%! Бессмысленно спорить по поводу таких мелочей, как будто безнравственно носить хлопчатобумажную рубашку, чтобы защитить себя от пули! Хотя я предлагаю вам попробовать и избавить нас от вашей бесполезности. </p><p> Сказать, что у вас нет когнитивных предубеждений, является прекрасным примером наличия когнитивных предубеждений! Вы верите, что у вас есть прекрасное понимание чрезвычайно сложной биохимии, когда даже ведущие ученые-фармацевты, изучающие ашвагандху, не будут болтать о такой ерунде. В этот момент я чувствую себя щедрым, даже если учесть, что вы достаточно грамотны, чтобы понимать эти слова! Вот реддитор, который думает, что он умнее, чем ведущий ученый. Какой подвиг когнитивного диссонанса! Если бы вам было приятно участвовать в беседе, я бы попросил моих друзей из отдела психологии рассказать о вас! Увы, ваша ценность в этом мире не достигнет таких высот, когда вы продолжаете подвергать себя непонятным диатрибам. </p></div>",
                                            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f705e02/",
                                            "name": "t1_f705e02",
                                            "created": 1573353345,
                                            "created_utc": 1573324545,
                                            "subreddit_name_prefixed": "r/Nootropics",
                                            "depth": 8
                                        }
                                    ],
                                    "id": "f6wp8fo",
                                    "author": "SexySodomizer",
                                    "parent_id": "t1_f6vt76w",
                                    "subreddit_id": "t5_2r81c",
                                    "body": "That's a gross misunderstanding of pharmacodynamics. Drug effects aren't inherently additive. If you were to administer 1000 1/1000th doses of different drugs, that would *not* equal 1 dose of, say, DMT. Chemically similar drugs can have drastically different pharmacokinetics. LSD is a potent hallucinogen, yet iso-LSD isn't even psychoactive.\n\nAs an aside, if you ever hear yourself say, \"I understand it perfectly well.\" you should see that as a huge red flag. I understand these topics to a much higher degree than you, yet I would say I hardly understand them at all. I'm a mathematician, not a pharmaceutical scientist. Read up on the [illusion of explanatory depth](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3062901/), and the [Dunning-Kruger effect](https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect).",
                                    "body_html": "<div class=\"md\"><p> Это грубое недопонимание фармакодинамики. Лекарственные эффекты не являются аддитивными. Если бы вы вводили 1000 1/1000-ю дозы различных лекарств, это <em>не</em> равнялось бы 1 дозе, скажем, DMT. Химически похожие препараты могут иметь кардинально различную фармакокинетику. ЛСД является сильным галлюциногеном, но изо-ЛСД даже не психоактивен. </p><p> Кроме того, если вы когда-нибудь услышите, как вы говорите: «Я прекрасно это понимаю». Вы должны увидеть это как огромный красный флаг. Я понимаю эти темы в гораздо большей степени, чем вы, но я бы сказал, что совсем их не понимаю. Я математик, а не ученый-фармацевт. Читайте об <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3062901/\">иллюзии глубины объяснения</a> и об <a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\">эффекте Даннинга-Крюгера</a> . </p></div>",
                                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6wp8fo/",
                                    "name": "t1_f6wp8fo",
                                    "created": 1573260551,
                                    "created_utc": 1573231751,
                                    "subreddit_name_prefixed": "r/Nootropics",
                                    "depth": 6
                                }
                            ],
                            "id": "f6uhf6h",
                            "author": "SexySodomizer",
                            "parent_id": "t1_f6rlht4",
                            "subreddit_id": "t5_2r81c",
                            "body": "You're still not providing your arithmetic. That combined with your apparent misunderstanding of the differences between Withaferin A and withanolides leads me to believe you have no expertise on the subject whatsoever. If you're going to claim my arithmetic is faulty, the burden of proof is on you to prove it.\n\nEven if adjusted for a 2:37 rat dose:human dose equivalency value, that would only bring the relative value up to .37%. That's still less than half of a percent of the doses used in the study.\n\nRedditors... SMH",
                            "body_html": "<div class=\"md\"><p> Вы все еще не предоставляете свою арифметику. Это в сочетании с вашим очевидным неправильным пониманием различий между Витаферином А и вананолидами заставляет меня думать, что у вас нет опыта в этом вопросе. Если вы собираетесь утверждать, что моя арифметика ошибочна, бремя доказывания лежит на вас, чтобы доказать это. </p><p> Даже если скорректировать на дозу крысы 2:37: значение эквивалентности дозы для человека, это приведет только к относительному значению до 0,37%. Это по-прежнему менее половины процента доз, использованных в исследовании. </p><p> Реддиторы ... SMH </p></div>",
                            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6uhf6h/",
                            "name": "t1_f6uhf6h",
                            "created": 1573191752,
                            "created_utc": 1573162952,
                            "subreddit_name_prefixed": "r/Nootropics",
                            "depth": 4
                        }
                    ],
                    "id": "f6r4v0s",
                    "author": "SexySodomizer",
                    "parent_id": "t1_f6psitk",
                    "subreddit_id": "t5_2r81c",
                    "body": "Not sure how you did your math, but if you're going to claim mine is wrong, please provide your calculations. Mine is as follows:\n\n(40mg/kg)(1kg/2.2lb)(170lbs)(1g/1000mg) = 3.09g\n\nAlso, we're not talking about withanolides here. The study was on Withaferin A which is unique in the withanolide group. If you believe Withaferin A to be least wanted, then why are you commenting on a study on its effects?",
                    "body_html": "<div class=\"md\"><p> Не уверен, как вы сделали свою математику, но если вы собираетесь утверждать, что моя неправильная, пожалуйста, предоставьте свои расчеты. Шахта выглядит следующим образом: </p><p> (40 мг / кг) (1 кг / 2,2 фунта) (170 фунтов) (1 г / 1000 мг) = 3,09 г </p><p> Кроме того, мы не говорим здесь об ананолидах. Исследование проводилось на Withaferin A, который является уникальным в группе, в которой использовался спирт. Если вы считаете, что Withaferin A наименее востребован, то почему вы комментируете исследование его воздействия? </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6r4v0s/",
                    "name": "t1_f6r4v0s",
                    "created": 1573122548,
                    "created_utc": 1573093748,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pl3gt",
            "author": "SexySodomizer",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Here's my quick analysis of the study: \n\nIt's a rat study, so don't be too quick in thinking its findings will apply well to humans. They made an extract with a quantifiable amount of Withaferin A. They then gave between 10 and 40mg/kg of Withaferin A to the rats, which would be equivalent to about 3 grams of Withaferin A for a human. KSM-66, touted as one of the best commercial extracts, has \"less than\" 0.6 **mg** Withaferin A per dose (that's 0.0006 g, or 0.02%, two hundredths of one percent of the doses in the study).\n\ntl;tl;dr: **The doses of KSM-66 we use are equivalent to two hundredths of one percent of the doses used in this study.**\n\nedit: I'm going to respond here to the attempts below to discredit this post:\n\nOne user attempts to discredit this post by inventing a false claim that Ixoreal, the manufacturer of KSM-66 \"deliberately extract almost all of the Withaferin A on purpose\". This is patently false. Ixoreal makes no such claim. Read [here](https://ksm66ashwagandhaa.com/ashwagandha/how-to-pick-your-ashwagandha-supplier/) for their actual statement, which, by the way, they don't support with any evidence, so take even that with a grain of salt.\n\nAnother argument made is that I failed to adjust for the rat:human dose equivalency. Adjusting for the [HED of a rat dose](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4804402/) brings the value up to .125%. That's one tenth of one percent of the doses used in this study. This is inconsequential .\n\nAnother argument relies on the false premise that withanolides and Withaferin A are the same thing. They are not. Not by a long shot. There are many chemical differences. For one, [unlike other withanolides, Withaferin A is highly reactive](https://www.sciencedirect.com/science/article/abs/pii/S0006295212005837) because of the ketone-containing unsaturated A ring, the epoxide in the B ring, and the unsaturated lactone ring.",
            "body_html": "<div class=\"md\"><p> Вот мой быстрый анализ исследования: </p><p> Это исследование на крысах, поэтому не спешите думать, что его результаты хорошо подойдут людям. Они сделали экстракт с количественно определяемым количеством Withaferin A. Затем они дали крысам от 10 до 40 мг / кг Withaferin A, что было бы эквивалентно примерно 3 г Withaferin A для человека. KSM-66, рекламируемый как один из лучших коммерческих экстрактов, содержит «менее» 0,6 <strong>мг</strong> витамина А на дозу (это 0,0006 г, или 0,02%, две сотых от одного процента доз в исследовании). </p><p> tl; tl; dr: <strong>дозы KSM-66, которые мы используем, эквивалентны двум сотым одного процента доз, использованных в этом исследовании.</strong> </p><p> редактировать: я собираюсь ответить здесь на попытки ниже дискредитировать этот пост: </p><p> Один из пользователей пытается дискредитировать этот пост, выдумав ложное утверждение о том, что Ixoreal, производитель KSM-66, «намеренно извлекает практически весь Withaferin A специально». Это явно ложно. Ixoreal не делает таких претензий. Прочитайте <a href=\"https://ksm66ashwagandhaa.com/ashwagandha/how-to-pick-your-ashwagandha-supplier/\">здесь</a> их фактическое утверждение, которое, кстати, они не подтверждают никакими доказательствами, так что возьмите даже это с крошкой соли. </p><p> Другой аргумент состоит в том, что я не смог приспособиться к крысе: эквивалентность дозы для человека. Корректировка на <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4804402/\">HED дозы для крыс</a> приводит к значению до .125%. Это одна десятая одного процента доз, использованных в этом исследовании. Это несущественно. </p><p> Другой аргумент опирается на ложную предпосылку, что withanolanol и Withaferin A - это одно и то же. Они не. Отнюдь не. Есть много химических различий. С одной стороны, в <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0006295212005837\">отличие от других спиртов, Витаферин А обладает высокой реакционной способностью</a> благодаря <a href=\"https://www.sciencedirect.com/science/article/abs/pii/S0006295212005837\">кетонсодержащему</a> ненасыщенному кольцу А, эпоксиду в кольце В и ненасыщенному лактоновому кольцу. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pl3gt/",
            "name": "t1_f6pl3gt",
            "created": 1573087527,
            "created_utc": 1573058727,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_dshpg0",
            "id": "f6pp05v",
            "author": "sonambule",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I have a bottle sitting here but haven’t tried it because I was reading it can cause thyroid issues. Anybody have any input on this?",
            "body_html": "<div class=\"md\"><p> У меня есть бутылка, но я ее не пробовал, потому что читал, что это может вызвать проблемы со щитовидной железой. Кто-нибудь есть какие-либо мнения по этому поводу? </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pp05v/",
            "name": "t1_f6pp05v",
            "created": 1573089973,
            "created_utc": 1573061173,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_dshpg0",
            "id": "f6q76ql",
            "author": "hypolaristic",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I don't like it. Makes me tired and gives me low mood. Will that maybe pass over time or is there an explanation for this paradoxic effect? Is there anything to add to make it work. It's such a promising adaptogen but someone has to know why some people react this way.",
            "body_html": "<div class=\"md\"><p> Мне это не нравится Усталость и плохое настроение. Может ли это пройти со временем или есть объяснение этому парадоксальному эффекту? Есть ли что-нибудь, чтобы добавить, чтобы это работало. Это такой многообещающий адаптоген, но кто-то должен знать, почему некоторые люди реагируют таким образом. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6q76ql/",
            "name": "t1_f6q76ql",
            "created": 1573100882,
            "created_utc": 1573072082,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_dshpg0",
            "id": "f6sp6db",
            "author": "randomradman",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "My experience after 2 months of Sensoril was it made my anxiety significantly worse.  KSM-66 had similar effects.  I had high hopes and they did not work. The only thing that has helped my anxiety is consistent daily meditation.",
            "body_html": "<div class=\"md\"><p> Мой опыт после 2 месяцев использования Сенсорила значительно ухудшил мое беспокойство. KSM-66 имел аналогичные эффекты. У меня были большие надежды, и они не сработали. Единственное, что помогло моему беспокойству, - это постоянная ежедневная медитация. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6sp6db/",
            "name": "t1_f6sp6db",
            "created": 1573166571,
            "created_utc": 1573137771,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_dshpg0",
            "id": "f6pkmkx",
            "author": "ConceptoftheLiving",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "This does explain why you need to use it consistently for better effect",
            "body_html": "<div class=\"md\"><p> Это объясняет, почему вы должны использовать его последовательно для лучшего эффекта </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pkmkx/",
            "name": "t1_f6pkmkx",
            "created": 1573087232,
            "created_utc": 1573058432,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_dshpg0",
            "id": "f6py863",
            "author": "kekistankratom",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I find the raw root powder works better than the extract",
            "body_html": "<div class=\"md\"><p> Я считаю, что сырой порошок корня работает лучше, чем экстракт </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6py863/",
            "name": "t1_f6py863",
            "created": 1573095677,
            "created_utc": 1573066877,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6pi4fp",
            "author": "kmack1986",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Does this include KSM-66 Ashwaganda as well?",
            "body_html": "<div class=\"md\"><p> Включает ли это также KSM-66 Ashwaganda? </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pi4fp/",
            "name": "t1_f6pi4fp",
            "created": 1573085658,
            "created_utc": 1573056858,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6ptizt",
            "author": "thesituation531",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "It used to work decently well for my stress and anxiety. But eventually i developed an allergy to it and it was giving me these weird rashes on my back and forearms.\n\nI've read before that it's possible to develop allergies to nightshades. Kind of weird cause i haven't developed allergies to other consumable nightshades, but oh well.",
            "body_html": "<div class=\"md\"><p> Раньше он работал прилично хорошо для моего стресса и тревоги. Но в конце концов у меня появилась аллергия на него, и у меня появились странные высыпания на спине и предплечьях. </p><p> Я читал ранее, что возможно развитие аллергии на паслен. Что-то странное, потому что у меня не было аллергии на другие расходуемые солнцезащитные очки, ну да ладно. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6ptizt/",
            "name": "t1_f6ptizt",
            "created": 1573092743,
            "created_utc": 1573063943,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6pzgd7",
            "author": "Neuro-Herbal",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Very interesting post, thanks for the contribution.",
            "body_html": "<div class=\"md\"><p> Очень интересный пост, спасибо за вклад. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pzgd7/",
            "name": "t1_f6pzgd7",
            "created": 1573096465,
            "created_utc": 1573067665,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6qmb72",
            "author": "nshave20",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Ashwagandha made me extremely drowsy and unproductive. I only took it for 2 days but the effect was very pronounced...perhaps taking less would be ideal, although I only took an 800 mg pill. The anti-anxiety benefit is legit, but I'd rather have more energy to be honest lol. Maybe I'll do it again on a rainy day or something.",
            "body_html": "<div class=\"md\"><p> Ашваганда сделал меня очень сонным и непродуктивным. Я принимал его только в течение 2 дней, но эффект был очень выраженным ... возможно, было бы лучше принимать меньше, хотя я принимал только таблетку 800 мг. Пособие по борьбе с тревогой является законным, но я бы предпочел больше энергии, если честно. Возможно я сделаю это снова в дождливый день или кое-что. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qmb72/",
            "name": "t1_f6qmb72",
            "created": 1573109289,
            "created_utc": 1573080489,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6qufgl",
            "author": "EvelynnSpoiler",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "As much as I love Ashwagandha I could never take it daily",
            "body_html": "<div class=\"md\"><p> Как бы я ни любил Ашвагандху, я никогда не мог принимать это ежедневно </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qufgl/",
            "name": "t1_f6qufgl",
            "created": 1573114993,
            "created_utc": 1573086193,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "id": "f6uxcvi",
                    "author": "R452991",
                    "parent_id": "t1_f6u3ups",
                    "subreddit_id": "t5_2r81c",
                    "body": "Same, nothing bad, just wore off like ashwaghanda",
                    "body_html": "<div class=\"md\"><p> То же самое, ничего плохого, просто стирается как ашвагханда </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6uxcvi/",
                    "name": "t1_f6uxcvi",
                    "created": 1573199836,
                    "created_utc": 1573171036,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6qwuzz",
            "author": "R452991",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Not for me, that and l theanine lost effect so soon.",
            "body_html": "<div class=\"md\"><p> Не для меня, и теанин потерял эффект так скоро. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qwuzz/",
            "name": "t1_f6qwuzz",
            "created": 1573116794,
            "created_utc": 1573087994,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6s3i95",
            "author": "MyMonte87",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I've tried Ashwagandha a few times and it just makes me uncomfortable, irritable not a pleasant experience. I keep ready how amazing it is and feel like i'm not getting it :/",
            "body_html": "<div class=\"md\"><p> Я пробовал Ашвагандху несколько раз, и это просто делает меня некомфортным, раздражительным, а не приятным опытом. Я готовлюсь, как это удивительно, и чувствую, что я не понимаю: / </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6s3i95/",
            "name": "t1_f6s3i95",
            "created": 1573154939,
            "created_utc": 1573126139,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_dshpg0",
            "id": "f6sg2m1",
            "author": "Create_devour_own",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "I just wish ashwagandha didn't make me so itchy",
            "body_html": "<div class=\"md\"><p> Я просто хочу, чтобы Ашваганда не заставил меня так зудеть </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6sg2m1/",
            "name": "t1_f6sg2m1",
            "created": 1573162245,
            "created_utc": 1573133445,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": 0,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_dshpg0",
                    "id": "f6qj1t7",
                    "author": "SirReal14",
                    "parent_id": "t1_f6qebb9",
                    "subreddit_id": "t5_2r81c",
                    "body": "Reverse tolerance to anti-anxiety effects: \n\nhttps://www.ncbi.nlm.nih.gov/pubmed/2572494\n\n\nUPregulation of GABA receptors:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/16107249\n\n\nAlso, etizolam is subjectively very very different from diazepam. Diazepam is a super long acting \"fuzzy\" feeling benzo, and etizolam is a super fast acting benzo with a very clear and energetic headspace. You may want get your etizolam tested.",
                    "body_html": "<div class=\"md\"><p> Обратная толерантность к анти-тревожным эффектам: </p><p> <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/2572494\">https://www.ncbi.nlm.nih.gov/pubmed/2572494</a> </p><p> Регуляция ГАМК-рецепторов: </p><p> <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/16107249\">https://www.ncbi.nlm.nih.gov/pubmed/16107249</a> </p><p> Кроме того, этизолам субъективно очень сильно отличается от диазепама. Диазепам - это супер долго действующий «нечеткий» бензо, а этизолам - супер быстродействующий бензо с очень чистым и энергичным свободным пространством. Вы можете проверить свой этизолам. </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qj1t7/",
                    "name": "t1_f6qj1t7",
                    "created": 1573107167,
                    "created_utc": 1573078367,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6q1489",
            "author": "zbanger",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Etizolam (Benzo) supposedly also exhibits reverse tolerance",
            "body_html": "<div class=\"md\"><p> Этизолам (бензо) предположительно также проявляет обратную толерантность </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6q1489/",
            "name": "t1_f6q1489",
            "created": 1573097548,
            "created_utc": 1573068748,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": -1,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": -2,
                    "link_id": "t3_dshpg0",
                    "replies": [
                        {
                            "ups": -2,
                            "link_id": "t3_dshpg0",
                            "replies": [
                                {
                                    "ups": -1,
                                    "link_id": "t3_dshpg0",
                                    "replies": [
                                        {
                                            "ups": -1,
                                            "link_id": "t3_dshpg0",
                                            "id": "f6vrslq",
                                            "author": "oklujay",
                                            "parent_id": "t1_f6vk6m9",
                                            "subreddit_id": "t5_2r81c",
                                            "body": "You are embarasing yourself, tons of first-hand experiences that people are sharing online be it drugs, noots, supps and their side effects are worth more than any scientific study, and you are better off trusting them, period.\n\nPeople discarding all that are just harming themselves.",
                                            "body_html": "<div class=\"md\"><p> Вы смущаете себя, тонны личного опыта, которым люди делятся в Интернете, будь то наркотики, наркотики, добавки и их побочные эффекты, стоят больше, чем любое научное исследование, и вам лучше доверять им, точка. </p><p> Люди, от которых отказываются, просто вредят себе. </p></div>",
                                            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6vrslq/",
                                            "name": "t1_f6vrslq",
                                            "created": 1573226247,
                                            "created_utc": 1573197447,
                                            "subreddit_name_prefixed": "r/Nootropics",
                                            "depth": 8
                                        }
                                    ],
                                    "id": "f6ursp5",
                                    "author": "oklujay",
                                    "parent_id": "t1_f6tbpwk",
                                    "subreddit_id": "t5_2r81c",
                                    "body": "Good luck trusting a \"scientific\" trial on rats instead of first hand experiences of actual users.",
                                    "body_html": "<div class=\"md\"><p> Удачи в доверии «научному» испытанию на крысах, а не на собственном опыте реальных пользователей. </p></div>",
                                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6ursp5/",
                                    "name": "t1_f6ursp5",
                                    "created": 1573196085,
                                    "created_utc": 1573167285,
                                    "subreddit_name_prefixed": "r/Nootropics",
                                    "depth": 6
                                }
                            ],
                            "id": "f6rpilv",
                            "author": "oklujay",
                            "parent_id": "t1_f6rfvy7",
                            "subreddit_id": "t5_2r81c",
                            "body": "People reporting the effects of ashwagandha on themselves are just idiots? Congratulations to you, personal experiences are much closer to the truth than some tests on lab rats or some old study paper, but this idiotic attitude is prevelant here 'give me links to studies on rats because I only believe science! I don't care what actual users report time after time'\n\nThe whole culture of noots and biohacking began with people sharing their first hand experiences with stacks and supps.\n\nI will take firsthand experience every day before trusting some bs study paper. But you do you.",
                            "body_html": "<div class=\"md\"><p> Люди, сообщающие о влиянии ашваганды на себя, просто идиоты? Поздравляю вас, личный опыт намного ближе к истине, чем некоторые тесты на лабораторных крысах или какая-то старая учебная статья, но здесь преобладает этот идиотский подход: «дайте мне ссылки на исследования на крысах, потому что я верю только в науку! Мне все равно, что реальные пользователи сообщают раз за разом </p><p> Вся культура noots и biohacking началась с людей, делящихся их непосредственным опытом со стеками и глотками. </p><p> Я буду брать личный опыт каждый день, прежде чем доверять какой-нибудь учебной работе. Но ты делаешь. </p></div>",
                            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6rpilv/",
                            "name": "t1_f6rpilv",
                            "created": 1573143039,
                            "created_utc": 1573114239,
                            "subreddit_name_prefixed": "r/Nootropics",
                            "depth": 4
                        }
                    ],
                    "id": "f6qqole",
                    "author": "oklujay",
                    "parent_id": "t1_f6qprsm",
                    "subreddit_id": "t5_2r81c",
                    "body": "I've seen it reported here a few times, it supposedly increases testosterone and can lead to earlier onset of male pattern baldness, others said is messes up with thyroid.\n\nhttps://www.reddit.com/r/Nootropics/comments/7mlvli/ashwagandha_ksm66_is_causing_my_hair_to_fall_out\n\nhttp://www.longecity.org/forum/topic/56290-hair-loss-ashwagandha-bacopa-monnieri-rhodiola/",
                    "body_html": "<div class=\"md\"><p> Я видел, как сообщалось здесь несколько раз, он предположительно повышает уровень тестостерона и может привести к более раннему появлению облысения у мужчин, другие утверждают, что это портит щитовидную железу. </p><p> <a href=\"https://www.reddit.com/r/Nootropics/comments/7mlvli/ashwagandha_ksm66_is_causing_my_hair_to_fall_out\">https://www.reddit.com/r/Nootropics/comments/7mlvli/ashwagandha_ksm66_is_causing_my_hair_to_fall_out</a> </p><p> <a href=\"http://www.longecity.org/forum/topic/56290-hair-loss-ashwagandha-bacopa-monnieri-rhodiola/\">http://www.longecity.org/forum/topic/56290-hair-loss-ashwagandha-bacopa-monnieri-rhodiola/</a> </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qqole/",
                    "name": "t1_f6qqole",
                    "created": 1573112293,
                    "created_utc": 1573083493,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6qof4p",
            "author": "oklujay",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "And prolonged use leads to hair loss, so not sure what would I choose, probably benzo and have it at least work, not placebo and hair loss.",
            "body_html": "<div class=\"md\"><p> А длительное использование приводит к выпадению волос, поэтому не уверен, что бы я выбрал, вероятно, бензо, и он хотя бы сработал, а не плацебо и выпадение волос. </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6qof4p/",
            "name": "t1_f6qof4p",
            "created": 1573110717,
            "created_utc": 1573081917,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        },
        {
            "ups": -9,
            "link_id": "t3_dshpg0",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_dshpg0",
                    "id": "f6xbt4h",
                    "author": "jimmyjamespresents",
                    "parent_id": "t1_f6qmt27",
                    "subreddit_id": "t5_2r81c",
                    "body": "no because I discontinued for a couple weeks and started taking again. Problems came back. I did 3 small runs with this with the same result. Google Ashwaganda issues and you'll find similar problems",
                    "body_html": "<div class=\"md\"><p> нет, потому что я прекратил на пару недель и начал принимать снова. Проблемы вернулись. Я сделал 3 небольших пробега с этим же результатом. Проблемы с Google Ashwaganda, и вы найдете похожие проблемы </p></div>",
                    "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6xbt4h/",
                    "name": "t1_f6xbt4h",
                    "created": 1573275227,
                    "created_utc": 1573246427,
                    "subreddit_name_prefixed": "r/Nootropics",
                    "depth": 2
                }
            ],
            "id": "f6pwz1l",
            "author": "jimmyjamespresents",
            "parent_id": "t3_dshpg0",
            "subreddit_id": "t5_2r81c",
            "body": "Ashwagandha fucked me up. Gave me fierce anxiety, suicidal thoughts and mild hallucinations. I had brain forza ksm 66. This stuff shouldn't be allowed to be sold IMO",
            "body_html": "<div class=\"md\"><p> Ашваганда облажался со мной. Дали мне яростную тревогу, мысли о самоубийстве и легкие галлюцинации. У меня был мозг forza ksm 66. Этот материал нельзя продавать IMO </p></div>",
            "permalink": "/r/Nootropics/comments/dshpg0/ashwagandha_has_reverse_tolerance_unlike/f6pwz1l/",
            "name": "t1_f6pwz1l",
            "created": 1573094899,
            "created_utc": 1573066099,
            "subreddit_name_prefixed": "r/Nootropics",
            "depth": 0
        }
    ]
}