{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Перекрестная ссылка [u / nanoissuperior] (https://www.reddit.com/user/nanoissuperior) Он написал сегодня ранее: [https://www.reddit.com/r/CryptoCurrency/comments/a3n6uw/in\\_january\\_i \\ _was \\ _а \\ _millionaire \\ _thanks \\ _to \\ _nano \\ _now /] (https://www.reddit.com/r/CryptoCurrency/comments/a3n6uw/in_january_i_was_a_millionaire_thanks_to_nano_now/)\n\nНазвание: ** В январе я был миллионером благодаря Nano, теперь у меня 25 000 долларов США AMA **\n\n& # X200B;\n\nЯ отвечал на его сообщение, но мой ответ оказался слишком большим как ответ и уклонился от темы, хотя и был интересным. Поэтому я решил сделать это своим собственным постом, потому что могут быть хорошие уроки, которые можно извлечь, и надеемся, что некоторые из них будут предлагать хорошую информацию для обмена.\n\nЯ надеюсь, что это может помочь любому на этом сабе избежать дорогостоящих ошибок, которые я сделал. Вот оно: FLAIR: LEGAL (нет в списке)\n\n\\ ----\n\n[u / nanoissuperior] (https://www.reddit.com/user/nanoissuperior) ты тот, кем я себя считаю? Я не буду выдавать дальнейшие идентифицирующие подсказки, но я случайно знаю кого-то в той же позиции, который мог бы написать точно такой же заголовок. Если вы прочтете первый абзац, вы узнаете, знаете ли вы меня.\n\nЧеловек, которого я знаю, купил Nano очень рано, основываясь на чаевых от друга. Я вошел намного позже. К тому времени, когда он сказал мне, что он уже достиг максимума в 5 долларов, когда я закончил покупать. Затем я продал за 20 долларов, так что это была хорошая покупка. Мы были бывшими коллегами в крупной, крупной компании-разработчике программного обеспечения где-то в PNW. Я оставил компанию, чтобы сам рискнуть и попытаться запустить некоторые проекты, которые я имел в виду, и переехать за границу на несколько лет. Мы потеряли связь друг с другом во время моего отсутствия, но мы снова соединились во время роста рынка и начали ежедневно обмениваться информацией о монетах во время большого бычьего пробега в конце 2017 года. Это было сумасшедшее время ... рыночная тенденция была несколько градусов ниже вертикали почти для всех монет!\n\n& # X200B;\n\nЭй, угадай что? Теперь, когда я думаю об этом, я мог бы написать тот же самый заголовок сам! В январе 2018 года я тоже был миллионером! Не с Nano, но благодаря покупке хорошего кусочка биткойна в 2011 году по 1,20 доллара за штуку. В итоге я стал миллионером с тем, что оставил в биткойнах в январе 2018 года.\n\nИ, как и вы, сегодня, из всего этого богатства, у меня осталось около 30 000 долларов, и мало что для этого нужно. Можем ли мы назвать это даже? Хотя моя катастрофа не была вызвана исключительно рыночными колебаниями; Моя история - более сложная история, и я собираюсь упомянуть ее, потому что, надеюсь, она могла бы послужить уроком для любого владельца криптографии, поэтому они не делают ошибку, которую я сделал: никому не доверяй , Всегда будьте скептичны и следите за своими интересами. Во всяком случае, здесь это идет:\n\nПосле 5 лет за границей у меня было достаточно и я хотел вернуться в Штаты. Моя жена заявила о своем предпочтении остаться за границей, но в конце концов она уступила, хотя и неохотно. Мы выбрали небольшой город в Колорадо, чтобы поселиться, и приземлились в ноябре 2017 года. У нас были планы поселиться и рассматривали возможность покупки дома с моим / нашим новым состоянием, основываясь на рыночной цене в этот период. В то же время я также сомневался в неотъемлемых налоговых платежах, вызванных такой крупной ликвидацией. Я пытался платить налоги как можно дальше. Итак, я решил подождать до Нового года и начал ликвидировать мой криптограф 1 января 2018 года, сразу после полуночи. Таким образом, у меня будет 16 месяцев (до апреля 2019 года), чтобы платить любые налоги на прирост капитала, и я был уверен, что в то время рынок даст мне это бесплатно, особенно в том темпе, в котором он шел. Я был одним из первых пользователей, и с тех пор я получал высокие уровни проверки и торговых лимитов в неделю со многими биржами, но для такой большой суммы мне понадобилось несколько отдельных транзакций в течение нескольких недель, особенно желая сделайте это с базой в США, которая была связана с банковскими счетами в США, чтобы избежать зарубежных банковских переводов, что означает увеличение сборов. (Да, я рассмотрел все внебиржевые варианты, но по причинам, не относящимся к истории, я не смог этого сделать, поэтому мне пришлось использовать традиционные каналы обмена для ликвидации активов).\n\nУ нас с женой изначально были некоторые принципиальные разногласия относительно общей суммы, которую нужно потратить, и типа имущества, которое мы должны приобретать. Я хотел маленькое место с более плотным, молодым сообществом, где будут дети нашего возраста, чтобы он играл. Она настаивала на том, что мы должны стать большими; мы путешествовали так много лет, и мы не могли назвать ни одну из наших прошлых резиденций нашим домом. Пришло время селиться и гнездиться; Она убедила меня, что мы должны владеть собственностью, которой мы гордимся, живя годами. Тот, который мы могли бы иметь прямо и не легко перерасти. В итоге мы разорили и приобрели для себя два роскошных автомобиля за наличные и нацелились на большой дом мечты в загородном гольф-клубе города, бесплатный и чистый для нас и наших двоих детей. Я даже не играю в гольф, и при этом я даже не люблю это, но, если это делает ее счастливой, и это находится в пределах безопасности, я решил, почему бы и нет? Мои опасения были в основном финансовыми, и цифры складывались. Это было немного жестко по отношению к моей личной безопасной марже, но, в то же время, я представлял себе, что никогда больше не придется делать или даже думать о выплате ипотеки автомобиля или дома! Биткойн находится в рулоне, и нет никаких признаков его остановки. Хорошо. Давайте сделаем это, прежде чем я передумаю.\n\nТеперь я признаю, что мне очень повезло с выбором времени, когда нужно продавать активы. Я понятия не имел, что рынок в феврале совершит погружение, и поэтому многим казалось, что я отлично рассчитал рынок, продавая большинство своих монет в первые две недели января 2018 года. Многие называли меня гением для продажи в самый верх, как будто у меня была какая-то мудрость, чтобы знать, когда она упадет; правда намного менее лестна; это была просто глупая удача, потому что я хотел заплатить налоги в 2018 году и отложить до 2019 года. Отлично, молодец! Да? ну, помедленнее, сынок, не так быстро.\n\nИтак, я собираю 7-значную единовременную сумму в январе 2018 года, и мы выписываем чек на полную сумму при закрытии в феврале на имущество ее мечты. Свойство, которое может быть легко продемонстрировано на обложке роскошного журнала недвижимости. Кроме того, помните, что мы только что вернулись в Соединенные Штаты с несколькими чемоданами из-за рубежа. У нас не было мебели, кухонных принадлежностей, штор, телевизоров, постельного белья, зимней одежды и многих других важных вещей, которые обычно покупаются через какое-то время, но которые нам теперь приходилось покупать сразу. Не проблема, Биткойн немного упал, но все же значительно выше 15 тысяч долларов, я думаю, в то время. И ранее, в январе, я старательно учел эти расходы и без особых усилий выделил небольшое состояние для оснащения такого большого дома всем, что нам когда-либо понадобится, совершенно новым. Казалось, мы были главными героями одного из шоу Home Makeover.\n\nНаконец, после рабочего дня и ночи, готовя дом без перерыва в течение нескольких дней, и когда каждый предмет мебели, наконец, прибыл, был распакован и доставлен в соответствующую ему комнату, казалось, что большинство предметов первой необходимости были на месте, и тяжелая работа была выполнена , Я жаждал налить себе скотча и, наконец, сесть и насладиться плодами своего труда. Я спускаюсь вниз по лестнице в погреб для сигар, хьюмидора / вина / скотча в подвале и беру лучшую бутылку виски из нескольких бутылок скотча, которые я купил ранее на этой неделе. На своем пути я помню чувство спокойствия в сочетании с сиянием волнения и этого неописуемого глубокого внутреннего покоя, все сразу. Это был такой редкий, естественный, не вызванный наркотиками высокий уровень, который я никогда не испытывал. Это было так хорошо! Это чувство достижения цели, которой я преследовал и жаждал всю свою жизнь. Я ожидал, что буду преследовать эту цель в течение следующих 15-20 лет, и все же, вот она. Нет, где я был, даже лучше, чем ожидалось! Место, где нет даже моих родителей, которые все еще должны вносить свои ежемесячные ипотечные платежи. Я сделал это! С улыбкой до ушей я глубоко вздыхаю с облегчением и, осматривая дом, думаю про себя: «Все отлично, все на месте, и я могу наконец назвать это нашим домом. Нам так повезло, и мы будут жить великой жизнью. Жизнь, о которой немногие могут только мечтать. Так много забот будет снято и станет излишним. Все будет лучше. Я начну пожар в одном из наших двух каминов, и я собираюсь начать наслаждаюсь своей полуотставной жизнью с первым глотком моего напитка. Это будет официальным началом нашей новой жизни ».\n\nЯ иду на кухню, чтобы взять стакан и несколько кубиков льда, в то время как я пытаюсь найти, какой из них является морозильником среди многих ящиков на кухне. Тогда я заметил написанную от руки записку, расположенную спереди и по центру на кухонном столе. Это от моей жены и читайте: «Нет простого способа сказать это, поэтому я просто собираюсь сказать это ... Я хочу законно развестись \\ [... \\]». Он продолжал говорить, что она забрала нашего сына и однозначно решила покинуть меня. Она уже подала документы на развод, и я должен был быть подан утром.\n\nМое блаженство длилось менее 5 минут, и менее чем за две секунды оно стало темным, мрачным, и я увидел, как все это рушится передо мной. Как и долгожданный запуск ракеты, годы подготовки, которая затем неожиданно взорвется на стартовой площадке во время обратного отсчета. Мой желудок, сердце и все, что было в моем теле, просто погрузилось и растворилось в одном яде в моем ядре. Мне хотелось рвать. Я был полностью слеп; она все время играла в эту игру, не давая мне ни малейшего намека на то, что выдумывают на заднем плане. Она уже работала со своими адвокатами за несколько недель до этого. Ее мать уже была в городе из другого штата, чтобы помочь, я не знаю чем. Я был заправлен газом и ей угрожали, что я должен был обратиться к психиатру из-за изменения в моем характере, который я предположительно развил - мой характер был потрясающим: с BTC по такой цене? Все было идеально! Но я повиновался и пошел в любом случае (это позже соответствовало бы ее истории о том, что ей пришлось расстаться с ребенком, потому что она боялась за свою безопасность из-за моего предполагаемого характера, от которого я лечился, поэтому у меня должна быть эта проблема с характером, понимаете? ). Кроме того, покупка дома с завышенной ценой также казалась явно преднамеренной: цена была основным фактором принятия решений; не местоположение, демография, налоги и т. д. Это было неподходящее место для нас (люди намного старше нас, пенсионеры, игроки в гольф и не дети того же возраста, что и наш сын, с которым можно играть). Наш дом оказался самым дорогим в округе. Теперь я все это ясно вижу.\n\nСмотрите, ваши шифрованные монеты на blockchain, не подпадают под юрисдикцию американского суда (или, по крайней мере, это довольно спорно - серая зона - спросите меня, для затравки, и я могу вам сказать, что я, возможно, семя, или что я может не иметь семени, у меня может быть неправильное семя, я, возможно, забыл его, я, возможно, потерял его - вы не можете доказать, что я не забыл или потерял его и т. д.). Однако, как только он находится в FIAT в банке или инвестируется в собственность, суды могут вынести решение об активе (активах), заморозить, выплатить или распорядиться о продаже имущества и т. Д. Это делается постоянно.\n\nКроме того, монеты были технически мои, и по определению частная собственность (не подлежит разделению во время развода), поскольку они были приобретены до брака. Я не смог доказать его происхождение (я купил многие из них через участников прямого обмена сообщениями на [Bitcointalk.org] (https://Bitcointalk.org) и майнинге, а не на биржах, поэтому никаких записей, квитанций или ничего, что могло бы доказать обратное: большой биржи, такие как BitStamp и Coinbase, не начинали свою деятельность до 2013 года, если я не ошибаюсь. Вместо этого я бы поговорил с одним из участников форума, предлагая монеты, с которыми мы договорились бы о цене, я бы отправил чек, куда бы человек продавец дал указание (Россия, Болгария, Япония, Великобритания и т. д.), и монеты будут сданы на хранение по любому указанному мною адресу. Да, в то время это было довольно грубо.\n\nОднако, как только я конвертировал свои монеты в наличные деньги и использовал эти деньги для покупки имущества в интересах семьи, он стал общей собственностью, и, таким образом, она имела право на часть ее при разделении между двумя сторонами в случае развода - что в итоге составило почти 3/4 всех активов.\n\nЯ был ограблен среди бела дня. Одним человеком я доверился своей жизни. Тот, которому ты должен доверять свою жизнь. Ваш жизненный партнер. И пока я полностью отрицал, пытаясь торговаться, я слишком долго ждал, чтобы получить хорошее юридическое представительство. Когда я, в конце концов, получил адвоката, я был совершенно растерян, и я явно не проводил надлежащих исследований, и это привело к тому, что результаты стали менее звездными и нанесли мне ущерб на многих ключевых этапах процесса. Мне пришлось сменить юридическое представительство прямо перед посредничеством, и я не могу винить и моего нового адвоката, так как у него не было необходимого времени, чтобы разобраться во всех деталях, он сделал все, что мог, но В конечном итоге я был вынужден уступить свою будущую бывшую жену, чтобы она могла вернуться домой, в обмен на получение 50% опеки над моим сыном, с серьезными и строгими условиями, которые я должен был соблюдать. Итак, мне пришлось уехать, найти дыру в стене в студенческой квартире, заплатить мою арендную плату и заплатить нашим детям дошкольного возраста, пока она живет грандиозно, без ежемесячных платежей в загородном клубе, пока дом не продастся, что будет скорее всего будет весной следующего года. Ницца!\n\nИз-за моей задержки, юридического неправильного обращения и любого другого элемента в ее пользу, она необъяснимым образом получила около 3/4 стоимости всех активов, свободных и ясных, без налогов. Имейте в виду, она никогда не делала финансовых вложений и не заработала ни единого доллара за весь наш брак. Она никогда не работала и имела 0 долларов в кармане, когда мы поженились. У нее даже не было текущего счета, ей было за тридцать. Она не пустышка; она умна на улице, знает, как манипулировать людьми, справляться с флиртом и обаянием, а я умнее и умнее книг. и она избила меня руками Она уходит с суммой, не совсем 7 цифр, но близко.\n\nС учетом того, что у меня осталось от продажи дома, я несу ответственность за оплату всех налогов на прирост капитала от ликвидации до IRS, которые должны быть выплачены в апреле 2019 года. Я не ожидаю, что их останется больше, чем ориентировочная сумма в 30 тысяч долларов, упомянутая выше.\n\nНенавижу рынок все, что ты хочешь, я заключил мир с рынком и продолжаю некоторое время ненавидеть своего бывшего за то, что он поставил меня в такую же ситуацию. Она споткнула меня за 1 ярд до финиша и толкнула меня в колючие кусты, чтобы пересечь ее самостоятельно. Пойди разберись. Когда я закончу ненавидеть ее, я вернусь к тому, чтобы заново строить свою жизнь с нуля. Я не волнуюсь, я делал это раньше. Просто разозлился, я был так близко и настолько наивен, что не увидел, что это произойдет.\n\nИзвините, я не собираюсь угонять нить, просто хотел, чтобы вы знали, что другие могут потерять больше, чем просто \"свободные\" деньги; деньги, на которые нам не нужно было работать. Мы были счастливчиками. Это то, что я продолжаю говорить себе, чтобы я не спрыгнул с моста.\n\nPS - Woah: простите за стену текста; Я просто собирался написать первый абзац и закончил высказываться о моей текущей ситуации. Я знаю, я должен отнести этот вопрос к / r / депрессии, / r / exes или / r /, где находится ближайший мост.\n\nНадеюсь, это может стать уроком для тех, кто держит крипто, и некоторые могут узнать, что НЕ делать. Я выучил трудный путь и остался ни с чем. Не будь хорошим парнем. Никому не доверяй свою криптографию. В любом случае, я уверен, что либо наш бдительный субреддит-бот, либо один из модов удалит мой пост за то, что он не придерживается правил, и если нет, то я уверен, что вы, прекрасные люди, понесете меня в ад. Преуспевать. Забери у меня маленькую карму, которую я тоже оставил! Благодарность!\n\n& # X200B;\n\nЯ выучил много уроков, но вот некоторые ключевые \\ [IANAL - любое крипто-образованное мнение AL приветствуется здесь, спасибо \\]:\n\n\\ - Понять понятие частной собственности - собственность, которую вы приобретаете до вступления в брак. INAL - это зависит от законодательства штата, но это трудно доказать с помощью криптографии, особенно если вы получили крипто через иностранные биржи, за пределами законной юрисдикции, заявитель может не понимать или не желать вкладывать средства в получение повесток в суд и запросов к предприятиям, работающим за границей, так как это может быть дорогостоящим.\n\n\\ - Найдите адвоката, который понимает или желает понять криптовалюту, о ее преимуществах, связанных с недоступностью, и о том, как это может сработать для вас. Не позволяйте им обмануть вас: «ну, давайте просто конвертируем все остальное в наличные деньги, потому что я так понимаю».\n\n\\ - Если вы пойдете на посредничество, вышеизложенное также применимо. Этот арбитр или посредник должен быть тем, кто понимает внутренние детали криптографии - например, во время ATH я купил 6 цифр в долларах США Stellar. Я использовал самую первую версию программного обеспечения, поддерживающую Stellar на моем аппаратном устройстве, и положил все это в кошелек для хранения в холодильнике где-то в январе. Я обычно проверял свои монеты на блокчейне, и они там. Через несколько месяцев я пытаюсь получить доступ к своей учетной записи, и устройство возвращает другой публичный адрес, который содержит 0 средств. Я все еще пытаюсь отладить эту проблему с производителем, но дело в том, что меня обвинили в сокрытии этих монет или халатности, и мне потребовали заплатить половину того, что было потеряно. или не потерян, из моего кармана за деньги, к которым у меня тоже не было доступа. Я попытался объяснить это в самых простых терминах, есть риски, связанные с использованием программного обеспечения «первым пришел». Там нет номера 1800, мо техподдержка. нет генерального директора, нет, вы не можете позвонить в BBB и пожаловаться, и т. д., и никто, казалось, не мог ни понять, ни желать. Это стало огромным контрольно-пропускным пунктом, за который я должен был уступить не наличными, а уступкой, которую я не хотел уступать. Заявитель полагался на тот факт, что я либо умышленно обманывал, либо достаточно глуп, чтобы потерять монеты, и сумел вызвать достаточно сомнений в моем характере и честности, и не было ничего рационального, чтобы я мог объяснить, что она или кто-либо другой в комнате поймут. Возможно, стоит заключить контракт с опытным крипто-экспертом, который может предложить нейтральную точку зрения и высказать свое мнение. Андреас, где ты был, когда я нуждался в тебе? :)\n\n\\ - Другими примерами были монеты, которые я купил в 2012 году и подарил детям ее семьи. Я держал их до тех пор, пока им не исполнится 16, чтобы они заплатили себе за колледж, или так я им сказал. Эти монеты были востребованы заявителем. Хорошо, я предложил отправить их, но со значением CHECKLOCKTIMEVERIFY с высотой блока, скажем, через 10 лет, из страха, что она потратит монеты, и дети никогда не узнают (они малыши). Никто не понял, о чем я говорю, меня разозлили сумасшедшим, я сдался, послал ей монеты, разблокировал и, как я и ожидал, в течение 20 минут после их получения она потратила на него 1200 долларов (для полет, я думаю). Если вы являетесь единственным, кто говорит на вашем языке, никто не хочет слушать или прилагать усилия, чтобы понять вас.\n\n\\ - Кажется, мои монеты были частной собственностью, а это значит, что я приобрел их до брака, а в случае развода, если я их не сдвинул или не использовал для общего блага брака, они остаются моими. Однако я их ликвидировал, и деньги попали на мой текущий счет для покупки продуктов питания, автомобилей и, в конечном итоге, дома, и именно тогда они стали общей собственностью. Только однажды они попали в мой текущий счет, на котором она названа. Похоже, что если бы я принял надлежащие юридические меры предосторожности с документацией или компанией / трастом, куда бы ушли эти деньги, вместо моих чековых счетов, в другом месте, я все равно смог бы быть законным владельцем полученных денежных средств. Я не могу вспомнить подробности, но это как то, что мне объяснили позже, и я, честно говоря, думаю, что я просто отключил это, потому что мне стало плохо от того, что я мог сохранить свое богатство. Возможно, адвокат может вмешаться? Опять же, большая часть недостатка информации и всех принятых ошибок была связана с тем, что имеешь дело с людьми, которые привыкли к традиционным активам и не будут отклоняться от них. Крипто отличается и обрабатывается по-разному. Очень важно знать сильные и слабые стороны при рассмотрении дел о том, чего люди не понимают.\n\n\\ - Я могу вспомнить еще кое-что, но этот пост выходит из-под контроля. Не стесняйтесь комментировать / предлагать свои собственные, и я добавлю больше к комментариям.\n\n& # X200B;\n\nКредиты: [u / nanoissuperior] (https://www.reddit.com/user/nanoissuperior) Спасибо за ваш пост, это вдохновило меня на написание этого. Любой, любая карма, которую вы считаете нужной, должна идти своим путем, чтобы обеспечить источник вдохновения, пожалуйста, дайте О-ОП.\n\n& # X200B;\n\nTL; DR: Жена, внесшая 0 долларов в течение всего брака, подождала, пока я не обналичил все свои крипто-валюты на вершине бычьего рынка в январе 2018 года, на хорошую сумму из семи цифр, а затем сразу же развелась со мной за деньги.\n\n& # X200B;\n\nРедактировать: добавлено TL; DR","title":"Lessons learned - Crypto and Divorce - In January I was a millionaire thanks to BTC, then my wife divorces me and now I have $30,000 AMA","subreddit_name_prefixed":"r/CryptoCurrency","ups":651,"created":1544154290,"link_flair_background_color":"","id":"a3rh6u","author":{"name":"mijalis"},"permalink":"/r/CryptoCurrency/comments/a3rh6u/lessons_learned_crypto_and_divorce_in_january_i/","url":"https://www.reddit.com/r/CryptoCurrency/comments/a3rh6u/lessons_learned_crypto_and_divorce_in_january_i/","created_utc":1544125490}