{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"& # X200B;\n\nhttps://preview.redd.it/r6nvz6g643521.png?width=594&format=png&auto=webp&s=35fc73c6393a7d3f884ed40aba5e5fc2193be304\n\n[https://cryptoiq.co/all-of-the-weedcoins-pot-thc-smoke-prg-tks-dope-cann-mrja-grwi-kush-grmd-ccn-stv-cnnc-bgr-mar-blazr -bubo-являются-shitcoins /] (https://cryptoiq.co/all-of-the-weedcoins-pot-thc-smoke-prg-tks-dope-cann-mrja-grwi-kush-grmd-ccn-stv -cnnc-BGR-Mar-blazr-Bubo-являются-shitcoins /)\n\n \n\n*** Война с Shitcoins. Эпизод 7: Монеты на тему сорняков, включая *** ** Включая PotCoin (POT), Paragon (PRG), SMOKE, Tokes (TKS), HempCoin (THC), монету марихуаны (MAR), CannabisCoin (CANN), CannaCoin (CCN), DopeCoin (DOPE), BlazerCoin (BLAZR), GreenMed (GRMD), Growers International (GRWI), Каннация (CNNC), Бонгер (BGR), Сативакоин (STV), KushCoin (KUSH), GangaCoin (MRJA), Budbo (BUBO). ** *** Война с шиткойнами - это серия Crypto.IQ, которая нацелена на криптовалюты и сбивает их с толку, в которые не стоит вкладывать деньги из-за их мошенничества, серьезных недостатков дизайна, централизованные или вообще просто бесполезные копии других криптовалют. Есть тысячи дерьмов, которые разрушают рынки, и Crypto.IQ намеревается разоблачить их всех. Крипто-пространство нуждается в экзорцизме, и мы рады предоставить его. ***\n\nСуществует множество криптовалют, которые представляют собой не что иное, как копии других криптовалют с надетыми логотипами марихуаны. Возможно, разработчики этих криптовалют иссякли и решили сделать ICO или premine, чтобы наполнить свой военный сундук марихуаной. Какими бы ни были мотивы, человеческая раса создала 18 криптовалют на тему сорняков. Каждый из них будет рассмотрен и правильно сожжен ниже.\n\n** Potcoin (POT) ** - одна из самых ранних криптовалют на тему марихуаны, запущенная в 2014 году и имеющая рыночную капитализацию [$ 2,7 млн] (https://coinmarketcap.com/currencies/potcoin/). Шокирующе, рыночная капитализация POT приблизилась к 100 миллионам долларов во время крипто-увлечения 2017 года. POT считается глобальным решением для мировой индустрии марихуаны за 100 миллиардов долларов, но очевидно, что мировая индустрия марихуаны никогда не принимала Potcoin из-за объема менее 3000 долларов в день на момент написания этой статьи. На самом деле бессмысленно, что энтузиасты марихуаны хотели бы держать и совершать операции с POT, поскольку пометка POT на всех их транзакциях гораздо менее анонимна, чем использование Биткойна. POT начинался как PoW и в конечном итоге переключился на PoS и не имеет уникальных возможностей или характеристик. Поскольку единственная уникальная черта POT - это логотип сорняков, это явно дерьмовая монета. Для каждой криптовалюты на тему сорняков CryptoIQ даст понять классификаторы. Поскольку POT является одной из самых ранних и популярных монет для сорняков и имеет вторую по величине рыночную капитализацию для сорняковых монет, классификация ** является тупой **.\n\n** HempCoin (THC) ** не сильно отстает от POT [с рыночной капитализацией в 2,3 миллиона долларов] (https://coinmarketcap.com/currencies/hempcoin/) и аналогичным незначительным объемом в 12000 долларов в день. THC была запущена в 2014 году и призвана революционизировать индустрию по выращиванию сорняков и конопли, создав децентрализованную систему платежей. Как и POT, нет никаких причин, по которым предприниматели марихуаны предпочитают совершать сделки с THC по сравнению с биткойнами, тем более что ликвидность настолько низка, что они могут потерять деньги. По-видимому, THC - это PoW и PoS, но не имеет уникальных возможностей. Классификация ТГК - ** полукопчёная тупая **.\n\n** SMOKE ** имеет [рыночный предел 840 000 долларов США] (https://coinmarketcap.com/currencies/smoke/#markets) и котируется на некоторых децентрализованных биржах. Кажется, что SMOKE - это версия Steemit для сорняков. Похоже, веб-сайт запустился и функционирует как социальная сеть для стоунеров, которые могут курить и зарабатывать ДЫМ. Возможно, у ДЫМА есть потенциал, поэтому он получает классификацию ** свежий штифт **. Однако сама концепция мотивации друг друга к курению наркотиков для получения криптовалюты кажется чем-то, что миру не нужно.\n\n** Paragon (PRG) ** является немного более продвинутым, чем другие сорняковые монеты, поскольку он объединяет технологию интеллектуального контракта и может использоваться для создания приложений для индустрии марихуаны. Возможно, PRG можно прозвать Weedthereum. PRG имеет самую высокую рыночную капитализацию монет сорняков [на уровне 5,2 миллиона долларов США (https://coinmarketcap.com/currencies/paragon/), хотя объем составляет всего 21000 долларов в день. SEC растоптал тупой PRG [и наложил суровые штрафы] (https://www.sec.gov/litigation/admin/2018/33-10574.pdf) для незарегистрированной ICO. PRG должна вернуть инвестиции инвесторам, и поскольку было собрано 12 миллионов долларов, а PRG потеряла более половины этой стоимости, похоже, Paragon рискует обанкротиться. Это дает классификацию ** тупого, пропитанного соком сока **.\n\n** Tokes (TKS) ** - это монета с сорняками, выпущенная через блокчейн WAVES, рыночная капитализация которой составляет 775 000 долларов США (https://coinmarketcap.com/currencies/tokes/), но менее 400 долларов США в день при ежедневном объеме торгов , Кто-то, сбрасывающий TKS, который они получили от продажи QP сорняков, может обрушить рынок. По всей видимости, TKS стремится быть инструментом отслеживания цепочки поставок для индустрии марихуаны, в дополнение к тому, что он является совместимой валютой для амбулаторий, но он, очевидно, используется не часто. На данный момент TKS классифицируется как ** удары плотвы **.\n\n** DopeCoin (DOPE) ** была запущена еще в 2014 году, и сегодня она практически мертва с рыночной капитализацией около 420 000 долларов США ([серьезно] (https://coinmarketcap.com/currencies/dopecoin/)) и менее 1000 долларов США в ежедневной торговле. объем. DOPE перешел от криптовалюты PoW к PoS, и веб-сайт сделан плохо, в отличие от перечисленных выше монет для борьбы с сорняками, которые имеют хорошо построенные веб-сайты. У DOPE нет искупительных качеств, и его классификация ** случайно вдыхает плотву **.\n\n** КаннабисКойн (CANN) ** имеет [рыночная капитализация менее 400 000 долл. США и объем менее 4000 долл. США в день] (https://coinmarketcap.com/currencies/cannabiscoin/). Цель CANN состоит в том, чтобы использовать ее для покупки марихуаны в амбулаториях, и раньше существовала продуктовая линия штаммов сорняков под названием [CANNdy] (https://bitcointalk.org/index.php?topic=827998.0), которые должны были быть проданы по одному грамму на одного CANN. Теперь одна CANN стоит половину копейки, так что, вероятно, не получилось. Шокирует то, что рыночная капитализация CANN достигла 30 миллионов долларов в начале января 2018 года, поэтому в этом году она пережила грандиозный крах. Это дает CANN классификацию **, уплаченную за кипрея, но получившую шваг **.\n\n** GanjaCoin (MRJA) ** - первая в списке монета сорняков, которая почти мертва. Основанный на потоке Bitcointalk, он указан на нескольких непонятных биржах. У GanjaCoin были амбициозные планы открыть амбулаторию, в которой каждый грамм сорняков поддерживался одним MRJA. GangaCoin уникален среди сорняковых монет, так как в нем использовались мастерноды, очень похожие на Dash. Очевидно, что практически никто не использует MRJA, давая ему классификацию ** старая плотва в ливневой канализации **.\n\n** Growers International (GRWI) ** предназначена для производителей марихуаны и обладает некоторыми расширенными возможностями по сравнению с другими монетами сорняков, такими как умные контракты, хранилище блокчейнов для штаммов каннабиса и отслеживание поставок от семян до продажи. Идея законна, [но рыночная капитализация в размере 88 000 долларов США и менее 1000 долларов США ежедневного объема торговли] (https://coinmarketcap.com/currencies/growers-international/) указывает на то, что GRWI не удалось внедриться. Возможно, это связано с тем, что [своп к токену ERC-20] (https://bitcointalk.org/index.php?topic=1879760.1040) требуется для использования любого из dApps, поскольку, по-видимому, разработчики не могли этого сделать на собственной цепочке. Похоже, что своп идет не очень хорошо, поэтому GRWI классифицируется как ** сгоревшие пальцы на плотве **.\n\n** KushCoin (KUSH) ** - это монета сорняков, которая имела стремления к Weedthereum, но теперь веб-сайт мертв, разработчики исчезли за облаком дыма от сорняков, а KUSH был полностью исключен. Единственная подходящая классификация - это ** плотва, похороненная на свалке **.\n\n** GreenMed (GRMD) ** имеет рыночную историю, аналогичную периоду полураспада радиоактивных отходов, [и в настоящее время рыночная капитализация составляет всего 40 000 долл. США, а дневной объем торгов составляет менее 300 долл. США] (https://coinmarketcap.com/currencies / greenmed /). Очевидно, [GreenMed является одной из криптовалют, которые намеревались иметь прикрепленную дебетовую карту] (https://bitcointalk.org/index.php?topic=2108848.0), и, как и TenX и Монако, это закончилось катастрофой. Сайт был преобразован в простой интернет-магазин марихуаны без упоминания о криптовалюте, что указывает на то, что разработчики отказались от идеи крипто-дебетовой карты. GRMD, кажется, полностью мертв, и по классификации ** выброшена плотва из машины на шоссе **.\n\n** CannaCoin (CCN) ** - это криптовалюта PoS, на которую, вероятно, никто не делает ставок. Это может быть перечислено на случайном неясном обмене. Похоже, что у CCN не было каких-либо уникальных характеристик, но рыночная капитализация в январе 2018 года все же достигла 2 миллионов долларов. Это еще одно доказательство того, насколько оторванным от реальности был этот крипто-ралли, поскольку теперь CCN определенно мертва. Классификация - ** плотва на дне мусорного бака, заполненного мусором **.\n\n** SativaCoin (STV) ** не имеет искупительных качеств, несмотря на то, что назван в честь мощного сорта марихуаны. Это был PoS, и это все. Во время криптовалюты STV едва не достигла рыночной капитализации в 1 миллион долларов, но команда разработчиков ушла и, вероятно, выкурила часть рыночной капитализации, которую они обналичили. STV полностью исключен из списка и не имеет никакой ценности, что дает ему классификацию ** измельченной плотвы на обочине дороги, пропитанной соком из мусора **.\n\n** Каннация (CNNC) ** подняла меньше, чем биткойн во время их ICO в середине 2017 года, возможно, достаточно, чтобы выкурить команду разработчиков на месяц, и теперь веб-сайт пропал. CNNC был просто гибридом PoW / PoS, у которого не было уникальных возможностей. Действительно, CNNC является очевидным мошенничеством ICO, согласно которому классификация ** купила плотву для сорняков, но получила плотву для специй **.\n\n** Bongger (BGR) ** назван в честь кого-то, кто делает огромный разрыв из водопровода марихуаны, и, возможно, это именно то, что делает команда разработчиков, так как разработчики все еще находятся примерно через четыре года после запуска и кажутся холодными из-за того факта, что BGR ничего не стоит. Классификация этой криптовалюты ** вынесена на кушетку и покрыта доритосом **.\n\n** Marijuanacoin (MAR) ** достигла рыночной капитализации в 900 000 долларов в январе 2018 года, возможно, не по какой-либо другой причине, кроме названия слова марихуана. Разработчик MAR кратко появился в октябре 2017 года и предложил жестко раскрутить блокчейн и, по-видимому, попросил пожертвования, прежде чем исчезнуть навсегда. MAR продолжает оставаться в списке в Cryptopia, но не имеет объема, что означает, что он бесполезен. Это дает МАР классификацию ** порыв ветра уносит ваш сустав в озеро **.\n\n** BlazerCoin (BLAZR) ** не имеет веб-сайта и ветки объявлений, но присутствует на YoBit, несмотря на нулевой объем. Это дает BLAZR специальную классификацию ** тюремное соединение из туалетной бумаги и соскобов с зеленого яблока **.\n\n** Budbo (BUBO) ** котируется в Cryptopia и HitBTC, с огромным объемом $ 63, достаточным для покупки восьмого. Budbo является брендом децентрализованной автономной организации (DAO) для индустрии сорняков. BUBO был продан в ICO [и, похоже, собрал колоссальные 37 миллионов долларов от инвесторов] (https://bitcointalk.org/index.php?topic=2657697.0). Возможно, это связано с тем, что ICO произошла в конце декабря 2017 года и январе 2018 года, когда инвесторы были перегружены деньгами и энтузиазмом. Разработчики все еще периодически появляются и говорят, что «работают над этим», но ничего не было разработано, и сайт посредственный. Будбо, безусловно, самая большая афера в истории монет сорняков и, следовательно, получает классификацию **, ограбленную торговцем наркотиками **.","title":"All Of The Weedcoins, POT, THC, SMOKE, PRG, TKS, DOPE, CANN, MRJA, GRWI, KUSH, GRMD, CCN, STV, CNNC, BGR, MAR, BLAZR, BUBO, are Shitcoins","subreddit_name_prefixed":"r/CryptoCurrency","ups":1048,"created":1545188732,"link_flair_background_color":"","id":"a7e2vp","author":{"name":"turtlecane"},"permalink":"/r/CryptoCurrency/comments/a7e2vp/all_of_the_weedcoins_pot_thc_smoke_prg_tks_dope/","url":"https://www.reddit.com/r/CryptoCurrency/comments/a7e2vp/all_of_the_weedcoins_pot_thc_smoke_prg_tks_dope/","created_utc":1545159932}