{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"хорошо, так что все в крипто) поговорим о том, как мы можем облегчить для обычных людей покупать криптовалюты. Но никто из них, похоже, не задумывается о «финансовом стимулировании». Они говорят только о том, как технология быстрее, децентрализована и более безопасна, но среднестатистическим людям это на самом деле не важно. Я покажу вам, что я имею в виду.\n\nИтак, я разговаривал с не крипто людьми в реальной жизни. Люди, которых я знаю, которым наплевать на крипто. Я объяснил основы крипто. Затем, обычно, когда я спрашиваю их, что может убедить их использовать криптографию вне спекулятивного инвестиционного фактора, они задают этот вопрос: «Но зачем мне заботиться о децентрализации? Почему вы не говорите мне, почему крипто может сделать мою жизнь проще? \"\n\nНу, вот в чем проблема. Им по-прежнему необходимо зарегистрироваться с помощью базы монет или другого обмена фиатами / крипто, делать KYC, прежде чем они смогут его использовать. поэтому, если они хотят отправить деньги прямо сейчас в другую страну, они думают, что это слишком много дополнительных шагов, если они должны использовать криптографию. Это создает ситуацию с курицей и яйцом, потому что им лень подписываться на крипто-обмен, и они не возражают, если их деловому партнеру в другой стране придется ждать 1 рабочий день. С моей точки зрения, большинство людей считают, что это так -> \"Если я отправлю деньги сейчас, моему бизнес-партнеру / семье нужно подождать только 1 рабочий день. Если я отправлю их с помощью криптообмена, мне нужно зарегистрироваться на этой базе монет. что-то, подождите некоторое время, и мой деловой партнер / семья также должны подписаться на эту монету, прежде чем они смогут вывести криптографию обратно в распоряжение \"<- и именно поэтому они не видят никакой выгоды от выполнения этого дополнительного шага даже после того, как я объяснил им, что им нужно зарегистрироваться только один раз. Но им просто все равно, потому что они видят это с точки зрения «сейчас», они не могут видеть это с точки зрения будущих трансграничных транзакций.\n\nТак что это заставило меня задуматься о чем-то. люди не против сделать «дополнительный шаг» и пройти через все неудобства, чтобы зарегистрироваться с новым приложением, переводя деньги в это новое приложение вместо того, чтобы делать банковский перевод напрямую, если они видят финансовые стимулы для них сделать так. Без финансовых выгод они этого не сделают. Я чувствую, что крипто-сообщество редко говорит об этих финансовых стимулах, чтобы среднестатистические шутки могли принять их массово.\n\nНапример, никто не говорит: «Эй, приятель. Вы можете сэкономить 25 долларов быстрых сборов, если вместо прямого банковского перевода вы используете быстрое шифрование, такое как XRP или XLM или NANO». Всякий раз, когда люди обсуждают криптовалюты, они почти всегда говорят: «Должен ли я инвестировать в эту вещь? Она может доходить до $ ххххх, верно?»\n\n Когда вы говорите обычным людям в реальном мире, что они могут «сэкономить $ xxx денег», указывая, насколько дорогой является наша текущая трансграничная транзакция через банковскую систему, они начинают слушать.\n\nКроме того, никто не говорит об этих «стимулах» для среднего шутника. Мы общаемся только в кругах, мы только общаемся друг с другом. Только для того, кто уже в крипто. Я еще не видел, чтобы база монет или какая-либо крупная корпорация на самом деле делали рекламу об этих «преимуществах по сравнению с нашей нынешней банковской системой».\n\nLitecoin и т. Д. Скорее рекламируют себя в UFC (что по-прежнему хорошо для разоблачения, не поймите меня неправильно!). Но да .. вы поняли. Никто из них не говорит о том, как люди могут получить финансовую выгоду, переключаясь с нашей нынешней системы на криптографическую. Они скорее спонсируют бои UFC и все другие не относящиеся к делу события.\n\nИ вот еще. люди часто говорят о том, насколько «изменчива» цена криптовалюты, и это их пугает. именно поэтому, на мой взгляд, чрезвычайно важно «автоматическое» преобразование криптофайлов в фиат.\n\n Я имею в виду, поставить себя на их место. Допустим, вы хотите отправить 10 тысяч долларов своей маме в другую страну. ETH или BTC поступили на монетный счет вашей мамы, но она в настоящее время на улице. Она будет беспокоиться, что BTC может упасть, поэтому она должна открыть свой ноутбук / телефон и преобразовать его в фиат, прежде чем значение упадет. Почему ни один из этих бирж не думает о «автоматическом преобразовании фиатных платежей», чтобы обычным людям, которые используют эти биржи только для того, чтобы получать деньги от своих близких / деловых партнеров за пределами страны, не нужно беспокоиться о своей крипто-ценности? Я имею в виду, конечно, что у нас есть вариант с стабильной монетой, но это не относится к делу, потому что многие крипто-фиатные биржи в разных частях мира не обладают достаточной ликвидностью для стабильной монеты (или даже не имеют пары стабильной монеты)","title":"Why Nobody Talks About Financial Incentives For Average People To Use Crypto?","subreddit_name_prefixed":"r/CryptoCurrency","ups":444,"created":1546365014,"link_flair_background_color":"","id":"abh0kd","author":{"name":"fabzo100"},"permalink":"/r/CryptoCurrency/comments/abh0kd/why_nobody_talks_about_financial_incentives_for/","url":"https://www.reddit.com/r/CryptoCurrency/comments/abh0kd/why_nobody_talks_about_financial_incentives_for/","created_utc":1546336214}