{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Сегодня, чтобы удостовериться в наличии ключей, я наконец-то сделал со своими дерьмами то, что сделал с моими BTC, ETH и LTC, когда получил Ledger Nano S. Я снял их все с бирж. И это заставило меня еще раз осознать, что является самой большой проблемой для криптовалют на данный момент, если учесть массовое усыновление.\n\n** И, пожалуйста: подумайте о массах, а не о нас, о тех, кто раньше принимал криптовалюту, когда вы читаете дальше. ** Я знаю **, мы ** можем справиться с проблемами, но теперь расширим ваш взгляд на массы:\n\nСамая большая проблема заключается в том, что даже хранение и передача вашего криптозащиты нервирует. Под нервированием я подразумеваю, что когда вы переводите шифрование, у вас всегда возникает ощущение, что «этот адрес действительно правильный?». И чем больше сумма и стоимость, тем больше вы проверяете. И вы могли бы проверять адреса много раз. И вдобавок ко всему, вы, возможно, все равно будете сначала отправлять меньшую сумму. Я привык к этому с биткойнами, но с новыми системами, которые мне приходилось устанавливать на моем компьютере, чтобы хранить шиткойны на моей бухгалтерской книге или на моем компьютере, я сделал это. Убедитесь, что адреса верны несколько раз, а затем отправьте сначала небольшую сумму. Когда это прибыло, тогда я переместил остальных. Я еще не нашел систему, обмен или кошелек, который заставляет это чувство исчезнуть. Я считаю это одним из самых больших препятствий, которое вы можете отправить ваши монеты / жетоны на несуществующий адрес или на неправильный адрес и никогда не видеть ваши средства снова. И проблема огромна, если вы думаете о массовом усыновлении.\n\nПодумайте об этом так: сколько раз вы оказывали техническую поддержку самым простым вещам своим родителям? Твои дедушка и бабушка? Оказывая такую ​​поддержку, сколько раз даже самые простые вещи, такие как «отправить мне картинку в сообщении», приводили к вопросу «я не знаю как»? Сколько раз вы меняли настройки на чьем-то телефоне, потому что «я не знаю, что я сделал, но это <вставьте проблему здесь>»\n\nТогда подумай о крипто. Как, по вашему мнению, ваши родители отреагируют на предупреждение: «Убедитесь, что вы отправили свои средства по правильному адресу, длина которого составляет около 25 случайных символов, иначе ваши средства больше никогда не увидят». Я хотел бы видеть лицо таких родителей, когда они понимают, что, если они дадут неправильный адрес или пропустят сохраненный адрес клика и отправят туда арендную плату, деньги исчезнут.\n\nЭто действительно нужно изменить.\n\nВторой вопрос тесно связан с первым и это удобство использования. Вы должны быть в состоянии, ** если вы хотели **, например. связать свой адрес BTC с вашим именем, номером социального страхования, адресом и т. д. И сеть должна иметь возможность отклонить транзакцию, если эта информация была неверной, если этого требует владелец адреса.\n\nПредставьте, сможет ли сеть вернуть вам транзакцию, если идентификация не удалась. Подумайте, насколько вы были бы увереннее, если бы отправили BTC, например, в. обменный адрес, и вы могли бы предоставить дополнительную информацию для транзакции (например, имя биржи, имя вашей учетной записи, одноразовый пароль) в дополнение к адресу BTC и сумме. И если любая из этих сведений будет неверной, вы не сможете выполнить транзакцию.\n\nДаже замечательно иметь анонимную (по-видимому, отслеживаемую BTC) систему, которая действительно делает использование во много раз более трудным.\n\nИ все это должно быть так же просто, как программное обеспечение телефона, которое у меня сейчас есть на моем телефоне, и которое позволяет мне отправлять евро своим друзьям, используя только их номер телефона.\n\nЕсли мы хотим массового внедрения, мы должны стремиться и к этим проблемам, а не только к новым технологиям, скорости сети или пропускной способности.\n\n\n\nРЕДАКТИРОВАТЬ: Aww спасибо за добрый незнакомец за серебро. Мой первый в истории Reddit Silver. :)\n\n","title":"Снял все мои токены / монеты с бирж и понял самую большую проблему для массового принятия","subreddit_name_prefixed":"r/CryptoCurrency","ups":326,"created":1546493318,"link_flair_background_color":"","id":"abxygu","author":{"name":"Porriz"},"permalink":"/r/CryptoCurrency/comments/abxygu/withdrew_all_my_tokenscoins_from_exchanges_and/","url":"https://www.reddit.com/r/CryptoCurrency/comments/abxygu/withdrew_all_my_tokenscoins_from_exchanges_and/","created_utc":1546464518}