{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Я не являюсь носителем английского языка, поэтому мне трудно и сложно написать свой рассказ о Ликке, но я думаю, что важно, чтобы все знали, поэтому никто больше не совершит такую ​​же ошибку.\n\nГод назад я использовал Lykke, чтобы обменять 2000 $ на ETH, а затем перевел его в Binance. Тогда все было хорошо, заплатил своей картой Mastercard, быстрыми переводами, быстрой поддержкой, и через 2 дня у меня были деньги в Crypto.\n\nОчевидно, мне удалось купить очень, очень высоко, и в прошлом месяце я понял, что я упал более чем на 80%. Я подумала: «Нет паники, блокчейн - это будущее, давайте купим еще!» и мои проблемы с Лыкке начались…\n\nСначала я попытался расплатиться своей картой Mastercard, и все застряло очень странным образом. Я не знал, что происходит. Служба поддержки Lykke Вера Романова объяснила:\n\n* «С сожалением сообщаем вам о последних изменениях, внесенных MasterCard в отношении обработки карт. С 12 октября мы больше не сможем предлагать вам депозиты через Mastercard…. В качестве обходного пути я предлагаю вам внести депозит с помощью кредитной карты Visa или SWIFT-перевода ». *\n\nВероятно, MasterCard решила прекратить работать с компанией, которая делает деньги исчезают!\n\nЭто происходило 7 декабря, ETH был в 86USD, и я действительно хотел купить еще. Я решил банковским переводом 600 $. (Я прилагаю подтверждение банковского перевода, чтобы доказать, что я говорю)\n\nhttps://preview.redd.it/4z0ff1xmxz821.jpg?width=1000&format=pjpg&auto=webp&s=15ce38293ce3ccccc83d81b6660a67210ff6e812\n\nПрошли дни, Lykke не добавил мои деньги на мой счет, ETH начал расти, и я начал волноваться.\n\nПрочитайте несколько сообщений между Ликке и мной:\n\nLykke 11 декабря - * «Наша финансовая команда сообщила, что ваш платеж еще не получен». *\n\nLykke 17 декабря * - «Я попросил нашу финансовую команду дважды проверить, и из вашего банка в наш банк не поступило ни одной транзакции. Я настоятельно советую вам запросить у банка подтверждение сделки. У банков есть способ провести SWIFT-расследование, чтобы выяснить, где находятся средства ». *\n\nАдрин 19 декабря * - «Я разговаривал со своим банком, и они говорят, что транзакция прибыла. Для проверки транзакции мне дали номер TRN 100012636.… С этим номером ваша финансовая команда сможет быстро найти мои деньги! »*\n\nLykke 19 декабря - * «После подтверждения нашей финансовой командой транзакция не поступила, и номер TRN не раскрывает никакой информации, поскольку они не могут выполнять поиск в системе SWIFT на основе номера TRN». *\n\nАдрин 25 декабря - * «Вот копия исходного SWIFT-сообщения о платеже (MT 103) моего платежа 600USD. Больше никаких оправданий, как вы видите в строке 32A, у вас были мои деньги с 18 декабря, и я хотел бы, чтобы они были добавлены на мой счет как можно скорее ». *\n\nLykke 27 декабря - «* Этот случай действительно находится за пределами нашего понимания, так как 18 декабря не было проведено ни одной транзакции или после сопоставления с вашими данными подтверждения SWIFT. Я настоятельно рекомендую вам попросить банк вернуть средства обратно. Операции Swift позволяют вернуть средства ... »*\n\n\n\nВ этот момент я позвонил в свой банк и потребовал обратно 600 $, к сожалению, Lykke Corp должна принять мой запрос, чтобы он снова был добавлен в мой аккаунт.\n\nПрошло еще 10 дней, сегодня 7 января, и я хотел обменять 600 $ в ETH месяц назад за 85 $, а не завтра за 160 $. Я не богат, и у меня нет 600 долларов больше, я не могу купить Crypto, если не получу свои деньги от Lykke.\n\nЭто сообщество - моя последняя надежда, пожалуйста, проголосуйте за этот пост, чтобы все могли знать о рисках, связанных с Lykke, и решить, действительно ли это лучший выбор для отправки денег ...\n\nСпасибо!\n\n** ВАЖНОЕ РЕДАКТИРОВАНИЕ! **\n\nТолько через 6 часов после публикации этой темы ** моя ситуация была решена, 600 $ были добавлены обратно в мой аккаунт. ** Спасибо за все положительные отзывы, которые действительно привлекли внимание к этой неприятной ситуации и заставили команду Lykke сделать все возможное, чтобы решить мою проблему.\n\nЯ чувствую, что ** я должен извиниться с сообществом Lykke **. Мои деньги прибыли 10 минут назад, это означает, что они уже были переведены 6 часов назад, когда я впервые решил написать на Reddit. Я сожалею, что не могу использовать ваш обмен, и я надеюсь, что в будущем вы найдете способ получить деньги из моего итальянского банка. За один месяц поддержка Lykke написала мне 15 раз и не сделала ничего плохого.\n\n** Я перевел 600 $ на их счет, но деньги так и не поступили, они были потеряны в каком-то банке или сервере на один месяц и сегодня добавлены обратно на мой счет. У меня его тоже не было, Люкке. Мне достаточно этого дерьма, пришло время для блокчейнов выйти на мейнстрим! **","title":"Ликке заставил мои 600 $ исчезнуть ...","subreddit_name_prefixed":"r/CryptoCurrency","ups":838,"created":1546894180,"link_flair_background_color":"","id":"adhda9","author":{"name":"AdrinBig"},"permalink":"/r/CryptoCurrency/comments/adhda9/lykke_made_my_600_disappear/","url":"https://www.reddit.com/r/CryptoCurrency/comments/adhda9/lykke_made_my_600_disappear/","created_utc":1546865380}