{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Я видел много комментариев о проблемах людей, связанных с функциональностью Bluetooth, поэтому я взял на себя обязанность проанализировать, как работают цифровые подписи и как аппаратные кошельки надежно подписывают цифровые транзакции. Я считаю, что протест превышает фактический риск.\n\nОдна из основных задач кошелька криптовалюты - подписывать цифровые сообщения (или транзакции). Что это обозначает? Это означает, что когда я хочу отправить BTC на какой-либо адрес, я создаю неподписанную транзакцию. Эта транзакция, в ее самых упрощенных терминах, просто говорит, сколько и кому я хочу отправить BTC.\n\nКошелек запускает алгоритм подписи ** для этой неподписанной транзакции ** для создания ** подписанной транзакции. ** Если вы когда-либо использовали MyEtherWallet, вы можете увидеть транзакцию без подписи и подписи при попытке отправить токены. Будь то аппаратный или программный кошелек, он берет ваш закрытый ключ / семя, запускает алгоритм подписи для вашей неподписанной транзакции ** с помощью ** вашего личного ключа, а затем выводит вашу подписанную транзакцию. Эта подписанная транзакция представляет собой просто длинную строку данных, которая ** на самом деле не ** имеет ваш закрытый ключ, но была изменена им.\n\nПрелесть в том, что если у кого-то есть ваш открытый ключ (который соответствует вашему закрытому ключу) вместе с подписанной транзакцией, он может легко проверить, что лицо, которое владеет этим закрытым ключом, одобрило эту транзакцию. * Это все без раскрытия секретного ключа *.\n\nТаким образом, чтобы подвести итог, я создаю ** беззнаковую транзакцию **, в которой говорится, кому я хочу что-то отправить, я использую свой кошелек для запуска алгоритма подписи на нем с моим закрытым ключом, кошелек ** выводит ** ** подписанная транзакция ** без раскрытия ключа. Эта подписанная транзакция передается майнерам / стейкерам для проверки и выполнения транзакции. Подробнее о подписи в биткойнах см. Здесь <span translate = \"no\"> (https://www.cryptocompare.com/wallets/guides/how-do-digital-signatures-in-bitcoin-work/) </ span >. Ни неподписанные, ни подписанные транзакции не содержат вашего закрытого ключа.\n\n\n\nТеперь, как это относится к аппаратному кошельку? Ваш программный кошелек, или MEW, или Ledger Live генерирует неподписанное сообщение, отправляет его на ваш аппаратный кошелек, который, в свою очередь, ** подписывает ** транзакцию на защищенном чипе с закрытым ключом, а затем отправляет обратно подписанное сообщение вашему компьютер для вещания в сеть.\n\nBluetooth позволит беспроводным потокам без подписи и подписи. И, как мы обсуждали выше, закрытый ключ никогда не раскрывается в неподписанных или подписанных транзакциях. Пока на экране отображается то, что вы подписываете, вы никогда не сможете случайно подписать транзакцию, которая отправит ваши драгоценные активы на какой-то другой адрес.\n\nЗатем связь между вашей бухгалтерской книгой nano x и компьютером / телефоном / планшетом зашифрована. Таким образом, даже если бы кто-то даже каким-то образом смог расшифровать эти беспроводные данные, это были бы только неподписанные / подписанные транзакции, которые в любом случае были бы для них бесполезны! Но люди, видящие эти данные, с такой же вероятностью, как и те, кто пытается увидеть данные между вами и вашим банком (СОВЕТ: очень маловероятно, посмотрите [HTTPS] <span translate = \"no\"> (https://en.wikipedia.org/ вики / HTTPS) </ SPAN>).\n\nМы работаем в предположении, что аппаратный кошелек не был скомпрометирован, но в любом случае это действительно так.\n\nУ вас, ребята, нет причин бояться, если вы доверяете бухгалтерской книге для выполнения соответствующих мер безопасности и проверки кода. Пока что они очень хорошо справились.\n\n\n\nРЕДАКТИРОВАТЬ: Чтобы визуализировать, как работает аппаратный кошелек, вот [диаграмма]  (https://imgur.com/a/moCuoeq) , которую я быстро сделал в краске.\n\nРЕДАКТИРОВАТЬ 2: Я удалю злые слова.","title":"Озабоченность по поводу Ledger Nano X Bluetooth разоблачает массовое недоразумение подписи блокчейна / аппаратного кошелька","subreddit_name_prefixed":"r/CryptoCurrency","ups":278,"created":1546904464,"link_flair_background_color":"","id":"adittt","author":{"name":"MarshallBlathers"},"permalink":"/r/CryptoCurrency/comments/adittt/concern_about_ledger_nano_x_bluetooth_exposes/","url":"https://www.reddit.com/r/CryptoCurrency/comments/adittt/concern_about_ledger_nano_x_bluetooth_exposes/","created_utc":1546875664}