{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"\n\nhttps://preview.redd.it/xcx68wwfva921.png?width=612&format=png&auto=webp&s=7de1fc443e4364f5724f0f5bb85fb96f24614134\n\n[https://cryptoiq.co/219500-ethereum-classic-etc-worth-1-1-million-double-spent-during-51-percent-attack-coinbase-may-delist/]<span translate = \"нет «> (https://cryptoiq.co/219500-ethereum-classic-etc-worth-1-1-million-double-spent-during-51-percent-attack-coinbase-may-delist/) </ SPAN>\n\nEthereum Classic (ETC) подвергся осаде из-за атаки в 51 процент [как подробно описано в статье CryptoIQ вчера] <span translate = \"no\"> (https://cryptoiq.co/ethereum-classic-etc-hit- с-51 процентов-атаки в неделю, перед тем, Эфириума-ETH-Константинопольский твердолобый-вилка /) </ SPAN>. Первоначально была неверная информация о том, что эта 51-процентная атака произошла из-за тестирования новых ASIC ETHash с тактовой частотой 1,4 ГГц / с и не имела связанных двойных расходов.\n\nЭто вызвало общественный протест против запрета ASIC в сетях Ethereum Classic (ETC) и Ethereum (ETH). Однако [анализ Coinbase]  (https://blog.coinbase.com/ethereum-classic-etc-is-currently-being-51-attacked-33be13ce32de)  показывает что 219 500 ETC стоимостью 1,1 млн. долл. США были украдены в два раза, что не оставляет сомнений в том, что эта атака была сделана с целью получения прибыли, а не из-за тестирования ASIC.\n\nКроме того, анализ Coinbase показывает, что 51-процентная атака происходила с 5 по 8 января и прекращалась, что делает это продолжительной атакой, а не разовым инцидентом. Самая длинная атака на 51 процент была глубиной 123 блока, что составляет около 30 минут.\n\nДо настоящего времени было совершено 15 таких атак, большинство из которых были связаны с двойными расходами. Продавцам и биржам было предложено подождать не менее 400 подтверждений, прежде чем принять безопасную транзакцию Ethereum Classic (ETC), хотя, если у кого-то есть 51 процент хэш-мощности, то технически никакое количество подтверждений транзакций не является безопасным.\n\nБезопасность и неизменность Ethereum Classic (ETC) теперь находятся под серьезным сомнением. Двойные расходы очень опасны для пользователей сети, поскольку злоумышленник может отменить транзакции по желанию. Понятно, что у кого-то есть возможность атаковать Ethereum Classic на 51% по желанию, и они могли бы сделать это снова.\n\nИз-за этого недостатка безопасности [Coinbase заблокирован]  (https://blog.coinbase.com/ethereum-classic-etc-is-currently-being-51-attacked-33be13ce32de)  все депозиты и снятия Ethereum Classic (ETC). Пока неизвестно, будет ли Coinbase исключать Ethereum Classic, но кажется вероятным, что проблемы безопасности не могут быть устранены.\n\nУдивительно, но OKEx [остается открытым]  (https://twitter.com/OKEx/status/1082548615766265856)  для депозитов и снятий Ethereum Classic, для депозита требуется всего 100 подтверждений. Это кажется серьезной угрозой безопасности, так как злоумышленник уже продемонстрировал, что он может атаковать 51% для более чем 100 блоков подряд.\n\nПримерно 60 миллионов долларов (10 процентов) было урезано из [рыночной капитализации Ethereum Classic (ETC)] <span translate = \"no\"> (https://coinmarketcap.com/currencies/ethereum-classic/#charts) </ span > С этого двойного инцидента тратится. Если Coinbase исключит ETC - а мы не знаем, будет ли это - это может привести к гораздо большему краху.","title":"219 500 Ethereum Classic (ETC) стоит $ 1,1 миллиона, дважды потраченных во время 51-процентной атаки; Coinbase May Delist","subreddit_name_prefixed":"r/CryptoCurrency","ups":272,"created":1547026042,"link_flair_background_color":"","id":"ae1jxi","author":{"name":"turtlecane"},"permalink":"/r/CryptoCurrency/comments/ae1jxi/219500_ethereum_classic_etc_worth_11_million/","url":"https://www.reddit.com/r/CryptoCurrency/comments/ae1jxi/219500_ethereum_classic_etc_worth_11_million/","created_utc":1546997242}