{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Предположение, конечно, но вот некоторая информация, которую вы можете проверить сами.\n\n1. Объявление компании TenX об уходе Джулиана ([источник]  (https://twitter.com/tenxwallet/status/1082864468164513793) )\n2. Видео Джулиана на YouTube о его уходе ([source]  (https://www.youtube.com/watch?v=n4xjbUKTzuw&feature=youtu.be) )\n3. Проверенная подпись Джулиана, связывающего себя с этим адресом Эфириума # 1 ([подпись]  (https://etherscan.io/verifySig/21) , [адрес # 1 ]  (https://etherscan.io/address/0x15b6e1aC3c84c0673E3cb6D4Ef138E274b763Dbf#tokentxns) )\n4. Его «реальный» адрес Эфириума №2 с несколькими 6250 депозитами PAY. Существует связь между адресами № 1 и № 2 с этой транзакцией ([ссылка транзакции]  (https://etherscan.io/tx/0x8b318ae41b65364217c18d3a117e4707e97f31f283ef8f903469258a9f03b5c0) <# span>, [#] <span translate = \"no\"> (https://etherscan.io/tokentxns?a=0xf340a7341c992ef0b06a4c1d4e7ac83020f80555&p=1) )\n5. Почему я думаю, что это его фактический адрес? Ранее в Твиттере было указано, что он ежемесячно получал 6 250 PAY, и он не опроверг это, но сказал, что «ждет того дня, когда PAY составляет 100 долларов США, и люди жалуются на это». ([твит указывает на 6250 PAY]  (https://twitter.com/DegenSpartan/status/1037696125573128200) , [его ответ]  (https : //twitter.com/julianhosp/status/1037706913582964737) , [его ответ заархивирован]  (https://imgur.com/a/J0qnWxm) )\n6. Депозиты на сумму 2 222 035 PAY зачисляются на что-то, похожее на адрес депозита Bittrex, с различными депозитами, приходящими с адреса № 2 и предположительно другого адреса, которым он управляет ([предполагаемый адрес депозита Bittrex] <span translate = \"no\" > (https://etherscan.io/address/0xa1fa9422ed2159b57fff31fc0172d0bd83455a78#tokentxns) </ SPAN>)\n7. За исключением первоначальных 1.5M токенов PAY, депонированных за 5 дней до конца 2018 года, остальные депозиты поступили ПОСЛЕ того, как был сделан снимок для их нового токена после 1 января 2019 года ([подробности снимка] <span translate = \"нет\"> (https://twitter.com/tenxwallet/status/1079357122947756032) </ SPAN>)\n8. Цена PAY / BTC от 25 декабря, до поступления депозитов: 0,00010783\nЦена PAY / BTC на 9 января, на момент публикации: 0.00004950\nИзменение цены в BTC: -54%\n\nСводные заметки:\n\nПо-видимому, было продано 2 партии токенов: 1 до моментального снимка, 1 после моментального снимка.\n\nЯ считаю, что первая партия токенов, проданных до того, как снимок был его «собственными» токенами - т.е. Платите токены, которые он купил на собственные деньги у Bittrex и OKex для своей личной торговли / накопления. Поскольку он не был «передан» ему от компании в качестве зарплаты или пособий, «жетонов» для этих токенов не существует. Эти токены ~ 1,5 млн. Были помещены в Bittrex, чтобы воспользоваться преимуществами ценовой накачки в обман.\n\nЯ полагаю, что вторая партия жетонов, проданных после снимка, была его жетонами \"зарплата или льготы\" - т.е. Токены PAY, выданные ему в качестве вознаграждения за его работу в TenX, которая, вероятно, будет иметь юридический период блокировки или удержания. Следовательно, движение к биржам ПОСЛЕ 1 января 2019 г., 00.01 +8 по Гринвичу (TenX базируется в Сингапуре, что +8 по Гринвичу).\n\nМне кажется весьма вероятным, что Джулиан сбросил все свои токены PAY, пытаясь продать промежуточную вершину в шумиху вокруг снимка токена. Цена резко упала за последние 2 недели с момента поступления депозитов. Снимок также является идеальной дымовой завесой, чтобы скрыть выход из его позиции, поскольку объем до и после будет выше, чем обычно.\n\nЧто вы, ребята, думаете о моем сборе фактов? Мои предположения? Юлиана?\nКак вы думаете, каковы последствия для TenX как компании, специализирующейся на криптографических услугах?\nВы бы им доверяли? Какой у них имидж? Что вы думаете о токене PAY и их новом токене TENX?\n\nЯ хотел бы услышать ваши мысли по этому вопросу.\n\nРедактировать: форматирование","title":"Неужели бывший со-основатель TenX Джулиан Хосп сбросил на Bittrex 2,22 млн токенов PAY?","subreddit_name_prefixed":"r/CryptoCurrency","ups":265,"created":1547051026,"link_flair_background_color":"","id":"ae4ukr","author":{"name":"gmgh-"},"permalink":"/r/CryptoCurrency/comments/ae4ukr/did_tenx_excofounder_julian_hosp_dump_222m_of_pay/","url":"https://www.reddit.com/r/CryptoCurrency/comments/ae4ukr/did_tenx_excofounder_julian_hosp_dump_222m_of_pay/","created_utc":1547022226}