{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Позвольте мне доказать это в первую очередь. Я споткнулся об этом, когда исследовал атаку ETC на 51% и дискуссии о других PoW-монетах и ​​их «отличной способности». В настоящее время Nicehash хранит> 70% общего хэшрейта DASH, см. [Https://www.nicehash.com/algorithm/x11] (https://www.nicehash.com/algorithm/x11 )  (1390TH / s nicehash против 1790TH / s всего). Это первая проблема, и она встречается редко. Обычно nicehash содержит около 10 - 20% недешевых монет PoW, и это опасно только для небольших вилок PoW-монет.\n\nСледующим шагом была проверка пулов майнинга: если этот хэшрейт направлен на несколько известных и надежных пулов майнинга, это не проблема, но, к сожалению, это не так. Этот сайт показывает только \\ ~ 560TH / s из 1790TH / s из известных пулов. Это также необычно. Например, у Monero это произошло, когда его настигло тихое майнинг ASIC. Но поскольку ASIC уже есть, «обычный пользователь» будет использовать один из пулов.\n\nЭтот хороший сайт показывает, какие адреса собирают награды за майнинг: [https://chainz.cryptoid.info/dash/#!extraction] (https://chainz.cryptoid.info/dash/ #! extract)  Здесь вы на самом деле видите 4 неизвестных больших адреса, собирающих весь этот неизвестный хэшрейт. Я не был в состоянии соединить 3 из них через блок проводника: [https://dashradar.com/explorer/tx/31de30b48c9263544724c0e607a9cb1f7bf05dc2961119827c52571334506172]<span переводить = «нет»> (https://dashradar.com/explorer/tx/31de30b48c9263544724c0e607a9cb1f7bf05dc2961119827c52571334506172 ) </ SPAN>\n\nЭта конкретная транзакция имеет три из четырех главных адресов в качестве входных данных, что означает, что один объект контролирует все три. Только эти трое собирают 53% и более.\n\nВы также можете увидеть, что это началось 6 месяцев назад / примерно в сентябре прошлого года, и я думаю, что четвертый неизвестный пул также принадлежит этому объекту, но он разделен на блокчейн. Он начал собирать много хешей одновременно.\n\n\n\nЧто мы можем из этого сделать? ASIC - это рак. По крайней мере, для всех монет меньше BTC. Они не защищают каждую сеть, как мы можем видеть здесь.\n\nNicehash это рак. Кто-то может арендовать достаточно хэш-мощности, чтобы DASH мог выполнить 51% сразу.\n\nТот, кто владеет этими бассейнами, не держит черту, которую он добывает. Следующие транзакции из их собирающего адреса имеют право на обмен.\n\nТак что, возможно, кто-то может попытаться выполнить 51%, прежде чем DASH реализует свои цепные блокировки. Актер может начать прямо сейчас. Любой, кто предлагает услугу с помощью DASH, должен следить за цепочкой, пока это не изменится, и быть очень осторожным.\n\nХорошего дня и будьте в безопасности\n\nИзменить: обновить. В настоящее время 63% Nethash контролируется одним лицом. XfYm8vfjh3pKN3eKxzqAqACyAo9RQiVeBs также принадлежит ему.\n\nEdit2: кто-то снял 730TH / s с nicehash и теперь указывает на [poolin.com]  (https://poolin.com)  Так что кем бы вы ни были, вы можете сейчас быть на 100% уверенным, что он владеет оборудованием (хотя этого недостаточно, чтобы осуществить атаку на 51%).\n\nEdit3 (15.01.2019): поэтому, хотя одна сущность отодвинула свои 730TH / s от nicehash, добыча сущностей в 4 из 5 лучших кошельков снова достигла 50%. Это также приводит к выводу, что 80% + всего майнинга DASH выполняется двумя людьми / компаниями / организациями. Посмотрим, остановит ли один из них DASh при обновлении своей сети до следующей версии. Afaik им нужно 80% -ое согласие майнера. Оба могут помешать обновлению сети (или оба вместе могут запустить обновление самостоятельно).","title":"Кто-то контролирует> 51% хэшрейта DASH","subreddit_name_prefixed":"r/CryptoCurrency","ups":325,"created":1547083380,"link_flair_background_color":"","id":"ae90zd","author":{"name":"Flenst"},"permalink":"/r/CryptoCurrency/comments/ae90zd/someone_controls_51_of_dashs_hashrate_currently/","url":"https://www.reddit.com/r/CryptoCurrency/comments/ae90zd/someone_controls_51_of_dashs_hashrate_currently/","created_utc":1547054580}