{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Пару лет назад, будучи еще одним компьютерным фанатом, я заработал свой путь в ETH Zurich, чтобы получить степень магистра в области CS, и в это время работал одновременно со швейцарской компанией FinTech, которая использовала технологию «блокчейн» для своего продукта. Короче говоря, провалившись в крипто-кроличью нору, я в конце концов оставил эту работу и свою должность помощника исследователя ИИ и начал работать над этим небольшим устройством, которое буквально является следующим логическим шагом в жизненном цикле биткойн-платежей.\n\n& # X200B;\n\nЕсли массовое усыновление произойдет -\n\n1. Любой человек в мире, разбирающийся в технологиях или нет, должен иметь возможность использовать криптографию так же просто, как использовать бумажную валюту, то есть мгновенно и безопасно.\n2. Постоянно контролируйте свои средства - ни банк, ни обмен, ни посредник.\n\n& # X200B;\n\nАппаратные кошельки решают пункт № 2. Мне нравилось наблюдать за развитием трезора и его успехами на протяжении многих лет, но, как ни странно, я также был барабанщиком, гастролирующим по Европе с немецкой группой в течение этого времени, и посещая кучу разных стран, у которых были разные валюты, я был из «сторонняя» страна должна была конвертировать деньги из моей страны в любую нужную мне валюту, и ставки / сроки депозита для этого были нелепыми. Будучи ранним последователем, я все еще не мог использовать криптографию как валюту! Мой трезор просто сидел \"дома\"? сохраняя мой криптобезопасный.\n\n& # X200B;\n\nИменно поэтому я начал работать на lastbit. То, что начиналось как простое хобби, быстро превратилось в тщательно продуманный план, и я оставил своих магистров на полпути (справочная информация: я индиец - все время обучаюсь тому, чтобы получить прямой результат, но никогда не использую эти знания. Лучшее решение, которое когда-либо было, оставив университет) работать над этим полный рабочий день и за последний год построил несколько поколений прототипов, научился вести бизнес и привлек капитал (трудный путь)! (Создать компанию сложно, построить аппаратную компанию экспоненциально сложнее!)\n\n& # X200B;\n\nВ общем, я отработал свою задницу, чтобы построить эту маленькую компанию, команду, собрать средства, и теперь мы готовы постепенно начать внедрять это ([lastbit.io] (https://lastbit.io)). Я потратил бесчисленное количество часов на криптографы, и пришло время, когда сообщество приняло участие. Нет дерьма, не дерьма, просто чистая любовь ко всему сложному.\n\n& # X200B;\n\nОчень очень очень короткий пример мыслительного процесса, стоящего за этим\n\n& # X200B;\n\nПример:\n\n& # X200B;\n\nУ меня есть 100 BTC. Я храню его в своей бухгалтерской книге -\n\n& # X200B;\n\n1.1 Я бы никогда не взял с собой свою бухгалтерскую книгу, чтобы прогуляться до кофейни, это слишком большой риск. Вместо этого мой бухгалтер сидит в моем ящике, собирая пыль, но я верю, что мои монеты в безопасности дома.\n\n& # X200B;\n\n(lastbit - оставьте свои средства длительного хранения в холодном кошельке дома на безопасной зашифрованной карте micro-SD. Возьмите «горячий», но надежный кошелек для расходов в любом месте - Hodler работает с мобильным приложением без проводов. NB. Оба кошелька находятся на защищенных элементах! Пример: оставьте 99 BTC дома и возьмите с собой 1 BTC. В худшем случае потеряли свой кошелек? Нет проблем, резервное копирование дома или в 6 разных местах по всему миру, и никто не сможет взломать ваше устройство).\n\n& # X200B;\n\n1.1.1. Плюс, с чего бы ты это взял? Торговцы никогда не собираются покупать новый POS-терминал для приема биткойнов. Кто принимает крипто? \\ * (С этим решением - Все. Цель Hodlers - работать с ЛЮБОЙ машиной кредитных карт в мире, и вы можете расплатиться крипто, даже если торговец даже не узнает, что вы заплатили крипто.) \\ *\n\n& # X200B;\n\n1.1.1.1 Даже если кто-то принял криптографию, возможно ли сегодня расплатиться биткойнами? Ждете 1 час в очереди, чтобы купить кофе? \\ * (С помощью этого решения - мгновенные транзакции через LN) \\ *\n\n& # X200B;\n\nОставьте комментарий или сообщение в личку, если вы хотите поддержать это, работать с нами или быть большей частью этого.\n\n& # X200B;\n\nЛюбая помощь / обратная связь приветствуется.\n\n& # X200B;\n\nTLDR: Левая престижная магистерская программа для работы над криптографическим проектом. Превратился в компанию ([lastbit.io] (https://lastbit.io)). Можно использовать помощь сообщества, чтобы продвинуться дальше.\n\nРЕДАКТИРОВАТЬ: Спасибо за все комментарии всех, это был действительно довольно подавляющий ответ. Намного больше, чем я ожидал, и множество полезных отзывов от всех присутствующих. Да, нам нужно работать над брендингом, логотипом, объясняя проект в более простых терминах и названии устройства - Hodler явно не лучшая идея. Несколько классных предложений, еще раз спасибо! Будет продолжать держать всех, кто подписался, в курсе.\nЧто касается всех, кто спрашивает о вакансиях / открытых вакансиях, мы могли бы использовать опытного инженера по оборудованию / встраиваемым системам и / или специалиста по цифровому маркетингу. Мы изучаем возможность кикстартера финансировать это после минимальной бета-версии, и я полагаю, что маркетинг обязательно для успешной кампании.","title":"I started working with bitcoin when I was 21, left my Masters in CS from ETH Zurich and today I have a small crypto hardware company whose only goal is to truly enable mass adoption!","subreddit_name_prefixed":"r/CryptoCurrency","ups":987,"created":1547116597,"link_flair_background_color":"","id":"aeeipa","author":{"name":"shadow12348"},"permalink":"/r/CryptoCurrency/comments/aeeipa/i_started_working_with_bitcoin_when_i_was_21_left/","url":"https://www.reddit.com/r/CryptoCurrency/comments/aeeipa/i_started_working_with_bitcoin_when_i_was_21_left/","created_utc":1547087797}