{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"[Tron Accelerator] (https://tronaccelerator.io/) - это (предположительно) конкурс стоимостью $ 1 млн для разработчиков TRX dapp. Будучи человеком, который был очень активным во всех сценах блокпейна, я наблюдал за этим. Я решил опубликовать это здесь, чтобы вы, ребята, могли помочь собрать все вместе.\n\nВ основном, тонны предполагаемых призов USDT для людей, которые выиграют, разрабатывая на TRX. Это главная причина, по которой некоторые разработчики Eth решили портировать игры на TRX. Не потому, что они «прыгают с корабля», как хотят, чтобы вы верили шиллерам (на самом деле многие из них, которых я знаю лично, все еще планируют продолжить разработку Eth). Они просто хотели получить часть призов конкурса, и довольно просто положить eth dapp на tron.\n\nВо всяком случае, вчера должен был быть, когда они определяют победителей. Результаты не были объявлены, и люди начали беспокоиться. Наконец сегодня они сказали, что по электронной почте все победители. Внутри письма включено следующее:\n\n> В связи с неожиданно большим объемом конкурсных проектов мы внесли некоторые коррективы в структуру призов, одним из которых является награждение более 100 проектов вместо 56 проектов. Более подробная информация будет объявлена в ближайшее время. Пожалуйста, не переключайтесь:)\n\nОчевидно, они решили изменить призовые выплаты, опустив самый низкий приз до 1 тыс. Долларов вместо 5 тыс. Долларов. Многие люди были расстроены из-за этого разногласия в официальном разногласии по поводу того, что их обманули. Некоторые даже думают, что происходит нечто более глубокое. Например, один кандидат на должность супер-представителя:\n\n> Никто даже не знает, что они выплатят полные 1 000 000, я могу гарантировать, что они не будут. Они не выплатили всю сумму в прошлом конкурсе. Они не сокращают суммы призов, потому что так много людей, якобы, вошли, они сокращают их, потому что они не заплатят всю сумму. 100 победителей - не лучше 57, когда большинству этих победителей потребовалось 30 минут, чтобы изменить свой существующий умный контракт в сети. Вы можете сделать все оправдания, которые хотите, или попытаться увидеть в этом пользу, но вы лжете только себе. Когда мы выиграли $ 75 000, мы не были счастливы, потому что 100 победителей были лучше, чем 57. Они даже не выбрали победителей для некоторых призов.\n\n& # X200B;\n\nБыли некоторые люди, которые сказали, что получили электронное письмо и выиграли 1 тыс. Долларов, но что интересно, никто не выходил на публику, говоря, что они выиграли большой приз. После некоторой паузы мы нашли этот пост [instagram] (https://www.instagram.com/p/BsgCyyGAHv-/), по-видимому, какого-то случайного человека, связанного с «STOken Studio», который, кажется, выиграл приз в $ 200 000. Не пытайтесь гуглить, ничего не подойдет. Все, что мы смогли найти об этом таинственном проекте, это этот [смущающе пустой github] (https://github.com/chews/stoken) всего с 3 коммитами \\ [edit: он был удален или сделан приватным через 1 день после создания этого сообщение \\], и это [https://stokenstudio.firebaseapp.com/](https://stokenstudio.firebaseapp.com/). [Умный код контракта] (https://github.com/chews/stoken/blob/master/contractAgent/chalicelib/STOken.sol) не существует, и если веб-сайт даже что-то делает, он, похоже, находится в тестовой сети shasta. После анализа один из кандидатов в СД из раздора шутит, что этот «dapp» - просто плагин Microsoft Word.\n\nКроме того, в часто задаваемых вопросах на веб-сайте Tron Accel четко говорится, что участники должны быть в сети:\n\n> Могу ли я разработать DApp, который не использует смарт-контракты, но использует TRX?\n>\n> Да, вы можете. Это нормально для вас, чтобы не использовать TVM, но вы должны быть в сети.\n\nПомимо главного приза, некоторые другие забавные вещи: один разработчик решил клонировать «Креветочную ферму» от эт до трона, просто как эксперимент. Удивительно, но он получил громадный объем, несмотря на то, что был простой игрой понци. Это привело к огромному количеству клонов на Tron, включая Tron Anthills, Crocs и многих других. Удивительно, но хотя у Tron Shrimp явно больше всего пользователей, пользователей и пользователей, он не выиграл приз. НО ОДИН ИЗ КЛОНОВ ЭТОГО КЛОНА СДЕЛАЛ! Разработчик Anthills \"diego\" сообщил своему сообществу, что он был одним из победителей!\n\n** Подводя итог, пока: **\n\n* Они поменяли призы * после * окончания конкурса\n* Они позволили клонам победить, но не оригинальному клону на TRX\n* Они позволили победителям, которые не соответствовали критериям (находясь в сети)\n* Они позволили победить проектам с открытым исходным кодом\n* Grand Winner - загадочный проект, в котором практически нет информации\n* Они не опубликовали публичный список победителей.\n* Некоторые откровенные игры Понзи выиграли призы\n\nЕсли вы хотите посмотреть, как все это разворачивается вживую, вы можете найти дискографию Tron dev [здесь] (https://np.reddit.com/r/Tronix/comments/a254am/in_1_months_time_the_tron_discord_channel_has/) и перейти на канал #tronaccelerator. Тонны FUD в настоящее время приносят попкорн. Будет интересно посмотреть, публикуют ли они когда-нибудь публичный список победителей или просто задерживают его в надежде, что люди в конце концов перестанут говорить об этом\n\n** Обновление **: один из официальных судей (Vincent, Dapp.review) появился в разногласиях. Некоторые из его комментариев:\n\n> Я думаю, что они сделали проверку перед отправкой судьям. Я не видел все представленные dapps\n>\n> Список, который мы получили, меньше 40 даппов, я думаю, это большой приз…\n>\n> Нет, у меня нет окончательных результатов\n\nКак ни парадоксально, это было электронное письмо, которое некоторые разработчики получили от Tron Accelerator:\n\n> Уважаемые разработчики TRON! Это письмо предназначено для того, чтобы уведомить вас о том, что до этого момента финальные призы TRON Accelerator были объявлены уже по электронной почте. Мы хотели бы поблагодарить вас за ваш напряженный труд и энтузиазм в разработке ваших приложений для приложений в течение последних 5 недель. ! В связи с неожиданно большим объемом конкурсных проектов мы внесли некоторые коррективы в структуру призов, одним из которых является награждение более 100 проектов вместо 56 проектов. Более подробная информация будет объявлена в ближайшее время. Пожалуйста, следите за обновлениями :) Еще раз спасибо,\n\nДобавление в список:\n\n* Был проведен «показ» еще до того, как dapps были переданы судьям (кем? На основании чего?)\n* Один из судей сам не имеет окончательных результатов, но в электронном письме утверждается, что все призы были объявлены по электронной почте.","title":"Something fishy is going on with the Tron Accelerator $1m developer contest","subreddit_name_prefixed":"r/CryptoCurrency","ups":1007,"created":1547292258,"link_flair_background_color":"","id":"af3fuj","author":{"name":"9hil"},"permalink":"/r/CryptoCurrency/comments/af3fuj/something_fishy_is_going_on_with_the_tron/","url":"https://www.reddit.com/r/CryptoCurrency/comments/af3fuj/something_fishy_is_going_on_with_the_tron/","created_utc":1547263458}