{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Я собираюсь помочь объяснить этот феномен, потому что именно так крупные игроки входят или выходят на рынок. Таким образом, они создают необходимую им ликвидность, устраняя проскальзывание, которого они не хотят. В последнее время у меня было несколько человек, которые совершенно не понимали этого, и я подумал, что может появиться много новых инвесторов (не только крипто, но и рыночных инвесторов), которые могли бы извлечь выгоду из подробного объяснения этого маневра.\n\nЭто не попытка получить прибыль. Это не инструмент для дневной торговли. Это инструмент входа в рынок (стена для продажи) или инструмент выхода из рынка (стена для продажи).\n\nПоговорим сначала продать стены.\n\nВы пытаетесь купить столько, сколько можете, не меняя цену. Ваша цель - снизить среднюю стоимость огромной покупки за 10 миллионов долларов. Таким образом, вы тратите 1 млн. На прилавок и выставляете его в качестве стены продажи, а затем покупаете следующие 10 млн. У людей, которые подрывают вашу стену продажи, напуганные, потому что они думают, что это безумное давление продаж. Это не так, это просто выглядит так. Вы открываете ликвидность, паникуя людей, которые теперь продают вам. Вы можете потерять эту стену продажи на 1 млн., Но за это время вы подобрали 10 млн. Подрезчиков и сделали это, не повышая цену товара, который вы покупали, что вы сделали бы, если бы просто купили 10M на рынке. , Конечно, вы хотели бы купить внеклассные 10М, но если доступен только 1М, то именно так вы можете использовать эти первые 1М на 9М больше.\n\nОпять же, это очень известный инструмент, который используют крупные игроки, и он не имеет ничего общего с крипто. Это происходит каждый день на фондовом рынке.\n\nЭто не работает на бычьем рынке, потому что люди будут покупать через эту стену 1М. Но в то же время вам все-таки удалось сократить вход, выкопав столько, сколько вы могли, даже если это было всего 1,5 млн., Это все еще работало.\n\nНа медвежьем рынке или боковом рынке (и ваша стена сама по себе создает стабильность до тех пор, пока она не пробита), вы можете поднять намного больше, чем ваша стена, просто выплескивая подрезатели.\n\nЭта тактика такая же старая, как и рынки. Это не какая-то фантазия, которую я придумал, это происходит каждый день, особенно на небольших рынках, таких как крипто. Крипто растет и объем внушителен, но это все еще арахис по сравнению с попытками сделать это с помощью амазонского запаса, или золота, и т. Д.\n\nТак что лучше всего работает на боковых или слегка медвежьих рынках. Это огромная стена для продажи, которая выглядит ужасающе, но на самом деле это очень бычий индикатор. И это не только я и мое мнение, иди посмотри \"продают ли стены медвежьи или бычьи\".\n\nОбратное тоже верно ...\n\nКупить стены\n\nМассивная стена покупки выглядит так, как будто кто-то действительно хочет (и она * может * быть настолько простой), и похоже, что цена не упадет ниже, потому что она должна проникнуть через эту стену. В действительности, если стена для покупок - это какой-то кит, который использует капитал в 1 млн., Чтобы поддерживать высокую цену, в то время как он продает свой стек в 10 млн. Людям, прыгающим за него, чтобы купить, то это на самом деле большая стена для покупок, но на самом деле происходит продажа на 10 млн. давление. Он пытается выйти из позиции 10М без падения цены, как он. Затем, когда его 10M ушел, он просто вытаскивает все, что осталось от стены покупки, рынок продает это, и он ушел, не сильно двигая цену.\n\nЯ знаю, что это была стена текста, но, надеюсь, это объясняет, что стены покупают и продают, и почему они часто рассматриваются как противоположные признаки того, о чем вы изначально думаете о них. Это относится к фондовому рынку, а не только к крипто.","title":"Понимание того, как покупают и продают стены, и почему они указывают на противоположное тому, что вы думаете, они делают. Это рынок 101, но я думаю, что многие люди не понимают этого, поэтому я собираюсь помочь объяснить это.","subreddit_name_prefixed":"r/CryptoCurrency","ups":959,"created":1547941599,"link_flair_background_color":"","id":"ahn4jr","author":{"name":"Suuperdad"},"permalink":"/r/CryptoCurrency/comments/ahn4jr/understanding_how_buy_and_sell_walls_work_and_why/","url":"https://www.reddit.com/r/CryptoCurrency/comments/ahn4jr/understanding_how_buy_and_sell_walls_work_and_why/","created_utc":1547912799}