{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Несколько дней назад кто-то писал о том, что, хотя он перевел BTC с игрового сайта на собственный кошелек и только потом на Coinbase (или какой-либо другой централизованный обмен), обмен перехватил BTC и / или начал спрашивать вопросов.\n\nВчера был поток монстров, жалующихся на навязчивые вопросы KYC от Bitstamp.\n\nЯ не понимаю\n\n** Вы много используете прозрачные (без конфиденциальности) блокчейны И жалуетесь на то, что ваши транзакции могут, иметь и активно отслеживаются?! **.\n\n** Вы используете централизованные биржи, которые в силу закона ТРЕБУЮТСЯ, чтобы шпионить и сообщать о вас, И вы жалуетесь, что они изнасиловали вашу конфиденциальность? **.\n\nСерьезно, пора просыпаться.\n\nЧетвертый рейх растянулся по всей планете. Проводники прослушиваются, ваша интернет-активность регистрируется, ваше местоположение мобильного телефона и метаданные сохраняются и автоматически анализируются, ваши банковские транзакции / история уже давно стали честной игрой, и ...\n\n**Что вы ожидали** ?\n\nЧто бы ваши крипто транзакции не были? ** на прозрачном блокчейне ** ?!\n\nПроснуться.\n\nСилами, которые были трудолюбивы, в течение многих лет приходилось отчитываться за каждый свой цент, которым вы владеете, под видом борьбы с отмыванием денег и борьбой с терроризмом.\n\nУ нас был [FATCA] (https://en.wikipedia.org/wiki/FATCA), и теперь у нас есть [CRS] (https://en.wikipedia.org/wiki/Common_Reporting_Standard), конфиденциальность банка была серьезно подорвана За последнее десятилетие конфискация гражданских активов станет чем-то особенным в Европе (США уже давно оказались в этой кроличьей норе, почему-то я сомневаюсь, что правоохранительные органы США откажутся от такой сладкой сделки), крупной «первой мировой» «правительства продвигают концепцию безналичного общества, как будто она выходит из моды, и ..\n\n**Что вы ожидали** ?\n\nЧто они оставят крипто, где ВЫ можете быть банком, где вы НЕ зависите от третьих лиц, которые обрабатывают (и, таким образом, контролируют, цензируют и отслеживают) ваши транзакции, в одиночку?\n\nДавай.\n\nПосмотрите на новый AMLd 5, прямо изо рта лошадей, они очень хотели бы знать каждый крипто-адрес, который принадлежит вам - и всем остальным - хорошо, учитывая прозрачную природу большинства блокчейнов, и вы можете делать ставки на будущие законы если обработчики платежей и продавцы обмениваются данными о платежах (адресами и т. д.) с правительством, вы можете поспорить, что со временем правительство узнает всех, кому вы отправляете крипто, и что вы платите крипто.\n\n\n**Послушай**.\n\nЕсли вы не хотите, чтобы криптовалюта пошла по пути Интернета после 9/11 (массовое наблюдение), пришло время узнать о ** технологии сохранения конфиденциальности **.\n\nИрония этого подпрограммы заключается в том, что это будет выглядеть как шиллинг или что-то в этом роде, но, поверьте мне, меня очень мало волнует, какую технологию / монету криптовалюты мы в итоге примем, поскольку она помогает нам сохранять конфиденциальность и анонимность.\n\nЕсли вы думаете, что P & A предназначен только для преступников, вы сильно заблуждаетесь. Единственное, к чему может привести общество без P & A, - это тоталитарное общество, где правительство и крупные корпорации знают каждый ваш шаг и имеют огромный контроль над вашей жизнью. ** Посмотрите на то, что сегодня происходит в Китае с системой социального кредитования, вот что нас ждет, ЕСЛИ НЕ **.\n\nЕсли только вы не перестанете платить за все своей глупой дебетовой картой. ** Используйте наличные, фс. Используйте это или потерять его. **\n\nЕсли только вы не перестанете платить за вещи в Интернете со 100% прозрачной криптовалютой, удобной для наблюдения. ** Используйте Monero, FFS, транзакции стоят меньше, чем цент **.\n\nА ты думаешь я шиллинг? Отлично, тогда сделайте свое собственное исследование, посмотрите на Zcash, Dash, и не дай бог Верже, но я говорю вам, Monero - лучший выбор прямо сейчас.\n\nБольшинство из вас слишком привязаны к этому материалу, кого это волнует, пока оно работает, и оно ЗАЩИЩАЕТ НАШИ ПРАВА.\n\nБиткойн нет, я надеюсь, ты это видишь. Возможно, однажды это произойдет, но я нахожу это очень сомнительным (хотя хотелось бы ошибаться), потому что Биткойн по праву очень консервативен с изменениями протокола. И конфиденциальность отказа (как Monero) была бы совсем изменением.\n\n\n** Я действительно, действительно советую ** подумать о том, как будет выглядеть будущее, лишенное личной жизни. И потом, ради вас, ради меня и ради наших детей, я действительно предлагаю вам долго и усердно подумать, хотите ли вы быть частью этого мира или нет.\n\nЭто не неизбежно, но тоталитарное течение очень сильно в этот момент. Если это не вызовет сомнений, такие меры будут только расширяться.\n\nЭто идет ** путь, далеко за пределы ** крипто-лун, большой прибыли, и все такое.\n\nЯ надеюсь, что вы можете видеть это, и я надеюсь, что вы также * сделаете что-нибудь с этим.\n\nhttps://coincenter.org/entry/we-must-protect-our-ability-to-transact-privately-online\n\n\nЯ закончу с этим.\n\nБудут те, кто скажет, что нам нужны такие правила для предотвращения терроризма и отмывания денег, и что такие меры в определенной степени эффективны в борьбе с такими проблемами.\n\nМой ответ на это таков: если бы вы поручили всем носить телекамеру, постоянно записывающую все, преступление также наверняка уменьшится. Если вы находитесь под наблюдением 24/7, то, конечно, вы корректируете свое поведение и, скорее всего, воздержитесь от преступной деятельности.\n\nНо какой социальной ценой? Во что обходится человеческому достоинству?\n\nЯвляемся ли мы детьми, управляемыми влиятельным папиным правительством, которое требует отчитываться за каждый цент, * потому что мы, возможно, были непослушными *?\n\n**Понимаю это**. Представление о том, что «этот человек МОЖЕТ быть террористом или МОЖЕТ помогать террористам в финансовом отношении» или «этот человек МОЖЕТ отмывать незаконно полученные деньги», по своей природе является параноидальным, подозрительным по умолчанию.\n\nЭто делает каждую транзакцию, каждого человека подозрительной по умолчанию.\n\nМне это не кажется вменяемым дефолтом.\n\nЭто тоталитарное проявление.\n\nМожете ли вы представить ту же логику, примененную в другом месте? «Мы не можем позволить им иметь зашифрованные сообщения, поскольку они МОГУТ быть террористами, или МОГУТ общаться с террористами, или они МОГУТ распространять« ненавистную »речь).\n\nНу, на самом деле, я думаю, мы можем себе это представить, благодаря Австралии.\n\nНо вы видите, к чему это приведет? Это приводит к тому, что все обнажаются, хотят они того или нет, это вызывает подозрения у тех, кто предпочитает сохранять скромность, приводит к запугиванию и неправильному применению государственной власти.\n\nЭто увеличивает состояние и сокращает человека. И, таким образом, это против свободы.\n\nМожете ли вы представить, что на заре эры интернета нам всем приходилось спрашивать у правительства папы разрешение связаться с кем-либо онлайн, потому что они МОГУТ быть террористами, МОГУТ быть преступниками? Насколько это душило бы прогресс, инновации и межкультурное взаимопонимание?\n\nА теперь представьте, что вам придется отвечать за каждый раз, когда вы решаете отправить 200 долларов своему хорошему другу в России, Парагвае или Конго.\n\nВы МОЖЕТЕ отмывать деньги, он МОЖЕТ быть преступником.\n\nВопросы будут заданы.\n\n\nЭто будущее, частью которого вы хотите стать?\n\nНет, я тоже.\n\nТак что сделай что-нибудь с этим. Cегодня.\n\nКак обычно, DYOR, но я рекомендую Monero.\n\nКогда речь идет о защите финансовой конфиденциальности, это лучший инструмент, который у нас есть на сегодняшний день. Будет ли это так или нет, я не знаю.\n\nНо я знаю следующее: мир, в котором финансовая конфиденциальность запрещена, потому что «преступники тоже этого хотят», - это мир, в котором свобода человека строго ограничена.\n\nИ мне нравится моя свобода.\n\nВы?","title":"What did you expect?","subreddit_name_prefixed":"r/CryptoCurrency","ups":310,"created":1551111763,"link_flair_background_color":"","id":"auiwpz","author":{"name":"xmr_karnal"},"permalink":"/r/CryptoCurrency/comments/auiwpz/what_did_you_expect/","url":"https://www.reddit.com/r/CryptoCurrency/comments/auiwpz/what_did_you_expect/","created_utc":1551082963}