{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Прежде всего, я хотел бы начать с того, что людям действительно нужно больше исследовать. Этот саб так сильно отличается от того, когда я начинал в 17 году. Еще в 2017 году люди были очень полезны и фактически слушали то, что должны были сказать другие. Прямо сейчас вас атакуют или называют «FUDster», когда вы просто пытаетесь что-то объяснить людям. Даже не начинайте меня с крипто-трибализма, где, если вы говорите «мне нравится монета х», вы - шилл, и на вас нападают все другие племена.\n\nЖаль, потому что я нашел этот сабвуфер очень полезным, когда начал сам.\n\n\n\nВ любом случае, о чем эта тема?\n\n\n\nПомните, когда Binance ([CZ tweet]  (https://twitter.com/cz_binance/status/1123048279124500480) ) говорил, что переводит свои средства на другой адрес с помощью * ** ОДНА БОЛЬШАЯ транзакция ***? Ну получается что не получилось! Первоначальный адрес был обработан примерно с 10 транзакциями на новый адрес. Но подождите, новый адрес на момент написания этой статьи имел * 42M Tether *, а оригинальный адрес имел более 780M! Так куда же делись остальные ?? Ответ: разные адреса, тысячи из них.\n\n\n\n[Это видео]  (https://www.youtube.com/watch?v=FAOX7Hcdrag&t=1s)  объясняет все это прекрасно и содержит все необходимые доказательства (перейдите к 1:00, если вы не хотите слышать вступление песни тролля). Пожалуйста, посмотрите видео, прежде чем называть меня FUDster или Shill или что-то еще. Вы, ребята, понятия не имеете, что происходит за кулисами, и человек на видео провел серьезное исследование. Нет смысла повторять все, что он говорит, в текстовой форме.\n\n\n\nЯ нахожу довольно подозрительным, что все это происходит в тот же период, когда Ифинекс переживает трудные времена. Компания-учредитель Bitfinex под названием Ifinex владеет как Tether, так и Bitfinex. Для людей, которые не знали, что Tether [получает иск]  (https://ag.ny.gov/press-release/attorney-general-james-announces-court-order-against-crypto -currency-company-under)  Генеральным прокурором штата Нью-Йорк за покрытие убытков в размере 850 миллионов долларов США.\n\nВсе это приводит к неопределенности, и неудивительно, что за последние пару дней из Битфинекса было выведено более 30 тыс. BTC, как вы можете видеть на фото ниже. Люди получают свои средства с биржи и помещают их в холодное хранилище / отправляют на другие биржи.\n\nhttps://i.redd.it/bg93u5zh8dw21.png\n\n«Это просто совпадение, чувак, о чем ты говоришь, перестань унывать, чувак. '\n\nХорошо объясните, почему выводится не только BTC, но и Ethereum, и ПОСМОТРИТЕ, сколько снимается. Это более 40% снятых за последнюю неделю на *** Ethereum ***. Ценовая помпа BTC, транзакции Binance Tether и расследование мошенничества NYSAG происходят одновременно, и никто не бросает глаз.\n\n\n\nhttps://i.redd.it/ylomp8aa9dw21.png\n\nКак я уже сказал, все отлично объясняется в [ЭТОМ]  (https://www.youtube.com/watch?v=FAOX7Hcdrag&t=1s)  видео. Youtuber под названием Chico Crypto провел огромное и серьезное исследование по этим темам. Было бы очень жаль, если бы эта тема была затоплена теми же старыми «обвинениями FUD» вместо конструктивной критики. Я за хорошие исследования и обсуждения, но факты показывают, что за кулисами происходят серьезные вещи.\n\nРедактировать: Я не уверен, почему моды расценили мою нить как вводящую в заблуждение. Поскольку все в порядке, никто в комментариях не смог найти недостающую 100-метровую привязь, а остальная часть саги bitfinex все еще стоит.\n\nКак я сказал в одном из моих комментариев, прежде чем я не ожидаю, что будет на 100% правильным. Мне просто нравится приносить вещи за стол обсуждения, чтобы иметь возможность говорить об этом. Мое намерение состоит в том, чтобы обсудить исследования друг с другом, что должно быть сделано в криптовалюте. Если я ошибаюсь, у меня все в порядке с этим, но как дела, все еще не ясно.","title":"BTC манипулирование ценами, киты и Binances 700M привязь «ход» (исследования)","subreddit_name_prefixed":"r/CryptoCurrency","ups":768,"created":1557082472,"link_flair_background_color":"#ff4500","id":"bkwgkm","author":{"name":"DontTrustJack"},"permalink":"/r/CryptoCurrency/comments/bkwgkm/btc_price_manipulation_whales_and_binances_700m/","url":"https://www.reddit.com/r/CryptoCurrency/comments/bkwgkm/btc_price_manipulation_whales_and_binances_700m/","created_utc":1557053672}