{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Вы думаете, что будете ходить, вы говорите, что будете ходить, но вы не будете.\n\nВот в чем дело, я не знаю дерьмо, а ты не знаешь дерьмо. Итак, теперь, когда мы оба уравновешены, вы и я оба согласны, что мы дерьмовые мозги, которые не знают, что произойдет на рынке, давайте поговорим о психологии.\n\nКогда BTC 2x, 3x или 5x, ваш маленький пипи станет покалывать. Мемы будут течь, вы будете болтаться с большим членом в своей подвальной квартире с 1 спальней в \"восходящем\" районе города, когда вы будете проверять свой крипто-портфель несколько раз в середине ночи, пока люди, с которыми вы тусуетесь с которым приятно провести время, играя в форнт или что-то еще, в чёрт возьми, дети играют в эти дни\n\nНесмотря на то, что вы уже сказали, что вы «в этом надолго», вы все еще проверяете свое портфолио, как инстаграммер преследует людей на их графике.\n\nПочему, черт возьми, вы проверяете цены каждые 15 минут, если вы долгое время ходите?\n\nВ конечном итоге pass10k.gif вернется после выхода на пенсию, и вы будете подбирать цвета для своего ламбо из своих вложений в 100 долларов в бит-монеты.\n\nТогда это произойдет. Никто не знает, когда, но все, что нужно, это внезапный прилив краткосрочных трейдеров, чтобы продать и разрушить ваши жесткие успехи.\n\nВы поспешите на свой любимый сайт с дерьмовыми постами и расскажете всему миру: «Я только что вырос в 3 раза, теперь BTC снизился на 50% за последнюю неделю! Что происходит? Это опять этот чертов кит, не так ли ?!»\n\nНесколько человек скажут вам продолжать: «Это только начало», - говорят они. Но ты умнее этого. Вы только что провели 3-кратное увеличение, а затем потеряли 50% от этого. Вскоре вы получите подтверждение от пары редких редакторов: «Сумасшедший, 3х выигрыши - это не то, на что чихать. Герп, вам нужно было продать, а затем перекупить во время этой коррекции, и вы бы удвоили свой стек, ура».\n\nВы будете думать: «Ух ты, твоя ретроспективная оценка абсолютно правильна. В следующий раз, когда это произойдет, я буду готов и буду предсказывать рынок со 100% точностью. Я скажу, что я долгосрочный ходок, но я» Я буду проверять цены 20 раз в день, надеясь идеально рассчитать верх и низ. Я очень устойчивый гений ».\n\nЗатем у BTC будет небольшой отскок на 15% на следующей неделе. Вы найдете кого-то, с кем вы согласны, в Trading View, который скажет всем: «Он собирается протестировать поддержку дерьма на уровне дерьма 0,69. Метод вывода на нас, есть шанс 420%, что я прав, и .007 шанс, что я ошибаюсь. Я не твой финансовый консультант, я просто парень, который шиллинг мои идеи в надежде получить достаточную поддержку, чтобы повлиять на рынок. Нет сговора! \"\n\nВы продадите, рынок отскочит вверх еще на 20%, вы будете фомо, рынок увеличится еще на 50%. Вы будете продавать с еще одной потерей, она упадет еще на 10%, и вы прибегнете к Reddit: «Я знал, что он упадет, поэтому я продал! Я просто заработал на 10% больше, продав»… но вы не на самом деле еще не покупал, потому что вы думаете, что он будет падать немного дальше.\n\nВы не скажете людям, что вы также только что потерпели крушение в предыдущие 4 раза, делая это, и вы упали более чем на 70% во время бычьей пробежки, потому что вы продолжали пытаться рассчитывать время на рынке.\n\nИз тех, кто читает это сейчас, я думаю, ** в лучшем случае **, только 1 из каждых 100 человек будет на самом деле DCA или просто проведет следующую бычью пробежку.\n\nИх будет несколько, и я говорю о многомесячных встряхиваниях по пути к БТД.\n\nЯ не думаю, что у 99% людей есть терпение и воля к тому, чтобы пройти через завоевания и массовые распродажи.\n\nВы здесь сейчас, вы прошли через медвежий рынок. Но видеть успехи - это совсем другой зверь. Я подозреваю, что как только вы столкнетесь с 3-м или 4-м основным встряхиванием после 3х, 5х, 6х прибылей, я говорю о действительно огромных 50-75% распродажах за несколько дней, что вы не сможете долго пережить это.\n\nНекоторые вкладывают сюда от 10 000 до 50 000 долларов. Представьте себе, что за год у вас будет 2x, 3x или 5x. Затем вы теряете 70% своей прибыли за неделю.\n\nЭто реальная возможность, несколько раз. Независимо от того, вложили ли вы 100, 1000 или 50 000 долларов сюда во время медвежьего рынка, вам нужно подготовиться к тому, что через неделю вы почувствуете себя совершенно обескураженным.\n\nНекоторые из нас получат, что их 20 000 долларов превратятся в 80 000 или 100 000 долларов, а затем упадут до 30 000 или 25 000 долларов в следующие 12-18 месяцев.\n\nПредставьте, что это происходит многократно, это 3-6x, а затем теряется 70% от этой прибыли, многократно за относительно короткий период времени. Представьте себе консолидацию в течение нескольких месяцев после распродажи, затем еще одну встряску после того, как вы просто хотели, чтобы вы продали.\n\nОглядываясь назад, приятно взглянуть на график и сказать: «Уменьшить масштаб», но пройти через него гораздо сложнее, чем просто посмотреть на историю из графика.\n\nВы сможете выполнить 1 или 2 распродажи, но в какой-то момент у вас будет напряженная неделя или напряженный месяц в ближайшие несколько лет. это совпало с массовой распродажей, и вы будете сидеть там и думать: «Черт, мне было бы лучше просто продать в прошлый раз. Это дерьмо слишком стрессовое».\n\nК сведению, нет ничего плохого в том, чтобы продавать по 2x, 3x или 5x или как угодно, но я по-прежнему скептически отношусь к тому, что люди на самом деле будут идти к вершине или к вершине следующего бычьего рынка, пусть одна возможность предсказывать, когда и где это находится. Еще меньше среди нас будет DCA на всем протяжении и продавать по любой следующей вершине.\n\nЭто жестокая игра, и вы не сделаете ее невредимой. Большинство потерпит неудачу из-за отсутствия планирования.\n\nДокажите, что я не прав, товарищи по делам и DCAers.\n\nДокажи, что я чертовски неправ.\n\n** TL; DR **: Комментарий основан на заголовке, иначе читайте дерьмо.\n\n* Редактировать: для справки, я не знаю, дерьмо, но я думаю, что вершина следующего бычьего рынка будет от $ 180 000 до $ 225 000. Я понятия не имею, что происходит между сейчас и потом. Вы тоже не И, опять же, я не знаю, что это действительно получится, но мои паучьи чувства говорят мне об этом. Я ожидаю, что это будет около августа 2021 года и января 2022 года. Через несколько лет. К этому моменту у меня будет только около 50% моего стека, потому что у меня есть определенные интервалы, которые я продаю, потому что я знаю, что могу ошибаться; опять же, я не знаю дерьмо, поэтому я буду продавать, когда достигну определенных целей. Я буду DCA в течение большей части пути, и я увижу вас всех в крипто-аду независимо от вас, грязные случайные люди. *","title":"99% из вас не выдержат весь следующий пробег","subreddit_name_prefixed":"r/CryptoCurrency","ups":2281,"created":1557605383,"link_flair_background_color":"","id":"bnbdyi","author":{"name":"KnownCoder"},"permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/","url":"https://www.reddit.com/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/","created_utc":1557576583,"replies":[{"ups":955,"link_id":"t3_bnbdyi","replies":[{"ups":9,"link_id":"t3_bnbdyi","id":"en500f2","author":"paulgnz","parent_id":"t1_en4jj01","subreddit_id":"t5_2wlj3","body":"I was just thinking about this South Park episode. Nice","body_html":"<div class = \"md\"> <p> Я просто думал об этом эпизоде ​​в Южном парке. Nice </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en500f2/","name":"t1_en500f2","created":1557627834,"created_utc":1557599034,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en48qri","author":"willzyx01","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"When it goes up, I'm in it for the lambos. \n\nWhen it tanks, I'm in it for the technology. \n\nBoth are good for bitcoin.","body_html":"<div class = \"md\"> <p> Когда он поднимется, я в нем за ламбосов. </Р>\n\n<p> Когда это танки, я в нем ради технологий. </Р>\n\n<p> Оба хороши для биткойнов. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en48qri/","name":"t1_en48qri","created":1557610135,"created_utc":1557581335,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1206,"link_id":"t3_bnbdyi","replies":[{"ups":11,"link_id":"t3_bnbdyi","id":"en4pj2e","author":"scsibusfault","parent_id":"t1_en4hcuj","subreddit_id":"t5_2wlj3","body":"Loan me 20x that and I'll give it a shot.","body_html":"<div class = \"md\"> <p> Одолжи мне 20 раз, и я попробую. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4pj2e/","name":"t1_en4pj2e","created":1557621476,"created_utc":1557592676,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en447l9","author":"CarpetThorb","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I watched a $325k portfolio go down to 6k I think my little pee pee can handle anything.","body_html":"<div class = \"md\"> <p> Я наблюдал, как портфель за $ 325 тыс. снизился до 6 тыс. Я думаю, что моя маленькая пи-пи может справиться с чем угодно. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en447l9/","name":"t1_en447l9","created":1557606839,"created_utc":1557578039,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":165,"link_id":"t3_bnbdyi","replies":[{"ups":29,"link_id":"t3_bnbdyi","replies":[{"ups":3,"link_id":"t3_bnbdyi","replies":[{"ups":3,"link_id":"t3_bnbdyi","id":"en82uof","author":"MrMogz","parent_id":"t1_en7jzg0","subreddit_id":"t5_2wlj3","body":" ( ͡° ͜ʖ ͡°)","body_html":"<div class = \"md\"> <p> (͡ ° ͜ʖ ͡ °) </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en82uof/","name":"t1_en82uof","created":1557702624,"created_utc":1557673824,"subreddit_name_prefixed":"r/CryptoCurrency","depth":6}],"id":"en70404","author":"el_covfefe","parent_id":"t1_en6ouc4","subreddit_id":"t5_2wlj3","body":"Could still be in the sock.","body_html":"<div class = \"md\"> <p> Может быть в носке. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en70404/","name":"t1_en70404","created":1557674574,"created_utc":1557645774,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"en4gxi7","author":"hurpleflurple","parent_id":"t1_en4dgf6","subreddit_id":"t5_2wlj3","body":"I laughed. All good crypto should be stored in your sock drawer.","body_html":"<div class = \"md\"> <p> Я засмеялся. Все хорошие криптографии должны храниться в вашем ящике с носками. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4gxi7/","name":"t1_en4gxi7","created":1557615766,"created_utc":1557586966,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":17,"link_id":"t3_bnbdyi","id":"en4irs7","author":"git_world","parent_id":"t1_en4dgf6","subreddit_id":"t5_2wlj3","body":"Looking at the trading on binance and the fact that they have suspended withdrawal/deposit for a week makes me worried. All these users have their cryptoassets on the exchange.","body_html":"<div class = \"md\"> <p> Меня беспокоит то, что торговля бинарными операциями приостановлена ​​на неделю. Все эти пользователи имеют свои крипто-активы на бирже. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4irs7/","name":"t1_en4irs7","created":1557617025,"created_utc":1557588225,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":28,"link_id":"t3_bnbdyi","replies":[{"ups":18,"link_id":"t3_bnbdyi","id":"en5pwkd","author":"NedDeadStark","parent_id":"t1_en54mt2","subreddit_id":"t5_2wlj3","body":"This story is wilder than crypto","body_html":"<div class = \"md\"> <p> Эта история более дикая, чем крипто </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en5pwkd/","name":"t1_en5pwkd","created":1557641930,"created_utc":1557613130,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4},{"ups":9,"link_id":"t3_bnbdyi","id":"en5rrej","author":"GilfOG","parent_id":"t1_en54mt2","subreddit_id":"t5_2wlj3","body":"Holding crypto on exchanges causes cancer!!","body_html":"<div class = \"md\"> <p> Проведение криптографии на биржах вызывает рак !! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en5rrej/","name":"t1_en5rrej","created":1557643066,"created_utc":1557614266,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4},{"ups":5,"link_id":"t3_bnbdyi","id":"en5sf90","author":"MakeTotalDestr0i","parent_id":"t1_en54mt2","subreddit_id":"t5_2wlj3","body":"typical crypto story","body_html":"<div class = \"md\"> <p> типичная крипто-история </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en5sf90/","name":"t1_en5sf90","created":1557643427,"created_utc":1557614627,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"en4fiph","author":"darkfroggy","parent_id":"t1_en4dgf6","subreddit_id":"t5_2wlj3","body":"NEVER hodling on exchanges NEVER","body_html":"<div class = \"md\"> <p> НИКОГДА не держитесь за биржи НИКОГДА </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fiph/","name":"t1_en4fiph","created":1557614799,"created_utc":1557585999,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en4529c","author":"MrCryptoBoi","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"If your coins are stored in a cold wallet its easy to hodl.","body_html":"<div class = \"md\"> <p> Если ваши монеты хранятся в холодном кошельке, его легко зайти. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4529c/","name":"t1_en4529c","created":1557607410,"created_utc":1557578610,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":93,"link_id":"t3_bnbdyi","id":"en4erbo","author":"[deleted]","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"&#x200B;\n\n* never sell your whole stack\n* never trade with your whole stack. not your keys not your crypto\n* if you have life changing amounts, you are a gambler if you hodl everything for bigger life changing amounts (lots of people have been thinking \"i should have, would have, could have\" everyday for the last year+)\n* scale out when the log chart goes parabolic, and your grandma and uber driver and katy perry are talking about bit coins. the difference between short term gains & long term gains is more than losing 90% of your principle. markets don't care about your timetable\n* take chunks of your profits out of crypto entirely & diversify, you can lockup a small percentage into defi and earn interest as a hedge to offset fomo\n* pay your taxes (optional?) and/or save money for a rainy day in fiat\n* set some low limit orders you don't think will hit on the way up and be patient\n* set some high limit orders on the way down to catch any fat finger trades\n* keep a few low orders on exchanges that still allow flash crashes and think of those as your reserves\n* don't talk to people about your gains","body_html":"<div class = \"md\"> <p> </p>\n\n<UL>\n<li> никогда не продавай весь свой стек </li>\n<li> никогда не торгуй всем своим стеком. не твои ключи, не твоя криптография </li>\n<li> если у вас есть количество, меняющее жизнь, вы - игрок, если вы предпочитаете все для больших количеств, меняющих жизнь (многие думали: «Я должен был бы иметь, мог бы иметь» каждый день в течение последнего года +) </li >\n<li> масштабируется, когда лог-карта становится параболической, а ваша бабушка и водитель uber и Кэти Перри говорят о битовых монетах. Разница между кратковременной прибылью и долгосрочной прибылью более, чем потеря 90% вашего принципа. рынки не заботятся о вашем графике </li>\n<li> полностью извлекая часть своей прибыли из крипто и диверсификации, вы можете ограничить небольшой процент в defi и заработать проценты в качестве хеджирования для компенсации fomo </li>\n<li> платите налоги (необязательно?) и / или сохраняйте деньги в дождливый день в указе </li>\n<li> установите несколько нижних лимитных ордеров, которые, как вы думаете, не достигнут успеха, и наберитесь терпения </li>\n<li> установил несколько верхних лимитных ордеров на пути вниз, чтобы поймать любые сделки с толстыми пальцами </li>\n<li> держите несколько низких заказов на биржах, которые по-прежнему допускают сбои флэш-памяти, и рассматривайте их как свои резервы </li>\n<li> не говорите с людьми о ваших достижениях </li>\n</UL>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4erbo/","name":"t1_en4erbo","created":1557614302,"created_utc":1557585502,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":157,"link_id":"t3_bnbdyi","replies":[{"ups":5,"link_id":"t3_bnbdyi","id":"en4atcq","author":"mr_li_jr","parent_id":"t1_en49wvv","subreddit_id":"t5_2wlj3","body":"Right. I'll keep hold of something so if it keeps going up I get to ride it. If it drops, I can rebuy with my profits.","body_html":"<div class = \"md\"> <p> Верно. Я буду держаться за что-то, поэтому, если оно будет продолжать расти, я буду ездить на нем. Если он упадет, я смогу выкупить свою прибыль. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4atcq/","name":"t1_en4atcq","created":1557611717,"created_utc":1557582917,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en47bh1","author":"mr_li_jr","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Nothing wrong with taking some profit when you're winning.\n\nI have certain points where I'm planning to cash out a portion.\n\nIf we see another parabolic rise and fall, I'm sure I won't have made the absolute best of it, but as long as I'm up, I'm fine with that, too.","body_html":"<div class = \"md\"> <p> Нет ничего плохого в том, чтобы получать прибыль, когда вы выигрываете. </p>\n\n<p> У меня есть определенные моменты, когда я планирую обналичить часть. </p>\n\n<p> Если мы увидим еще один параболический взлет и падение, я уверен, что я не смогу добиться абсолютного лучшего из этого, но пока я встаю, мне тоже хорошо. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en47bh1/","name":"t1_en47bh1","created":1557609023,"created_utc":1557580223,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":69,"link_id":"t3_bnbdyi","replies":[{"ups":15,"link_id":"t3_bnbdyi","id":"en4flso","author":"thevoteaccount","parent_id":"t1_en4bd32","subreddit_id":"t5_2wlj3","body":"This is why bubbles keep getting larger and larger. Human greed never changes. Seems like everyone's forgotten their lessons from the bear market already and swept away in Euphoria.","body_html":"<div class = \"md\"> <p> Вот почему пузыри становятся все больше и больше. Человеческая жадность никогда не меняется. Похоже, что все уже забыли свои уроки на медвежьем рынке и сметены в Euphoria. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4flso/","name":"t1_en4flso","created":1557614856,"created_utc":1557586056,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":40,"link_id":"t3_bnbdyi","replies":[{"ups":13,"link_id":"t3_bnbdyi","id":"en50d2r","author":"fastinguy11","parent_id":"t1_en4vdl2","subreddit_id":"t5_2wlj3","body":"Yea, well you can be smarter and be 10000 % instead.","body_html":"<div class = \"md\"> <p> Да, вы можете быть умнее и вместо этого быть на 10000%. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en50d2r/","name":"t1_en50d2r","created":1557628018,"created_utc":1557599218,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4},{"ups":3,"link_id":"t3_bnbdyi","id":"en50jps","author":"BrugelNauszmazcer","parent_id":"t1_en4vdl2","subreddit_id":"t5_2wlj3","body":"You have my respect and admiration, sir.","body_html":"<div class = \"md\"> <p> Вы уважаете и восхищаетесь, сэр. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en50jps/","name":"t1_en50jps","created":1557628114,"created_utc":1557599314,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"en4fif8","author":"BrugelNauszmazcer","parent_id":"t1_en4bd32","subreddit_id":"t5_2wlj3","body":"This. In the last bullrun, when it went from 3.5k to 19k to 6k to 3.5k HODLers made exactly 0 profit.\n\nThats 2017/7 to 2019/3!","body_html":"<div class = \"md\"> <p> Это. В последнем туре, когда он пошел с 3,5 тыс. До 19 тыс. От 6 до 3,5 тыс., HODLers получили ровно 0 прибыли. </P>\n\n<p> С 2017/7 по 2019/3! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fif8/","name":"t1_en4fif8","created":1557614793,"created_utc":1557585993,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":6,"link_id":"t3_bnbdyi","id":"en4fesj","author":"jd1izzle","parent_id":"t1_en4bd32","subreddit_id":"t5_2wlj3","body":"With a heavy dose of projecting on top","body_html":"<div class = \"md\"> <p> С большой дозой выступающего сверху </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fesj/","name":"t1_en4fesj","created":1557614725,"created_utc":1557585925,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":2,"link_id":"t3_bnbdyi","id":"en4fvyh","author":"SlappyMcFartsack","parent_id":"t1_en4bd32","subreddit_id":"t5_2wlj3","body":"No0b fortune tellers","body_html":"<div class = \"md\"> <p> Гадалки №0b </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fvyh/","name":"t1_en4fvyh","created":1557615039,"created_utc":1557586239,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en47rfi","author":"ZerohourX3","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Is this suppose to be some reverse psychology post?","body_html":"<div class = \"md\"> <p> Предполагается ли, что это какой-то пост по обратной психологии? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en47rfi/","name":"t1_en47rfi","created":1557609340,"created_utc":1557580540,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":24,"link_id":"t3_bnbdyi","id":"en4b39n","author":"BdayEvryDay","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"speak for yourself. I haven't sold anything since buying at the top in 2017. I have been dollar cost avg in since. I will keep buying for the next 20 years or so. This is my supplemental investment account.","body_html":"<div class = \"md\"> <p> говори за себя. Я ничего не продал с момента покупки на вершине в 2017 году. С тех пор я стоил в долларах в среднем. Я буду продолжать покупать в течение следующих 20 лет или около того. Это мой дополнительный инвестиционный счет. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4b39n/","name":"t1_en4b39n","created":1557611924,"created_utc":1557583124,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":48,"link_id":"t3_bnbdyi","replies":[{"ups":20,"link_id":"t3_bnbdyi","id":"en4nicy","author":"mETHaquaIone","parent_id":"t1_en4hd9m","subreddit_id":"t5_2wlj3","body":"My plan is obviously to eventually sell, but I figured to keep DCA'ing for 3 -5 years. My observation was that crypto is going through a series of exponential up-cycles followed by corrective down-cycles, with each down-cycle's bottom leaving us in a higher place than the previous. \n\nSo my plan since 2016 was always to DCA into promising projects based on fundamentals and hold for 3 -5 years, and then bail in one of the up-cycles that occurs towards the end of that timeframe. Im not a trader but Ive got a decent grasp on the tech, so rather than trying to time the markets I figured I'd get in early on handful of promising projects and try to build deep positions to hold for the medium/longterm, bailing in an up-cycle some years down the line. \n\nSo my plan was to ride these waves, Im just not sure I was prepared for the emotional havoc of a 90% drop :)","body_html":"<div class = \"md\"> <p> Мой план, очевидно, состоит в том, чтобы в конечном итоге продать, но я рассчитывал сохранить DCA в течение 3-5 лет. Мое наблюдение состояло в том, что криптозавод проходит серию экспоненциальных повышательных циклов, за которыми следуют корректирующие понижающие циклы, причем дно каждого понижающего цикла оставляет нас на более высоком месте, чем предыдущий. </Р>\n\n<p> Таким образом, с 2016 года я планировал включить DCA в многообещающие проекты, основанные на фундаментальных принципах и удерживать их в течение 3-5 лет, а затем внести залог в один из циклов повышения, который происходит ближе к концу этого периода. Я не трейдер, но я неплохо разбираюсь в технологиях, поэтому вместо того, чтобы пытаться рассчитывать рынки, на которые я рассчитывал, я рано попаду на горстку многообещающих проектов и попытаюсь построить глубокие позиции для удержания на средне / долгосрочный период, освобождая под залог в течение нескольких лет вниз по линии. </Р>\n\n<p> Так что я планировал кататься на этих волнах, я просто не уверен, что готов к эмоциональному хаосу падения на 90%:) </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4nicy/","name":"t1_en4nicy","created":1557620122,"created_utc":1557591322,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en49l91","author":"mETHaquaIone","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I have the DCA'ing and never selling strategy down - I entered in 2016 and Ive never fucking sold, all I do is buy.\n\nSo far this has not been a great strategy. 2018 was a PTSD-inducing horror show. I also happen to believe this strategy will be fruitful over the medium/longterm, but goddamn its an unpleasant way to live.","body_html":"<div class = \"md\"> <p> У меня есть стратегия DCA и никогда не продаю - я вступил в 2016 году, и я никогда не продавался, все, что я делаю, это покупаю. </p>\n\n<p> Пока что это не было хорошей стратегией. 2018 год был ужасным шоу, вызванным ПТСР. Я также считаю, что эта стратегия будет плодотворной в среднесрочной / долгосрочной перспективе, но, черт возьми, это неприятный способ жить. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49l91/","name":"t1_en49l91","created":1557610783,"created_utc":1557581983,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":14,"link_id":"t3_bnbdyi","id":"en49er9","author":"DropaLog","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":">You think you'll hodl, you say you'll hodl, but you won't.\n\nI will, honest! Proof: still hodling since BTC was worth just $11, that's why I'm still living in a \"1 bedroom basement apartment in the \"up and coming\" side of town as [I] check [my] crypto portfolio multiple times in the middle of the night\" :)","body_html":"<div class = \"md\"> <blockquote>\n<p> Ты думаешь, что будешь ходить, ты говоришь, что будешь ходить, но ты не будешь. </p>\n</BLOCKQUOTE>\n\n<p> Я буду честен! Доказательство: все еще суета, так как BTC стоил всего 11 долларов, поэтому я все еще живу в подвале с 1 спальней в \"восходящем\" районе города, так как [я] проверяю [мое] крипто портфолио несколько раз в середине ночи \":) </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49er9/","name":"t1_en49er9","created":1557610646,"created_utc":1557581846,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":26,"link_id":"t3_bnbdyi","replies":[{"ups":5,"link_id":"t3_bnbdyi","id":"en6abkk","author":"bone_shadows","parent_id":"t1_en4rz4c","subreddit_id":"t5_2wlj3","body":"Yup. That's the crazy thing about all of this. It's like seeing the future unfold imagine the ancient Roman heretics joking about going to heaven, \"as if any one can get to the skies ha!\" then next week they invent rockets and are going to the moon.","body_html":"<div class = \"md\"> <p> Да. Это сумасшедшая вещь обо всем этом. Это все равно, что увидеть разворачивающееся будущее, представьте, как древние римские еретики шутят о том, чтобы попасть на небеса, «как будто кто-то может попасть в небо, ха!» затем на следующей неделе они изобретают ракеты и отправляются на луну. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en6abkk/","name":"t1_en6abkk","created":1557653600,"created_utc":1557624800,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en4deo3","author":"cafeitalia","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I am holding until btc hits $1000000. I am sure it will hit $1M though, because someone said on Twitter and some TV show. They said Bitcoin will replace all currency in the world. No more Fiat they said. So I sold my Fiat, it was a nice car. Then they said it was not Fiat but fiat, so I bought more Bitcoin with the money I got from selling my Fiat for fiat. I will hold. Because everything will be Bitcoin one day. 99.9% of the population doesn't even know what a wallet is and how to have a secure one etc, but that is why it will replace everything. I also invested in crypto wallet companies. They will go up and up. I am looking for the day that I become a billionaire when Bitcoin hits $10,000,000,000. Hodl forever.","body_html":"<div class = \"md\"> <p> Я держу до тех пор, пока btc не достигнет 1000000 долларов. Я уверен, что он достигнет 1 миллиона долларов, потому что кто-то сказал в Твиттере и в телешоу. Они сказали, что Биткойн заменит всю валюту в мире. Нет больше Fiat, они сказали. Поэтому я продал свой Фиат, это была хорошая машина. Затем они сказали, что это был не Fiat, а Fiat, поэтому я купил больше биткойнов на деньги, полученные от продажи Fiat за Fiat. Я подожду. Потому что все будет биткойн в один прекрасный день. 99,9% населения даже не знают, что такое кошелек и как его иметь, и т.д., но именно поэтому он все заменит. Я также инвестировал в криптовалютные компании. Они будут идти вверх и вверх. Я ищу день, когда я стану миллиардером, когда Биткойн достигнет 10 000 000 000 долларов. Ходл навсегда. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4deo3/","name":"t1_en4deo3","created":1557613455,"created_utc":1557584655,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":22,"link_id":"t3_bnbdyi","id":"en48647","author":"RikkityR","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Na im finna just sell lol, fuck holding 5k - 20k back to 5k again, wanted to eat my own testicles, chew them up and spit them into a bowl of weetabix","body_html":"<div class = \"md\"> <p> На самом деле я просто продаю лол, трахаюсь, держа 5к - 20к, снова до 5к, хочу съесть свои собственные яички, разжевать их и выплюнуть их в миску с крошечным уксусом </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en48647/","name":"t1_en48647","created":1557609681,"created_utc":1557580881,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":14,"link_id":"t3_bnbdyi","id":"en49mp2","author":"BulkingEternal","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"So? If I sell at 10K, make a nice x5 profit, and then wait to buy back in with a bit of that if it drops to 6K again, wheres the issue? I hodl until I reach a good profit, sell, then buy low and repeat, not worrying about the drops or rises that come between the cycles.","body_html":"<div class = \"md\"> <p> Итак? Если я продам по 10K, получу хорошую прибыль в 5 раз, а затем подожду, чтобы выкупить немного, если она снова упадет до 6K, в чем проблема? Я жду, пока не достигну хорошей прибыли, продаю, затем покупаю низко и повторяю, не беспокоясь о падениях или подъемах, которые происходят между циклами. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49mp2/","name":"t1_en49mp2","created":1557610814,"created_utc":1557582014,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":80,"link_id":"t3_bnbdyi","replies":[{"ups":6,"link_id":"t3_bnbdyi","replies":[{"ups":5,"link_id":"t3_bnbdyi","id":"en53edv","author":"ZeroWithEverything","parent_id":"t1_en4h01t","subreddit_id":"t5_2wlj3","body":"I've got years (5+) of life savings in there, so I'm not taking chances. I know gains can be made in alts. I may play around with a small fund on an exchange, after I'm satisfied with my $btc accumulation.","body_html":"<div class = \"md\"> <p> У меня есть годы (5+) сбережений, поэтому я не рискую. Я знаю, что успехи могут быть достигнуты в alts. Я могу поиграть с небольшим фондом на бирже, после того как я буду удовлетворен накоплением в $ btc. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en53edv/","name":"t1_en53edv","created":1557629623,"created_utc":1557600823,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"en4bf3h","author":"ZeroWithEverything","parent_id":"t1_en49og2","subreddit_id":"t5_2wlj3","body":"Yes, that was a good rant.   \n   \nPersonally I've grown numb to corrections after losing 2btc panic selling in 2017. \n\nMy plan right now is to hodl until at least mid 2021/$BTC@$150k, at which point I'll start selling off 1/3 of my $btc. 1/9th to live on, and 2/9ths to buy the next bear. (pure $btc, no alts).","body_html":"<div class = \"md\"> <p> Да, это была хорошая напыщенная речь. </Р>\n\n<p> Лично я оцепенел к исправлениям после потери продаж паники в 2 млрд. в 2017 году. </p>\n\n<p> Сейчас я планирую идти до середины 2021 года / $ BTC при $ 150 тыс., после чего я начну продавать 1/3 моего $ btc. 1/9-й, чтобы жить, и 2/9-й, чтобы купить следующего медведя. (чистый $ btc, без альтернатив). </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4bf3h/","name":"t1_en4bf3h","created":1557612165,"created_utc":1557583365,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en43j0q","author":"florian_ehrbar","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I resonated with this more than I want to admit.\n\nNicely written btw","body_html":"<div class = \"md\"> <p> Я резонировал с этим больше, чем хочу признать. </p>\n\n<p> Красиво написанное, кстати </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en43j0q/","name":"t1_en43j0q","created":1557606381,"created_utc":1557577581,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":26,"link_id":"t3_bnbdyi","id":"en48vm1","author":"rulesforrebels","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"The people who held to long before didnt fair too well. Sell small amounts on the way up and take some profits","body_html":"<div class = \"md\"> <p> Люди, которые придерживались задолго до этого, плохо справлялись. Продавайте небольшие суммы по пути вверх и получайте прибыль </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en48vm1/","name":"t1_en48vm1","created":1557610236,"created_utc":1557581436,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":11,"link_id":"t3_bnbdyi","id":"en50z7j","author":"Apps4Life","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I've been in since 2013 and been through 2 bull runs now; the gains aren't 2x, 3x, 5x during bull runs. In 2013-2014 I went from $30 to $1000+ (33x gain) and in the most recent bull run it went from $200 to $20,000 (100x gain). This next bull could be closer to 300-600x ROI. Now imagine you put just $2k in and it goes 500x and now all of a sudden you're a millionaire (in USD) if you cash out. This is something that a lot of people will do, I'll feel bad for them because they are moving into USD which is going to be history very soon...","body_html":"<div class = \"md\"> <p> Я был в 2013 году и проходил 2 бычьих пробега; Прибыль не 2x, 3x, 5x во время бега с быком. В 2013-2014 годах я вырос с 30 до 1000 долларов + (рост в 33 раза), а в последнем бычьем пробеге он вырос с 200 до 20000 долларов (рост в 100 раз). Этот следующий бык может быть ближе к 300-600x ROI. А теперь представьте, что вы вкладываете всего 2 тыс. Долларов, и это увеличивается в 500 раз, и теперь вы внезапно становитесь миллионером (в долларах США), если получаете деньги. Это то, что многие люди сделают, мне будет плохо за них, потому что они переходят на доллары, которые скоро станут историей ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en50z7j/","name":"t1_en50z7j","created":1557628340,"created_utc":1557599540,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":50,"link_id":"t3_bnbdyi","replies":[{"ups":37,"link_id":"t3_bnbdyi","id":"en4an4t","author":"[deleted]","parent_id":"t1_en492hi","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4an4t/","name":"t1_en4an4t","created":1557611588,"created_utc":1557582788,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":16,"link_id":"t3_bnbdyi","id":"en4cmie","author":"UnknownEssence","parent_id":"t1_en492hi","subreddit_id":"t5_2wlj3","body":"This happened to me. Bought in 2014 when studying CS is college. Got \"rich\" at age 21. Then lost 90% of it in a year. It was a bit of an emotional roller coaster but really didn't effect me that much since my life never really change. It has always been just numbers on the screen. It never felt like real money","body_html":"<div class = \"md\"> <p> Это случилось со мной. Купил в 2014 году при изучении КС в колледже. Получил «богатство» в возрасте 21 года. Затем потерял 90% всего за год. Это было что-то вроде эмоциональных американских горок, но на самом деле это не сильно меня поразило, так как моя жизнь никогда не менялась. Это всегда были просто цифры на экране. Это никогда не казалось реальными деньгами </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4cmie/","name":"t1_en4cmie","created":1557612975,"created_utc":1557584175,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":18,"link_id":"t3_bnbdyi","id":"en49hw0","author":"Zombie4141","parent_id":"t1_en492hi","subreddit_id":"t5_2wlj3","body":"I did the same thing from $440 per Bitcoin.  It sucks.  Taking profit this time.  But not too much.  I believe the longer we HODL the richer we’ll be.","body_html":"<div class = \"md\"> <p> Я сделал то же самое с $ 440 за биткойн. Это отстой. Взятие прибыли на этот раз. Но не слишком много. Я верю, что чем дольше мы HODL, тем богаче мы будем. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49hw0/","name":"t1_en49hw0","created":1557610711,"created_utc":1557581911,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":3,"link_id":"t3_bnbdyi","id":"en4rhcg","author":"SuperSonic6","parent_id":"t1_en492hi","subreddit_id":"t5_2wlj3","body":"Lol. 20x gains = poor","body_html":"<div class = \"md\"> <p> Lol. 20-кратный выигрыш = плохой </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4rhcg/","name":"t1_en4rhcg","created":1557622739,"created_utc":1557593939,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en486mp","author":"[deleted]","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en486mp/","name":"t1_en486mp","created":1557609692,"created_utc":1557580892,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":21,"link_id":"t3_bnbdyi","id":"en4bgm2","author":"tmacnb","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This might be the craziest most delusional sub on reddit.","body_html":"<div class = \"md\"> <p> Это может быть самый сумасшедший идиотский саб в reddit. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4bgm2/","name":"t1_en4bgm2","created":1557612197,"created_utc":1557583397,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":10,"link_id":"t3_bnbdyi","id":"en4ceoq","author":"[deleted]","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4ceoq/","name":"t1_en4ceoq","created":1557612843,"created_utc":1557584043,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","id":"en4bhi2","author":"DBA_HAH","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"So if what you're saying is true, the smart thing to do would be to sell it all when I see 3-5x gains then buy back in after the market collapses again.","body_html":"<div class = \"md\"> <p> Так что, если вы говорите, что это правда, разумно было бы продать все это, когда я вижу увеличение в 3-5 раз, а затем выкупить его после того, как рынок снова рухнет. < / р>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4bhi2/","name":"t1_en4bhi2","created":1557612214,"created_utc":1557583414,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":24,"link_id":"t3_bnbdyi","replies":[{"ups":3,"link_id":"t3_bnbdyi","id":"en469xm","author":"[deleted]","parent_id":"t1_en45nxo","subreddit_id":"t5_2wlj3","body":"All I can do at this point","body_html":"<div class = \"md\"> <p> Все, что я могу сделать на этом этапе </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en469xm/","name":"t1_en469xm","created":1557608298,"created_utc":1557579498,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en43voh","author":"[deleted]","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Ive been holding since late 2017. I saw my portfolio gain 10x and didn't sell for some reason. Then the bear market came and I panicked, but held. Now I see the arrow pointing up again and starting to get anxious on the trigger to get at least 30% of my initial investment back. I'm hoping I don't miss out on gains this run and I'm only hoping for some of my initial investment back.\n\nHopefully I do the right thing this year and don't freeze if I see another 3-10x run happening.\n\nHindsight is a bitch","body_html":"<div class = \"md\"> <p> Я держу с конца 2017 года. Я увидел, что мой портфель увеличился в 10 раз и по какой-то причине не продавался. Затем пришел медвежий рынок, и я запаниковала, но удержалась. Теперь я вижу, что стрелка снова направлена ​​вверх и начинает беспокоиться о том, чтобы вернуть как минимум 30% моих первоначальных инвестиций. Я надеюсь, что не упущу выгоды в этом заезде, и я только надеюсь, что часть моих начальных инвестиций вернется. </P>\n\n<p> Надеюсь, в этом году я поступлю правильно и не замерзну, если увижу еще 3-10 раз. </p>\n\n<p> Задним числом является сука </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en43voh/","name":"t1_en43voh","created":1557606617,"created_utc":1557577817,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_bnbdyi","id":"en498hw","author":"Mr_HODL","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I held BQX/ethos from 50c to $12 and back to 0.20c and that wasn't even the biggest multiplier in my portfolio. My Hodl game is probably too strong","body_html":"<div class = \"md\"> <p> Я держал BQX / ethos с 50c до 12 долларов и обратно до 0,20c, и это был даже не самый большой множитель в моем портфеле. Моя игра Ходла, вероятно, слишком сильна </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en498hw/","name":"t1_en498hw","created":1557610508,"created_utc":1557581708,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_bnbdyi","id":"en4a8m5","author":"wingfn1","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This is why it's a good idea to have a plan before entering this market.  Set a defined goal and when you get to that goal, sell and don't look back.","body_html":"<div class = \"md\"> <p> Вот почему неплохо иметь план перед выходом на этот рынок. Установите определенную цель, и когда вы достигнете этой цели, продайте и не оглядывайтесь назад. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4a8m5/","name":"t1_en4a8m5","created":1557611287,"created_utc":1557582487,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_bnbdyi","id":"en4b3o8","author":"Serpico2","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I probably need to hold through 10 bull runs to make any money 😂","body_html":"<div class = \"md\"> <p> Мне, вероятно, нужно провести 10 бычьих забегов, чтобы заработать деньги 😂 </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4b3o8/","name":"t1_en4b3o8","created":1557611933,"created_utc":1557583133,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_bnbdyi","id":"en4cs39","author":"[deleted]","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This so much. Throughout the next 2 years or how long it will go, tokens will be bought every day. And guess what, they are not coming from thin air. For anyone buying, you have someone selling. Many of us will sell into early pamps so institutions can buy cheap and load up. Don't give those fuckers an easy entry for this run by giving up your entry. You have been here the entire winter. You have slept with bears around you all night. You deserve the summer. They want to get you out before the spring has started. Don't let yourself be fooled by market players. Don't fall for shiny gains. You know the moon will come and you deserve to be here when it does.","body_html":"<div class = \"md\"> <p> Это так много. В течение следующих 2 лет или как долго это будет продолжаться, токены будут покупать каждый день. И угадайте, что они не приходят из воздуха. Для тех, кто покупает, у вас есть кто-то продает. Многие из нас будут продавать в ранних памперсах, чтобы учреждения могли покупать дешево и загружаться. Не дайте этим лохам легко войти в этот забег, отказавшись от участия. Вы были здесь всю зиму. Вы спали с медведями всю ночь. Вы заслуживаете лето. Они хотят вытащить тебя до начала весны. Не дайте себя обмануть игрокам рынка. Не поддавайтесь на блестящие выгоды. Вы знаете, что луна придет, и вы заслуживаете того, чтобы быть здесь, когда это произойдет. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4cs39/","name":"t1_en4cs39","created":1557613069,"created_utc":1557584269,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","id":"en4d5g9","author":"proudlyhumble","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This sub makes wsb look like an actual fountain of wisdom.","body_html":"<div class = \"md\"> <p> Этот субмастер делает wsb похожим на настоящий источник мудрости. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4d5g9/","name":"t1_en4d5g9","created":1557613293,"created_utc":1557584493,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bnbdyi","id":"en4cvfy","author":"Pipkin81","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Those of us who bought the ATH will be the last ones to buckle :D","body_html":"<div class = \"md\"> <p> Те из нас, кто купил ATH, будут пристегиваться последними: D </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4cvfy/","name":"t1_en4cvfy","created":1557613123,"created_utc":1557584323,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","replies":[{"ups":8,"link_id":"t3_bnbdyi","id":"en4bwpa","author":"Sirius-AB","parent_id":"t1_en4as9o","subreddit_id":"t5_2wlj3","body":"Not a bad Moon. 😉\n\nMoon for me is financial independence! At the top of the last bull market I was pretty close. Next bull run I'll be there for sure, then I will take some profit and reinvest in other assets like government bonds. I do believe in the Bitcoin/Crypto revolution so I will never cash out everything. With crypto you just never know when your moon landing will arrive.","body_html":"<div class = \"md\"> <p> Неплохая луна. 😉 </р>\n\n<p> Луна для меня - финансовая независимость! На вершине последнего бычьего рынка я был довольно близко. В следующий раз я буду там наверняка, затем возьму некоторую прибыль и реинвестирую в другие активы, такие как государственные облигации. Я верю в революцию Биткойн / Крипто, поэтому я никогда не обналичу все. С crypto вы просто не знаете, когда прибудет ваша посадка на Луну. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4bwpa/","name":"t1_en4bwpa","created":1557612518,"created_utc":1557583718,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en45afz","author":"Sirius-AB","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I only sell on the Moon.","body_html":"<div class = \"md\"> <p> Я продаю только на Луне. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en45afz/","name":"t1_en45afz","created":1557607570,"created_utc":1557578770,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","id":"en54kct","author":"SpartanVFL","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Can anybody explain why bitcoin would rise to hundreds of thousands if its price actually reflected its value and wasn’t artificially inflated like last time? I’m being serious and not just trashing bitcoin. The last time it spiked to 20k the fees were fucking insane to even send bitcoin to another wallet (well beyond what it costs me to move cash around) and the wait times were also ridiculous. Meanwhile you have coins with 0 fees and instant transactions. So I’m honestly wondering why bitcoin would ever be used when it couldn’t scale last time","body_html":"<div class = \"md\"> <p> Кто-нибудь может объяснить, почему биткойн вырос бы до сотен тысяч, если его цена действительно отражала бы его стоимость и не была искусственно завышена, как в прошлый раз? Я веду себя серьезно, а не просто уничтожаю биткойны. В прошлый раз, когда он прибавил 20 тысяч, гонорары были чертовски безумными, чтобы даже отправлять биткойны на другой кошелек (гораздо больше, чем стоило мне перевести деньги), и время ожидания также было нелепым. Между тем у вас есть монеты с нулевой комиссией и мгновенными транзакциями. Поэтому я искренне удивляюсь, почему биткойн вообще будет использоваться, когда он не мог масштабироваться в прошлый раз </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en54kct/","name":"t1_en54kct","created":1557630221,"created_utc":1557601421,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":20,"link_id":"t3_bnbdyi","id":"en43siz","author":"12manyNs","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Epic rant","body_html":"<div class = \"md\"> <p> Epic rant </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en43siz/","name":"t1_en43siz","created":1557606563,"created_utc":1557577763,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bnbdyi","id":"en4a1k9","author":"anan12451","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I ain't rich but I have made my self a rule to ways hodl at least 0.5 btc I'm at 0.9 atm hope it drops again by my next paycheck as I'm getting it to dat damn 1","body_html":"<div class = \"md\"> <p> Я не богат, но я сделал свое правило правилом, по крайней мере, 0.5 btc. Я на 0.9 атм, надеюсь, он снова упадет к моей следующей зарплате, поскольку я получаю это к черту 1 </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4a1k9/","name":"t1_en4a1k9","created":1557611139,"created_utc":1557582339,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bnbdyi","id":"en4c61u","author":"whose_butt_hurts","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Can I get an amen?","body_html":"<div class = \"md\"> <p> Могу ли я получить аминь? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4c61u/","name":"t1_en4c61u","created":1557612692,"created_utc":1557583892,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bnbdyi","id":"en4x369","author":"zaparans","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"99% of those who hold through the entirety of the next bull run will get caught holding bags in the next bear market","body_html":"<div class = \"md\"> <p> 99% тех, кто пройдет весь следующий бычий забег, будут пойманы с сумками на следующем медвежьем рынке </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4x369/","name":"t1_en4x369","created":1557626280,"created_utc":1557597480,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":13,"link_id":"t3_bnbdyi","id":"en43qh4","author":"Enterz","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Yeah, I think you've pretty much nailed it.","body_html":"<div class = \"md\"> <p> Да, я думаю, вы в значительной степени прибили это. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en43qh4/","name":"t1_en43qh4","created":1557606527,"created_utc":1557577727,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_bnbdyi","id":"en46z4s","author":"smokeone234566","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"So, a very difficult thing to do, but a smart technique is setting monetary goals. Not just portfolio goals, I did that and of course once you hit that goal, or come close you tend to move the goal line back further, I started making plans to have a mil in my portfolio after I hit a few, much lower portfolio goals, not a good technique, greed will get you.\n\nSet concrete monetary goals, if I get enough to pay off this amount of student loans, or put down for a house I will take it out,  or at least put a stop loss to ensure I come out with that much if things drop.  It may not be the very top but it is at least it s not a randomly moving goal post.  You can keep adding concrete goals like this as you hit mile stones, it's still very difficult, but hopefully you come out with a real plan and then change your life a little with your profits.","body_html":"<div class = \"md\"> <p> Итак, это очень трудная вещь, но умная техника - это установление денежных целей. Не только цели портфеля, я сделал это, и, конечно, как только вы достигнете этой цели или приблизитесь к ней, вы склонитесь к дальнейшему продвижению линии ворот назад, я начал планировать иметь мил в своем портфеле после того, как попал в несколько, гораздо более низкий портфель. цели, а не хорошая техника, жадность получит вас. </p>\n\n<p> Установите конкретные денежные цели, если я получу достаточно, чтобы погасить эту сумму студенческих ссуд, или отложу на дом, я возьму его или, по крайней мере, поставлю стоп-лосс, чтобы гарантировать, что я выйду с этим так много, если дела понижаться. Возможно, он не самый верхний, но, по крайней мере, это не случайно перемещающийся гол. Вы можете продолжать добавлять конкретные цели, как это, когда вы попадаете на милю, это все еще очень сложно, но, надеюсь, вы разработали реальный план, а затем немного изменили свою жизнь с помощью прибыли. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en46z4s/","name":"t1_en46z4s","created":1557608798,"created_utc":1557579998,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_bnbdyi","id":"en4gaiu","author":"Cow_Bell","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Damn, it feels good to be that 1% that doesn't give a fuck if it crashes or moons, but believes in technology.","body_html":"<div class = \"md\"> <p> Черт, приятно быть тем 1%, который не трахается, если он падает или лунится, но верит в технологии. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4gaiu/","name":"t1_en4gaiu","created":1557615317,"created_utc":1557586517,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","id":"en45128","author":"somethingoddgoingon","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"and to the 1% that do, let us meet again in the trough of the next wave","body_html":"<div class = \"md\"> <p> и до 1%, которые это сделают, давайте встретимся снова в корыте следующей волны </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en45128/","name":"t1_en45128","created":1557607386,"created_utc":1557578586,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en490py","author":"tilltill12","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Well i hope not...","body_html":"<div class = \"md\"> <p> Ну, я надеюсь, что нет ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en490py/","name":"t1_en490py","created":1557610342,"created_utc":1557581542,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4astn","author":"HodlMyMoon","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Easy, set your price targets and wait until they reach your goals. Have at least one section of your portfolio you hold for the long long run. Then portion the rest of your portfolio to sell in clumps on the way up. The goal is to at least lock in profits.","body_html":"<div class = \"md\"> <p> Легко, установите целевые цены и подождите, пока они не достигнут ваших целей. Имейте, по крайней мере, один раздел вашего портфеля, который вы держите в долгосрочной перспективе. Затем разделите оставшуюся часть вашего портфеля, чтобы продавать в глыбах по пути вверх. Цель - как минимум зафиксировать прибыль. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4astn/","name":"t1_en4astn","created":1557611706,"created_utc":1557582906,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4awgv","author":"Manzocumerlanzo","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"A lot of people still hanging out around here certainly witnessed some serious shit. I personally have come to terms with my regrets, so whatever has to come next, bring it on.","body_html":"<div class = \"md\"> <p> Многие люди, все еще болтающиеся здесь, наверняка были свидетелями серьезного дерьма. Я лично примирился со своими сожалениями, поэтому, что бы ни случилось дальше, принесите это. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4awgv/","name":"t1_en4awgv","created":1557611782,"created_utc":1557582982,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4axtm","author":"phillyman128","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"You’re right. I can’t wait for the chance to break even and be done with this shit","body_html":"<div class = \"md\"> <p> Вы правы. Я не могу дождаться того момента, когда у меня появится возможность обойтись без этого дерьма. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4axtm/","name":"t1_en4axtm","created":1557611810,"created_utc":1557583010,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4by8s","author":"AznPersuasi0n","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This was hilarious to read, but so true.","body_html":"<div class = \"md\"> <p> Это было весело читать, но это правда. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4by8s/","name":"t1_en4by8s","created":1557612549,"created_utc":1557583749,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4cr8d","author":"GildedCodpiece","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"A bit long-winded, my friend, but I like the cut of your gib.","body_html":"<div class = \"md\"> <p> Немного скучно, друг мой, но мне нравится срез твоего выступа. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4cr8d/","name":"t1_en4cr8d","created":1557613054,"created_utc":1557584254,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4d14g","author":"the_ocs","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"TL;DR","body_html":"<div class = \"md\"> <p> TL; DR </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4d14g/","name":"t1_en4d14g","created":1557613216,"created_utc":1557584416,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4dr9p","author":"BretticusWins","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I bought Raiblocks at 12 cents. You don't know shit.","body_html":"<div class = \"md\"> <p> Я купил Raiblocks за 12 центов. Вы не знаете дерьмо. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4dr9p/","name":"t1_en4dr9p","created":1557613671,"created_utc":1557584871,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4e981","author":"TheLostBigBoss","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Yes, I have no intention of holding. \n\nIf you're not securing profits by letting your gains melt away then you've gained nothing.","body_html":"<div class = \"md\"> <p> Да, я не собираюсь держать. </Р>\n\n<p> Если вы не получаете прибыль, позволяя вашим доходам таять, вы ничего не получили. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4e981/","name":"t1_en4e981","created":1557613979,"created_utc":1557585179,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4hnk8","author":"paulsonyourchin","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Did OP write this about how I was 6 months ago?  I’ve gotten de sensitized to it now and may only check the price of bitcoin 2-3 times a week but back around September through December I was looking at the price multiple times a day and then tried to become a bad ass trader 😂😂 I wrecked myself over and over again and after a while just gave up on attempting to trade.","body_html":"<div class = \"md\"> <p> Писал ли OP это так, как я был 6 месяцев назад? Сейчас я чувствую к этому и могу проверять цену биткойна только 2-3 раза в неделю, но примерно с сентября по декабрь я несколько раз в день смотрел на цену, а затем пытался стать плохим трейдером с задницей 😂😂 Я ломал себя снова и снова, и через некоторое время просто разочаровался в попытке торговать. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4hnk8/","name":"t1_en4hnk8","created":1557616252,"created_utc":1557587452,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4htdn","author":"EducationTaxCredit","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"lucky I have the keys to my Nano S in a timed safe that won't reveal itself until 10 years from now. My pee pee feels great","body_html":"<div class = \"md\"> <p> К счастью, у меня есть ключи от моего Nano S в сейфе, который не откроется через 10 лет. Моя моча чувствует себя прекрасно </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4htdn/","name":"t1_en4htdn","created":1557616364,"created_utc":1557587564,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4i3mn","author":"FrankieColombino","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"For real? Do you not realize that most people that bought @ 2,3,5,10k in early 2017 thought btc was going to 100k and hodled all the way through 20k to extreme losses at 6-3k? Nothing will change this time and your thesis is ass backwards. The problem for most people is that they don’t do exactly what you’re saying they will do.","body_html":"<div class = \"md\"> <p> На самом деле? Разве вы не понимаете, что большинство людей, которые купили @ 2,3,5,10 тыс. В начале 2017 г., думали, что btc будет стоить 100 тыс. И ходят по 20 тыс. К огромным потерям в 6-3 тыс.? На этот раз ничего не изменится, и ваш тезис задом наперед. Проблема для большинства людей в том, что они не делают именно то, что вы говорите, они будут делать. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4i3mn/","name":"t1_en4i3mn","created":1557616562,"created_utc":1557587762,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4lcf2","author":"ratskim","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Why would anyone hold through the entire run? I'm sure plenty of people still feel the fresh pain of watching BTC hit ~20k and not selling before it dropped dramatically..\n  \nExplain why you want people to hold through everything? Whats the plan?  Lmao you are nothing but a dumb edgelord fanning the fire of every 3rd comment in r/crypto - get a fkn life bro","body_html":"<div class = \"md\"> <p> Зачем кому-то проходить весь пробег? Я уверен, что многие люди до сих пор чувствуют свежую боль, когда смотрят, как БТД ударил ~ 20 тыс., А не продают, пока он не упал резко. </P>\n\n<p> Объясните, почему вы хотите, чтобы люди выдержали все? Какой план? Лмао, ты всего лишь тупой предводитель, разжигающий огонь каждого третьего комментария в <a href=\"/r/crypto\"> r / crypto </a> - получи fkn life bro </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4lcf2/","name":"t1_en4lcf2","created":1557618671,"created_utc":1557589871,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4m22h","author":"II_Gryphon_II","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"> “Why the fuck are you checking prices every 15 mins still if you’re a long term hodler?” \n\nDopamine","body_html":"<div class = \"md\"> <blockquote>\n<p> «Какого черта вы проверяете цены каждые 15 минут, если вы долгое время ходите?» </p>\n</BLOCKQUOTE>\n\n<Р> Допамин </р>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4m22h/","name":"t1_en4m22h","created":1557619137,"created_utc":1557590337,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4p2d0","author":"anberlinz","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Says he doesn't know shit but still manages to tell exactly what's going to happen.\nUpvoted.","body_html":"<div class = \"md\"> <p> Говорит, что он не знает дерьма, но все же ему удается точно сказать, что произойдет.\nUpvoted. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4p2d0/","name":"t1_en4p2d0","created":1557621182,"created_utc":1557592382,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4p434","author":"Always_Question","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Hodling is a lot harder than people think.","body_html":"<div class = \"md\"> <p> Ходить намного сложнее, чем думают люди. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4p434/","name":"t1_en4p434","created":1557621212,"created_utc":1557592412,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4r569","author":"Marikc1","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"These stupid posts are annoying. It's all you see.","body_html":"<div class = \"md\"> <p> Эти глупые посты раздражают. Это все, что вы видите. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4r569/","name":"t1_en4r569","created":1557622517,"created_utc":1557593717,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4s8fd","author":"slimcarlito","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Remember buy high and sell low.","body_html":"<div class = \"md\"> <p> Помните, покупайте высоко и продавайте дешево. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4s8fd/","name":"t1_en4s8fd","created":1557623230,"created_utc":1557594430,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en57sxf","author":"sonny1022","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Reading War and peace was shorter than this post 🙄","body_html":"<div class = \"md\"> <p> Чтение Войны и мира было короче, чем этот пост 🙄 </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en57sxf/","name":"t1_en57sxf","created":1557631873,"created_utc":1557603073,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en5iiv7","author":"alwayswatchyoursix","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Quality shitpost.  Take my upvote.","body_html":"<div class = \"md\"> <p> Качественный говнюк. Возьми мой голос. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en5iiv7/","name":"t1_en5iiv7","created":1557637565,"created_utc":1557608765,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en5xlar","author":"Thluks","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Holy fuck man, are you bored?","body_html":"<div class = \"md\"> <p> Черт возьми, тебе скучно? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en5xlar/","name":"t1_en5xlar","created":1557646133,"created_utc":1557617333,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en6ba1o","author":"the_chest_lives_on","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Anybody else in this for the long haul, and still regularly check the price anyway?","body_html":"<div class = \"md\"> <p> Кто-нибудь еще занимается этим в течение длительного времени, и все равно регулярно проверяет цену? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en6ba1o/","name":"t1_en6ba1o","created":1557654441,"created_utc":1557625641,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en6pl09","author":"smartromain","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Damn you got so much free time","body_html":"<div class = \"md\"> <p> Черт, у тебя так много свободного времени </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en6pl09/","name":"t1_en6pl09","created":1557666225,"created_utc":1557637425,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en6xl3d","author":"Akhaiz","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Honestly the fact that I need so much shit to log in to Binance and to my cold wallets just makes me not want to do it, so I just hodl, out of laziness lol","body_html":"<div class = \"md\"> <p> Честно говоря, тот факт, что мне нужно так много дерьма, чтобы войти в Binance и в мои холодные кошельки, просто заставляет меня не хотеть этого делать, поэтому я просто из лени, лол </р>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en6xl3d/","name":"t1_en6xl3d","created":1557672410,"created_utc":1557643610,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en72ixn","author":"deuZige","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"How quaint, someone who thinks hodling is something to be proud of, because it's hold spelled wrong, but was a trending tag on twitter once (ohno, instasomething he said)\n\nOr someone who bought at a ridiculously high price and is still buthurting because the road back to that pricelevel is so long they'll have to hodl for years before they'll ever be able to sell without losses. :P\n\nI wonder which one of the two?","body_html":"<div class = \"md\"> <p> Как странно, кто-то, кто думает, что hodling - это то, чем можно гордиться, потому что это неправильно написано, но когда-то он был популярным тэгом в твиттере (ох, кстати, он сказал) </p>\n\n<p> Или кто-то, кто купил по смехотворно высокой цене и все еще мучается, потому что путь к этому уровню цен настолько велик, что им придется годами ходить, прежде чем они смогут продавать без потерь. : P </р>\n\n<p> Интересно, какой из двух? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en72ixn/","name":"t1_en72ixn","created":1557676725,"created_utc":1557647925,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bnbdyi","replies":[{"ups":6,"link_id":"t3_bnbdyi","id":"en4avsc","author":"reddity-mcredditface","parent_id":"t1_en48y9g","subreddit_id":"t5_2wlj3","body":"McAfee?","body_html":"<div class = \"md\"> <p> McAfee? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4avsc/","name":"t1_en4avsc","created":1557611768,"created_utc":1557582968,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"en47ns8","author":"ItWouldBeGrand","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Lol, yes guys. Hodl. Never sell, ever. Ever. I need you to hodl, so that I can dump on your heads.","body_html":"<div class = \"md\"> <p> Лол, да, ребята. Hodl. Никогда не продавай, никогда. Когда-либо. Мне нужно, чтобы ты ходил, чтобы я мог свалить тебе голову. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en47ns8/","name":"t1_en47ns8","created":1557609263,"created_utc":1557580463,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bnbdyi","id":"en4fckb","author":"YoMomasDaddy","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Wow, goes from “I don’t know shit, you don’t know shit” to “Prove me wrong motherfuckers.” \nSomewhere the train of thought does a 180.","body_html":"<div class = \"md\"> <p> Ничего себе, от «Я не знаю дерьмо, ты не знаешь дерьмо» до «Докажи, что я не прав, ублюдки».\nГде-то ход мысли делает 180. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fckb/","name":"t1_en4fckb","created":1557614682,"created_utc":1557585882,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_bnbdyi","id":"en4494h","author":"Low-keyy","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"This was Legendary!","body_html":"<div class = \"md\"> <p> Это был легендарный! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4494h/","name":"t1_en4494h","created":1557606868,"created_utc":1557578068,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bnbdyi","id":"en49naw","author":"Softest-Dad","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"You talking about yourself, bro ?","body_html":"<div class = \"md\"> <p> Ты говоришь о себе, братан? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49naw/","name":"t1_en49naw","created":1557610826,"created_utc":1557582026,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bnbdyi","id":"en4a38m","author":"DancinginAshes","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I've got two modest suburban cars sitting in my driveway that were bought with profits from holding through most of 2017.    \n\n\nI won't be holding this time either because I want to buy new gutters and get some other stuff fixed up on my house.","body_html":"<div class = \"md\"> <p> У меня на подъездной дорожке сидят две скромные пригородные машины, которые были куплены с прибылью в течение большей части 2017 года. </p>\n\n<p> На этот раз я тоже не задержусь, потому что хочу купить новые желоба и починить другие вещи в моем доме. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4a38m/","name":"t1_en4a38m","created":1557611174,"created_utc":1557582374,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bnbdyi","id":"en4ahsx","author":"Evil_jelly_","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Thank you for submitting your opinion","body_html":"<div class = \"md\"> <p> Спасибо за отправку вашего мнения </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4ahsx/","name":"t1_en4ahsx","created":1557611479,"created_utc":1557582679,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bnbdyi","id":"en4fvrs","author":"Adeus_Ayrton","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Lol cringefest.","body_html":"<div class = \"md\"> <p> Lol cringefest. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4fvrs/","name":"t1_en4fvrs","created":1557615035,"created_utc":1557586235,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en49rtl","author":"Ciddie","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Some people don’t keep it in an exchange ready to sell whenever they feel like it","body_html":"<div class = \"md\"> <p> Некоторые люди не держат его на бирже, готовым продать, когда ему так хочется </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en49rtl/","name":"t1_en49rtl","created":1557610926,"created_utc":1557582126,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4awdq","author":"powerfunk","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"If you think 99% of BTC holders sell each market cycle, then...I disagree. 99% of people won't hodl? Everyone fucking hodls lol","body_html":"<div class = \"md\"> <p> Если вы думаете, что 99% держателей BTC продают каждый рыночный цикл, тогда ... Я не согласен. 99% людей не будут ходить? Все, блядь, черт возьми, LOL </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4awdq/","name":"t1_en4awdq","created":1557611780,"created_utc":1557582980,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4b4bu","author":"Dr_Bendova420","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Hehe I'm the 1%","body_html":"<div class = \"md\"> <p> Хе-хе, я на 1% </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4b4bu/","name":"t1_en4b4bu","created":1557611946,"created_utc":1557583146,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4goqv","author":"titooo7","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Of course I will hold. I'm down 75% so I'll hold at least till I get to 0% P/L (which I don't think will happen soon)","body_html":"<div class = \"md\"> <p> Конечно, я буду держать. Я упал на 75%, поэтому я буду удерживаться, по крайней мере, до тех пор, пока не доберусь до 0% P / L (что, я думаю, не произойдет в ближайшее время) </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4goqv/","name":"t1_en4goqv","created":1557615596,"created_utc":1557586796,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4hdky","author":"Klaat","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"I feel personally attacked.","body_html":"<div class = \"md\"> <p> Я чувствую себя лично атакованным. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4hdky/","name":"t1_en4hdky","created":1557616067,"created_utc":1557587267,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4hl8y","author":"8w2e5s6h8r6a5n9e0a3s","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"Saved this post. See you soon in citadel!","body_html":"<div class = \"md\"> <p> Сохранено это сообщение. До скорой встречи в цитадели! </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4hl8y/","name":"t1_en4hl8y","created":1557616206,"created_utc":1557587406,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bnbdyi","id":"en4ik0j","author":"NullFlex","parent_id":"t3_bnbdyi","subreddit_id":"t5_2wlj3","body":"shut up libtard, we know you are going to sell to rofl","body_html":"<div class = \"md\"> <p> заткнись libtard, мы знаем, что ты собираешься продать rofl </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bnbdyi/99_of_you_wont_hold_through_the_entirety_of_the/en4ik0j/","name":"t1_en4ik0j","created":1557616882,"created_utc":1557588082,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0}]}