{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Насколько абсолютно бредовые все не видят, какой огромной дойной коровой вырос этот рынок?\n\nПод маской их так называемой экспертизы я вижу, что пользователи с нулевым пониманием экономики обслуживают эти микроволненные темы для разговоров, не помня надлежащий контекст, окружающий их, я вижу, как шиллы рекламируют неизвестные проекты с чрезмерно восторженными комментариями, я вижу сторонников, уверенно описывающих их желаемое за действительное на бумаге, игнорируя любые неудобные детали. Так сложно разобраться в количестве полной ерунды, опубликованной в ежедневной газете, что последние три года постепенно заставили меня изменить мой взгляд на весь рынок: для подавляющего большинства розничных инвесторов из этой революции ничего не выйдет (несмотря на негативы, это все еще очень большая революция) за исключением долгов и потерь. Наше сообщество претендует на славу, посыпая статьи и комментарии ошибочными написаниями некоторых парней о мире \"держись\". Для всех нас, кому нет девяти лет, это чертовски неловко.\n\nВо-первых, запрет на отслеживание цен и поощрение здоровых дебатов позволили бы нам преодолеть первую (и самую большую) пропасть: пропасть информации. Например ... ** нет абсолютно никаких причин, по которым Биткойн будет использоваться в будущем. Каждый аргумент опирается на теорию Великого Дурака и предполагает постоянный рост. ** Технология распределенной бухгалтерской книги - это «изменение игры», так что нет, преимущество первопроходца, текущий уровень безопасности (который можно переопределить в любое время, просто выделив больше ресурсов для другой цепочки, поскольку именно так функционирует PoW) и возраст не являются важными или устойчивыми преимуществами. На данный момент существует ** один ** вариант использования Биткойна: продажа кому-либо по более высокой цене. Все остальное сделано лучше кем-то другим. Вы хотите частные, анонимные деньги? Монеро тебя прикрыл. Вы хотите быстро перевести деньги из пункта А в пункт Б, не обращая внимания на более низкие уровни децентрализации в обмен на отсутствие комиссий? Используйте Nano или Venmo, если вы не против доверять кому-то еще. Вы хотите настроить самобалансирующуюся электросеть, полностью управляемую автономными машинами? Эксперимент с IOTA. Вы хотите хороший запас стоимости в случае социального краха? Биткойн не поможет вам, я гарантирую это. То, что вам нужно, это земля, домашний скот, зерновые культуры и т. Д. Если вы считаете, что жетоны цепочки поставок - это будущее, многие из них получили интересное партнерство для разработки концепции и, в некоторых случаях, живых реализаций. Большинство из этих проектов, даже с правильными командами, умрут. Ничто не гарантировано, но, по крайней мере, они *** на самом деле пытаются что-то сделать ***.\n\nВы заметите, что я много гадю на Биткойн, но есть причина. В настоящее время это воплощение манипуляций, происходящих в этом пространстве, и это также потрясающий показатель того, что мы даже не близки к массовому принятию. Ни технология, ни рынок, который нуждается в ней, не готовы. Из-за этого подавляющее большинство внимания приковано к движению цены, и колесо вращается, и вращается ...\n\nИтак, я чертовски устал. Усталый, потому что я продолжаю писать длинные, сердечные сообщения о чушь, что ничего не меняется. Усталый от безудержной финансовой неграмотности и пренебрежения к осторожности. Надоело читать чертовы статьи MSNBC с двумя параграфами, рассказывающие, почему Биткойн снова наберет 20 000 долларов и рухнет до нуля одновременно. Устали от ICO, STO и IEO. Едва ли кто-нибудь говорит о препятствиях к криптовалютам для усыновления, но мы выпускаем два новых токена со вкусом дерьма в день. Едва ли кто-либо говорит о совершенно бредовых рыночных ограничениях, сомнительных методах и монетах с 60% -ным запасом, принадлежащим основателям, когда это должно прямо отклонить эти проекты как незаконные с самого начала. Едва ли кто-то сравнивает и противопоставляет проекты в ясной, нейтральной манере, чтобы у нас был намек на то, как выглядит конкурентный ландшафт в настоящее время, и еще меньше людей советуют проявлять осторожность, когда видят ценность своего проекта, даже если он все еще очень уровень исследования. Черт, 90% людей, которые в некоторой степени разбираются в технологиях, еще не признались себе, что сырое Доказательство Работы ** никогда не будет ** масштабироваться.\n\nЭто особенно расстраивает, потому что я осознаю ценность этой технологии. Я не сомневаюсь, что мы будем использовать распределенные бухгалтерские книги в ближайшем будущем, и что криптовалюты будут неотъемлемой частью этого использования, но вода не замурована. Микроскопические кусочки логики теряются в море мусора размером с Тихий океан.","title":"Насколько абсолютно бредовые все не видят, какой огромной дойной коровой этот рынок вырос?","subreddit_name_prefixed":"r/CryptoCurrency","ups":374,"created":1558995915,"link_flair_background_color":"","id":"btmkce","author":{"name":"bLbGoldeN"},"permalink":"/r/CryptoCurrency/comments/btmkce/how_absolutely_delusional_is_everyone_not_to_see/","url":"https://www.reddit.com/r/CryptoCurrency/comments/btmkce/how_absolutely_delusional_is_everyone_not_to_see/","created_utc":1558967115}