{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Я очень плохо испортил. Больше, чем когда-либо в моей жизни. Я потерял все свои крипто и фиатные средства, и некого винить, кроме себя. На протяжении всего медвежьего рынка 2018 года я собирал как можно больше BTC и ETH. Я полностью верил в технологию, а также в возможность финансовой свободы, которая была представлена ​​передо мной. Я использовал деньги от работы с частичной занятостью (пока учился в университете на постоянной основе) и большую часть своих студенческих ссуд, чтобы покупать криптографии каждый месяц. Несмотря на то, что медвежий рынок уменьшил стоимость моего портфеля, я продолжал покупать, зная, что он потенциально окупится за один день. Я училась на последнем курсе университета и думала, что криптозащита, по крайней мере, может помочь мне погасить студенческие ссуды. И последние пару месяцев все, казалось, шло по плану. Crypto процветал буквально как раз к моему выпуску.\n\nВот когда я открыл для себя Bitmex.\n\nВ течение месяца мое открытие Bitmex сумело разрушить мою жизнь. Я начал с небольшого депозита в 0,01 BTC, и мне удалось увеличить его до 0,2 BTC в течение недели. Я был в эйфории. Затем, как только я это сделал, я потерял все это одним быстрым движением рынка. Поэтому я сделал новый аккаунт, думая, что знаю, что делаю в этот раз, и внес немного большую сумму. Ликвидирован. Я снова сдал на хранение. Ликвидирован. Дошло до того, что на моем банковском счете не осталось денег для пополнения моего счета Bitmex, и именно здесь я допустил самую большую ошибку. Я решил «одолжить» средства из моего холодного хранилища BTC и ETH, чтобы попытаться восстановить все, что я потерял на Bitmex. И, как я теперь знаю, торговля местью никогда не работает. Сегодняшний день ознаменовал конец моей крипто-карьеры, все мои альты были ликвидированы, когда BTC сломал 9k и почти сразу бросил.\n\nТеперь у меня больше нет средств для депозита, и я потерял все свои крипто. Все, что я собирал на медвежьем рынке, просто чтобы забрать его прямо перед бычьим рынком. Я потерял всего 1BTC крипто, что может показаться некоторым из вас не таким уж большим, но это было буквально все, что у меня было. У меня ничего не осталось сейчас. Я не могу найти кого-то, чтобы нанять меня с моей чертовски бесполезной степенью. У меня нет возможности погасить свои студенческие ссуды. Я чувствую себя застрявшим Мне страшно. Я злюсь из-за того, что так сильно себя облажал. Я сейчас очень волнуюсь, когда набираю это, и у меня возникают мысли убить себя ... потому что я действительно не думаю, что смогу оправиться от этого. Я не знаю что делать.\n\nЕсли есть что-то, что кто-то может от этого отнять, это не возиться с маржинальной торговлей и кредитным плечом, если вы действительно не знаете, что делаете. Это будет смертью тебя. Буквально.\n\n[https://i.redd.it/xh9v7lhmcg131.png] (https://i.redd.it/xh9v7lhmcg131.png) \n\n[https://i.redd.it/k31709ulcg131.png] (https://i.redd.it/k31709ulcg131.png) \n\n[https://i.redd.it/7k7bq04lcg131.png] (https://i.redd.it/7k7bq04lcg131.png) \n\n[https://i.redd.it/0dpffljkcg131.png] (https://i.redd.it/0dpffljkcg131.png) \n\n\n\nРЕДАКТИРОВАТЬ: Спасибо всем, кто дал совет, поделился историей или просто оставил положительное сообщение. Я не могу ответить вам всем, но ваша поддержка была подавляющей и очень полезной. Я думаю, что через некоторое время у меня все будет хорошо. Мне просто нужно найти время для себя и разобраться.","title":"Я потерял все.","subreddit_name_prefixed":"r/CryptoCurrency","ups":815,"created":1559296112,"link_flair_background_color":"","id":"bv1kj7","author":{"name":"nomoresaddays"},"permalink":"/r/CryptoCurrency/comments/bv1kj7/i_lost_everything/","url":"https://www.reddit.com/r/CryptoCurrency/comments/bv1kj7/i_lost_everything/","created_utc":1559267312}