{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Сегодня свалка БТД была полностью изготовлена:\n\n* Примерно за 20-30 минут до свалки кит переместил 25 тыс. BTC (стоимостью $ 215 млн.) В Coinbase: [ссылка] (https://whale-alert.io/transaction/bitcoin/b53321a92835b607f94af4703fd0a576209e48f02037f187d4e3e43)\n* Примерно через час после сброса кит переместил 14k BTC (стоимостью 112 миллионов долларов США) из Coinbase в другой кошелек: [ссылка] (https://whale-alert.io/transaction/bitcoin/3cf3e3d9ad9f2dd8e5f71a6530a9081eaa35d819e17bc65475759) 9\n* Через 40 минут после этого кит переместил 11k BTC (стоимостью 88 млн долларов) из Coinbase в другой кошелек: [ссылка] (https://whale-alert.io/transaction/bitcoin/761e464ef57f8ce0fd8064fcc6b52c4529778b07cbaae4d84aa546dd2f84aa5152b3)\n* Через 15 минут кит переместил 10 миллионов долларов США с одного кошелька на другой: [ссылка] (https://whale-alert.io/transaction/bitcoin/b0a9755c65b41e3c69204d9708ddd4b12aa7b935f7f219599333d50e4ad203bd)\n\nЕсли вы немного разберетесь в математике и соблюдаете график, нетрудно увидеть, что кто-то сбросил 25 тыс. BTC за 215 млн долларов и выкупил его вскоре после этого за 200 млн долларов. При этом они положили в карман 15 миллионов долларов и ушли с тем же количеством BTC, с которого начали.\n\nFuckers.\n\nИзменить: Для всех тех, кто говорит, что никто не жаловался, когда кит, выходящий на рынок, повлиял на нас. Нет дерьма, все лодки поднимаются в такой ситуации. В том, о котором мы здесь говорим, только одна группа людей получает выгоду, в то время как подавляющее большинство подвергается негативному воздействию. В этом разница.","title":"BTC Dump: Чистая манипуляция с китами","subreddit_name_prefixed":"r/CryptoCurrency","ups":2571,"created":1559643724,"link_flair_background_color":"","id":"bwjdnw","author":{"name":"makoveli"},"permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/","url":"https://www.reddit.com/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/","created_utc":1559614924,"replies":[{"ups":1657,"link_id":"t3_bwjdnw","replies":[{"ups":33,"link_id":"t3_bwjdnw","id":"epy8s9l","author":"ripndipp","parent_id":"t1_epy7u72","subreddit_id":"t5_2wlj3","body":"Ramadan done. Eid right around the corner.","body_html":"<div class = \"md\"> <p> Рамадан готов. Ид прямо за углом. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8s9l/","name":"t1_epy8s9l","created":1559652204,"created_utc":1559623404,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":16,"link_id":"t3_bwjdnw","id":"epyffkp","author":"SuperCloak","parent_id":"t1_epy7u72","subreddit_id":"t5_2wlj3","body":"Don't forget the wall street bonuses!","body_html":"<div class = \"md\"> <p> Не забывайте бонусы Уолл-стрит! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyffkp/","name":"t1_epyffkp","created":1559660560,"created_utc":1559631760,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy0252","author":"Metalgear_ray","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Welcome to the fucking show","body_html":"<div class = \"md\"> <p> Добро пожаловать на гребаное шоу </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0252/","name":"t1_epy0252","created":1559644278,"created_utc":1559615478,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":356,"link_id":"t3_bwjdnw","replies":[{"ups":54,"link_id":"t3_bwjdnw","id":"epy6kgw","author":"roamingandy","parent_id":"t1_epy2ff8","subreddit_id":"t5_2wlj3","body":"At a very basic level;\n\nif you own enough to crash the market with a big sell\n\nthen on the way down the market price hits a whole load of pre-set sell orders set to avoid getting wiped in a crash, and the dip gathers speed\n\nSeeing the dip grow traders bail out turning it into a crash\n\nThe market reaches a price far lower than it would through the whales sell off, so now they buy back in and gain a fat profit\n\n\nNow throw a shit ton of complex trading tools in there and the profits are massively higher, our ability to see what happend far lower,  and the only risk being another whale knowing what you plan and countering.. buy they'd probably make more by just joining in.\n\nThis is a huge problem for crypto. You can't have a dentralised economy when anyone one individual owns enough to do this because they can game the system and continually enrich themselves at everyone else's expense\n\nAll the main tokens have people who own close to an entire percent. Most have individuals owning a few percent. Many new tokens give away a few percent for seed funding removing their ability to become a decentralised economy.","body_html":"<div class = \"md\"> <p> На базовом уровне; </p>\n\n<p> если у вас достаточно денег, чтобы обанкротить рынок с большой продажей </p>\n\n<p> затем по пути вниз рыночная цена достигает целого множества предустановленных ордеров на продажу, установленных, чтобы избежать уничтожения в случае сбоя, и провал набирает скорость </p>\n\n<p> Видя, как трейдеры вырастают, они превращаются в крах </p>\n\n<p> Рынок достигает цены намного ниже, чем через распродажу китов, поэтому теперь они выкупают и получают большую прибыль </p>\n\n<p> Теперь добавьте туда кучу сложных торговых инструментов, и прибыль будет значительно выше, наша способность видеть, что происходит намного ниже, и единственный риск - это другой кит, зная, что вы планируете, и противодействует ... купите, вероятно, они сделать больше, просто присоединившись. </p>\n\n<p> Это огромная проблема для крипто. У вас не может быть дентрализованной экономики, когда у кого-то одного достаточно людей, чтобы сделать это, потому что они могут играть в систему и постоянно обогащаться за счет всех остальных </p>\n\n<p> У всех основных токенов есть люди, которым принадлежит почти целый процент. У большинства есть люди, владеющие несколькими процентами. Многие новые токены отдают несколько процентов на начальное финансирование, что лишает их возможности стать децентрализованной экономикой. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy6kgw/","name":"t1_epy6kgw","created":1559649901,"created_utc":1559621101,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":33,"link_id":"t3_bwjdnw","id":"epy2p6x","author":"A1mSC","parent_id":"t1_epy2ff8","subreddit_id":"t5_2wlj3","body":"Go to some shitcoin with low marketcap and low liquidity, where you are a whale with your 1 BTC portfolio. Now go ahead and try to pump & dump everything by yourself. It's the same thing on a smaller scale ... good luck.\n\n&#x200B;\n\nI am not saying that it's not possible and it's never happening. Over a long term, groups of whales can certainly have influence, that's obvious. But moving the market != riskfree money printing","body_html":"<div class = \"md\"> <p> Отправляйтесь в какую-нибудь хреновину с низкой рыночной капитализацией и низкой ликвидностью, где вы являетесь китом со своим портфелем в 1 BTC. А теперь иди и попробуй сам все прокачать и выбросить То же самое в меньшем масштабе ... удачи. </P>\n\n<Р> </р>\n\n<p> Я не говорю, что это невозможно и этого никогда не происходит. В долгосрочной перспективе группы китов, безусловно, могут оказывать влияние, это очевидно. Но двигать рынок! = Безрисковая печать денег\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy2p6x/","name":"t1_epy2p6x","created":1559646365,"created_utc":1559617565,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":21,"link_id":"t3_bwjdnw","replies":[{"ups":8,"link_id":"t3_bwjdnw","id":"epycsma","author":"[deleted]","parent_id":"t1_epy5kao","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epycsma/","name":"t1_epycsma","created":1559656921,"created_utc":1559628121,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"epy51m2","author":"rainano","parent_id":"t1_epy2ff8","subreddit_id":"t5_2wlj3","body":"This 100%. When you have a certain level of wealth, your main goals become diversification and wealth preservation. The last thing you want to do is risk losing a huge chunk of your stack playing games like this; it's extremely risky. Plus you can earn at least $6,000,000 a year on interest alone on a $300 million stack. I suppose some people will always try to gamble, but manipulation is not as trivial as it sounds and there's a high degree of massive losses.\n\nAlso, where is the Coinbase volume? Coinbase only did 25,000 BTC volume in the past 24 hours.","body_html":"<div class = \"md\"> <p> Это 100%. Когда у вас есть определенный уровень богатства, вашими основными целями становятся диверсификация и сохранение богатства. Последнее, что вы хотите сделать, это рискнуть потерять огромную часть своего стека, играя в подобные игры; это чрезвычайно рискованно Кроме того, вы можете зарабатывать не менее 6 000 000 долларов в год только на процентах из стека в 300 миллионов долларов. Я полагаю, что некоторые люди всегда будут пытаться играть в азартные игры, но манипулирование не так тривиально, как кажется, и есть огромные потери. </P>\n\n<p> Кроме того, где находится объем Coinbase? Coinbase только сделал объем 25 000 BTC за последние 24 часа. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy51m2/","name":"t1_epy51m2","created":1559648430,"created_utc":1559619630,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":6,"link_id":"t3_bwjdnw","id":"epyd50n","author":"makoveli","parent_id":"t1_epy2ff8","subreddit_id":"t5_2wlj3","body":"Sure, cuz it's not possible for this to be the coordinated action of multiple whales who spread the risk amongst themselves. And if we're talking risk, the kind of influence a whale has on prices means they potentially have a degree of control over the outcome (or at least have a good idea of what's going to happen). They may be exposed to the same market dynamics as us but they're the ones who help create those market dynamics.","body_html":"<div class = \"md\"> <p> Конечно, потому что это не может быть скоординированным действием нескольких китов, которые распределяют риск между собой. И если мы говорим о риске, то влияние, которое кит оказывает на цены, означает, что они потенциально имеют некоторую степень контроля над результатом (или, по крайней мере, имеют хорошее представление о том, что произойдет). Они могут быть подвержены той же рыночной динамике, что и мы, но именно они помогают создать такую ​​рыночную динамику. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyd50n/","name":"t1_epyd50n","created":1559657365,"created_utc":1559628565,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy1kmw","author":"BitttBurger","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Okay dumb question:\n\nIf I were to try and dump say 1000 BTC all at once, I would not get (say) $8700 for all of them.  \n\nThe act of dumping would make me lose an absolute ton of money, as every coin would have to fill buy orders that are cheaper and cheaper all the way down.  \n\nThe same thing happens if I buy back.  \n\nSo why does OP say the dumper got out at 1 exact price and bought back at 1 exact price?  As if it’s some easy clean process. \n\nIn fact if this dude bought it all back, would he not have pushed the price right back up??","body_html":"<div class = \"md\"> <p> Хорошо, тупой вопрос: </p>\n\n<p> Если бы я попытался сбросить, скажем, 1000 BTC сразу, я бы не получил (скажем) $ 8700 за все из них. </Р>\n\n<p> Акт сброса заставил бы меня потерять абсолютную тонну денег, поскольку каждая монета должна была бы заполнять заказы на покупку, которые все дешевле и дешевле. </Р>\n\n<p> То же самое произойдет, если я куплю обратно. </Р>\n\n<p> Так почему ОП говорит, что самосвал вышел по 1 точной цене и выкупил по 1 точной цене? Как будто это какой-то легкий чистый процесс. </Р>\n\n<p> На самом деле, если бы этот чувак выкупил все обратно, разве он не поднял бы цену обратно? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy1kmw/","name":"t1_epy1kmw","created":1559645471,"created_utc":1559616671,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":134,"link_id":"t3_bwjdnw","replies":[{"ups":8,"link_id":"t3_bwjdnw","id":"epymiof","author":"Individual_1ne","parent_id":"t1_epy75ue","subreddit_id":"t5_2wlj3","body":"I agree and I think this is why we saw the two transactions off exchange and less of a selloff (25k would drop the price considerably).\n\nOne thing i haven't seen people considering is that this whale just took the risk of averaging a lot of their coins most likely at a now higher price... hopefully at this point it will change momentum tho, or else even the whale could get burned.","body_html":"<div class = \"md\"> <p> Я согласен и думаю, что именно поэтому мы увидели две транзакции без обмена и с меньшей продажей (25k значительно снизили бы цену). </p>\n\n<p> Я не видел, чтобы люди думали о том, что этот кит просто рискнул усреднить большую часть своих монет, скорее всего, по более высокой цене ... надеюсь, в этот момент он изменит импульс, или даже кит может обжечься. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epymiof/","name":"t1_epymiof","created":1559672368,"created_utc":1559643568,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy3eqz","author":"DrDerpinheimer","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"That sounds really logical... but explain to me how they would have first sold 25k BTC (creating 25k volume) and then rebought it (creaing another 25k volume) when coinbase BTC/USD volume for the entire day is only $200m USD, or ~25k BTC","body_html":"<div class = \"md\"> <p> Звучит действительно логично ... но объясните мне, как они сначала продали бы 25 тыс. BTC (создав объем 25 тыс.), а затем перекупили его (создав еще один 25 тыс. объем), когда BTC / USD на монетной основе объем за весь день составляет всего 200 миллионов долларов США, или ~ 25 тысяч BTC </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy3eqz/","name":"t1_epy3eqz","created":1559646963,"created_utc":1559618163,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":75,"link_id":"t3_bwjdnw","replies":[{"ups":6,"link_id":"t3_bwjdnw","id":"eq0kc99","author":"zimmah","parent_id":"t1_epzrz8g","subreddit_id":"t5_2wlj3","body":"It's funny how they never tell you to sell at the top.","body_html":"<div class = \"md\"> <p> Забавно, что они никогда не говорят вам продавать сверху. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq0kc99/","name":"t1_eq0kc99","created":1559715633,"created_utc":1559686833,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy3pdr","author":"Kabawl","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"All in all with whatever a whale does, as long as you dont freak out, you should be good. I could only imagine the amount of people thumb exercising their sell instead of riding the wave. \n\nLooking back at BTC's graph climbing to 20k, similar events took place. Numbers may be slightly off, give or take...\n\n$2960 6/9/17 - $1904 7/14/17\n\n$4607 9/1/17 - $3667 9/22/17\n\n$7394 11/3/17 - $5849 11/10/17","body_html":"<div class = \"md\"> <p> В целом, чем бы ни занимался кит, до тех пор, пока вы не волнуетесь, вы должны быть хорошими. Я мог только вообразить количество людей, использующих свои продажи вместо того, чтобы кататься на волне. </Р>\n\n<p> Оглядываясь назад на график BTC, набравший 20 тыс., произошли подобные события. Числа могут быть немного от, дать или взять ... </p>\n\n<p> 2960 9/17/17 - 1904/17/17 $ </p>\n\n<p> 4607 долл. США 01.09.17 - 3667 долл. США 22.09.17 </p>\n\n<p> 7394 11/17/17 долл. США - 17 58/17 долл. США </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy3pdr/","name":"t1_epy3pdr","created":1559647219,"created_utc":1559618419,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":116,"link_id":"t3_bwjdnw","replies":[{"ups":17,"link_id":"t3_bwjdnw","id":"epzlcxw","author":"Logpile98","parent_id":"t1_epybc1x","subreddit_id":"t5_2wlj3","body":"Unfortunately, it's not even close. 24 hours a day over 365 days a year is 8760 hours in a year (not counting leap year), at 10 years that's 87,600 hours. At 7.5 million USD per hour that's \"only\" $657 billion for the decade, or $65.7 billion per year. The deficit in 2018 alone was $779 billion, and the current national debt is $22 trillion. Absolutely staggering that $7.5 million per hour wouldn't even make a dent.","body_html":"<div class = \"md\"> <p> К сожалению, это даже не близко. 24 часа в сутки в течение 365 дней в году - 8760 часов в год (не считая високосного года), в 10 лет - 87 600 часов. При 7,5 млн. Долларов в час это «всего» 657 млрд. Долларов в течение десятилетия, или 65,7 млрд. Долларов в год. Только в 2018 году дефицит составил 779 миллиардов долларов, а текущий государственный долг - 22 триллиона долларов. Абсолютно ошеломляюще, что 7,5 млн. Долл. США в час не сделают даже вмятину. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzlcxw/","name":"t1_epzlcxw","created":1559696708,"created_utc":1559667908,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy36sv","author":"tyson1199","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Well if I could make 15 mil in 2 hours I would do it 4 times a day","body_html":"<div class = \"md\"> <p> Ну, если бы я мог заработать 15 мил за 2 часа, я бы делал это 4 раза в день </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy36sv/","name":"t1_epy36sv","created":1559646774,"created_utc":1559617974,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":257,"link_id":"t3_bwjdnw","replies":[{"ups":3,"link_id":"t3_bwjdnw","id":"epzofb3","author":"chahoua","parent_id":"t1_epy8quc","subreddit_id":"t5_2wlj3","body":"> although its not as blatant as we see in crypto trading\n\nThat reminds me of a pretty funny story.\n\nBack around 2007 or so the owner of the biggest Danish football club (FCK) announced that his club had invested in another big club (BIF).\n\nHe was generally seen as somewhat of a business genius so a lot of people bought BIF stocks too as they thought it must be a good buy. The price rose something like 10-15% and less than a week later he sold all the stocks. His club made a shit ton of money and the price of the rival clubs stock plummeted.\n\nPeople were **pissed!**","body_html":"<div class = \"md\"> <blockquote>\n<p> хотя это не так вопиюще, как мы видим в криптовалютах </p>\n</BLOCKQUOTE>\n\n<p> Это напоминает мне довольно забавную историю. </p>\n\n<p> Примерно в 2007 году или около того владелец самого большого датского футбольного клуба (FCK) объявил, что его клуб инвестировал в другой большой клуб (BIF). </p>\n\n<p> Его обычно считали чем-то вроде гения бизнеса, поэтому многие покупали акции BIF, так как считали, что это хорошая покупка. Цена выросла примерно на 10-15%, и менее чем через неделю он продал все акции. Его клуб заработал кучу денег, и цена акций конкурирующих клубов резко упала. </P>\n\n<p> Люди были <strong> разозлены! </strong> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzofb3/","name":"t1_epzofb3","created":1559698383,"created_utc":1559669583,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy4i5p","author":"orbofdeception","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"dump = manipulation\n\npump = tech","body_html":"<div class = \"md\"> <p> dump = манипулирование </p>\n\n<p> pump = tech </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy4i5p/","name":"t1_epy4i5p","created":1559647931,"created_utc":1559619131,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":17,"link_id":"t3_bwjdnw","id":"epy867j","author":"Ruttelisious","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"There is one solution, don’t panic sell or try to be a greedy TA-eliteboi. Hold your crypto and dont get tricked.","body_html":"<div class = \"md\"> <p> Есть одно решение: не паниковать, продавать или пытаться быть жадным TA-eliteboi. Держи криптографию и не обманывайся. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy867j/","name":"t1_epy867j","created":1559651554,"created_utc":1559622754,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":33,"link_id":"t3_bwjdnw","id":"epy93ni","author":"SaturnsSilverRing","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Maybe he was trying to buy a pizza and forgot what year it was?","body_html":"<div class = \"md\"> <p> Может быть, он пытался купить пиццу и забыл, какой это был год? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy93ni/","name":"t1_epy93ni","created":1559652550,"created_utc":1559623750,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":15,"link_id":"t3_bwjdnw","id":"epyabtq","author":"hjras","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"First time?","body_html":"<div class = \"md\"> <p> Первый раз? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyabtq/","name":"t1_epyabtq","created":1559653926,"created_utc":1559625126,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bwjdnw","replies":[{"ups":6,"link_id":"t3_bwjdnw","id":"epy6s29","author":"onenifty","parent_id":"t1_epy1dus","subreddit_id":"t5_2wlj3","body":"I have it on good authority that it was actually a Bogdanoff.","body_html":"<div class = \"md\"> <p> У меня есть все основания полагать, что на самом деле это был Богданов. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy6s29/","name":"t1_epy6s29","created":1559650112,"created_utc":1559621312,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy0wuj","author":"ndcong2002","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I believe it was Arthur.","body_html":"<div class = \"md\"> <p> Я думаю, это был Артур. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0wuj/","name":"t1_epy0wuj","created":1559644953,"created_utc":1559616153,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":10,"link_id":"t3_bwjdnw","id":"epyf7qj","author":"xaminmo","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Unregulated quasi-securities market.  This is par for the course.  Enjoy the show.","body_html":"<div class = \"md\"> <p> Нерегулируемый рынок квази-ценных бумаг. Это в порядке вещей. Наслаждайтесь шоу. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyf7qj/","name":"t1_epyf7qj","created":1559660245,"created_utc":1559631445,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":9,"link_id":"t3_bwjdnw","id":"epyb1uv","author":"Justtryme90","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"BTC rise as of late, was completely manufactured by whales.","body_html":"<div class = \"md\"> <p> Рост BTC в последнее время был полностью изготовлен китами. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyb1uv/","name":"t1_epyb1uv","created":1559654766,"created_utc":1559625966,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":23,"link_id":"t3_bwjdnw","replies":[{"ups":4,"link_id":"t3_bwjdnw","id":"eq06q3o","author":"-Takta-","parent_id":"t1_epye8if","subreddit_id":"t5_2wlj3","body":"Why would anyone complain about that?","body_html":"<div class = \"md\"> <p> Зачем кому-то жаловаться на это? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq06q3o/","name":"t1_eq06q3o","created":1559707956,"created_utc":1559679156,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epyax5c","author":"everythingisatoms","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"So when it dumps it’s manipulation but when it pumps it’s organic?","body_html":"<div class = \"md\"> <p> Итак, когда он сбрасывает свои манипуляции, но когда он качает, он органический? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyax5c/","name":"t1_epyax5c","created":1559654611,"created_utc":1559625811,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_bwjdnw","id":"epydbq0","author":"grumpyfrench","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Tldr. People sell and buy which make the price move","body_html":"<div class = \"md\"> <p> Tldr. Люди продают и покупают, что заставляет цену двигаться </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epydbq0/","name":"t1_epydbq0","created":1559657613,"created_utc":1559628813,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":42,"link_id":"t3_bwjdnw","id":"epy8avc","author":"FriendlyNeighborCEO","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Coinbase 24h BTC/USD volume is 25k BTC. The only place this happened was in your head.","body_html":"<div class = \"md\"> <p> Объем 24-часовой BTC / USD Coinbase составляет 25 тыс. BTC. Единственное место, где это произошло, было в твоей голове. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8avc/","name":"t1_epy8avc","created":1559651689,"created_utc":1559622889,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epyen4l","author":"NoSwearingAcc","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Lmao zoom out and look at the daily chart. Do you really think this rally could have gone forever? It was gonna dump sooner or later. The whale might have just triggered it.","body_html":"<div class = \"md\"> <p> Lmao уменьшите масштаб и посмотрите на дневной график. Вы действительно думаете, что это ралли могло бы продолжаться вечно? Рано или поздно это свалилось. Кит, возможно, только что вызвал это. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyen4l/","name":"t1_epyen4l","created":1559659416,"created_utc":1559630616,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":43,"link_id":"t3_bwjdnw","replies":[{"ups":13,"link_id":"t3_bwjdnw","id":"epyifm2","author":"j4c0p","parent_id":"t1_epy6bug","subreddit_id":"t5_2wlj3","body":"\"Its going to dump from ~~4k~~ , ~~5k~~ , ~~6k~~ ,~~7k 8k\"~~  \nKeep redrawing triangles , Pythagoras would be proud","body_html":"<div class = \"md\"> <p> \"Это будет дамп из <del> 4k </del>, <del> 5k </del>, <del> 6k </del>, <del> 7k 8k\" </дел> <br/>\nПродолжайте перерисовывать треугольники, Пифагор будет гордиться </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyifm2/","name":"t1_epyifm2","created":1559665361,"created_utc":1559636561,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy0ith","author":"LondonLexus","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"The TA boys are very quiet.....","body_html":"<div class = \"md\"> <p> Парни из ТА очень тихие ..... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0ith/","name":"t1_epy0ith","created":1559644646,"created_utc":1559615846,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_bwjdnw","id":"epy6dt9","author":"JamesTrendall","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Could this not be Coinbase moving funds from storage to another wallet?  \n\nIs there any indication that all that bitcoin was sold/bought?","body_html":"<div class = \"md\"> <p> Не может ли Coinbase переводить средства из хранилища в другой кошелек? </Р>\n\n<p> Есть ли признаки того, что весь этот биткойн был продан / куплен? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy6dt9/","name":"t1_epy6dt9","created":1559649718,"created_utc":1559620918,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":26,"link_id":"t3_bwjdnw","id":"epy3ucd","author":"Steven81","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Lol, where were you then very similar action got us from 3k to almost 9k? \n\nHypocrites.","body_html":"<div class = \"md\"> <p> Lol, где вы были очень похожим действием, которое привело нас от 3k к почти 9k? </Р>\n\n<Р> лицемеры. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy3ucd/","name":"t1_epy3ucd","created":1559647340,"created_utc":1559618540,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":13,"link_id":"t3_bwjdnw","replies":[{"ups":6,"link_id":"t3_bwjdnw","id":"epy4k3x","author":"-CryptoMania","parent_id":"t1_epy4gjh","subreddit_id":"t5_2wlj3","body":"I wish lol, just seemed funny to drop that line","body_html":"<div class = \"md\"> <p> Я бы хотел, лол, просто смешно было бросить эту строку </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy4k3x/","name":"t1_epy4k3x","created":1559647982,"created_utc":1559619182,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy0obm","author":"-CryptoMania","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Can't even spend a coin without sending the market into convulsions, shieeet...","body_html":"<div class = \"md\"> <p> Даже монету нельзя потратить, не отправив рынок в конвульсии, шиит ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0obm/","name":"t1_epy0obm","created":1559644765,"created_utc":1559615965,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":26,"link_id":"t3_bwjdnw","replies":[{"ups":6,"link_id":"t3_bwjdnw","id":"epy6rfm","author":"hammurabi1337","parent_id":"t1_epy1aep","subreddit_id":"t5_2wlj3","body":"Reddit aluminum, now with less features!","body_html":"<div class = \"md\"> <p> Алюминий Reddit, теперь с меньшими возможностями! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy6rfm/","name":"t1_epy6rfm","created":1559650094,"created_utc":1559621294,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epxzgom","author":"cryptorookie99","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I like you","body_html":"<div class = \"md\"> <p> Ты мне нравишься </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epxzgom/","name":"t1_epxzgom","created":1559643806,"created_utc":1559615006,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epy8bad","author":"mr_fujiyama","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"The rich get richer... at the expense of...","body_html":"<div class = \"md\"> <p> Богатые становятся богаче ... за счет ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8bad/","name":"t1_epy8bad","created":1559651700,"created_utc":1559622900,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bwjdnw","id":"epyex7s","author":"GharDK","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Don't you think a whale would sell @ blackpool so the price wouldn't tank.\n\nNo fool sells 215m worth of BTC on an illiquid market, blackpools are the whey to go when selling huge amounts.\n\n\nI thinks it's quite a stretch to say that a whale dumped the market but was able to score 15m usd in the buyback with little to no price action.","body_html":"<div class = \"md\"> <p> Не думаете ли вы, что кит продаст @ блэкпул, чтобы цена не пошла на спад. </p>\n\n<p> Ни один дурак не продает БТД на 215 млн. на неликвидном рынке, черные пулы - это сыворотка, которую нужно продавать при продаже в больших количествах. </p>\n\n<p> Я думаю, что довольно сложно сказать, что кит бросил рынок, но смог выкупить 15 миллионов долларов США при обратном выкупе практически без изменения цены. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyex7s/","name":"t1_epyex7s","created":1559659820,"created_utc":1559631020,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epyhnw3","author":"fabloisgone","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Umm, how do we know the person who transferring in 25K bitcoin and the one who transferred out 11k Bitcoin are the same person? \n\nCouldnt whale1 deposit 25k bitcoin, sell 11k to whale2 for $10,000,000, then withdraw 14k bitcoin and $10,000,000.\n\nWhale2 would then withdraw 11k bitcoin. \n\nThe scenario above would recreate what you are seeing exactly.","body_html":"<div class = \"md\"> <p> Хм, откуда мы знаем, что человек, который переводит биткойны в 25K, и тот, кто переводит биткойны в 11K, - это один и тот же человек? </Р>\n\n<p> Не удалось whale1 внести 25 тыс. биткойнов, продать 11 тыс. китам 2 за 10 000 000 долл., затем вывести 14 000 биткойнов и 10 000 000 долл. </p>\n\n<p> Whale2 затем выведет 11 тыс. биткойнов. </Р>\n\n<p> Приведенный выше сценарий воссоздает то, что вы видите точно. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyhnw3/","name":"t1_epyhnw3","created":1559664054,"created_utc":1559635254,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":13,"link_id":"t3_bwjdnw","replies":[{"ups":3,"link_id":"t3_bwjdnw","id":"epyjogd","author":"XaresPL","parent_id":"t1_epyis8t","subreddit_id":"t5_2wlj3","body":"You can use this 1mil to make more money though","body_html":"<div class = \"md\"> <p> Вы можете использовать это 1 мил, чтобы заработать больше денег, хотя </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyjogd/","name":"t1_epyjogd","created":1559667558,"created_utc":1559638758,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"epy9g1b","author":"mcrksman","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Who the fuck needs 200 million to live on? Give me a mil and I'll be set for life","body_html":"<div class = \"md\"> <p> Кому, черт возьми, нужно 200 миллионов, чтобы жить? Дайте мне мил, и я буду настроен на жизнь </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy9g1b/","name":"t1_epy9g1b","created":1559652929,"created_utc":1559624129,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":28,"link_id":"t3_bwjdnw","id":"epy0y9c","author":"Robby16","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"What’s wrong with that? People are allowed to sell and buy back. Stop crying and ride the wave.","body_html":"<div class = \"md\"> <p> Что с этим не так? Людям разрешено продавать и покупать обратно. Хватит плакать и кататься на волне. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0y9c/","name":"t1_epy0y9c","created":1559644983,"created_utc":1559616183,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_bwjdnw","id":"epy7rq9","author":"dottom","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"You need to do more work to make this claim. What was the order book? What were the fills on the way down and on the way back up?  And if this theory is correct, it is very likely this isn't the first time, so you should be able to trace these accounts' historical trades and show similar past patterns.\n\nOr maybe it was just coincidence...","body_html":"<div class = \"md\"> <p> Вам нужно проделать дополнительную работу, чтобы сделать это заявление. Какова была книга заказов? Какие заливки были на пути вниз и на пути назад? И если эта теория верна, вполне вероятно, что это не первый раз, поэтому вы должны иметь возможность отслеживать исторические сделки этих счетов и показывать аналогичные прошлые модели. </P>\n\n<p> Или, может быть, это было просто совпадение ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy7rq9/","name":"t1_epy7rq9","created":1559651136,"created_utc":1559622336,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_bwjdnw","id":"epyhnww","author":"AtomicSymphonic_2nd","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Please, tell me again why regulations are “bad”?","body_html":"<div class = \"md\"> <p> Пожалуйста, скажите мне еще раз, почему правила «плохие»? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyhnww/","name":"t1_epyhnww","created":1559664055,"created_utc":1559635255,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epyh05k","author":"totallynonplused","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"So the answer to this is simple, isn’t coinbase US based? Time to start writing complains to the regulating authorities.\n\nI seriously doubt that person is paying taxes on those gains and the feds really take a dim view towards market manipulation.","body_html":"<div class = \"md\"> <p> Таким образом, ответ на этот вопрос прост, разве не на основе США? Время начинать писать жалобы в регулирующие органы. </P>\n\n<p> Я серьезно сомневаюсь, что человек платит налоги с этих прибылей, и федералы действительно смутно относятся к манипулированию рынком. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyh05k/","name":"t1_epyh05k","created":1559662985,"created_utc":1559634185,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epyhx2g","author":"TotesMessenger","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/buttcoin] [BTC seems to be manipulated](https://www.reddit.com/r/Buttcoin/comments/bwm7c5/btc_seems_to_be_manipulated/)\n\n- [/r/u_colorprogram] [BTC Dump: Pure Whale Manipulation](https://www.reddit.com/r/u_ColorProgram/comments/bwm6up/btc_dump_pure_whale_manipulation/)\n\n- [/r/u_naynapat] [BTC Dump: Pure Whale Manipulation](https://www.reddit.com/r/u_naynapat/comments/bwpjur/btc_dump_pure_whale_manipulation/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*","body_html":"<div class = \"md\"> <p> Я бот, <em> bleep </em>, <em> bloop </em>. Кто-то связался с этой темой из другого места на Reddit: </p>\n\n<UL>\n<li> <p> [<a href=\"/r/buttcoin\"> / r / buttcoin </a>] <a href = \"https://www.reddit.com/r/Buttcoin/comments/bwm7c5/ btc_seems_to_be_manipulated / \"> BTC, похоже, манипулируют </a> </p> </li>\n<li> <p> [<a href=\"/r/u_colorprogram\"> / r / u_colorprogram </a>] <a href = \"https://www.reddit.com/r/u_ColorProgram/comments/bwm6up/ btc_dump_pure_whale_manipulation / \"> Дамп BTC: чистая манипуляция с китами </a> </p> </li>\n<li> <p> [<a href=\"/r/u_naynapat\"> / r / u_naynapat </a>] <a href = \"https://www.reddit.com/r/u_naynapat/comments/bwpjur/ btc_dump_pure_whale_manipulation / \"> Дамп BTC: чистая манипуляция с китами </a> </p> </li>\n</UL>\n\n<p> <em> <sup> Если вы переходите по любой из приведенных выше ссылок, соблюдайте правила reddit и не голосуйте в других темах. </sup> <sup> (<a href = \"/ r / TotesMessenger \"> Информация </a> </sup> <sup> / </sup> <sup> <a href=\"/message/compose?to=/r/TotesMessenger\"> Контакт </a>) </sup > </EM> </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyhx2g/","name":"t1_epyhx2g","created":1559664478,"created_utc":1559635678,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epyqgfq","author":"Yarnyosh","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Oh whale.  Welcome to the thunderdome bitchezzzz","body_html":"<div class = \"md\"> <p> О, кит. Добро пожаловать в Грозовую Битчецззз </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyqgfq/","name":"t1_epyqgfq","created":1559676737,"created_utc":1559647937,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epz2e4j","author":"Sweet_Fifi","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"This is how all markets work. The only way to combat this, is if through some miracle, majority of non whale traders collude to not fud sell during these manipulated movements. Then whales would have no incentive to dump as the risk/, reward would not be worthwhile. However, this is nearly impossible as small traders are only out for themselves.","body_html":"<div class = \"md\"> <p> Так работают все рынки. Единственный способ бороться с этим, если через какое-то чудо большинство трейдеров, не являющихся китами, вступают в сговор, чтобы не обманывать продажи во время этих манипулируемых движений. Тогда у китов не будет стимула к свалке, поскольку риск / вознаграждение не будет иметь смысла. Однако это практически невозможно, так как мелкие трейдеры работают только для себя. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epz2e4j/","name":"t1_epz2e4j","created":1559685676,"created_utc":1559656876,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epztadj","author":"Harucifer","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Going down: WHALE MANIPULATION, FUCK TETHER, BITFINEX CRIMINAL\n\nGoing up: aDoPTiOn, OrGaNiC GrOWTh\n\n\nFucking idiots","body_html":"<div class = \"md\"> <p> Понижение: МАНИПУЛЯЦИЯ КИТОВ, ЧЕРТОВОЙ ВЕС, БИТФИНЕКС УГОЛОВНЫЙ </p>\n\n<p> Подниматься: aDoPTiOn, OrGaNiC GROWTh </p>\n\n<p> Чертовы идиоты </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epztadj/","name":"t1_epztadj","created":1559701031,"created_utc":1559672231,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epzvki5","author":"GrimmReaperBG","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"If you just scroll down the historical data for BTC prices you will find out that no bull run has ever started in the summer. On top of that the place is ruled by bots, where every single exchange uses customers funds (of those stupid enough to hold their crypto in the exchanges) to make astonishing profits by arbitrages. And for last, the whole \"market\" is a very, very tiny fraction of the financial markets, just 200 bil. It would be a waste if some rich players don't toy with it all the time. Usually there is this majority of fresh \"traders\" that believe that some guy, who is charting on the internet and has some nice calls here and there will makes them rich. They even pay to get into private groups, whale secret signals and other magical tools like the described before. In my opinion every single individual who believes in such fairytale deserves everything he gets, and in 99.99% they are getting their wallets drained in less than 12 months...","body_html":"<div class = \"md\"> <p> Если вы просто прокрутите исторические данные о ценах на BTC, вы обнаружите, что летом не было быков. Кроме того, этим местом управляют боты, где каждая отдельная биржа использует средства клиентов (достаточно глупых, чтобы держать свои крипто на биржах), чтобы получать удивительную прибыль от арбитражей. И наконец, весь «рынок» - это очень, очень крошечная доля финансовых рынков, всего 200 млрд. Было бы бесполезно, если бы некоторые богатые игроки не играли с ним все время. Обычно это большинство новых «трейдеров», которые верят, что какой-то парень, который занимается графиком в интернете и имеет несколько хороших звонков здесь и там, сделает их богатыми. Они даже платят, чтобы попасть в частные группы, секретные сигналы китов и другие волшебные инструменты, подобные описанным ранее. По моему мнению, каждый человек, который верит в такую ​​сказку, заслуживает всего, что он получает, и в 99,99% они истощают свои кошельки менее чем за 12 месяцев ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzvki5/","name":"t1_epzvki5","created":1559702286,"created_utc":1559673486,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epzwrcr","author":"till-mann","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"The only lesson here is that /r/CryptoCurrency doesn't understand how skepticism or market orders work.","body_html":"<div class = \"md\"> <p> Единственный урок здесь заключается в том, что <a href=\"/r/CryptoCurrency\"> / r / CryptoCurrency </a> не понимает, как работают скептицизм или рыночные ордера. </p >\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzwrcr/","name":"t1_epzwrcr","created":1559702937,"created_utc":1559674137,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":16,"link_id":"t3_bwjdnw","id":"epy8bpa","author":"tarpmaster","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"This is why we can't get an ETF.  This is why it is illegal in regulated markets.  This is why governments want to regulate crypto markets.  This is why we can't have nice things.","body_html":"<div class = \"md\"> <p> Вот почему мы не можем получить ETF. Вот почему это запрещено на регулируемых рынках. Вот почему правительства хотят регулировать криптовалюты. Вот почему у нас не может быть хороших вещей. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8bpa/","name":"t1_epy8bpa","created":1559651713,"created_utc":1559622913,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_bwjdnw","id":"epy0cw1","author":"Leoak47","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Decentralized place equals wolfs on the hunt.. don’t cry if your fighting for this.. I’m all for wtv goes down. If decentralized or centralized. I’m happy but I won’t cry if someone is a bigger wolf then me. 🤷‍♂️ sad truth","body_html":"<div class = \"md\"> <p> Децентрализованное место равняется волкам на охоте .. не плачь, если ты сражаешься за это .. Я все из-за провала. Если децентрализовано или централизовано. Я счастлив, но я не буду плакать, если кто-то больше волка, чем я. 🤷‍♂️ грустная правда </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy0cw1/","name":"t1_epy0cw1","created":1559644517,"created_utc":1559615717,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epy1roa","author":"[deleted]","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"And still not half as bad as what's been happening with Tesla stock over the past three weeks","body_html":"<div class = \"md\"> <p> И все же не в два раза хуже, чем то, что происходило с акциями Tesla за последние три недели </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy1roa/","name":"t1_epy1roa","created":1559645624,"created_utc":1559616824,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bwjdnw","id":"epy6ylv","author":"tapunan","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"This is why SEC doesn't want to approve any ETF due to concerns about market manipulation.","body_html":"<div class = \"md\"> <p> Вот почему SEC не хочет утверждать ETF из-за опасений по поводу манипулирования рынком. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy6ylv/","name":"t1_epy6ylv","created":1559650294,"created_utc":1559621494,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_bwjdnw","id":"epye5hk","author":"TheGarlicBreadKing","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Let's be happy for our fellow whale who earned $15 mill in about an hour or two. Good for him! I hope he gets a lambo in his favorite color.","body_html":"<div class = \"md\"> <p> Будем рады за нашего кита, который заработал 15 миллионов долларов за час или два. Хорошо для него! Надеюсь, он получит ламбо в своем любимом цвете. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epye5hk/","name":"t1_epye5hk","created":1559658731,"created_utc":1559629931,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epy17io","author":"RayTheMaster","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Small fish need to buy theses so we gain momentum then","body_html":"<div class = \"md\"> <p> Рыбкам нужно покупать тезисы, чтобы мы набирали обороты </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy17io/","name":"t1_epy17io","created":1559645186,"created_utc":1559616386,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_bwjdnw","id":"epy5qs6","author":"DBA_HAH","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Ah yes but the days we had of 20% gains were not manufactured, simply natural markets.","body_html":"<div class = \"md\"> <p> Ах, да, но те дни, когда мы получали 20% прибыли, не были произведены, просто естественные рынки. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy5qs6/","name":"t1_epy5qs6","created":1559649102,"created_utc":1559620302,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epy8diw","author":"hudi2121","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Honestly, idk what side to take here; just live with it cause it’s the fucking Wild West or get pissed because one person who guessed right in 2010 needed to refill their piggy bank.\n\nI’ve been on the wrong side of 1 too many pump and dumps and economy will crumble if these things are not mitigated.\n\nI think it’s high time that coins stop paying to be listed on exchanges but flip the script. You need reputable exchanges where you know there is no fuckery going on behind the scenes pumping volume or price. Also, if the markets had programmed points where trading is halted, you would immediately eliminate the manipulation because people would be able to asses the state of the market and whether selling is truly warranted.","body_html":"<div class = \"md\"> <p> Честно говоря, не знаю, какую сторону здесь взять; просто смирись с этим, потому что это чертов Дикий Запад или разозлился, потому что один человек, который угадал прямо в 2010 году, должен был пополнить свою копилку. </p>\n\n<p> Я был на неправильной стороне: 1 слишком много насосов, и свалки, и экономия рухнет, если эти вещи не будут смягчены. </p>\n\n<p> Я думаю, что пришло время, когда монеты перестают платить, чтобы быть внесенными в список на биржах, но перевернуть сценарий. Вам нужны уважаемые биржи, на которых вы знаете, что за кулисами не происходит никакого бреда, качающего объем или цену. Кроме того, если бы на рынках были запрограммированные точки, где торговля была остановлена, вы бы немедленно исключили манипулирование, потому что люди могли бы оценить состояние рынка и действительно ли продажи оправданы. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8diw/","name":"t1_epy8diw","created":1559651767,"created_utc":1559622967,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epy4koy","author":"digital_lobotomy","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Only issue with that analysis is that the 24h volume on CBP is right around 25k right now and was (very roughly) abound ... I think like 6k prior to but I could be wrong.  \n\nStill doesn't invalidate your logic, just changes a few numbers","body_html":"<div class = \"md\"> <p> Единственная проблема, связанная с этим анализом, заключается в том, что 24-часовой том на CBP прямо сейчас составляет около 25 тыс., и его было (очень приблизительно) много ... Я думаю, что раньше было 6 тыс., но я могу ошибаться , </Р>\n\n<p> Все еще не лишает законной силы вашу логику, просто меняет несколько чисел </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy4koy/","name":"t1_epy4koy","created":1559647996,"created_utc":1559619196,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epy659v","author":"MrTGJC","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"The pump to this price was probably whale manipulation as well. \n\n[https://trends.google.com/trends/explore?date=today%205-y&geo=US&q=bitcoin](https://trends.google.com/trends/explore?date=today%205-y&geo=US&q=bitcoin)","body_html":"<div class = \"md\"> <p> Насос к этой цене, вероятно, был также манипуляцией с китами. </Р>\n\n<p> <a href=\"https://trends.google.com/trends/explore?date=today%205-y&geo=US&q=bitcoin\"> https://trends.google.com/trends/explore?date = сегодня% 205-й и гео = US & д = Bitcoin </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy659v/","name":"t1_epy659v","created":1559649489,"created_utc":1559620689,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epy779k","author":"DriveShaft24","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"one of my concerns is... whats to stop some whale from doing this every day? how could BTC hope to fly up again if this occurs constantly.","body_html":"<div class = \"md\"> <p> одна из моих проблем ... что мешает некоторым китам делать это каждый день? как BTC может надеяться снова взлететь, если это происходит постоянно. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy779k/","name":"t1_epy779k","created":1559650541,"created_utc":1559621741,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epy9hjo","author":"simon_fx","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"why wouldnt he do this over and over again then?","body_html":"<div class = \"md\"> <p> почему бы ему не делать это снова и снова? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy9hjo/","name":"t1_epy9hjo","created":1559652977,"created_utc":1559624177,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epya22n","author":"SethEllis","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Great analysis.  Now go back and look at what happened around every big buy.  At the moment price is completely manipulated and has no correlation with actual fundamentals.","body_html":"<div class = \"md\"> <p> Отличный анализ. Теперь вернитесь и посмотрите на то, что происходило вокруг каждой крупной покупки. На данный момент цена полностью манипулируется и не имеет корреляции с фактическими основами. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epya22n/","name":"t1_epya22n","created":1559653618,"created_utc":1559624818,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epybttf","author":"whatup1111","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Volume was less than 10k btc...","body_html":"<div class = \"md\"> <p> Объем был меньше 10 тыс. бит / час ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epybttf/","name":"t1_epybttf","created":1559655715,"created_utc":1559626915,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epydz9x","author":"burstintoflames1","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"When there's a manufactured pump, there's a manufactured dump following.","body_html":"<div class = \"md\"> <p> Когда изготовлен насос, за ним следует изготовленный дамп. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epydz9x/","name":"t1_epydz9x","created":1559658493,"created_utc":1559629693,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyeol1","author":"useemrlymad","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"what do you expect?","body_html":"<div class = \"md\"> <p> что вы ожидаете? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyeol1/","name":"t1_epyeol1","created":1559659475,"created_utc":1559630675,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyep5m","author":"Asio0tus","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"\"fak yuuuu dolphin and fak yuuu whaaaale\"","body_html":"<div class = \"md\"> <p> \"fak yuuuu dolphin и fak yuuu whaaaale\" </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyep5m/","name":"t1_epyep5m","created":1559659499,"created_utc":1559630699,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyf0g8","author":"minotauer","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I bet he leverage shorted on another account, easy money","body_html":"<div class = \"md\"> <p> Могу поспорить, что он заимствовал на другом счете, легкие деньги </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyf0g8/","name":"t1_epyf0g8","created":1559659948,"created_utc":1559631148,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epygwr0","author":"kirkisartist","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I wasn't complaining when they pumped it. And I'm not shocked they're dumping it.","body_html":"<div class = \"md\"> <p> Я не жаловался, когда они его качали. И я не в шоке, что они бросают его. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epygwr0/","name":"t1_epygwr0","created":1559662831,"created_utc":1559634031,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyhrxd","author":"kltan12","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"\\*fuckers\\*","body_html":"<div class = \"md\"> <p> * fuckers * </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyhrxd/","name":"t1_epyhrxd","created":1559664237,"created_utc":1559635437,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyj1wb","author":"Cheesecake10101101","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Maybe they needed a new yacht ?","body_html":"<div class = \"md\"> <p> Может, им нужна новая яхта? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyj1wb/","name":"t1_epyj1wb","created":1559666441,"created_utc":1559637641,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epykmjq","author":"jmlfc","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Welcome to the shit show","body_html":"<div class = \"md\"> <p> Добро пожаловать на шоу дерьма </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epykmjq/","name":"t1_epykmjq","created":1559669210,"created_utc":1559640410,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epymjbo","author":"nofreegp","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"BTC goes up BTC goes down but most of all BTC goes round","body_html":"<div class = \"md\"> <p> BTC идет вверх BTC идет вниз, но чаще всего BTC идет вверх </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epymjbo/","name":"t1_epymjbo","created":1559672397,"created_utc":1559643597,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyo8ks","author":"Tebasaki","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Is there a video explanation about this? It sounds like you sell 215 and buy 200 you lose 15.","body_html":"<div class = \"md\"> <p> Есть видео объяснение по этому поводу? Похоже, что вы продаете 215 и покупаете 200, вы теряете 15. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyo8ks/","name":"t1_epyo8ks","created":1559674701,"created_utc":1559645901,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyr2r5","author":"BobbaleeDoopadeeDoo","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Umm... hate to be \"that guy,\" but, is no one gonna talk about the entire flip side to this and wtf is BSV going UP????!!! \n\n(disclaimer, Not a bsv guy, only own btc atm thanks, and fuck you)","body_html":"<div class = \"md\"> <p> Ммм ... не хочется быть \"тем парнем\", но разве никто не собирается говорить обо всем этом с другой стороны, и ВТФ идет вверх по BSV ???? !!! </Р>\n\n<p> (отказ от ответственности, не парень bsv, только собственный btc atm, спасибо, и хрен вам) </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyr2r5/","name":"t1_epyr2r5","created":1559677284,"created_utc":1559648484,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyt6jo","author":"4_jacks","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Dude has some golden balls of kryptonite to trust Coinbase with $215M.","body_html":"<div class = \"md\"> <p> У чувака есть несколько золотых шариков криптонита, чтобы доверить Coinbase $ 215 млн. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyt6jo/","name":"t1_epyt6jo","created":1559679041,"created_utc":1559650241,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyv1qc","author":"coinalyze","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I think your theory is not really valid. The dump started around 23:00 UTC and lasted for about two hours. In that period only about 7k BTC has been sold. See chart with buy/sell volume here [https://coinalyze.net/bitcoin/usd/coinbase/price-chart-live/](https://coinalyze.net/bitcoin/usd/coinbase/price-chart-live/)  or screenshot here  [https://ibb.co/WWFnXnT](https://ibb.co/WWFnXnT)","body_html":"<div class = \"md\"> <p> Я думаю, что ваша теория на самом деле не верна. Свалка началась около 23:00 UTC и продолжалась около двух часов. За этот период было продано всего около 7 тыс. BTC. См. График с объемом покупки / продажи здесь <a href=\"https://coinalyze.net/bitcoin/usd/coinbase/price-chart-live/\"> https://coinalyze.net/bitcoin/usd/coinbase/price -chart-live / </a> или снимок экрана здесь <a href=\"https://ibb.co/WWFnXnT\"> https://ibb.co/WWFnXnT </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyv1qc/","name":"t1_epyv1qc","created":1559680522,"created_utc":1559651722,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyvlua","author":"StuGats","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"That's because this market has zero actual liquidity. Every exchange that reports high volume is full of shit. There's a reason why so many early adopters are HODLers and it's because they can't liquidate their position without crashing the market. Bitcoin is a glass tiger.","body_html":"<div class = \"md\"> <p> Это потому, что этот рынок имеет нулевую фактическую ликвидность. Каждый обмен, который сообщает о большом объеме, полон дерьма. Есть причина, почему так много ранних последователей являются HODLers, и это потому, что они не могут ликвидировать свою позицию, не разрушая рынок. Биткойн - это стеклянный тигр. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyvlua/","name":"t1_epyvlua","created":1559680941,"created_utc":1559652141,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epyyraf","author":"nomadismydj","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"it actually wasnt some massive transfer that dumped on you.. this tweet is correct. -  [https://twitter.com/Pyridox108/status/1135717317696868353](https://twitter.com/Pyridox108/status/1135717317696868353)","body_html":"<div class = \"md\"> <p> на самом деле это не был какой-то массивный перевод, который свалился на вас ... этот твит верен. - <a href=\"https://twitter.com/Pyridox108/status/1135717317696868353\"> https://twitter.com/Pyridox108/status/1135717317696868353 </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epyyraf/","name":"t1_epyyraf","created":1559683222,"created_utc":1559654422,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epz0gev","author":"mdgwashere12","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"How is moving BTC to coinbase a dump?  NEWB here.","body_html":"<div class = \"md\"> <p> Как продвигается BTC для создания дампа? NEWB здесь. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epz0gev/","name":"t1_epz0gev","created":1559684390,"created_utc":1559655590,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epz4s6h","author":"jkeegan123","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"If only there was a way to know when it was going to happen.","body_html":"<div class = \"md\"> <p> Если бы только был способ узнать, когда это произойдет. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epz4s6h/","name":"t1_epz4s6h","created":1559687191,"created_utc":1559658391,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epzleqk","author":"furyoshonen","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"This is why we the SEC was created. If Libertarians want a non governmental solution to Pump and Dumps, then the exchanges or the bitcoin core needs to come up with a solution quickly before government's step in and do the job that the free market is not. Otherwise, we just need to accept the market manipulation, as normal.","body_html":"<div class = \"md\"> <p> Вот почему мы создали SEC. Если либертарианцы хотят неправительственного решения Pump and Dumps, то биржи или ядро ​​биткойнов должны быстро найти решение, прежде чем вмешаться правительство, и выполнить работу, которой нет на свободном рынке. В противном случае нам просто нужно принять рыночные манипуляции, как обычно. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzleqk/","name":"t1_epzleqk","created":1559696736,"created_utc":1559667936,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epzlzyn","author":"live_authentically","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Just another shakeout.  The weak hands are going to get destroyed by whales as they did in '17.  This is very bullish to me.  Big BTC holders are focused on one thing and one thing only: Getting more BTC.  I'm doing nothing but buying dips From Sep 18 to now and will continue holding until at least 6 months after the halvening.  Guess we'll see how it plays out. Short term trading crypto in a bull market is suicide in my opinion.","body_html":"<div class = \"md\"> <p> Еще одна встряска. Слабые руки будут уничтожены китами, как они это сделали в 17 году. Это очень оптимистично для меня. Владельцы крупных BTC сосредоточены только на одном: получении большего BTC. Я ничего не делаю, но покупаю провалы с 18 сентября по настоящее время и продолжу удерживать их в течение, по крайней мере, 6 месяцев после сокращения. Думаю, мы увидим, как это закончится. Краткосрочная криптовалюта на бычьем рынке, на мой взгляд, самоубийство. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzlzyn/","name":"t1_epzlzyn","created":1559697054,"created_utc":1559668254,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"epzyen4","author":"pilotdave85","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I have an image of CSW stating how he was going to dump all his btc to drive down the btc price and pump bsv... i can't post images in comments though or I'd have just posted that.","body_html":"<div class = \"md\"> <p> У меня есть изображение CSW, в котором говорится, как он собирался сбросить все свои биты, чтобы снизить цену битрейта и прокачать бсв ... хотя я не могу публиковать изображения в комментариях, или я только что опубликовал это. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epzyen4/","name":"t1_epzyen4","created":1559703809,"created_utc":1559675009,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"eq09t8x","author":"cryptocraze_0","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"How is this wrong though? is this illegal or something, this is an open market, we all do as we please with our coins and we are all trying to buy low, sell high.","body_html":"<div class = \"md\"> <p> Как это не так? Это незаконно или что-то в этом роде, это открытый рынок, мы все делаем, как нам нравится, с нашими монетами, и мы все пытаемся покупать дешево, продавать дорого. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq09t8x/","name":"t1_eq09t8x","created":1559709472,"created_utc":1559680672,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"eq0ejb6","author":"JuanBenitoGuerrero","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"Are we all typing our \"let's not give up, i'm in it for the tech, here's the suicide hotline\" walls of text already?","body_html":"<div class = \"md\"> <p> Мы все печатаем нашу стену текста «давайте не сдаваться, я в поиске технологии, вот уже горячая линия самоубийства»? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq0ejb6/","name":"t1_eq0ejb6","created":1559712050,"created_utc":1559683250,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"eq0lns0","author":"e346e","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"I know you guys can't stand it when I do this. But it's part of the game. Don't invest more than you can lose and don't panic sell and this doesn't impact you. It's a victimless crime (not even a crime). Reallocation of wealth from the panicky dimwitted to the shrewd intelligent. Better to learn from this than to whine. Don't hate the player, nor the game. Learn to be a winner instead.","body_html":"<div class = \"md\"> <p> Я знаю, что вы, ребята, не можете этого вынести, когда я делаю это. Но это часть игры. Не вкладывайте больше, чем можете потерять, и не паникуйте, продавая, и это не повлияет на вас. Это преступление без жертв (даже не преступление). Перераспределение богатства от паники смутно до проницательного интеллигента. Лучше учиться на этом, чем ныть. Не ненавидь ни игрока, ни игру. Учитесь быть победителем вместо этого. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq0lns0/","name":"t1_eq0lns0","created":1559716613,"created_utc":1559687813,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"eq12s99","author":"ebaley","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"They want your coins.","body_html":"<div class = \"md\"> <p> Они хотят ваши монеты. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq12s99/","name":"t1_eq12s99","created":1559728680,"created_utc":1559699880,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_bwjdnw","id":"eq6nfyy","author":"SoberGameAddict","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"We know this","body_html":"<div class = \"md\"> <p> Мы это знаем </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/eq6nfyy/","name":"t1_eq6nfyy","created":1559861018,"created_utc":1559832218,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_bwjdnw","id":"epy4g14","author":"Libertymark","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"\nPure evil\n\n\nBut bullish as fuck","body_html":"<div class = \"md\"> <p> Чистое зло </p>\n\n<p> Но бычий как ебать </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy4g14/","name":"t1_epy4g14","created":1559647878,"created_utc":1559619078,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bwjdnw","id":"epya7cx","author":"JONNy-G","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"One person (or a few) being responsible for a >5% drop in my net worth in the course of a single day is not an ideal outlook for the future of money...\n\nWhat can be done to stop this from happening?","body_html":"<div class = \"md\"> <p> Один человек (или несколько человек), ответственный за> 5% -ное падение моей чистой стоимости в течение одного дня, не является идеальным прогнозом для будущего денег ... </р>\n\n<p> Что можно сделать, чтобы этого не случилось? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epya7cx/","name":"t1_epya7cx","created":1559653785,"created_utc":1559624985,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_bwjdnw","id":"epy8skf","author":"Gequals8PIT2","parent_id":"t3_bwjdnw","subreddit_id":"t5_2wlj3","body":"# EXCEPT for one small detail...\n\nCoinbase would never let anybody move that amount of money out at once. $10,000 per day or you can get the limits increased to $25k per day.","body_html":"<div class = \"md\"> <h1> за исключением одной маленькой детали ... </h1>\n\n<p> Coinbase никогда бы не позволил кому-либо вывести эту сумму сразу. 10 000 долларов США в день, или вы можете увеличить лимиты до 25 000 долларов США в день. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/bwjdnw/btc_dump_pure_whale_manipulation/epy8skf/","name":"t1_epy8skf","created":1559652213,"created_utc":1559623413,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0}]}