{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Прошло чуть менее трех лет с тех пор, как я присоединился к субреддиту, и чуть более трех лет с того момента, как я начал интересоваться криптовалютой. После бесчисленных часов исследований по различным отраслям промышленности, после прочтения технических документов, анализа профиля членов команды, просмотра записанных конференций и проведения расчетов, основанных на спросе и размере рынка, я могу с полной уверенностью написать, что подавляющее большинство сообщества Криптоинвесторов отсталый. Никогда я не видел рынок, который был бы менее сфокусирован на целях роста, или на которых крутились бы труднее для новостей и объявлений, влияние которых они даже не пытаются измерить или полностью понять.\n\nЧестно говоря, это не так уж удивительно. Сама технология более или менее трудна для понимания (любой, кто имеет опыт работы в области инженерии, информатики, экономики или финансов *, должен уметь понимать основные концепции и понимать, почему распределенные регистры имеют ценность, несмотря на то, что он не знаком с каждой ключевой концепцией) но чрезвычайно сложная часть состоит в том, чтобы точно представить, как эффективность должна быть достигнута на промышленном уровне, и насколько она будет эффективной. На других рынках именно поэтому существуют рейтинги, группы экспертов, консалтинговые группы. Они постоянно измеряют здоровье различных отраслей и делают прогнозы на основе тенденций, чтобы помочь другим принимать обоснованные решения. Даже тогда слой спекуляций (и, следовательно, манипуляций) всегда существует, но соотношение спекуляций и реального спроса, как правило, находится в совершенно другой лиге.\n\nНесмотря на то, что мы знаем или подозреваем это, одно и то же дерьмо случается ** каждый раз ** здесь. Биткойн начинает падать, и тролли выходят из леса, чтобы распространить свои депрессивные мысли на всех остальных. Альткойны начинают сиять, и дебилы, которые покупали во время безумия и видят 10% -ую прибыль впервые за недели, месяцы, если не когда-либо, начинают дергать друг друга и поглаживать себя по спине и писать эссе о том, почему эксперимент DPoS # 898 (у которого еще нет основной сети) находится на пути к массовому принятию и является * определенно * лучшей покупкой за десятилетие. Биткойн снова начинает расти, и внезапно все деньги приходят с остальной части рынка, чтобы накормить Большого папу, и каждый другой проект снова становится дерьмом, и они никогда ничего не достигнут.\n\nНет ничего страшного в том, как легко манипулируют всеми. Краткосрочные колебания рынка не делают вас правыми, и это также не делает вас неправыми. В основном * нулевые * откровенные дискуссии о состоянии технологии и о том, как она стоит относительно внедрения. *** В основном * нулевые * попытки составить комплексную карту экосистемы, чтобы «инвесторы» могли иметь четкое представление о том, как некоторые проекты могут взаимодействовать друг с другом, что позволяет нам сформулировать просвещенные предположения о том, какую долю рынка может захватить каждый из них. Никто, кажется, ни о чем не заботится о децентрализации *, но я подозреваю, что для подавляющего большинства это никогда не касалось свободы и справедливости, а только прибыли.\n\nВсе только празднуют, когда рынок движется вверх, даже не ставя под сомнение обоснованность этого движения. Когда актив раздувается без какой-либо фундаментальной причины, его единственным достижением является создание пузыря, который неизбежно приведет к серьезным потерям для большинства инвесторов.\n\nПринимая во внимание размер этого сообщества (только это субреддит), мы можем предупреждать других и влиять на рынок, привнося в него некоторую рациональность. Поэтому, пожалуйста, уделите время тому, чтобы побудить других взглянуть за пределы непосредственной выгоды и исследовать область. Потратьте время, чтобы критиковать твиттер \"влияния\". Потратьте время, чтобы обратиться к профессорам, профессионалам отрасли и другим знающим экспертам, чтобы спросить их мнение о конкретных проектах и ​​рынке в целом. Нам крайне необходимо создать глобальную сцену, на которой ведется информированный дискурс, иначе этот рынок никогда не будет действительно расти.","title":"Сообщество розничных инвесторов обладает памятью и логикой буквально золотой рыбки.","subreddit_name_prefixed":"r/CryptoCurrency","ups":2900,"created":1561669098,"link_flair_background_color":"","id":"c657ly","author":{"name":"bLbGoldeN"},"permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/","url":"https://www.reddit.com/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/","created_utc":1561640298,"replies":[{"ups":615,"link_id":"t3_c657ly","replies":[{"ups":3,"link_id":"t3_c657ly","id":"es79t5e","author":"throwawayLouisa","parent_id":"t1_es793dj","subreddit_id":"t5_2wlj3","body":"Proof of Stupidity?  I think we might have something here... wannabe collaborate on a white paper?","body_html":"<div class = \"md\"> <p> Доказательство глупости? Я думаю, что мы могли бы кое-что здесь ... хотеть сотрудничать на белой бумаге? </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es79t5e/","name":"t1_es79t5e","created":1561695418,"created_utc":1561666618,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es65f5t","author":"throwawayLouisa","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I wouldn't argue with a single word of that. Slow clap.","body_html":"<div class = \"md\"> <p> Я бы не стал спорить ни с одним словом об этом. Медленный хлопок. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es65f5t/","name":"t1_es65f5t","created":1561669766,"created_utc":1561640966,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":218,"link_id":"t3_c657ly","id":"es6aavd","author":"HontonoKershpleiter","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The biggest thing that bothers me is members of this subreddit treating cryptocurrencies like sports teams. They downvote any mention of crypto they don't like and upvote what they hold.","body_html":"<div class = \"md\"> <p> Самое большое, что меня беспокоит, - это члены этого подпредприятия, относящиеся к криптовалютам, как спортивные команды. Они опровергают любое упоминание о криптографии, которая им не нравится, и говорят о том, что у них есть. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6aavd/","name":"t1_es6aavd","created":1561673411,"created_utc":1561644611,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":249,"link_id":"t3_c657ly","replies":[{"ups":4,"link_id":"t3_c657ly","replies":[{"ups":10,"link_id":"t3_c657ly","id":"es6vmkz","author":"aron9forever","parent_id":"t1_es6tvl2","subreddit_id":"t5_2wlj3","body":"prolly the best choice, I also only hold Monero \n\nor do I? guess we'll never know","body_html":"<div class = \"md\"> <p>, конечно, лучший выбор, я также держу только Monero </p>\n\n<p> или я? думаю, мы никогда не узнаем </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6vmkz/","name":"t1_es6vmkz","created":1561687084,"created_utc":1561658284,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"es6sctx","author":"aron9forever","parent_id":"t1_es6bl7d","subreddit_id":"t5_2wlj3","body":"I hope then that you have one of the very few fungible coins, because Bitcoin and many of the others are the literal opposite of anonymity. Just because the layman  doesn't understand how it works and that long key looks impossible to understand and spooky, doesn't mean it's not very traceable by a computer programmed to do this, by people who understand blockchain like a brewer understands yeast (in comparison to the layman). \n\n\nI'm only saying this because it's a ridiculously common misconception - posssibly still the accepted 'truth' if you consider everyone who utters 'bitcoin' or something close to it like 'cryptobits' or whatever as being part of the ecosystem -, not necessarily for you.","body_html":"<div class = \"md\"> <p> Я надеюсь, что у вас есть одна из очень немногих грибных монет, потому что Биткойн и многие другие являются буквальной противоположностью анонимности. Тот факт, что непрофессионал не понимает, как он работает, и этот длинный ключ кажется невозможным для понимания и пугающим, не означает, что он не очень прослеживается компьютером, запрограммированным для этого, людьми, которые понимают блокчейн, как пивовар, понимает дрожжи (в сравнение с дилетантом). </Р>\n\n<p> Я говорю это только потому, что это смехотворно распространенное заблуждение - возможно, все еще общепринятая «правда», если вы считаете, что каждый, кто произносит «биткойн» или что-то похожее на «криптобиты» или что-то подобное, является частью экосистемы - , не обязательно для вас. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6sctx/","name":"t1_es6sctx","created":1561685065,"created_utc":1561656265,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es66oo7","author":"lemonmule","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"It’s such a fucking shitshow. The amount of immature comments is straight up gross. I swear half are either bots or people with $25 invested.","body_html":"<div class = \"md\"> <p> Это чертовски крутое шоу. Количество незрелых комментариев прямо вверх брутто. Клянусь, половина - это либо боты, либо люди с вложенными 25 долларами. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es66oo7/","name":"t1_es66oo7","created":1561670749,"created_utc":1561641949,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":23,"link_id":"t3_c657ly","replies":[{"ups":3,"link_id":"t3_c657ly","id":"es7s9i5","author":"alivmo","parent_id":"t1_es690zz","subreddit_id":"t5_2wlj3","body":"Stop hanging out in r/cc, it's a cesspool.  Basically no one of any intellect spends much time even trying to accomplish anything here.  The only purpose of this sub is to gauge the direction the horde of sheep are currently running.","body_html":"<div class = \"md\"> <p> Хватит зависать в <a href=\"/r/cc\"> r / cc </a>, это выгребная яма. В основном никто из интеллекта не тратит много времени, даже пытаясь что-то сделать здесь. Единственная цель этого субмарины - определить направление бега овец. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7s9i5/","name":"t1_es7s9i5","created":1561707253,"created_utc":1561678453,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es68kic","author":"Wagamamamany","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"What you are saying is that within this community, a large majority of the people don't know enough about the technology/don't care to make informed decisions. However, this is what you'll find in every industry. Almost all of the productive discussions come from 20% of the population. The big difference, is it's a new technology and almost everyone is talking through the internet on social media platforms. A place where anyone can post anything and they will be listened to. As Ricky Gervais puts it, its like the wall of a public bathroom in which everyone posts their thoughts and feelings. I don't think you're wrong, but I think the best thing you can do is to argue against any stupid comments with sound reason and generally just continue to contribute to discussions.","body_html":"<div class = \"md\"> <p> Вы говорите о том, что в этом сообществе подавляющее большинство людей недостаточно знает о технологии / не заботится о принятии обоснованных решений. Тем не менее, это то, что вы найдете в каждой отрасли. Почти все продуктивные дискуссии происходят от 20% населения. Большая разница в том, что это новая технология, и почти все общаются через Интернет на платформах социальных сетей. Место, где каждый может опубликовать что угодно, и его будут слушать. Как говорит Рики Жерве, это похоже на стену общественной ванной комнаты, в которой каждый публикует свои мысли и чувства. Я не думаю, что вы не правы, но я думаю, что лучшее, что вы можете сделать, - это спорить с любыми глупыми комментариями с веской причиной и, как правило, просто продолжать участвовать в дискуссиях. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es68kic/","name":"t1_es68kic","created":1561672167,"created_utc":1561643367,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":145,"link_id":"t3_c657ly","replies":[{"ups":21,"link_id":"t3_c657ly","replies":[{"ups":4,"link_id":"t3_c657ly","replies":[{"ups":9,"link_id":"t3_c657ly","replies":[{"ups":2,"link_id":"t3_c657ly","id":"es84cq4","author":"Chief_Kief","parent_id":"t1_es6k6wu","subreddit_id":"t5_2wlj3","body":"Silver actually","body_html":"<div class = \"md\"> <p> Серебро на самом деле </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es84cq4/","name":"t1_es84cq4","created":1561716369,"created_utc":1561687569,"subreddit_name_prefixed":"r/CryptoCurrency","depth":8}],"id":"es6iux4","author":"throwawayLouisa","parent_id":"t1_es6gqo8","subreddit_id":"t5_2wlj3","body":"I thought not. It's not a story /cc would tell you. It's a Crypto legend. Darth LenweMithrandir was a Dark Lord of the Crypto, so powerful and so wise he could use the TA to influence the Bogdanofs to create pumps... He had such a knowledge of the big red dildoes that he could even keep the coins he cared about from dying. The dark side of the TA is a pathway to many abilities some consider to be unnatural. He became so powerful... the only thing he was afraid of was losing his stash, which eventually, of course, he did. Unfortunately, he taught his apprentice everything he knew, then his apprentice hunted his limit orders while he slept. Ironic, he could save others from being rekt, but not himself.","body_html":"<div class = \"md\"> <p> Я не думал. Это не история, которую сказал бы вам cc. Это крипто легенда. Дарт Ленве Митрандир был Темным Лордом Крипто, настолько могущественным и мудрым, что мог использовать ТА, чтобы влиять на Богданофа для создания насосов ... У него было такое знание больших красных фаллоимитаторов, что он мог даже хранить монеты, о которых заботился от смерти Темная сторона ТА - это путь ко многим способностям, которые некоторые считают неестественными. Он стал таким могущественным ... единственное, чего он боялся, это потерять свой тайник, что, в конце концов, он и сделал. К сожалению, он научил своего ученика всему, что знал, затем его ученик охотился на его предельные приказы, пока он спал. Как ни странно, он мог спасти других от ректа, но не себя. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6iux4/","name":"t1_es6iux4","created":1561679094,"created_utc":1561650294,"subreddit_name_prefixed":"r/CryptoCurrency","depth":6}],"id":"es6fap3","author":"throwawayLouisa","parent_id":"t1_es6ccje","subreddit_id":"t5_2wlj3","body":"Under the circumstances, there's a \"Did you ever hear the tragedy of Darth Plagueis the Wise?\" joke here somewhere, but I can't quite get to it.","body_html":"<div class = \"md\"> <p> В этих обстоятельствах есть \"Вы когда-нибудь слышали трагедию Дарта Чума Мудрого?\" шутка где-то здесь, но я не могу до нее добраться. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6fap3/","name":"t1_es6fap3","created":1561676795,"created_utc":1561647995,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"es6bxti","author":"throwawayLouisa","parent_id":"t1_es6b50y","subreddit_id":"t5_2wlj3","body":"[Dunning-Kruger effect](https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect).","body_html":"<div class = \"md\"> <p> <a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\"> эффект Даннинга-Крюгера </a>. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6bxti/","name":"t1_es6bxti","created":1561674533,"created_utc":1561645733,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":6,"link_id":"t3_c657ly","replies":[{"ups":4,"link_id":"t3_c657ly","id":"es6h5ia","author":"bLbGoldeN","parent_id":"t1_es6dccd","subreddit_id":"t5_2wlj3","body":"My pleasure. Despite what people may think, I've little interest in influencing others for personal gain. I just want the world to become a better place. It's an extremely discouraging goal.","body_html":"<div class = \"md\"> <p> Мое удовольствие. Несмотря на то, что люди могут думать, я мало заинтересован во влиянии на других ради личной выгоды. Я просто хочу, чтобы мир стал лучше. Это крайне обескураживающая цель. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6h5ia/","name":"t1_es6h5ia","created":1561677997,"created_utc":1561649197,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"es6csz4","author":"bLbGoldeN","parent_id":"t1_es6b50y","subreddit_id":"t5_2wlj3","body":"What you're describing is the [Dunning-Kruger effect](https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect), and it's a real plague.","body_html":"<div class = \"md\"> <p> Что вы описываете, так это <a href=\"https://en.wikipedia.org/wiki/Dunning%E2%80%93Kruger_effect\"> эффект Даннинга-Крюгера </а> и это настоящая чума. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6csz4/","name":"t1_es6csz4","created":1561675120,"created_utc":1561646320,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":3,"link_id":"t3_c657ly","id":"es6efiq","author":"Mr_HODL","parent_id":"t1_es6b50y","subreddit_id":"t5_2wlj3","body":"Fuck yes, the more knowledge you gain, the more you realise how little you know","body_html":"<div class = \"md\"> <p> Черт, да, чем больше знаний ты получаешь, тем больше понимаешь, как мало ты знаешь </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6efiq/","name":"t1_es6efiq","created":1561676210,"created_utc":1561647410,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":3,"link_id":"t3_c657ly","id":"es6irnu","author":"-staccato-","parent_id":"t1_es6b50y","subreddit_id":"t5_2wlj3","body":"> Apparently there is a plateau on the knowledge versus \"realization on knowledge\" relation (picture it in a graphic) \n\nDK illustrated: https://i.imgur.com/mFAFcor.jpg","body_html":"<div class = \"md\"> <blockquote>\n<p> По-видимому, между платформой знаний и соотношением «реализация на знаниях» есть плато (изобразите это на рисунке) </p>\n</BLOCKQUOTE>\n\n<p> НЗ проиллюстрировано: <a href=\"https://i.imgur.com/mFAFcor.jpg\"> https://i.imgur.com/mFAFcor.jpg </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6irnu/","name":"t1_es6irnu","created":1561679036,"created_utc":1561650236,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es675lf","author":"Blockchainsapiens","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The problem is, not just in crypto, that many people think they are an 'expert' in everything. It seems to be become a new trend in our society. They are food experts, climate change experts, have a deep understanding of politics, have a deep understanding of complex blockchain infrastructure, etc. Critical thinking and philosophy seem to become less important and people try to use their 'intuition' to give their opinion about everything. Especially on the internet where you are somewhat anonymous and can get away with saying almost anything without any consequences.\n\nEdit: This is why I signed up on trustory.io. I feel like Reddit keeps falling in the same traps and new companies like trustory.io focus on debating by using credible sources and reputation.","body_html":"<div class = \"md\"> <p> Проблема не только в криптографии, в том, что многие люди считают себя экспертом во всем. Кажется, это стало новой тенденцией в нашем обществе. Они - эксперты по продуктам питания, эксперты по изменению климата, имеют глубокое понимание политики, имеют глубокое понимание сложной инфраструктуры блокчейна и т. Д. Критическое мышление и философия, кажется, становятся менее важными, и люди пытаются использовать свою «интуицию», чтобы высказать свое мнение о все. Особенно в Интернете, где вы несколько анонимны и можете говорить практически все без каких-либо последствий. </P>\n\n<p> Изменить. Именно поэтому я подписался на trustory.io. Я чувствую, что Reddit продолжает попадать в те же ловушки, а новые компании, такие как trustory.io, фокусируются на дебатах, используя заслуживающие доверия источники и репутацию. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es675lf/","name":"t1_es675lf","created":1561671108,"created_utc":1561642308,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":47,"link_id":"t3_c657ly","id":"es689um","author":"UniqueUsername642","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"If you are already annoyed by newbies just wait a couple of months. Within the next bull run 95% of this sub will consist of those kind of posts. Coin xy is up 10%? \"I am a genius and this is why should invest.\" Bitcoin is down 5%? \"It was fun boys, but the bubble bursted. Bitcoin is dead.\"\n\nPeople joke about the \"moon lambo\" phrase. But I feel that is the actual mentality of a lot of people here. And it will only get worse with each bull market.","body_html":"<div class = \"md\"> <p> Если вас уже раздражают новички, просто подождите пару месяцев. В следующем тесте 95% этого саба будет состоять из таких сообщений. Монета ху поднялась на 10%? «Я гений, и поэтому должен инвестировать». Биткойн упал на 5%? «Это было забавно, мальчики, но пузырь лопнул. Биткойн мертв». </P>\n\n<p> Люди шутят насчет фразы «лунный ламбо». Но я чувствую, что это настоящий менталитет многих людей здесь. И это будет только ухудшаться с каждым бычьим рынком. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es689um/","name":"t1_es689um","created":1561671950,"created_utc":1561643150,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":10,"link_id":"t3_c657ly","replies":[{"ups":2,"link_id":"t3_c657ly","id":"es6dog0","author":"Horrux","parent_id":"t1_es6cbd0","subreddit_id":"t5_2wlj3","body":"I fully agree. But crowd psychology is easy to understand, so that's OK.","body_html":"<div class = \"md\"> <p> Я полностью согласен. Но психологию толпы легко понять, так что все в порядке. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6dog0/","name":"t1_es6dog0","created":1561675702,"created_utc":1561646902,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es6ad1h","author":"Horrux","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"It's the same shit in the stock market: Fear and greed are the dominant drivers. They are emotions, not reason.\n\nPeople feel these things and then go on to rationalize what they feel. That is neither rational nor reasonable. It is knee-jerk reactions ruling the day.","body_html":"<div class = \"md\"> <p> Это то же самое дерьмо на фондовом рынке: страх и жадность являются доминирующими факторами. Это эмоции, а не разум. </P>\n\n<p> Люди чувствуют эти вещи, а затем продолжают рационализировать то, что они чувствуют. Это не рационально и не разумно. День - реакция коленного рефлекса. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ad1h/","name":"t1_es6ad1h","created":1561673453,"created_utc":1561644653,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_c657ly","id":"es6f2n6","author":"TonberryHS","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"\"Never about freedom, but profit.\" \n\n- For most of us, that's one and the same. Financial freedom from working, bills, student loans, hospital fees or feeding your kids ramen for the third night in a row. The stories that some druggo forgot he had 1000 BTC in a wallet from 7 years ago and now has financial freedom to buy/go whatever/wherever whilst the 99% get up and go to jobs they hate to pay bills, lead one to think \"why not me this time?\"","body_html":"<div class = \"md\"> <p> \"Никогда не о свободе, а о прибыли.\" </Р>\n\n<UL>\n<li> Для большинства из нас это одно и то же. Финансовая свобода от работы, счетов, студенческих ссуд, больничных сборов или кормления ваших детей рамэном в течение третьей ночи подряд. Истории о том, что какой-то наркоман забыл, что он имел 1000 BTC в кошельке 7 лет назад, и теперь у него есть финансовая свобода покупать / идти куда угодно / куда угодно, в то время как 99% встают и идут на работу, которую они ненавидят оплачивать счета, заставляют думать \" почему не я на этот раз? \"</li>\n</UL>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6f2n6/","name":"t1_es6f2n6","created":1561676645,"created_utc":1561647845,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_c657ly","replies":[{"ups":2,"link_id":"t3_c657ly","id":"esa39jb","author":"deineemudda","parent_id":"t1_es7j9a9","subreddit_id":"t5_2wlj3","body":"yes. but when the retail comes, you have to think like an idiot.","body_html":"<div class = \"md\"> <p> да. но когда приходит розница, нужно думать как идиот. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/esa39jb/","name":"t1_esa39jb","created":1561779329,"created_utc":1561750529,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es6p8dm","author":"deineemudda","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"to counteract this very solid post, here a gem i found in 4chan;\n\nHello Idiots,\n\nThis is the only post you ever need to read if you want to \"make it\" during an actual bull run.\n\n1) As soon as there is a day with multiple 101-300 rank shitcoins going 100% on accessible exchanges, and random idiots begin asking how to buy alts, AND btc dominance slips below 55% that's it. It's alt season. That is your signal. You can get in earlier than this, but that is the sure thing.\n2) Immediately split off half your btc (and possibly eth stack), and spread ~500-1000 dollars into several different rank 101-400 shitcoins on accessible exchanges, THAT ARE NOT DEAD ERC20's FROM 2017. \n3) Put 200-500 dollars into a collection of rank 401-800 shitcoins that haven't mooned yet \n4) Wait for it. \n5) Be prepared to condense the eth/btc from low performers into your shitcoins that are pumping. If something pumps once, during alt season this means it will go again. There is no one-and-done with mass fomo. Your objective here is to recognize when something is popping off, and \"all in\" temporarily with your shitcoin funds, and then exit with your inital x2, while leaving initial x1 to ride. \n6) repeat\n\nAdvanced tips:\n\n* If BTC/ETH moves upwards hard during the alt season, you have to be ready to move back into BTC, because everyone else is going to and you will sit there with your thumb up your ass waiting for something to happen to your shitcoin\n\n* When you take profit, relegate the appropriate % of that profit for taxes. The ZOG is no joke, and cones are making them increasingly antsy. Just hold onto this amount on the side, so you have the option of complying when the time comes. You may be extremely unpleasantly surprised if you trade hard during the year, and btc dumps leaving you with taxable events but no profit, and your \"home exchange\" is reporting your trades to the jews.\n\n* Make your shitty exchange accounts now. Spread out and create accounts on like 10+ different garbage exchanges.","body_html":"<div class = \"md\"> <p>, чтобы противодействовать этому очень твердому сообщению, здесь жемчужина, которую я нашел в 4chan; </p>\n\n<p> Привет идиоты, </p>\n\n<p> Это единственный пост, который вам когда-либо нужно прочитать, если вы хотите «сделать это» во время реального бега с быками. </p>\n\n<p> 1) Как только наступает день с множеством шиткойнов с рейтингом 101-300, которые на 100% становятся доступными на биржах, и случайные идиоты начинают спрашивать, как купить альтов, и доминирование btc снижается до 55%, вот и все. Это уже сезон. Это твой сигнал. Вы можете войти раньше, чем это, но это точно.\n2) Немедленно отколоть половину вашего btc (и, возможно, eth stack), и распределите ~ 500-1000 долларов в несколько различных shitcoin ранга 101-400 на доступных биржах, ЭТО НЕ СМЕРТЬ ERC20 ОТ 2017 ГОДА.\n3) Положите 200-500 долларов в коллекцию шиткойнов ранга 401-800, которые еще не лунатировали.\n4) Ждите этого.\n5) Будьте готовы к тому, чтобы сконцентрировать eth / btc из низкоэффективных приложений в ваши шиткойны, которые выкачивают. Если что-то прокачивается один раз, то в течение всего сезона это означает, что оно пойдет снова. С массовым фомо никто не справился. Ваша цель здесь состоит в том, чтобы распознать, когда что-то выпадает, и временно «пойти ва-банк» с вашими деньгами на шиткойн, а затем выйти с начальным х2, оставив начальный х1 для поездки.\n6) повторить </p>\n\n<p> Дополнительные советы: </p>\n\n<UL>\n<li> <p> Если BTC / ETH продвигается вверх сильно в течение альтернативного сезона, вы должны быть готовы вернуться в BTC, потому что все остальные собираются, и вы будете сидеть там с большим пальцем вверх по заднице, ожидая чего-то, чтобы случиться с твоим дерьмом </p> </li>\n<li> <p> Когда вы берете прибыль, переводите соответствующий процент этой прибыли на налоги. ZOG - не шутка, и шишки делают их все более раздражительными. Просто держите эту сумму на стороне, чтобы иметь возможность выполнить, когда придет время. Вы можете быть крайне неприятно удивлены, если вы интенсивно торгуете в течение года, и btc сбрасывает вас с облагаемых налогом событий, но без прибыли, и ваша «домашняя биржа» сообщает о ваших сделках евреям. </P> </li>\n<li> <p> Создайте свои дерьмовые учетные записи сейчас. Распространение и создание учетных записей на более чем 10 различных биржах мусора. </P> </li>\n</UL>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6p8dm/","name":"t1_es6p8dm","created":1561683130,"created_utc":1561654330,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":19,"link_id":"t3_c657ly","id":"es69ij6","author":"JamesWalsh88","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Intelligent discussion on Reddit?  XD","body_html":"<div class = \"md\"> <p> Интеллектуальное обсуждение Reddit? XD </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69ij6/","name":"t1_es69ij6","created":1561672853,"created_utc":1561644053,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_c657ly","id":"es6q7jd","author":"NotOneStar","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"It's because, and I truly believe this, at the present time cryptocurrencies only exist to be gambled with. Period. End of story.\n\nIt doesn't matter if bitcoin is $1 or $1 million tomorrow, it still doesn't change how it's being used. \n\nHowever, once some of these projects start pulling off some real tangible tools that people really use (cross currency transactions with OmiseGO, virtually free remittance payments with XLM, etc), THEN we'll see some sensible valuation on these things and THEN it'll will bring some stability to the markets, as with oil, precious metals, stocks, and so on. But for now this is all just a giant casino with futures trading dominating the market.","body_html":"<div class = \"md\"> <p> Потому что, и я искренне верю в это, в настоящее время криптовалюты существуют только для игры. Период. Конец истории. </P>\n\n<p> Неважно, будет ли биткойн завтра на 1 или 1 миллион долларов, это все равно не изменит способ его использования. </Р>\n\n<p> Однако, как только некоторые из этих проектов начнут реализовывать некоторые реальные материальные инструменты, которые люди действительно используют (кросс-валютные операции с OmiseGO, практически бесплатные платежные переводы с XLM и т. д.), ТОГДА мы увидим некоторую разумную оценку этих вещей и ПОТОМ это принесет некоторую стабильность на рынки, как с нефтью, драгоценными металлами, акциями и так далее. Но пока это всего лишь гигантское казино с фьючерсной торговлей, доминирующей на рынке. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6q7jd/","name":"t1_es6q7jd","created":1561683731,"created_utc":1561654931,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":25,"link_id":"t3_c657ly","replies":[{"ups":4,"link_id":"t3_c657ly","id":"es69ula","author":"Bibliophylum","parent_id":"t1_es65wzd","subreddit_id":"t5_2wlj3","body":"Updoot for the reference - aaaand now I need a new coffee.","body_html":"<div class = \"md\"> <p> Обновление для справки - ааа, и теперь мне нужен новый кофе. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69ula/","name":"t1_es69ula","created":1561673092,"created_utc":1561644292,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":3,"link_id":"t3_c657ly","id":"es6comh","author":"dysangel","parent_id":"t1_es65wzd","subreddit_id":"t5_2wlj3","body":"I don't think you have to be an expert to see the value in crypto. It's fairly easy to see that it can and probably should replace at least some existing forms of value storage.\n\nIt's literally impossible to tell which crypto will end up being the world currency in a few decades though, so any investment put into crypto should be actively reviewed regularly. I have put small or medium amounts into alts that seem promising to me. I feel like 99% of them will be worthless in a couple of years though, you never know who will come out ahead. Adoption is more about marketing and popularity than pure technical merit.","body_html":"<div class = \"md\"> <p> Я не думаю, что вам нужно быть экспертом, чтобы увидеть значение в криптографии. Довольно легко понять, что он может и, вероятно, должен заменить хотя бы некоторые существующие формы хранения значений. </P>\n\n<p> Буквально невозможно сказать, какая криптография станет мировой валютой через несколько десятилетий, поэтому любые инвестиции, вложенные в криптографию, должны регулярно проверяться. Я вложил небольшие или средние суммы в альтов, которые кажутся мне многообещающими. Я чувствую, что 99% из них будут бесполезны через пару лет, хотя вы никогда не знаете, кто выйдет вперед. Принятие - это скорее маркетинг и популярность, чем чисто техническая заслуга. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6comh/","name":"t1_es6comh","created":1561675038,"created_utc":1561646238,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es65a86","author":"Mercuun","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"TL;DR. Lambo now? :)  \n\n\nI earnest, you're probably right. But there's always the option to ignore all of it. Buy tech you believe in or where you see value and ignore the droning of a million voices.","body_html":"<div class = \"md\"> <p> TL; DR. Ламбо сейчас? :) </p>\n\n<p> Я серьезно, вы, вероятно, правы. Но всегда есть возможность игнорировать все это. Покупайте технологии, в которые вы верите или в которых вы видите ценность, и игнорируйте гудение миллиона голосов. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es65a86/","name":"t1_es65a86","created":1561669653,"created_utc":1561640853,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":40,"link_id":"t3_c657ly","replies":[{"ups":2,"link_id":"t3_c657ly","id":"es6ifz0","author":"the_manofsteel","parent_id":"t1_es6ef5y","subreddit_id":"t5_2wlj3","body":"The only reason I would say the price is justified is because of its mainstream usage but...\n\n99% doesn’t use it to pay for anything, they are only buying it to get rich in their fiat\n\nI’ve never heard anyone ever said they pay with crypto  or even talked about using it\n\nIf we got bitcoin to be used as much as the smartphone I would change my mind, until that happens i will keep trading it myself like it’s the worlds biggest scam","body_html":"<div class = \"md\"> <p> Единственная причина, по которой я бы сказал, что цена оправдана, это ее массовое использование, но ... </p>\n\n<p> 99% не используют его для оплаты чего-либо, они покупают его только для того, чтобы разбогатеть в своем распоряжении </p>\n\n<p> Я никогда не слышал, чтобы кто-то когда-либо говорил, что платит крипто или даже говорил об этом </p>\n\n<p> Если бы мы использовали биткойн столько же, сколько смартфон, я бы передумал, пока это не произойдет, я буду торговать им сам, как будто это самая большая афера в мире </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ifz0/","name":"t1_es6ifz0","created":1561678831,"created_utc":1561650031,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es695eu","author":"the_manofsteel","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The years I’ve been following crypto I’ve seen bitcoin go to 19k back to 3 and now up to 13 again\n\nDuring this time there haven’t been a single  news article that contain something actually real that state it should actually be worth this much \n\nThe only reason 99% of the people post here are about the price going up or down \n\nCrypto is a money making machine, nothing else\nThe big players knows this\n\nAll ads about bitcoin is about people getting rich when they buy it and that is a perfect sale pitch since who doesn’t want to get rich\n\nThe big players then together manipulate the market to start over the bubble chart over and over to trigger feelings on the inexperienced investors \n(Google Wall Street market cycle) \n\nThis will only continue to work as long as it’s not regulated because if it were nothing of how it’s traded would be legal \n\nBut that’s the awesome thing with crypto, it’s sale point is unregulated and decentralized","body_html":"<div class = \"md\"> <p> За годы, за которыми я следовал крипто, я видел биткойны, которые выросли с 19k до 3, а теперь до 13 снова </p>\n\n<p> За это время не было ни одной новостной статьи, которая содержала бы что-то действительно реальное, заявляющее, что оно должно стоить так много </p>\n\n<p> Единственная причина, по которой 99% людей пишут здесь, связана с повышением или понижением цены </p>\n\n<p> Crypto - это машина для зарабатывания денег, больше ничего\nКрупные игроки знают это </p>\n\n<p> Все объявления о биткойнах рассказывают о людях, которые становятся богатыми, когда покупают его, и это идеальный шаг для продажи, поскольку они не хотят разбогатеть </p>\n\n<p> Крупные игроки затем вместе манипулируют рынком, чтобы снова и снова начинать с пузырьковой диаграммы, чтобы вызывать чувства у неопытных инвесторов.\n(Рыночный цикл Google Уолл-стрит) </p>\n\n<p> Это будет продолжать работать только до тех пор, пока это не будет регулироваться, потому что если бы не было ничего, как это было бы продано, было бы законно </p>\n\n<p> Но с крипто это удивительная вещь, это точка продажи нерегулируемая и децентрализованная </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es695eu/","name":"t1_es695eu","created":1561672587,"created_utc":1561643787,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":12,"link_id":"t3_c657ly","id":"es69inj","author":"Mo-to-the-Mo","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"EXACTLY, when I try to even SUGGEST a slight pull back (like the correction from yesterday’s almost 14k) I get downvoted into oblivion. Goes to show you we’re still a relatively young market with immature emotional traders FOMOing in every time bitcoin pumps","body_html":"<div class = \"md\"> <p> Точно, когда я пытаюсь даже предложить небольшое отступление (как коррекция из почти 14k вчерашнего дня), я забываю об этом. Похоже на то, что мы все еще относительно молодой рынок с незрелыми эмоциональными трейдерами, которые каждый раз покупают биткойны </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69inj/","name":"t1_es69inj","created":1561672856,"created_utc":1561644056,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":10,"link_id":"t3_c657ly","replies":[{"ups":4,"link_id":"t3_c657ly","id":"es6ugur","author":"[deleted]","parent_id":"t1_es6ji41","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ugur/","name":"t1_es6ugur","created":1561686369,"created_utc":1561657569,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es69fo1","author":"Zulunation101","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"What were you expecting from a predominantly retail driven market. I don't think here is any other market that is as driven by the retail investor, as crypto. This is why it is so unbelievably volatile. Where there is an easy ability to create massive and quick movements by stirring people into a frenzy, you'll find sharks.","body_html":"<div class = \"md\"> <p> Чего вы ожидали от преимущественно розничного рынка? Я не думаю, что здесь есть какой-то другой рынок, который бы стимулировал розничный инвестор, как крипто. Вот почему это так невероятно изменчиво. Там, где есть легкая способность создавать массивные и быстрые движения, приводя людей в бешенство, вы найдете акул. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69fo1/","name":"t1_es69fo1","created":1561672797,"created_utc":1561643997,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_c657ly","id":"es69wah","author":"CoKBrian","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"You are the hero we need but not the one we deserve.","body_html":"<div class = \"md\"> <p> Вы герой, который нам нужен, но не тот, которого мы заслуживаем. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69wah/","name":"t1_es69wah","created":1561673127,"created_utc":1561644327,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_c657ly","id":"es6c06t","author":"Thevsamovies","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I feel like I see a lot of people say \"just keep HODLing\" and I think that's the whole point. Don't let the ups and downs get to you if you believe in the dream. If you believe the technology then you know one day it'll be worth a lot more than it is now and that there is no point in selling every time it goes up 10% in a day.","body_html":"<div class = \"md\"> <p> Мне кажется, я вижу, что многие люди говорят \"просто продолжай HODLing\", и я думаю, что в этом весь смысл. Не позволяйте взлетам и падениям добраться до вас, если вы верите в сон. Если вы верите технологии, то знаете, что однажды она будет стоить намного больше, чем сейчас, и что нет смысла продавать каждый раз, когда она растет на 10% в день. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6c06t/","name":"t1_es6c06t","created":1561674579,"created_utc":1561645779,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","replies":[{"ups":2,"link_id":"t3_c657ly","id":"es6w34q","author":"crypto-b","parent_id":"t1_es6v19n","subreddit_id":"t5_2wlj3","body":"An excellent point, the iPad fits this same category...there’s definitely a learning curve and a need for educating customers on the use-case. The best thing is, with cryptocurrency we have the market meltdown in ‘08 as an excellent backdrop to why the God protocol is second to the trust protocol. You’re hard pressed to find someone who wasn’t first or second-hand affected by the housing crisis.","body_html":"<div class = \"md\"> <p> Отличный момент: iPad подходит к той же категории ... определенно есть кривая обучения и необходимость информировать клиентов о сценарии использования. Лучше всего то, что с криптовалютой у нас крах рынка в 2008 году стал отличным фоном того, почему протокол Бога стоит на втором месте после протокола доверия. Вам трудно найти кого-то, кто не был первым или подержанным пострадавшим от жилищного кризиса. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6w34q/","name":"t1_es6w34q","created":1561687369,"created_utc":1561658569,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es6jek9","author":"crypto-b","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"OP nailed it, couldn’t agree more. When looking for value I think there are 3 critical areas to ask questions around:\n\n1. Customer use case and market. It’s so simple - show me the customers. Is there actually a market for this, does this solve a genuine pain point? How large is the potential market? How tech-savvy, therefore likely to adopt something blockchain/DLT based, are the businesses in the space? \n\n2. Technology. Is this something new, like IOTA’s Tangle protocol, or Cardano’s dPOS, or this just another POW token that’s slightly faster than bitcoin? In order for new technology to be adopted it has to be: better, faster, or cheaper. Preferably all of the above. Trying to build a better bitcoin without new features like privacy, genuine scalability (at least as fast as Visa, which can process 60K TPS, etc) is a waste of time. OP touched on this too - is it genuinely decentralized? Fuck EOS and Tron, that’s not cryptocurrency, its not decentralized...it’s just *slightly* better than a single central server like any normal company. Look at those blockchains that have already been subject to a 51% attack. \n\n3. The team. Do they have experience building companies? Are their engineers skilled at building and supporting blockchain solutions? Do they have enough funding to sustain cash-flow negativity for a long period of time while they aim to drive adoption? How’s their marketing team and plan? Build it and they will come isn’t enough...not when there’s hundreds of other companies vying for attention. What does the white paper say about he roadmap, how active is the team in communicating updates, etc. \n\nWhat’s so exciting about this current bull run is that it really seems to be institutionally driven, since the google trends for “buy bitcoin” or even just “bitcoin” aren’t tracking with the growth like they were winter of 2017, but OP has it right, if the retail community can’t learn to ask the right questions and weather the ups and downs we won’t be taken seriously and instead be seen as people trying to make a quick buck rather than those who believe in the power of decentralization and the potential for it to upset corruption and/or lack of technological access all over the globe. \nThis is a revolution and if you’re not prepared for bumps along the way, please kindly get the fuck out and leave those of us that believe to drive adoption. Great writing OP, I hope we can see more of this mode of thinking in the future.","body_html":"<div class = \"md\"> <p> ОП прибил его, не могу не согласиться. В поисках ценности я думаю, что есть 3 критических области, чтобы задавать вопросы вокруг: </p>\n\n<Ол>\n<li> <p> Вариант использования и рынок клиента. Это так просто - покажи мне клиентов. Есть ли на самом деле рынок для этого, решает ли это настоящую болевую точку? Насколько велик потенциальный рынок? Насколько технически подкованы, поэтому могут принять что-то на основе блокчейна / DLT, бизнес в космосе? </Р> </LI>\n<Li> <р> Технология. Это что-то новое, например протокол IOTA Tangle или dPOS от Cardano, или это просто еще один токен POW, который немного быстрее биткойна? Чтобы внедрить новую технологию, она должна быть: лучше, быстрее или дешевле. Желательно все вышеперечисленное. Попытка создать лучший биткойн без новых функций, таких как конфиденциальность, подлинная масштабируемость (по крайней мере, так же быстро, как Visa, которая может обрабатывать 60K TPS и т. Д.) - пустая трата времени. ОП затронул и эту тему - действительно ли она децентрализована? Черт, EOS и Tron, это не криптовалюта, она не децентрализована ... она просто <em> немного </em> лучше, чем один центральный сервер, как любая обычная компания. Посмотрите на те блокчейны, которые уже подверглись атаке на 51%. </Р> </LI>\n<li> <p> Команда. Есть ли у них опыт строительных компаний? Опытны ли их инженеры в создании и поддержке блочных решений? Достаточно ли у них средств для поддержания негативного отношения к денежным потокам в течение длительного периода времени, пока они стремятся стимулировать усыновление? Как их маркетинговая команда и план? Построить его, и они придут не достаточно ... не тогда, когда сотни других компаний борются за внимание. Что говорится в официальном документе о дорожной карте, насколько активна команда в распространении обновлений и т. Д. </P> </li>\n</Ол>\n\n<p> Что удивительно в этом текущем росте быков, так это то, что он действительно институционально обусловлен, поскольку тенденции Google «купить биткойн» или даже просто «биткойн» не отслеживают рост, как это было зимой 2017 года, но у OP это правильно, если розничное сообщество не может научиться задавать правильные вопросы и выдерживать взлеты и падения, к нам не будут относиться серьезно, и вместо этого мы будем восприниматься как люди, которые пытаются быстро заработать, а не как те, кто верит в сила децентрализации и возможность для нее расстроить коррупцию и / или отсутствие технологического доступа во всем мире.\nЭто революция, и если вы не готовы к ударам на этом пути, пожалуйста, будьте добры и оставьте тех из нас, кто верит в усыновление. Прекрасно сочиняя ОП, я надеюсь, что мы сможем увидеть больше такого образа мышления в будущем. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6jek9/","name":"t1_es6jek9","created":1561679447,"created_utc":1561650647,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_c657ly","id":"es6k1do","author":"Chaosed","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"/u/bLbGoldeN Love your post, thank you for your contribution. I'd love to hear your view on adoption and which projects you think have viability and longevity.","body_html":"<div class = \"md\"> <p> <a href=\"/u/bLbGoldeN\"> / u / bLbGoldeN </a>. Мне нравится ваш пост, спасибо за ваш вклад. Мне бы очень хотелось услышать ваше мнение об усыновлении и о том, какие проекты, по вашему мнению, имеют жизнеспособность и долговечность. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6k1do/","name":"t1_es6k1do","created":1561679855,"created_utc":1561651055,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_c657ly","id":"es6m0iv","author":"maccorf","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"This sub is also horribly moderated, it only seems like no one is questioning market rises because there’s 10 different literal screenshots of green BTC prices with a comment like “here we go!” that add zero substance at all to any discussion yet are not removed by mods. Same with memes, it’s just not a productive Reddit at all. I basically only come here for a portion of my read on sentiment, plus some sad laughs.","body_html":"<div class = \"md\"> <p> Эта подпрограмма также ужасно модерируется, только кажется, что никто не ставит под сомнение рост рынка, потому что есть 10 различных буквальных скриншотов зеленых цен на BTC с комментарием типа «здесь мы идем!», который добавляет Нулевая субстанция вообще ни к какой дискуссии пока не снята модами. То же самое с мемами, это просто не продуктивный Reddit. В основном я прихожу сюда только для того, чтобы прочесть о чувствах и немного грустного смеха. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6m0iv/","name":"t1_es6m0iv","created":1561681126,"created_utc":1561652326,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_c657ly","id":"es7no9j","author":"everythingisatoms","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I think personal financial standings play an important role in this. If you are at least well off and live a comfortable or okay life, you can ‘afford’ to be more intellectual and technical about crypto and blockchain.  \n  \nHowever you can’t really expect the same behavior from someone who struggles in life, earns minimal wage, has student debts but are constantly being reminded that their lives are worthless by Instagram posts showing young and beautiful people dressed up in designer brands,  flying in private jets, driving lambos, partying and traveling everyday. These people are willing to go all in with $1000 that they have saved for months to make 100x. Crypto-crazed youths in South Korea is a very good example of this. You only see this in crypto and not other markets because crypto has a much lower barrier of entry.  \n  \nYou’re trying to talk sense to the YOLO generation, who will constantly blame the older generations for creating a society they can’t afford.","body_html":"<div class = \"md\"> <p> Я думаю, что личные финансовые показатели играют важную роль в этом. Если вы, по крайней мере, состоятельны и ведете комфортную или нормальную жизнь, вы можете «позволить себе» быть более интеллектуальным и техническим в вопросах крипто и блокчейна. </Р>\n\n<p> Однако вы не можете ожидать такого же поведения от кого-то, кто борется за жизнь, зарабатывает минимальную заработную плату, имеет студенческие долги, но постоянно напоминает, что их жизни бесполезны из-за публикаций в Instagram, показывающих молодых и красивых людей, одетых в дизайнерские бренды. летать на частных самолетах, водить ламбо, вечеринки и путешествовать каждый день. Эти люди готовы пойти ва-банк с 1000 долларов, которые они месяцами копили, чтобы получить 100х. Сумасшедшая молодежь в Южной Корее - очень хороший пример этого. Вы видите это только на крипто, а не на других рынках, потому что крипто имеет гораздо более низкий барьер входа. </Р>\n\n<p> Вы пытаетесь говорить здравым смыслом с поколением YOLO, которое будет постоянно обвинять старшие поколения в создании общества, которое они не могут себе позволить. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7no9j/","name":"t1_es7no9j","created":1561703839,"created_utc":1561675039,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":13,"link_id":"t3_c657ly","id":"es67zox","author":"[deleted]","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"As a goldfish, I am offended at being compared to retail investors. This is species-ist. I've reported you to the Internet police for hate speech. Please pull your Lambo to the side of the Information Superhighway.","body_html":"<div class = \"md\"> <p> Как золотая рыбка, я оскорблен тем, что меня сравнивают с розничными инвесторами. Это видовой. Я сообщил вам в интернет-полиции за разжигание ненависти. Пожалуйста, потяните Lambo на сторону информационной супермагистрали. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es67zox/","name":"t1_es67zox","created":1561671739,"created_utc":1561642939,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":22,"link_id":"t3_c657ly","replies":[{"ups":6,"link_id":"t3_c657ly","replies":[{"ups":3,"link_id":"t3_c657ly","id":"es6txpl","author":"dysangel","parent_id":"t1_es6fnp8","subreddit_id":"t5_2wlj3","body":">...did I?\n\nYou at least appeared to. I see that you have now edited your comment. Your original text is visible in my unedited comment.\n\n>All you can do is exploit this knowledge for your gain.\n\nYou exploit the knowledge that food and water keep you alive every day.\n\nI understand that the word exploit can have negative connotations and that he was being very blunt, but suggesting making good use of your knowledge does not mean that \"everything he wrote\" is \"the corruption of capitalism\".","body_html":"<div class = \"md\"> <blockquote>\n<p> ... я сделал? </p>\n</BLOCKQUOTE>\n\n<p> Вы, по крайней мере, появились. Я вижу, что вы отредактировали свой комментарий. Ваш оригинальный текст виден в моем неотредактированном комментарии. </P>\n\n<BLOCKQUOTE>\n<p> Все, что вы можете сделать, это использовать эти знания для вашей выгоды. </p>\n</BLOCKQUOTE>\n\n<p> Вы используете знание, что пища и вода поддерживают вас каждый день. </p>\n\n<p> Я понимаю, что слово \"эксплойт\" может иметь негативную коннотацию и что он был очень груб, но предложение использовать ваши знания не означает, что \"все, что он написал\", есть \"коррупция капитализма\". </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6txpl/","name":"t1_es6txpl","created":1561686048,"created_utc":1561657248,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"es6dr1j","author":"dysangel","parent_id":"t1_es686n7","subreddit_id":"t5_2wlj3","body":"I don't think the other guy was talking about helping to create pumps and dumps in alts. Even by buying and holding bitcoin you are still exploiting knowledge of a likely future for your own gain. Otherwise you'd just wait until crypto has made its way well up the adoption curve in society before buying any.\n\n>When people talk about the corruption of capitalism, everything you wrote is exactly what they mean.\n\nAssuming people are evil/corrupt is not going to help anything. You made a whole lot of leaps and assumptions about his viewpoint that didn't seem justified to me.","body_html":"<div class = \"md\"> <p> Я не думаю, что другой парень говорил о помощи в создании насосов и свалок в alts. Даже покупая и удерживая биткойны, вы все равно используете знания о вероятном будущем для своей выгоды. В противном случае вы бы просто подождали, пока криптозащита хорошо продвинется вверх по кривой принятия в обществе, прежде чем покупать какую-либо. </P>\n\n<BLOCKQUOTE>\n<p> Когда люди говорят о коррупции капитализма, все, что вы написали, именно то, что они имеют в виду. </p>\n</BLOCKQUOTE>\n\n<p> Предположение, что люди злые / коррумпированные, ничем не поможет. Вы сделали много прыжков и предположений относительно его точки зрения, которые не казались мне оправданными. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6dr1j/","name":"t1_es6dr1j","created":1561675751,"created_utc":1561646951,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":4,"link_id":"t3_c657ly","id":"es6bfst","author":"GrandmaIsHungry","parent_id":"t1_es686n7","subreddit_id":"t5_2wlj3","body":"A fucking men","body_html":"<div class = \"md\"> <p> Черт, мужики </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6bfst/","name":"t1_es6bfst","created":1561674194,"created_utc":1561645394,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es6740d","author":"[deleted]","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"> With the size of this community (this subreddit alone), we have the power to warn others and to influence the market by infusing some rationality into it.\n\nNo we/you don't. You made your entire argument blinded by tunnel vision, only looking at the cryptocurrency exchange market. You're ignoring 200 years of history of global equities and currencies markets and the fact that most retail investors are, as you put it, retarded. There have been tons of irrational stock market and currency bubbles before cryptocurrency was ever a thing.\n\nAnd the market is bigger than you expect. Look at scams like BitConnect, where most of the cryptocurrency discussion/investment community knew it was a scam, but they still had hundreds of people show up for their conferences and got thousands of people to invest in their scam.\n\nTL;DR: Take off your blinders and look at the bigger picture and you'll realize that everything is fucked and there's nothing you can do to change that. All you can do is exploit this knowledge for your gain. Spend some time researching behavioral economics.","body_html":"<div class = \"md\"> <blockquote>\n<p> Благодаря размеру этого сообщества (только одного этого субредита) мы можем предупреждать других и влиять на рынок, привнося в него некоторую рациональность. </p>\n</BLOCKQUOTE>\n\n<p> Нет, мы / вы нет. Весь ваш аргумент ослеплен туннельным зрением, глядя только на биржевой рынок криптовалют. Вы игнорируете 200-летнюю историю мировых рынков акций и валют и тот факт, что большинство розничных инвесторов, как вы говорите, отсталые. До появления криптовалюты было множество иррациональных фондовых рынков и валютных пузырей. </P>\n\n<p> И рынок больше, чем вы ожидаете. Посмотрите на мошенников, таких как BitConnect, где большая часть дискуссионного / инвестиционного сообщества по криптовалютам знала, что это мошенничество, но у них все еще были сотни людей, приходящих на их конференции, и тысячи людей вкладывали деньги в их аферу. </P>\n\n<p> TL; DR: снимите шоры и посмотрите на картину в целом, и вы поймете, что все испорчено, и вы ничего не можете сделать, чтобы изменить это. Все, что вы можете сделать, это использовать эти знания для вашей выгоды. Потратьте некоторое время на изучение поведенческой экономики. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6740d/","name":"t1_es6740d","created":1561671075,"created_utc":1561642275,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_c657ly","id":"es67v5t","author":"vinnienine","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Bitcoin will continue spinning it's weird patterns regardless of what us idiots think about it. Too many variables, everybody is just blowing in the wind when viewed on a log scale. Chinese mining pools, whales, institutions. Day to day some of these parties can have a strong influence, but stretched out across time there is nothing anyone can do. \n\n&#x200B;\n\nIf you're like me then you believe that this was probably a milestone for our race, it was probably inevitable, and now it's off and running. Wether it's a false start, wether global catastrophe occurs, if we survive into the future we will at some stage cease to use paper and metal to transfer value stored as energy. And as I said, that feels absolutely inevitable, one way or another.","body_html":"<div class = \"md\"> <p> Биткойн будет продолжать крутить свои странные модели независимо от того, что думают нас, идиотов. Слишком много переменных, все просто дуют на ветер, если смотреть в логарифмическом масштабе. Китайские шахтерские бассейны, киты, заведения. Изо дня в день некоторые из этих партий могут оказывать сильное влияние, но с течением времени никто ничего не может сделать. </Р>\n\n<Р> </р>\n\n<p> Если вы похожи на меня, то вы верите, что это, вероятно, стало важной вехой для нашей расы, это было, вероятно, неизбежно, и теперь она запущена и работает. Если это фальстарт, произойдет ли глобальная катастрофа, если мы выживем в будущем, то на каком-то этапе мы перестанем использовать бумагу и металл для передачи ценности, хранящейся в виде энергии. И, как я уже сказал, это кажется абсолютно неизбежным, так или иначе. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es67v5t/","name":"t1_es67v5t","created":1561671643,"created_utc":1561642843,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_c657ly","id":"es6jswn","author":"sleepydruid","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"'I can write with full confidence that the overwhelming majority of the community of crypto investors is retarded.'\n\n&#x200B;\n\nI am almost crying from laughing but yes, everything you say is true OP. Hang in there.","body_html":"<div class = \"md\"> <p> 'Я могу написать с полной уверенностью, что подавляющее большинство сообщества криптоинвесторов отсталые.' </p>\n\n<Р> </р>\n\n<p> Я чуть не плачу от смеха, но да, все, что ты говоришь, - правда. Держись там. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6jswn/","name":"t1_es6jswn","created":1561679706,"created_utc":1561650906,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":7,"link_id":"t3_c657ly","id":"es74bu2","author":"bstr156","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Such is the nature of an emerging disruptive market - only on steroids, LSD, and too many cheetoes in this case.  It is ridiculous the degree to which coordinated hype/FUD market movements and \"mcap\" bleed into how projects' viability and usefulness are perceived by these \"investors\".  It results in punishment of projects with devs keeping their heads down working on innovation, and rewards the opposite.  A centralized platform gets churned-out lacking any substantial contribution to the ecosystem, is scientifically shown to underperform vs its claims, goes on to support online casinos to fill blocks w/ transactions, and people celebrate \"adoption\" and pump it up.  Meanwhile a project w/ mainnet that accomplishes a decentralized means of bi-directional on-demand cross-chain interoperability without need of atomic swap nor intermediaries, and rolls this out by integrating w/ Ethereum and its ERC20s (\\*which runs on a completely different algorithm\\*, effectively bridging Ethereum to Bitcoin), and furthermore is scientifically proven by a third-party as capable of scaling between 20-60k TPS while maintaining SHA256 finality, and is the chosen platform of an operating silver-backed stablecoin ecosystem, is \"that shitcoin\" and gets dumped faster than a rebound date.","body_html":"<div class = \"md\"> <p> Такова природа развивающегося разрушительного рынка - в данном случае только на стероидах, ЛСД и слишком большом количестве гепардов. Смешно то, насколько скоординированные движения рынка обмана / FUD и «mcap» влияют на то, как эти «инвесторы» воспринимают жизнеспособность и полезность проектов. Это приводит к наказанию проектов, когда разработчики не спешат работать над инновациями, и поощряет обратное. Централизованной платформе не хватает существенного вклада в экосистему, научно доказано, что она хуже, чем ее требования, продолжает поддерживать онлайн-казино, чтобы заполнить блоки без транзакций, и люди празднуют «принятие» и накачивают его. Между тем проект с основной сетью, который реализует децентрализованные средства двунаправленной межсетевой совместимости по требованию без необходимости атомного обмена или посредников, и развивает это путем интеграции w / Ethereum и его ERC20 (*), который работает на совершенно другом Алгоритм *, эффективно соединяющий Эфириум с Биткойном) и, кроме того, научно подтвержденный третьей стороной как способный масштабировать между 20-60 тыс. TPS при сохранении окончательности SHA256, и является выбранной платформой действующей стабильной экосистемы стабильной валюты, поддерживаемой серебром, \" это дерьмо \"и сбрасывается быстрее, чем дата отскока. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es74bu2/","name":"t1_es74bu2","created":1561692390,"created_utc":1561663590,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_c657ly","replies":[{"ups":6,"link_id":"t3_c657ly","id":"es695uv","author":"zimmah","parent_id":"t1_es68pgy","subreddit_id":"t5_2wlj3","body":"That's the plan, I won't be focusing just on price and I never chased shitcoins. Although I may do a for fun shitcoin roulette, mostly just for the excitement and attracting attention.    \n   \nThe main idea though is to have an informative channel for newcomers and experienced users alike. I have been in this market since 2013 and I have already seen a lot.","body_html":"<div class = \"md\"> <p> Это план, я не буду фокусироваться только на цене, и я никогда не гонялся за дерьмом. Хотя я могу сделать рулетку ради забавы, в основном только для волнения и привлечения внимания. </Р>\n\n<p> Основная идея заключается в том, чтобы иметь информативный канал для новичков и опытных пользователей. Я был на этом рынке с 2013 года, и я уже видел много. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es695uv/","name":"t1_es695uv","created":1561672596,"created_utc":1561643796,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"es689kd","author":"zimmah","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I was planning on making a crypto related YouTube channel and possibly blog when I'm back home. Maybe that will help.   \n   \nIt won't by itself be enough to fix the problem, but it's a start.","body_html":"<div class = \"md\"> <p> Я планировал создать канал YouTube, связанный с крипто, и, возможно, блог, когда вернусь домой. Может быть, это поможет. </Р>\n\n<p> Этого само по себе недостаточно для решения проблемы, но это только начало. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es689kd/","name":"t1_es689kd","created":1561671944,"created_utc":1561643144,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_c657ly","id":"es6u5ze","author":"polymetas","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"You might want to check out the IOTA discord. Price talk is not allowed there, it's only about the technology – to build the standard protocol for the machine economy.","body_html":"<div class = \"md\"> <p> Возможно, вы захотите проверить диссонанс IOTA. Ценовые разговоры там запрещены, речь идет только о технологиях - для построения стандартного протокола для экономии машин. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6u5ze/","name":"t1_es6u5ze","created":1561686187,"created_utc":1561657387,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es6atu4","author":"crypt0Ruski","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Yeah good luck with that. If you can't beat them join them. Price wise crypto is insanity and mob mentality. If you want gains just go with the mob basically","body_html":"<div class = \"md\"> <p> Да, удачи тебе в этом. Если вы не можете победить их, присоединяйтесь к ним. Мудрая криптография - это безумие и менталитет толпы. Если вы хотите выиграть, просто идите с мобом в основном </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6atu4/","name":"t1_es6atu4","created":1561673775,"created_utc":1561644975,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es6b6qt","author":"Ballstone_Group","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I don't know about the rest of you guys, but I am ready to buy a literary gold fish.","body_html":"<div class = \"md\"> <p> Я не знаю вас, ребята, но я готов купить литературную золотую рыбку. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6b6qt/","name":"t1_es6b6qt","created":1561674020,"created_utc":1561645220,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es6pbv1","author":"its_Lucifer","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"TL;DR\nyou’re all retarded.\n\n\n\n\nedit: jokes aside, well said. I agree with the points you have made.","body_html":"<div class = \"md\"> <p> TL; DR\nвы все отсталые. </p>\n\n<p> edit: шутки в сторону, хорошо сказано. Я согласен с высказанными вами замечаниями. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6pbv1/","name":"t1_es6pbv1","created":1561683192,"created_utc":1561654392,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es7dxea","author":"argbarman2","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I agree with everything, but my one qualm is with the jab at alt-coins. There is room for more than one successful project in this space and anybody who denies that is just another goldfish to me. There is a clear secular trend of BTC losing market share to other projects. Similar to what you mention happening with alt-coins, every time BTC dominance starts rising, all the maximalists come out of the woodwork talking about how *they knew all along* that all those shitcoins would fail. ETH has not failed. BAT and LINK are great projects with real-world use-cases. I'm just so sick of the \"blockchain not Bitcoin\" vs. \"Bitcoin not blockchain\" debate. How about Bitcoin *and* blockchain","body_html":"<div class = \"md\"> <p> Я согласен со всем, но мое единственное сомнение - джеб в alt-coins. В этом пространстве есть место для более чем одного успешного проекта, и любой, кто отрицает, что для меня это просто еще одна золотая рыбка. Существует четкая светская тенденция потери доли BTC на других проектах. Как и в случае с альт-монетами, каждый раз, когда доминирование BTC начинает расти, все максималисты выходят из работы по дереву, рассказывая о том, как <em> они все время знали </em>, что все эти дерьмовые монеты потерпят неудачу. ETH не потерпел неудачу. BAT и LINK - отличные проекты с реальными примерами использования. Я просто так устал от дебатов «Биткойн, а не Биткойн». Как насчет биткойнов <em> и </em> блокчейн </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7dxea/","name":"t1_es7dxea","created":1561697703,"created_utc":1561668903,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es69ns2","author":"iLLyNoiZe","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"As opposed to a metaphorical Goldfish?","body_html":"<div class = \"md\"> <p> В отличие от метафорической золотой рыбки? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69ns2/","name":"t1_es69ns2","created":1561672957,"created_utc":1561644157,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es69x8c","author":"CumBoxReseller","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The problem is that you joined the community only 3 years ago. That is when the community changed because everybody and his dog was getting into crypto. Prior to that it was very informative especially bitcoinmarkets sub","body_html":"<div class = \"md\"> <p> Проблема в том, что вы присоединились к сообществу только 3 года назад. Именно тогда сообщество изменилось, потому что все и его собака попали в крипто. До этого это было очень информативно, особенно в биткойнмаркетах. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69x8c/","name":"t1_es69x8c","created":1561673145,"created_utc":1561644345,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6ag00","author":"dsmouse","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"This shows a still immature market and that immaturity can be exploited in trading practices.  Ideally, if nothing fundamental changes, timing the market would be hard.","body_html":"<div class = \"md\"> <p> Это показывает все еще незрелый рынок, и что незрелость можно использовать в торговых практиках. В идеале, если ничего не изменится, выбор времени для рынка будет трудным. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ag00/","name":"t1_es6ag00","created":1561673509,"created_utc":1561644709,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6byn6","author":"tamastorok","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"There are dumb people in every industry, that's for sure. All in all, what really matters is adoption, not hype, not pumps but real-life use-cases. I'm a fundamental investor, I don't care about the short-term swings. In the short-term, it's just gambling. \n\nI got tired of the hype posts saying nothing, bullshit projects promising conquering the world so I started focusing only on the adoption-related news. It just helps to see clearly, filtering out the noise. I thought this would be useful for others so here is the website I created for that: [https://cryptoadoptionstatus.com/](https://cryptoadoptionstatus.com/)\n\n&#x200B;\n\nFor now, it's a newsletter but I want to transform it into a complex adoption tracking for crypto projects. helping investors to invest based on real performance.","body_html":"<div class = \"md\"> <p> В каждой отрасли есть тупые люди, это точно. В целом, что действительно важно, так это усыновление, а не реклама, не насосы, а реальные сценарии использования. Я фундаментальный инвестор, меня не волнуют краткосрочные колебания. В краткосрочной перспективе это просто азартная игра. </Р>\n\n<p> Я устал от постов с ажиотажем, молчаливых проектов, обещающих покорить мир, поэтому я сосредоточился только на новостях, связанных с усыновлением. Это просто помогает ясно видеть, отфильтровывая шум. Я подумал, что это будет полезно для других, поэтому вот сайт, который я создал для этого: <a href=\"https://cryptoadoptionstatus.com/\"> https://cryptoadoptionstatus.com/ </a> </p>\n\n<Р> </р>\n\n<p> Пока что это новостная рассылка, но я хочу превратить ее в сложное отслеживание принятия криптографических проектов. помогая инвесторам инвестировать, основываясь на реальных результатах. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6byn6/","name":"t1_es6byn6","created":1561674549,"created_utc":1561645749,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6bz76","author":"Apicit","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"A merket full of idiots and you are one of the few smart investors? Great opportunity for you!! I guess you are getting rich very fast, so why do you complain?","body_html":"<div class = \"md\"> <Рынок, полный идиотов, а вы один из немногих умных инвесторов? Отличная возможность для вас! Я полагаю, вы очень быстро разбогатели, так почему вы жалуетесь? </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6bz76/","name":"t1_es6bz76","created":1561674560,"created_utc":1561645760,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6cf0q","author":"borgqueenx","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"and the money that flows in dogpoop like tron, BTT etc. or whitepaper only projects. It amazes me how simple minded people are as well.\n\nYou have valid points about market manipulation attempts, but there's also just a lot of money being thrown at projects that are simply not good at all. Just because hype, or a known name.","body_html":"<div class = \"md\"> <p> и деньги, которые текут в собачьих упряжках, таких как tron, BTT и т. д. или только в проектах. Меня поражает, насколько просты люди. </P>\n\n<p> У вас есть веские аргументы в отношении попыток манипулирования рынком, но есть также много денег, которые вкладывают в проекты, которые просто не очень хороши. Просто потому, что шумиха или известное имя. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6cf0q/","name":"t1_es6cf0q","created":1561674857,"created_utc":1561646057,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6ha9n","author":"nice1work1","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Two groups of people visit here, shills and gamblers.\n\nIve asked, and most users are playing with less than 1000$.\n\nI'm only a believer in Bitcoin. I've tried to get excited and use altcoins, but they don't have much purpose. Non nerds think centralized cryptocurrencies are useful. Then there are cryptonoobies who don't realize decentralized coins are Bitcoin copy pastes.\n\nIt hasn't affected me much, except I sold my alts after ETH failed to scale.","body_html":"<div class = \"md\"> <p> Две группы людей посещают здесь, шиллы и игроки. </p>\n\n<p> Я спросил, и большинство пользователей играют с менее чем 1000 $. </p>\n\n<p> Я только сторонник биткойнов. Я пытался взволноваться и использовать альткойны, но у них нет особой цели. Не ботаники считают, что централизованные криптовалюты полезны. Кроме того, есть криптооботы, которые не понимают, что децентрализованные монеты - это биткойн-копии. </P>\n\n<p> Это не сильно повлияло на меня, за исключением того, что я продал свои альты после того, как ETH не удалось масштабировать. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ha9n/","name":"t1_es6ha9n","created":1561678082,"created_utc":1561649282,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6kltr","author":"Mans_Fury","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Im still convinced none of you are real.","body_html":"<div class = \"md\"> <p> Я все еще убежден, что никто из вас не настоящий. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6kltr/","name":"t1_es6kltr","created":1561680221,"created_utc":1561651421,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6q9y8","author":"sdmikecfc","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"So true. As a community manager for a few projects, people want to know when exchanges and when partnerships but RARELY do I see someone ask the real questions like....     \n\n\n\n\"when will this token reach full utilization\"     \n\n\"how many tokens are clients using and in what frequency\"     \n\n\"how long does a typical client hold the token before it is released back into the market\"     \n\n\"how is the token released back into the market\"      \n\n\n\nor even basic questions you should ask a business like, \"is the company generating revenue and are they running on revenue or reserves\". These questions are the important ones but no one cares.     \n\n\n\nGive some damn Minecrafter a microphone and they will listen to anything you have to say. Screw logic and facts.","body_html":"<div class = \"md\"> <p> Так и есть. Будучи менеджером сообщества по нескольким проектам, люди хотят знать, когда происходит обмен, а когда происходит партнерство, но РЕАЛЬНО я вижу, что кто-то задает реальные вопросы, такие как .... </p>\n\n<p> \"когда этот токен достигнет полного использования\" </p>\n\n<p> «Сколько токенов используют клиенты и с какой периодичностью» </p>\n\n<p> «сколько времени типичный клиент хранит токен, прежде чем он будет выпущен обратно на рынок» </p>\n\n<p> \"как токен выпускается обратно на рынок\" </p>\n\n<p> или даже основные вопросы, которые вам следует задать, например, «это компания, приносящая доход и работающая на выручку или резервы». Эти вопросы являются важными, но никто не заботится. </Р>\n\n<p> Дай чертовому Minecrafter микрофон, и они будут слушать все, что ты скажешь. Винт логика и факты. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6q9y8/","name":"t1_es6q9y8","created":1561683773,"created_utc":1561654973,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6toei","author":"CalvinsStuffedTiger","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Perfect timing for the next wave of ~~ICOs~~. IEOs.  \n\nGotta keep relearning the same fucking lessons I guess","body_html":"<div class = \"md\"> <p> Идеальное время для следующей волны <del> ICOs </del>. IEOs. </Р>\n\n<p> Должен продолжать повторять одни и те же чертовы уроки, я думаю, </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6toei/","name":"t1_es6toei","created":1561685888,"created_utc":1561657088,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es72gyq","author":"Er-c","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"While I don't really participate too much in the shitcoin sector and focus mainly on Bitcoin, this is so fucking true. Sure, it's on steroids in the shitcoin realm. But in Bitcoin itself, I still have a very hard time (in person and online) finding souls that grasp concepts like say, \"unforgeable costliness\" (I'm just picking one concept for this argument). I don't think I am r/gatekeeping when I say:\n\n**If you don't understand a concept like unforgeable costliness then it's kinda absurd to think that you could possibly have any sort of foundational understanding of Bitcoin.**\n\nI am legitimately confused how this can be the case, but it just it. Just a month ago, Anthony Pompliano was on CNBC jousting with Kevin O'Leary about Bitcoin and he clearly didn't seem to understand the difference between rarity and scarcity. Nor did he appear to know how scarcity is quantified in the commodities realm. It is utterly flabbergasting how few people have a deep understanding of what even Bitcoin is. I don't expect 'normies' to know. But Bitcoin twitter, reddit, and Bitcoin meetups have made me realize, even most \"crytpo-heads\" have no idea what is actually at work here.\n\nIt makes me greedy for the future. But also a wee bit terrified sometimes. Surely there must be some force at work in nature that will not allow people who include \"moon, rekt, and lambo\" in their *daily* vocabulary to have any true power in society.","body_html":"<div class = \"md\"> <p> Хотя я на самом деле не слишком много участвую в секторе шиткойнов и концентрируюсь в основном на биткойнах, это чертовски верно. Конечно, это на стероидах в мире дерьма. Но в самом Биткойне мне все еще очень трудно (лично и в Интернете) найти души, которые понимают такие понятия, как, скажем, «непростительная дороговизна» (я просто выбираю одну концепцию для этого аргумента). Я не думаю, что я <a href=\"/r/gatekeeping\"> r / gatekeeping </a>, когда говорю: </p>\n\n<p> <strong> Если вы не понимаете такую ​​концепцию, как неоправданная дороговизна, абсурдно думать, что у вас может быть какое-то фундаментальное понимание Биткойна. </strong> </p>\n\n<p> Я законно запутался, как это может быть, но это просто так. Всего месяц назад Энтони Помплиано выступал на CNBC, выступая с Кевином О'Лири о биткойнах, и он явно не понимал разницу между редкостью и редкостью. Похоже, он не знал, как дефицит измеряется в товарной сфере. Удивительно, как мало людей глубоко понимают, что такое Биткойн. Я не ожидаю, что «нормы» узнают. Но биткойн-твиттер, Reddit и биткойн-встречи заставили меня понять, что даже большинство «криптоголов» не имеют ни малейшего представления о том, что на самом деле здесь происходит. </P>\n\n<p> Это делает меня жадным до будущего. Но иногда даже немного напуган. Конечно, в природе должна действовать какая-то сила, которая не позволит людям, которые включают «луну, рект и ламбо» в свой <em> ежедневный </em> словарь, иметь какую-то истинную власть в обществе. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es72gyq/","name":"t1_es72gyq","created":1561691338,"created_utc":1561662538,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es76llf","author":"AllTimeHighs","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The longer you are around the space, the more those words bake into your decision making (rationally) rather than affecting you emotionally like your rant. I agree with pretty much all your views, just pointing out that it doesn't have to bother you that no one here is intelligent. You shouldn't be disappointed; you shouldn't want MORE out of the community. Some of the retards are 14, some of them are 54.\n\nThere are plenty of viewpoints from uninformed individuals on a daily basis pumping their shitcoin.\n\nBut as long as you stay self aware and understand the sentiment of \"retards\", you do great. Unless your goal is adoption. The that's all up in the air and speculative. Focus on the retards and don't have their retardation emotionally impact you.","body_html":"<div class = \"md\"> <p> Чем дольше вы находитесь в пространстве, тем больше эти слова впадают в ваше решение (рационально), а не влияют на вас эмоционально, как ваша напыщенная речь. Я согласен почти со всеми вашими взглядами, просто отмечая, что вас не должно беспокоить то, что здесь никто не умен. Вы не должны быть разочарованы; Вы не должны хотеть БОЛЬШЕ из сообщества. Некоторым из умственно отсталых 14, а некоторым - 54. </P>\n\n<p> Есть множество точек зрения от неосведомленных людей, ежедневно выкачивающих свою шиткойн. </p>\n\n<p> Но до тех пор, пока вы остаетесь в сознании и понимаете чувства «умственно отсталых», у вас все хорошо. Если ваша цель не является усыновлением. Это все в воздухе и умозрительно. Сосредоточьтесь на умственно отсталых и не оказывайте их эмоциональное воздействие на вас. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es76llf/","name":"t1_es76llf","created":1561693628,"created_utc":1561664828,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7bauf","author":"kur_einu","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Yes I suppose it is always the same. I mean, I bet you the average hippie in the 60s was there for the chicks/drugs, not for the ideology","body_html":"<div class = \"md\"> <p> Да, я полагаю, это всегда одно и то же. Я имею в виду, держу пари, что средний хиппи в 60-х годах был там для цыплят / наркотиков, а не для идеологии </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7bauf/","name":"t1_es7bauf","created":1561696240,"created_utc":1561667440,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7db14","author":"zuptar","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I like to think of it as mass confirmation bias.","body_html":"<div class = \"md\"> <p> Мне нравится думать об этом как о предвзятости массового подтверждения. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7db14/","name":"t1_es7db14","created":1561697358,"created_utc":1561668558,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7n0t1","author":"crypto-pirate","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"that's a pretty accurate summary of the majority \"investors\" in the cryptospace. I kinda believe in the early days back users were less speculators and more participant in the projects they chose. To be more specific nowadays \"investors\" just shill their choice and bash the competition instead of actively trying to use or help in various ways the growth of the project's network and thus it's progress to adoption. For an example  if someone bought a proof of stake coin, they should stake it to help the network , this will also help to raise the value of the project. The same applies if it's there is a masternode, if it's proof of work then mine it solo or with a pool, if it's a scale ability project like for example Raiden then make a node for payment channels similar to LN, if you own ETH then host a node etc. If it's a dapp platform try to   \n use the dapps and help the development with suggestions. Discussions in Reddit, telegram, twitter etc revolve mostly around prices.","body_html":"<div class = \"md\"> <p> это довольно точное резюме большинства \"инвесторов\" в криптопространстве. Я верю, что в первые годы назад пользователи были меньше спекулянтами и больше участвовали в выбранных ими проектах. Чтобы быть более конкретным, в настоящее время «инвесторы» просто отмахиваются от своего выбора и обостряют конкуренцию, вместо того, чтобы активно пытаться различными способами использовать или помогать росту сети проекта и, таким образом, его прогрессу до принятия. Например, если кто-то купил монету с доказательством кола, он должен поставить ее, чтобы помочь сети, это также поможет повысить ценность проекта. То же самое применимо, если есть мастер-узел, если он является доказательством работы, тогда можно использовать его в одиночку или с пулом, если это проект с возможностью масштабирования, такой как, например, Raiden, затем создайте узел для каналов платежей, аналогичный LN, если у вас есть ETH, тогда разместить узел и т. д. Если это платформа dapp, попробуйте <br/>\n используйте dapps и помогите разработке с предложениями. Обсуждения в Reddit, telegram, twitter и т. Д. Вращаются в основном вокруг цен. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7n0t1/","name":"t1_es7n0t1","created":1561703400,"created_utc":1561674600,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7u251","author":"tycooperaow","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"I totally agree, This is why I stick to just building the cryptocurrencies lol","body_html":"<div class = \"md\"> <p> Я полностью согласен, вот почему я придерживаюсь только построения криптовалют, смеется </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7u251/","name":"t1_es7u251","created":1561708637,"created_utc":1561679837,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7u5fx","author":"A3DMA","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The real kicker is that they just want to get rich quick.  So they blatantly promote poor prospect projects and pour scorn on great projects, not realising that they are slowing adoption, deterring investors and harming their own goals.\n\nSeriously if everyone just consolidated down to the better coins (as judged sensibly like the assessments performed by Weiss) the momentum would become unstoppable.","body_html":"<div class = \"md\"> <p> Настоящим кикером является то, что они просто хотят быстро разбогатеть. Таким образом, они открыто продвигают проекты с плохой перспективой и презирают великие проекты, не осознавая, что они замедляют принятие, сдерживают инвесторов и наносят ущерб их собственным целям. </P>\n\n<p> Серьезно, если бы все просто консолидировались до лучших монет (судя по разумным оценкам, подобным оценкам, выполненным Вейссом), импульс был бы не остановить. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7u5fx/","name":"t1_es7u5fx","created":1561708710,"created_utc":1561679910,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es8hgfi","author":"BudandDoyle69","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Please stay out of my head, mind reader.  Just yesterday I saw a bunch of what I’m assuming are kids celebrating the growth of a particular alt over the last week or so.  I always laugh when I see “X coin just passed Y coin and took over the number 14 spot on the market cap rankings list” posts.  The comparison of people cheering for specific coins to fans rooting for sports teams is spot on.  I have been saying the same exact thing since the alt craze of 2017/2018.  So many fools are making decisions based on emotions and attachments, which is the worst thing you could possibly do. Being objective is of the upmost importance when dealing with financial shit, especially crypto trading.\n\nLol, these crypto kids were talking about how a particular alt will pass the ATH in a couple of months time just because the price nearly doubled recently.  So i asked them why that would happen (despite knowing damn well that it won’t).  No one gave me a legit answer  about use case or implementations which would drive monster growth.  All I got was “because it’s happening just like 2017-18” or some other ridiculous BitConnect sounding shit (Wassa Wassa Wassa Wassa!). I totally agree with everything you said; you and I see things very, very similarly.  I hate to sound all r/iamveysmart-ish, but the majority of people who “trade crypto” (especially the ones who only start paying attention when prices jump wildly and fomo sets in) are dumb as shit.  Nothing you can say will save them from losing a lot of money.  There is no room for fanaticism and cult-like behavior in this very unforgiving environment.","body_html":"<div class = \"md\"> <p> Пожалуйста, держись подальше от меня, читатель. Буквально вчера я видел кучу того, что я предполагаю, что дети празднуют рост определенного альта за последнюю неделю или около того. Я всегда смеюсь, когда вижу сообщения «X монета только что прошла Y монету и заняла 14 место в списке рейтингов рыночной капитализации». Сравнение людей, болеющих за конкретные монеты, с болельщиками, болеющими за спортивные команды, является очень популярным. Я говорю то же самое со времени безумного увлечения 2017/2018. Так много дураков принимают решения, основываясь на эмоциях и привязанностях, а это худшее, что вы можете сделать. Быть объективным имеет первостепенное значение при работе с финансовым дерьмом, особенно с криптовалютой. </P>\n\n<p> Лол, эти крипто-дети говорили о том, как определенный alt пройдет ATH через пару месяцев только потому, что в последнее время цена почти удвоилась. Поэтому я спросил их, почему это произойдет (несмотря на то, что я чертовски хорошо знаю, что этого не произойдет). Никто не дал мне правдивого ответа о сценариях использования или реализации, которые могли бы стимулировать рост монстров. Все, что я получил, это «потому что это происходит как 2017-18» или какое-то еще нелепое звучание дерьма BitConnect (Wassa Wassa Wassa Wassa!). Я полностью согласен со всем, что вы сказали; мы с тобой очень, очень похожи. Ненавижу звучать все <a href=\"/r/iamveysmart\"> r / iamveysmart </a>, но большинство людей, которые «торгуют крипто» (особенно те, кто только начинают обращать внимание, когда цены резко растут и фомо) тупой как дерьмо. Ничто из того, что вы можете сказать, не спасет их от потери больших денег. В этой неумолимой среде нет места фанатизму и культовому поведению. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es8hgfi/","name":"t1_es8hgfi","created":1561726867,"created_utc":1561698067,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es8jedf","author":"[deleted]","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"If you had been around crypto a bit longer you would have seen the days where most arguments here were about Libertarian freedoms, decentralization and technology.  The same stupid maximalism was alive and kicking but perhaps the motivations were somewhat more noble.\n\nLets be honest, your post is really just about investing and money flows, you are just crying that its hard to pick.\n\nIm into crypto because I want new global currency where control is in the hands of people not bankers, stupid \"investors\" are ruining that dream by measuring everything in terms of fiat gainz.\n\nLet me tell you, its easy to pick; look at a projects true intentions, get engaged in that community, help to build/develop/market, earn some coin, exchange in that coin and hodl until you succeed or fail.\n\nFucking investments... BS","body_html":"<div class = \"md\"> <p> Если бы вы немного больше занимались криптовалютой, вы бы видели дни, когда большинство споров были связаны с либертарианскими свободами, децентрализацией и технологиями. Тот же самый глупый максимализм был жив и здоров, но, возможно, мотивация была несколько более благородной. </P>\n\n<p> Давайте будем честными, ваш пост на самом деле только об инвестициях и денежных потоках, вы просто плачете, что его трудно выбрать. </p>\n\n<p> Я нахожусь в криптовалюте, потому что я хочу новую глобальную валюту, где контроль находится в руках людей, а не банкиров, глупые «инвесторы» разрушают эту мечту, измеряя все с точки зрения фиатного дохода. </p>\n\n<p> Позвольте мне сказать вам, его легко выбрать; посмотрите на истинные намерения проекта, вступите в сообщество, помогите построить / развить / продать, заработать немного монеты, обменять эту монету и ходлать, пока вы не добьетесь успеха или не потерпите неудачу. </p>\n\n<p> Чертовы инвестиции ... BS </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es8jedf/","name":"t1_es8jedf","created":1561728918,"created_utc":1561700118,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es8l3ny","author":"tommytoan","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"i think its important to note that you dont have to be an expert on a topic to be informed enough to trade, or have an opinion of value.\n\nIf you want to be successful long term, being an expert is great. But understanding every little detail inside and out should not be an expectation, or really anybody elses business.\n\nI see this a lot in politics, if a person reads about socialism a couple times, understands it, decides they like it, but 1 month later is struggling to recall exactly what they read. I don't think this automatically makes their decision, and to some degree, any of their opinions value, complete garbage.\n\nOutside of that nitpick i generally agree with what youre saying.","body_html":"<div class = \"md\"> <p> Я думаю, важно отметить, что вам не нужно быть экспертом по теме, чтобы быть достаточно информированным, чтобы торговать, или иметь мнение о стоимости. </p>\n\n<p> Если вы хотите добиться успеха в долгосрочной перспективе, быть экспертом - это здорово. Но понимание каждой мелочи внутри и снаружи не должно быть ожиданием, или, по сути, никто не должен заниматься бизнесом. </P>\n\n<p> Я часто вижу это в политике, если человек пару раз читает о социализме, понимает его, решает, что ему это нравится, но через месяц пытается вспомнить, что именно он читает. Я не думаю, что это автоматически принимает их решение, и в какой-то степени любое их мнение ценит полный мусор. </P>\n\n<p> Вне этой придирки я в целом согласен с тем, что ты говоришь. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es8l3ny/","name":"t1_es8l3ny","created":1561730852,"created_utc":1561702052,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es8ldqb","author":"SaltCaptainSailor","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"You didn't think through your post. \n\n\"overwhelming majority of the community of crypto investors is retarded.\"\n\n\"With the size of this community (this subreddit alone), we have the power to warn others and to influence the market by infusing some rationality into it.\"\n\nHave you seen most of the posts on this subreddit... The blind leading the blind.","body_html":"<div class = \"md\"> <p> Вы не продумали свой пост. </Р>\n\n<p> «Подавляющее большинство сообщества криптоинвесторов отстает». </p>\n\n<p> «Благодаря размеру этого сообщества (только одного этого субредита) мы можем предупреждать других и влиять на рынок, привнося в него некоторую рациональность». </p>\n\n<p> Вы видели большинство постов в этом субреддите ... Слепой ведет слепого. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es8ldqb/","name":"t1_es8ldqb","created":1561731186,"created_utc":1561702386,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_c657ly","id":"es6v4b1","author":"ToiletTrainedMonkeys","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Super post. Now go buy syscoin you retards.","body_html":"<div class = \"md\"> <p> Супер пост. А теперь иди и купи syscoin, который ты тормозит. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6v4b1/","name":"t1_es6v4b1","created":1561686771,"created_utc":1561657971,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_c657ly","id":"es65060","author":"MajorRobotnik","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"when moon","body_html":"<div class = \"md\"> <p> когда луна </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es65060/","name":"t1_es65060","created":1561669420,"created_utc":1561640620,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es67hjs","author":"[deleted]","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es67hjs/","name":"t1_es67hjs","created":1561671361,"created_utc":1561642561,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es6nvn7","author":"jsands7","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"The other thing that happens everytime? Some enlightened person like yourself posts a huge rant about how the retail investor community has the memory and logic of a goldfish.","body_html":"<div class = \"md\"> <p> Другое дело, что происходит каждый раз? Некоторые просвещенные люди, такие как вы, публикуют огромные разговоры о том, как у сообщества розничных инвесторов есть память и логика золотой рыбки. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6nvn7/","name":"t1_es6nvn7","created":1561682291,"created_utc":1561653491,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_c657ly","id":"es7hx4f","author":"TheGreatCryptopo","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Satoshi bro welcome back.","body_html":"<div class = \"md\"> <p> Сатоши, братан, добро пожаловать обратно. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es7hx4f/","name":"t1_es7hx4f","created":1561699996,"created_utc":1561671196,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_c657ly","id":"es6dt96","author":"WitnessMeIRL","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Laughs in HODLer","body_html":"<div class = \"md\"> <p> Смеется в HODLer </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6dt96/","name":"t1_es6dt96","created":1561675793,"created_utc":1561646993,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_c657ly","id":"es69psc","author":"ViolentJenniferLopez","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Yeah but (gigantic company) mentioned (no blockchain shitcoin vaporware) in a Tweet, so this whole post is invalid.","body_html":"<div class = \"md\"> <p> Да, но (гигантская компания) упомянула (без чёртовой штуковины блокчейна) в Твиттере, поэтому весь этот пост недействителен. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es69psc/","name":"t1_es69psc","created":1561672996,"created_utc":1561644196,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_c657ly","id":"es6bom3","author":"Zanthious","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"once u realize and come to terms with every community being mostly idiots, the better off you will be. just ride the wave make ur money and do ur thing. \n\ntrying to explain shit here and is just going to piss you off.","body_html":"<div class = \"md\"> <p> как только вы поймете и примете соглашение, что каждое сообщество в основном идиоты, вам будет лучше. просто катайся на волне и зарабатывай деньги. </Р>\n\n<p> пытаюсь объяснить здесь дерьмо и просто разозлит тебя. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6bom3/","name":"t1_es6bom3","created":1561674359,"created_utc":1561645559,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_c657ly","id":"es6bpjo","author":"cambo666","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Well put.","body_html":"<div class = \"md\"> <p> Хорошо сказано. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6bpjo/","name":"t1_es6bpjo","created":1561674377,"created_utc":1561645577,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_c657ly","id":"es6ct0t","author":"faith_crusader","parent_id":"t3_c657ly","subreddit_id":"t5_2wlj3","body":"Start a blog","body_html":"<div class = \"md\"> <p> Начать блог </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/c657ly/the_retail_investor_community_has_the_memory_and/es6ct0t/","name":"t1_es6ct0t","created":1561675121,"created_utc":1561646321,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0}]}