{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Let's talk about some of Nano's biggest issues. I also made a video about this topic, [available here: https://youtu.be/d9yb9ifurbg](https://youtu.be/d9yb9ifurbg).\n\n---\n\n**00:12 Spam**\n\n*Issues*\n\n- Nano has 0 transaction fees, which could make it more vulnerable to spam.\n\n- Proof-of-Work (PoW) can be precomputed, which could allow bad actors to dump millions of blocks (transactions) on the network at once.\n\n- ASICs could be created to make precomputing PoW trivial for spam attacks.\n\n- Current node software and hardware cannot handle thousands of TPS (low-end nodes fall behind at even 50 TPS).\n\n*Potential Mitigations & Outstanding Issues*\n\n- Proof-of-Work is required for all transactions, which acts as a fee (costs electricity and time).\n\n- PoW takes a non-trivial amount of time, so precomputing PoW takes hours or days to generate enough traffic to actually affect the network (>150 TPS) for even a short period of time.\n\n- Nano nodes don't rebroadcast invalid transactions.\n\n- Dynamic Proof-of-Work allows legitimate users to have their transactions prioritized over spam by automatically increasing their PoW slightly if the network is congested.\n\n- As network scalability improves, more and more pre-computed PoW must be done to actually impact the network.\n\n- There is no single-blockchain that all transactions must be added to. Transactions are processed asynchronously, meaning that real user transactions can be processed separately from spam.\n\n- Creating an ASIC (none currently exist for Nano) costs millions of dollars, and is typically created to increase mining rewards (which Nano doesn't have). Why would someone make an ASIC just to attack Nano? Nano could also change the PoW algorithm to make ASICs useless. Memory-hard PoW is already being evaluated.\n\n- Remember that even just 50 TPS (which Nano can comfortably do) is over 4 million transactions per day. PayPal had almost [100 million users](https://www.statista.com/statistics/218493/paypals-total-active-registered-accounts-from-2010/) before it was doing [~5 million transactions per day in 2011](https://techcrunch.com/2011/09/25/paypal-now-processing-315-million-in-payments-per-day/)\n\n---\n\n**01:58 Privacy**\n\n*Issues*\n\n- Nano has no privacy. It is pseudonymous (like Bitcoin), not anonymous.\n\n*Potential Mitigations & Outstanding Issues* & Outstanding Issues*\n\n- Second layer solutions like mixers can help, but some argue that isn't enough privacy.\n\n- The current protocol design + the computational overhead of privacy does not allow Nano to implement first layer privacy without compromising it's other features (fast, feeless, and scalable transactions).\n\n---\n\n**02:56 Decentralization**\n\n*Issues*\n\n- Nano is currently not as decentralized as it could be. ~25% of the voting weight is held by Binance. \n\n- Users must choose representatives, and users don't always choose the best ones (or never choose).\n\n*Potential Mitigations & Outstanding Issues*\n\n- Currently 4 unrelated parties (who all have a verifiable interest in keeping the network running) would have to work together to attack the network\n\n- Unlike Bitcoin, there is no mining or fees in Nano. This means that there is not a strong incentive for emergent centralization from profit maximization and economies of scale. We've seen this firsthand, as Nano's decentralization has increased over time.\n\n- [Nano representative percentages](https://i.imgur.com/QLIxJqy.jpg) are not that far off from [Bitcoin mining pool percentages](https://www.blockchain.com/en/pools).\n\n- In Nano, voting weight can be remotely re-delegated to anyone at any time. This differs from Bitcoin, where consensus is controlled by miners and requires significant hardware investment.\n\n- The cost of a 51% attack scales with the market cap of Nano.\n\n---\n\n**06:49 Marketing & adoption**\n\n*Issues*\n\n- The best technology doesn't always win. If no one knows about or uses Nano, it will die.\n\n*Potential Mitigations & Outstanding Issues*\n\n- I would argue that the best technology typically does win, but it needs to be best in every way (price, speed, accessbility, etc). Nano is currently in a good place if you agree with that argument.\n\n- Bitcoin started small, and didn't spend money on marketing. It takes time to build a community.\n\n- The developers have said they will market more once the protocol is where they want it to be (v20 or v21?).\n\n- Community marketing initiatives have started to form organically (e.g. Twitter campaigns, YouTube ads, etc).\n\n- Marketing and adoption is a very difficult problem to solve, especially when you don't have first mover advantage or consistent cashflow.\n\n---\n\n**08:07 Small developer fund**\n\n*Issues*\n\n- The developer fund only has 3 million NANO left (~$4MM), what happens after that?\n\n*Potential Mitigations & Outstanding Issues*\n\n- The goal for Nano is to be an Internet RFC like TCP/IP or SMTP - development naturally slows down when the protocol is in a good place.\n\n- Nano development is completely open source, so anyone can participate. Multiple developers are now familiar with the Nano protocol.\n\n- Businesses and whales that benefit from Nano (exchanges, remittances, merchant services, etc) are incentivized to keep the protocol developed and running.\n\n- The developer fund was only ~5% of the supply - compare that to some of the other major cryptocurrencies.\n\n---\n\n**10:08 Node incentives**\n\n*Issues*\n\n- There are no transaction fees, why would people run nodes to keep the network running?\n\n*Potential Mitigations & Outstanding Issues*\n\n- The cost of consensus is so low in Nano that the benefits of the network itself are the incentive: decentralized money with 0 transaction fees that can be sent anywhere in the world nearly instantly. Similar to TCP/IP, email servers, and http servers. Just like Bitcoin full nodes.\n\n- Paying $50-$100 a month for a high-end node is a lot cheaper for merchants than paying 1-3% in total sales.\n\n- Businesses and whales that benefit from Nano (exchanges, remittances, merchant services, etc) are incentivized to keep the protocol developed and running.\n\n---\n\n**11:58 No smart contracts**\n\n*Issues*\n\n- Nano doesn't support smart contracts.\n\n*Potential Mitigations & Outstanding Issues*\n\n- Nano's sole goal is to be the most efficient peer-to-peer value transfer protocol possible. Adding smart contracts makes keeping Nano feeless, fast, and decentralized much more difficult. \n\n- Other solutions (e.g. Ethereum) exist for creating and enforcing smart contracts.\n\n- Code can still interact with Nano, but not on the first layer in a decentralized matter.\n\n- Real world smart contract adoption and usage is pretty limited at the moment, but that might not always be the case.\n\n---\n\n**13:20 Price stability**\n\n*Issues*\n\n- Why would anyone accept or spend Nano if the price fluctuates so much?\n\n- Why wouldn't people just use a stablecoin version of Nano for sending and receiving money?\n\n*Potential Mitigations & Outstanding Issues*\n\n- With good fiat gateways (stable, low fees, etc), you can always buy back the fiat equivalent of what you've spent.\n\n- The hope is that with enough adoption, people and businesses will eventually skip the fiat conversion and use Nano directly.\n\n- Because Nano is so fast, volatility is less of an issue. Transactions are confirmed in <10 seconds, and prices change less in that timeframe (vs 10 minutes to hours for Bitcoin).\n\n- Stablecoins reintroduce trust. Stable against what? Who controls the supply, and how do you get people to adopt them? What happens if the assets they're stable against fail? Nano is pure supply and demand.\n\n- With worldwide adoption, the market capitalization of Nano would be in the trillions. If that happens, even millions of dollars won't move the price significantly.\n\n---\n\n**15:06 Deflation**\n\n*Issues*\n\n- Nano's current supply == max supply. Why would people spend Nano today if it could be worth more tomorrow?\n\n- What happens to principal representatives and voting weight as private keys are lost? How do you know keys are lost?\n\n*Potential Mitigations & Outstanding Issues*\n\n- Nano is extremely divisible. 1 NANO is 10^30 raw. Since there are no transaction fees, smaller and smaller amounts of Nano could be used to transact, even if the market cap reaches trillions.\n\n- People will always buy things they need (food, housing, etc).\n\n- I'm not sure what the plan is to adjust for lost keys. Probably requires more discussion.\n\n---\n\n**Long-term Scalability**\n\n*Issue*\n\n- Current node software and hardware cannot handle thousands of TPS (low-end nodes fall behind at even 50 TPS).\n\n- The more representatives that exist, the more vote traffic is required (network bandwidth).\n\n- Low-end nodes currently slow down the network significantly. Principal representatives waste their resources constantly bootstrapping these weak nodes during network saturation.\n\n*Potential Mitigations & Outstanding Issues*\n\n- Even as is, Nano can comfortably handle 50 TPS average - which is roughly the amount of transactions per day [PayPal was doing in 2011](https://techcrunch.com/2011/09/25/paypal-now-processing-315-million-in-payments-per-day/) with nearly 100 million users. \n\n- Network bandwidth increases [50% a year](https://www.nngroup.com/articles/law-of-bandwidth/).\n\n- There are some discussions of prioritizing bootstrapping by vote weight to limit the impact of weak nodes. \n\n- Since Nano uses an account balance system, pruning could drastically reduce storage requirements. You only need current state to keep the network running, not the full transaction history.\n\n- In the future, vote stapling could drastically reduce bandwidth usage by collecting all representative signatures up front and then only sharing that single aggregate signature.\n\n- Nano has no artificial protocol-based limits (e.g. block sizes or block times). It scales with hardware.\n\n---\n\nObviously there is still a lot of work to be done in some areas, but overall I think Nano is a good place. For people that aren't Nano fans, what are your biggest concerns?","title":"Let's discuss some of the issues with Nano","subreddit_name_prefixed":"r/CryptoCurrency","ups":918,"created":1562568922,"link_flair_background_color":"","id":"cad6lv","author":{"name":"Qwahzi"},"permalink":"/r/CryptoCurrency/comments/cad6lv/lets_discuss_some_of_the_issues_with_nano/","url":"https://www.reddit.com/r/CryptoCurrency/comments/cad6lv/lets_discuss_some_of_the_issues_with_nano/","created_utc":1562540122}