{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Прошло десять лет с момента создания этого рынка и три года с тех пор, как я начал внимательно следить за ним и анализировать его. Независимо от того, новичок вы в крипто или ветеран, который прошел через множество пузырей, скорее всего, вы не * действительно * знаете, что происходит. Несмотря на то, что пока мы пережили худший медвежий рынок, мы находимся на общей рыночной капитализации в 300 миллиардов долларов. Так почему же крипто-журналистика настолько плоха, что она торчит даже по сравнению с современной журналистикой? Ответ в том, что ** отсутствие доступного предвидения и непредвзятых анализов очень преднамеренно. **\n\nLitecoin, Bitcoin Cash, Bitcoin SV и другие клоны (и почти все остальное, но клоны не такие туманные) действительно дают вам прекрасное представление о безумии этого рынка. Каждому, кто пытается привязать какие-либо метрики к этим проектам или сделать реалистичные прогнозы относительно усыновления и «справедливой стоимости», задают вопрос: «Кто в здравом уме мог бы подумать, что это стоит 5+ миллиардов?» Поскольку по существу невозможно совместить рыночную оценку и основные принципы, они предполагают, что есть что-то, чего они не получают, что есть важная информация, которой у них нет, и поэтому они возобновляют бизнес как обычно. Там *** должно быть ***, чтобы быть причиной, верно? Правда в том, что крипто в целом - это редкий и * безумно выгодный * коктейль. Рынок разделен почти идеально на две части (под идеальным я не имею в виду 50/50, я имею в виду, что эти две стороны представляют почти 100% рынка):\n\n* ** Манипуляторы **, которые имеют средства для проведения должной осмотрительности и полностью осознают, что подавляющее, подавляющее большинство проектов абсолютно никуда не денется, хотя некоторые из них могут взорваться.\n* ** Игроки **, которые не понимают основную технологию (и тем более экономическую среду, окружающую эту технологию), но готовы коллективно раскошелиться на миллионы, чтобы получить быструю прибыль.\n\nКоличество людей, которые проводят тщательные, непредвзятые исследования и тщательно инвестируют, невероятно низко, просто потому, что очень мало людей, у которых есть ресурсы, необходимые для того, чтобы просеять чушь собачью и не намерены эксплуатировать рынок. В сочетании с крайне низкой реальной ликвидностью (арбитраж и маркет-мейкеров не следует принимать во внимание), это приводит к бессмысленному рынку взлетов и падений, который приносит пользу манипуляторам ** каждый раз **. Тем не менее, все это было бы невозможно, если бы не ключевой ингредиент: биткойн. Пока Биткойн и любой его клон тяготеют к вершине, вы можете быть уверены, что рыночные условия не изменились, поскольку они действуют как индикаторы. Наш главный мем является отличным свидетельством этого: «HODL» основан на странном и необоснованном предположении, что прошлое повторится * ad vitam *, и он отлично справляется с поддержанием низкой ликвидности. Короче говоря, это идеальный показатель общего идиотизма сообщества.\n\nОсновные СМИ только усугубляют проблему. Намного дешевле (и, следовательно, выгоднее) пригласить сторонников или критиков Биткойна для продвижения определенной программы, чем платить компетентным журналистам или экспертам за подробное объяснение умных контрактов и рост программируемой экономики, например. Тем не менее, я могу вам сказать, что в большинстве профессиональных кругов никто не говорит о биткойнах. Производители не заботятся о получении платежей в биткойнах, они заботятся о целостности и безопасности данных. Энергетические консорциумы не заинтересованы в том, чтобы домохозяйства оплачивали свои счета с помощью Litecoin, они заботятся об автономных, самобалансирующихся, самоконтрольных сетях, которые оптимизируют распределение электроэнергии и цены.\n\nЕсть несколько проектов, у которых гораздо больше шансов преодолеть препятствия для усыновления, но вряд ли вы найдете их в топ-10, потому что они не сексуальны и не просты. Зачем манипуляторам тратить время, деньги и усилия, взвинчивая ценность этих проектов, когда они прекрасно знают, что они оценят сами по себе в свое время? Гораздо проще получить как можно больше денег от дебилов, которые хотят «инвестировать» в бесполезный мусор, а остальным резко обесцениться, чтобы обеспечить более низкую точку входа. Даже по мере развития технологий и обнародования реальных инноваций все остальное заботятся о трайбализме и хит-парадах.\n\n** TL; DR: ** Текущие цены не свидетельствуют о будущем успехе. Если вы провели исследование и пришли к выводу, что актив недооценен, поверьте в себя. Этот рынок не твой друг, он существует только для того, чтобы забрать твои деньги.","title":"Этот рынок - дойная корова.","subreddit_name_prefixed":"r/CryptoCurrency","ups":242,"created":1565648286,"link_flair_background_color":"","id":"cpcz8f","author":{"name":"bLbGoldeN"},"permalink":"/r/CryptoCurrency/comments/cpcz8f/this_market_is_a_cash_cow/","url":"https://www.reddit.com/r/CryptoCurrency/comments/cpcz8f/this_market_is_a_cash_cow/","created_utc":1565619486}