{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"","title":"Эндрю Ян хочет использовать Blockchain при голосовании. «Смешно, что в 2020 году мы все еще стоим в очереди в течение нескольких часов, чтобы проголосовать в устаревших кабинах для голосования. Технически возможно иметь голосование с защитой от мошенничества на нашем мобильном телефоне»","subreddit_name_prefixed":"r/CryptoCurrency","ups":4348,"created":1566361384,"link_flair_background_color":"","id":"ct5i93","author":{"name":"coinsmash1"},"permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/","url":"https://www.yang2020.com/policies/modernize-voting/","created_utc":1566332584,"replies":[{"ups":261,"link_id":"t3_ct5i93","replies":[{"ups":2,"link_id":"t3_ct5i93","id":"exkxbo6","author":"[deleted]","parent_id":"t1_exkf37x","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkxbo6/","name":"t1_exkxbo6","created":1566430002,"created_utc":1566401202,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exixoun","author":"itsthenewdan","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I can't believe nobody has posted the relevant xkcd yet: [https://xkcd.com/2030/](https://xkcd.com/2030/)","body_html":"<div class = \"md\"> <p> Не могу поверить, что никто еще не опубликовал соответствующий xkcd: <a href=\"https://xkcd.com/2030/\"> https://xkcd.com/2030 / </a> </р>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exixoun/","name":"t1_exixoun","created":1566366505,"created_utc":1566337705,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":323,"link_id":"t3_ct5i93","replies":[{"ups":33,"link_id":"t3_ct5i93","replies":[{"ups":5,"link_id":"t3_ct5i93","replies":[{"ups":6,"link_id":"t3_ct5i93","id":"exj5wm6","author":"EdisonClayton","parent_id":"t1_exj58yu","subreddit_id":"t5_2wlj3","body":"It'd be very suspicious but how do you catch the guy who did it if you don't have any evidence? With pencil, the dude has to be there erasing the ballots after they've been cast, which is near impossible considering the box is never alone.","body_html":"<div class = \"md\"> <p> Это было бы очень подозрительно, но как вы поймали парня, который сделал это, если у вас нет никаких доказательств? С карандашом, чувак должен стирать бюллетени после того, как они были брошены, что почти невозможно, учитывая, что коробка никогда не бывает одна. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj5wm6/","name":"t1_exj5wm6","created":1566371493,"created_utc":1566342693,"subreddit_name_prefixed":"r/CryptoCurrency","depth":6}],"id":"exj4azf","author":"EdisonClayton","parent_id":"t1_exj42ao","subreddit_id":"t5_2wlj3","body":"if you can somehow sneak past everyone, unlock the ballot box, and erase votes from ballots without getting caught, *after* they are cast but *before* they are counted, please make a movie about it. Invisible ink is something that could be loaded into pens beforehand.","body_html":"<div class = \"md\"> <p> если вы можете каким-то образом прокрасться мимо всех, разблокировать урну для голосования и стереть голоса из бюллетеней, чтобы их не поймали, <em> после </em> они разыгрываются, но <em> до < / em> они засчитаны, пожалуйста, сделайте фильм об этом. Невидимые чернила - это то, что можно предварительно загрузить в ручки. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj4azf/","name":"t1_exj4azf","created":1566370468,"created_utc":1566341668,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"exiunnr","author":"EdisonClayton","parent_id":"t1_exitmqe","subreddit_id":"t5_2wlj3","body":"Every programmer warns about this.\n\nWe had all of human history to perfect the voting system. We still use pencil instead of pen because fading-ink exists. Such a minor detail is crucial, imagine what could go wrong with digital voting?","body_html":"<div class = \"md\"> <p> Каждый программист предупреждает об этом. </p>\n\n<p> У нас была вся человеческая история, чтобы усовершенствовать систему голосования. Мы по-прежнему используем карандаш вместо ручки, потому что существуют блеклые чернила. Такая незначительная деталь очень важна, представьте, что может пойти не так с цифровым голосованием? </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiunnr/","name":"t1_exiunnr","created":1566364735,"created_utc":1566335935,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exiqicx","author":"IncrocioVitali","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"It's not merely technical requirements for digital voting. The booth ensures that no one vote on your behalf, or you vote under influence from someone else.\n\n&#x200B;\n\nStill, it'll eventually happen I reckon. And it has advantages as well, possibly increasing voter turnout e.g.","body_html":"<div class = \"md\"> <p> Это не просто технические требования для цифрового голосования. Стенд гарантирует, что никто не голосует от вашего имени, или вы голосуете под влиянием кого-то другого. </P>\n\n<Р> </р>\n\n<p> Тем не менее, это произойдет, я думаю. И это также имеет свои преимущества, возможно, увеличивая явку избирателей, например. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiqicx/","name":"t1_exiqicx","created":1566362378,"created_utc":1566333578,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":23,"link_id":"t3_ct5i93","id":"exiyqn4","author":"ifihadsomethingtosay","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Since there seems to be a lot of misinformation going around in these comments. Yang is not trying to replace paper voting with blockchain, but sees it as an interesting possibility and something to be explored more. He has mentioned security concerns about going to software voting and also concerns about how some rural areas would not have access to the resources to vote with software. He is not advocating for switching to blockchain in the next 4-8 years for voting, but rather for making steps towards that.","body_html":"<div class = \"md\"> <p> Поскольку в этих комментариях, похоже, много дезинформации. Ян не пытается заменить бумажное голосование блокчейном, но видит в этом интересную возможность и возможность более подробного изучения. Он упомянул о проблемах безопасности при переходе к голосованию по программному обеспечению, а также о том, что некоторые сельские районы не имеют доступа к ресурсам для голосования с помощью программного обеспечения. Он не выступает за переход на блокчейн в ближайшие 4-8 лет для голосования, а скорее для того, чтобы сделать шаги в этом направлении. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiyqn4/","name":"t1_exiyqn4","created":1566367124,"created_utc":1566338324,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":71,"link_id":"t3_ct5i93","replies":[{"ups":11,"link_id":"t3_ct5i93","replies":[{"body":"Except the degree of specialized knowledge needed to interogate a blockchain ledger is like one college CS class\n\nThe number of people with the sufficient skills to do so is like half the graduating white collar workforce","ups":5,"link_id":"t3_ct5i93","id":"exk13em","author":"Sir_Smurf","parent_id":"t1_exjre52","subreddit_id":"t5_2wlj3","body_html":"<div class = \"md\"> <p> За исключением того, что уровень специальных знаний, необходимых для объединения книги блокчейна, подобен одному классу CS колледжа </p>\n\n<p> Количество людей, обладающих достаточными навыками, чтобы сделать это, составляет половину выпускной рабочей силы белых воротничков </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk13em/","name":"t1_exk13em","created":1566396754,"created_utc":1566367954,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"exjrah7","author":"tommytoan","parent_id":"t1_exjkpgu","subreddit_id":"t5_2wlj3","body":"if its on a blockchain its public and transparent?","body_html":"<div class = \"md\"> <p> если он находится в блокчейне, он публичный и прозрачный? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjrah7/","name":"t1_exjrah7","created":1566386833,"created_utc":1566358033,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exizaen","author":"Trident1000","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Yeah thats gonna be a no from me dawg.  The govt could just plug in additional units/counts into the system and we would never know.  I want the physical exit polls that anyone can conduct to make sure elections are not a total scam and just programmed winners.  Blockchain is a great accounting method but it doesnt solve a bunch of other steps.","body_html":"<div class = \"md\"> <p> Да, это будет от меня нет. Правительство может просто добавить дополнительные единицы / числа в систему, и мы никогда не узнаем. Я хочу, чтобы любой физический опрос, который может провести каждый, чтобы убедиться, что выборы - это не просто афера, а просто запрограммированные победители. Блокчейн - отличный метод учета, но он не решает кучу других шагов. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exizaen/","name":"t1_exizaen","created":1566367451,"created_utc":1566338651,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_ct5i93","id":"exjgz2n","author":"[deleted]","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjgz2n/","name":"t1_exjgz2n","created":1566378997,"created_utc":1566350197,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":92,"link_id":"t3_ct5i93","replies":[{"ups":6,"link_id":"t3_ct5i93","id":"exizfh5","author":"x62617","parent_id":"t1_exiz23h","subreddit_id":"t5_2wlj3","body":"Yes but I think the issue is if you vote at home they can literally stand there and watch or do it themselves to ensure your vote is a certain way. Or hell, they could just pay to get your encryption key so they can use it to vote.","body_html":"<div class = \"md\"> <p> Да, но я думаю, что проблема в том, что если вы проголосуете дома, они могут буквально стоять там и смотреть или делать это сами, чтобы убедиться, что ваш голос определенным образом. Или, черт возьми, они могут просто заплатить, чтобы получить ваш ключ шифрования, чтобы они могли использовать его для голосования. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exizfh5/","name":"t1_exizfh5","created":1566367535,"created_utc":1566338735,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exitq6b","author":"x62617","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"There is a \"game theory\" reason that voting on your phone in your home is a bad idea.\n\nHere is why voting should be done in a public place but within a private booth. If you could vote on your phone that opens up voter fraud on a massive scale. A candidate could have people go door to door and buy your vote. The reason they can't buy your vote right now is that they can't prove that you voted how they want. They can't follow you into the booth. If someone knocked on my door and told me they'd give me $50 bucks to vote for their guy I'd probably do it. Unless I could get them in a bidding war with the other candidate. Then they could physically watch me vote on my phone to make sure I voted how they wanted and then give me the cash. (I'd sell my vote because honestly I'm an anarchist and don't care about government at all and I am firmly in the majority of people who don't vote. I suspect a large percentage of the population would also sell their vote.)\n\nSimilarly, it may seem counter intuitive but there is actually a good argument that all Senate and House votes should be done privately also. This would prevent lobbyists from being able to buy votes. They wouldn't be able to guarantee that the Senator they bribed actually voted the way they wanted. This is counter intuitive because most people think it's very important that the votes of the representatives are public but it actually helps lobbyists bribe votes. Elected officials would then be free to vote their conscience.  \n\n\nEdit: For more on this look up the writings of James G. D'Angelo. He does a better job of explaining the game theory.   \n\n\nAlso for background I was an officer in the Army in Iraq who set up and provided security around the first voting locations in Iraq. You know the famous images of the ink-dyed fingers of the Iraqi voters? Ya we were helping with that. The reasons the voting booths were set up the way they were, and the reasons the voting was done the way it was, was because of this same game theory to prevent corruption, fraud, bribery, etc.","body_html":"<div class = \"md\"> <p> Существует «теория игр», по которой голосование по телефону в вашем доме - плохая идея. </p>\n\n<p> Вот почему голосование должно проводиться в общественном месте, но в закрытом помещении. Если бы вы могли голосовать на своем телефоне, это открывает массовое мошенничество на выборах. Кандидат может заставить людей пойти от двери к двери и купить ваш голос. Причина, по которой они не могут купить ваш голос прямо сейчас, заключается в том, что они не могут доказать, что вы проголосовали так, как они хотят. Они не могут следовать за вами в будку. Если бы кто-нибудь постучал в мою дверь и сказал, что они дадут мне 50 долларов, чтобы я проголосовал за своего парня, я бы, наверное, сделал это. Если только я не смогу получить их в войне с другим кандидатом. Затем они могли физически наблюдать за тем, как я голосую по телефону, чтобы убедиться, что я проголосовал, как они хотели, а затем дать мне деньги. (Я бы продал свой голос, потому что, честно говоря, я анархист и вообще не заботюсь о правительстве, и я твердо в большинстве людей, которые не голосуют. Я подозреваю, что большой процент населения также продаст их голосование.) </p>\n\n<p> Точно так же это может показаться нелогичным, но на самом деле есть хороший аргумент в пользу того, что все голоса в Сенате и Палате представителей должны также проводиться в частном порядке. Это лишит лоббистов возможности покупать голоса. Они не смогут гарантировать, что подкупленный ими сенатор действительно проголосовал так, как они хотели. Это противоречит интуиции, потому что большинство людей считают очень важным, чтобы голоса представителей были публичными, но на самом деле это помогает лоббистам подкупать голоса. Избранные должностные лица будут иметь право голосовать за свою совесть. </Р>\n\n<p> Редактировать. Подробнее об этом читайте в сочинениях Джеймса Г. Д'Анджело. Он лучше объясняет теорию игр. </Р>\n\n<p> Также, для справки, я был офицером в армии в Ираке, который установил и обеспечил безопасность в первых местах голосования в Ираке. Вы знаете знаменитые изображения окрашенных чернилами пальцев иракских избирателей? Я помогал с этим. Причины, по которым кабины для голосования были установлены так, как они были, и причины, по которым голосование было сделано так, как оно было, были из-за той же теории игр для предотвращения коррупции, мошенничества, взяточничества и т. Д. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exitq6b/","name":"t1_exitq6b","created":1566364193,"created_utc":1566335393,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_ct5i93","id":"exj1qoh","author":"steb24","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I dont think the possibility of 0% fraud exists in anything","body_html":"<div class = \"md\"> <p> Я не думаю, что вероятность мошенничества в 0% существует во всем </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj1qoh/","name":"t1_exj1qoh","created":1566368910,"created_utc":1566340110,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":40,"link_id":"t3_ct5i93","replies":[{"ups":11,"link_id":"t3_ct5i93","id":"exjf1ab","author":"SexyAndImSorry","parent_id":"t1_exjb9sn","subreddit_id":"t5_2wlj3","body":"If you can verify your vote, someone else can ask to see the verification. There would have to be a way that you can verify it, but you can still lie to someone else about how you voted. But yeah, that would be cool.","body_html":"<div class = \"md\"> <p> Если вы можете подтвердить свой голос, кто-то другой может попросить его проверить. Должен быть способ, которым вы можете это проверить, но вы все равно можете лгать кому-то другому о том, как вы проголосовали. Но да, это было бы круто. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjf1ab/","name":"t1_exjf1ab","created":1566377609,"created_utc":1566348809,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exitn3o","author":"MoonlapseOfficial","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"no we need paper voting to avoid coercion","body_html":"<div class = \"md\"> <p> нет, нам нужно бумажное голосование, чтобы избежать принуждения </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exitn3o/","name":"t1_exitn3o","created":1566364144,"created_utc":1566335344,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":21,"link_id":"t3_ct5i93","replies":[{"ups":8,"link_id":"t3_ct5i93","replies":[{"ups":2,"link_id":"t3_ct5i93","id":"exksw2a","author":"suninabox","parent_id":"t1_exk1jxp","subreddit_id":"t5_2wlj3","body":"Someone already has:\n\nhttps://en.bitcoin.it/wiki/Value_overflow_incident\n\nSecondly the vulnerability is not people making changes to the ledger, but intercepting, manipulating and uploading false data to the ledger. Once that is done, the fact you can't change the ledger becomes a negative, not a positive, since now there's no way to get false records off the ledger.","body_html":"<div class = \"md\"> <p> У кого-то уже есть: </p>\n\n<p> <a href=\"https://en.bitcoin.it/wiki/Value_overflow_incident\"> https://en.bitcoin.it/wiki/Value_overflow_incident </a> </p>\n\n<p> Во-вторых, уязвимость заключается не в том, что люди вносят изменения в книгу, а в перехвате, манипулировании и загрузке ложных данных в книгу. Как только это будет сделано, тот факт, что вы не сможете изменить бухгалтерскую книгу, становится отрицательным, а не положительным, поскольку теперь нет способа получить ложные записи из бухгалтерской книги. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exksw2a/","name":"t1_exksw2a","created":1566426975,"created_utc":1566398175,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4},{"ups":3,"link_id":"t3_ct5i93","replies":[{"ups":4,"link_id":"t3_ct5i93","id":"exkc5ls","author":"d3vrandom","parent_id":"t1_exk4hf9","subreddit_id":"t5_2wlj3","body":"> That's not \"hacking\" bitcoin. They are hacking weak clients with security holes and phishing dumb people.\n\nWho are the same people who will be voting with mobile phones.","body_html":"<div class = \"md\"> <blockquote>\n<p> Это не \"хакерский\" биткойн. Они взламывают слабых клиентов с помощью дыр в безопасности и фишинговых глупостей. </P>\n</BLOCKQUOTE>\n\n<p> Это те же люди, которые будут голосовать с помощью мобильных телефонов. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkc5ls/","name":"t1_exkc5ls","created":1566412631,"created_utc":1566383831,"subreddit_name_prefixed":"r/CryptoCurrency","depth":6},{"ups":2,"link_id":"t3_ct5i93","id":"exk5hat","author":"robbak","parent_id":"t1_exk4hf9","subreddit_id":"t5_2wlj3","body":"It is exactly equivalent to hacking a blockchain-backed election. Blockchain helps you ensure that information on the blockchain is immutable, but it doesn't help with making sure accurate information is put on it, or the information taken from it is interpreted correctly. \n\nSo, the car disappeared along with the representatives of all candidates that were in the car accompanying the ballot box? Well, the paper system is vulnerable to mass murder, but mass murder is hard to do without causing a stink. This is the major problem with all electronic voting - the attacker can rig the election and then erase their trail.","body_html":"<div class = \"md\"> <p> Это в точности эквивалентно взлому выборов, поддерживаемых блокчейном. Блокчейн помогает вам гарантировать, что информация на блокчейне является неизменной, но это не помогает гарантировать, что точная информация помещена в нее, или информация, взятая из нее, интерпретируется правильно. </Р>\n\n<p> Итак, машина исчезла вместе с представителями всех кандидатов, которые находились в машине, сопровождающей урну для голосования? Ну, бумажная система уязвима для массовых убийств, но массовые убийства трудно сделать, не вызывая вони. Это главная проблема любого электронного голосования - злоумышленник может сфальсифицировать выборы, а затем стереть их след. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk5hat/","name":"t1_exk5hat","created":1566402784,"created_utc":1566373984,"subreddit_name_prefixed":"r/CryptoCurrency","depth":6}],"id":"exk2hnl","author":"robbak","parent_id":"t1_exk1jxp","subreddit_id":"t5_2wlj3","body":"Lots have people have, in that they have tricked someone to send their coins to the wrong person, by replacing the address without the person noticing. This is the sort of 'hack' we are talking about here. The web store is hacked and the addresses changed, or they are fooled into installing client software that redirects their transactions or steals their keys.","body_html":"<div class = \"md\"> <p> У многих есть люди, которые обманули кого-то, чтобы отправить свои монеты не тому человеку, заменив адрес, не заметив этого. Это своего рода «хак», о котором мы здесь говорим. Интернет-магазин взломан и адреса изменены, или они одурачены для установки клиентского программного обеспечения, которое перенаправляет их транзакции или крадет их ключи. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk2hnl/","name":"t1_exk2hnl","created":1566398552,"created_utc":1566369752,"subreddit_name_prefixed":"r/CryptoCurrency","depth":4}],"id":"exjod5w","author":"robbak","parent_id":"t1_exjkuao","subreddit_id":"t5_2wlj3","body":"The fraud would happen before the vote is hashed into the blockchain - the wrong votes recorded on the chain. You make a single change in the voting software, and it flips millions of votes.\n\nA public blockchain that records votes, allows anyone to verify that their vote was recorded correctly, but does not allow anyone to determine what someone else's vote was? Well, even if that works perfectly, you'll have half the losing side claiming their votes were recorded wrong.","body_html":"<div class = \"md\"> <p> Мошенничество произойдет до того, как голос будет добавлен в цепочку блоков - неправильные голоса, записанные в цепочке. Вы вносите одно изменение в программное обеспечение для голосования, и оно отбрасывает миллионы голосов. </P>\n\n<p> Публичная цепочка блоков, в которой записываются голоса, позволяет кому-либо проверить, правильно ли был записан их голос, но не позволяет кому-либо определить, каким был голос другого лица? Что ж, даже если это сработает отлично, половина проигравших будет утверждать, что их голоса были записаны неправильно. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjod5w/","name":"t1_exjod5w","created":1566384476,"created_utc":1566355676,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2},{"ups":3,"link_id":"t3_ct5i93","id":"exjlxda","author":"trizephyr","parent_id":"t1_exjkuao","subreddit_id":"t5_2wlj3","body":"The biggest vector of attack imo for that kind of thing, how do you know that the software that has been vetted/inspected/approved is the same software that actually ends up on the machine?\n\nToo many variables.","body_html":"<div class = \"md\"> <p> Самый большой вектор атаки на подобные вещи, откуда вы знаете, что программное обеспечение, которое было проверено / проверено / одобрено, является тем же программным обеспечением, которое фактически оказывается на компьютере? </р>\n\n<p> Слишком много переменных. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjlxda/","name":"t1_exjlxda","created":1566382608,"created_utc":1566353808,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exixs12","author":"alsomahler","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"[Why Electronic Voting is a BAD Idea](https://youtu.be/w3_0x6oaDmI)","body_html":"<div class = \"md\"> <p> <a href=\"https://youtu.be/w3_0x6oaDmI\"> Почему электронное голосование является ПЛОХОЙ идеей </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exixs12/","name":"t1_exixs12","created":1566366555,"created_utc":1566337755,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":15,"link_id":"t3_ct5i93","id":"exisn3j","author":"cryptonaut414","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Holy hell. Those comments are cancer","body_html":"<div class = \"md\"> <p> Святой ад. Эти комментарии являются раком </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exisn3j/","name":"t1_exisn3j","created":1566363565,"created_utc":1566334765,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":8,"link_id":"t3_ct5i93","id":"exirlgk","author":"noretreatz","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"RIP HST. What HST was trying to achieve.","body_html":"<div class = \"md\"> <p> RIP HST. Чего пытался достичь HST. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exirlgk/","name":"t1_exirlgk","created":1566362979,"created_utc":1566334179,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_ct5i93","id":"exjoowm","author":"BootDisc","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Ehh.  The thing is, you still probably need some type of Trusted Authority.  Someone needs to issue / revoke keys.  What if I die.  What if I lost my phone.  I should also be able to vote without my keys, some states you don’t need an ID, you sign a form that says I’m me, and I get to vote.  In an audit, that vote becomes a debatable point.  At the same time, people shouldn’t know who I voted for.  Wouldn’t want the police harassing me because I didn’t vote for their mileage.\n\nEdit: my main point, I don’t think it’s a trustless system.  There will still be people involved managing the trusted aspect.","body_html":"<div class = \"md\"> <p> Эхх. Дело в том, что вам все еще, вероятно, нужен какой-то тип доверенного органа. Кто-то должен выдать / отозвать ключи. Что если я умру. Что делать, если я потерял свой телефон. Я также должен иметь возможность голосовать без моих ключей, в некоторых штатах вам не требуется удостоверение личности, вы подписываете форму, в которой говорится, что я - я, и я могу голосовать. В ходе аудита этот голос становится дискуссионным. В то же время люди не должны знать, за кого я голосовал. Не хотел бы, чтобы полиция преследовала меня, потому что я не голосовал за их пробег. </P>\n\n<p> Редактировать: моя главная мысль, я не думаю, что это система, которой нельзя доверять. Все еще будут люди, вовлеченные в управление доверенным аспектом. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjoowm/","name":"t1_exjoowm","created":1566384733,"created_utc":1566355933,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":5,"link_id":"t3_ct5i93","id":"exk1oof","author":"Dan13LP","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I've been saying and thinking this since I discovered blockchain technology. Elections and keeping track of votes, are a great, if not one of the best, use cases for the blockchain. \n\nThe fact the voting and elections, even at a national level, aren't standardized is insane. Then throw in the chance for human error when counting the multitude of different voting mediums, and there's no doubt, there will be errors.\n\nA public distributed immutable ledger is literally the best solution for preventing voter fraud and provide accurate election results.","body_html":"<div class = \"md\"> <p> Я говорю и думаю об этом с тех пор, как открыл технологию блокчейна. Выборы и отслеживание голосов - отличный, если не один из лучших вариантов использования блокчейна. </Р>\n\n<p> Тот факт, что голосование и выборы, даже на национальном уровне, не стандартизированы, безумен. Затем добавьте шанс ошибки человека при подсчете множества различных сред голосования, и нет никаких сомнений, что будут ошибки. </P>\n\n<p> Публичный распределенный постоянный регистр буквально является лучшим решением для предотвращения мошенничества на выборах и предоставления точных результатов выборов. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk1oof/","name":"t1_exk1oof","created":1566397493,"created_utc":1566368693,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":16,"link_id":"t3_ct5i93","id":"exiw6yy","author":"hidanone","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"As a crypto enthusiast, I still admit that with elections we should use paper ballots.","body_html":"<div class = \"md\"> <p> Как криптоэнтузиаст, я все же признаю, что на выборах мы должны использовать бумажные бюллетени. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiw6yy/","name":"t1_exiw6yy","created":1566365623,"created_utc":1566336823,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":6,"link_id":"t3_ct5i93","replies":[{"ups":1,"link_id":"t3_ct5i93","id":"exjk2z2","author":"oklahomasooner55","parent_id":"t1_exjhgkl","subreddit_id":"t5_2wlj3","body":"He also proposed ending universal suffrage and only allowing people that serve the military to be able to vote or run for office.","body_html":"<div class = \"md\"> <p> Он также предложил отменить всеобщее избирательное право и разрешить только тем людям, которые служат в армии, иметь возможность голосовать или баллотироваться на должность. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjk2z2/","name":"t1_exjk2z2","created":1566381247,"created_utc":1566352447,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exizfxl","author":"[deleted]","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exizfxl/","name":"t1_exizfxl","created":1566367543,"created_utc":1566338743,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exj1yv0","author":"Tebasaki","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"This is going to have to be created before it's adopted","body_html":"<div class = \"md\"> <p> Это должно быть создано до его принятия </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj1yv0/","name":"t1_exj1yv0","created":1566369047,"created_utc":1566340247,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exjjj57","author":"CryptoShitLord","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Til someone grabs your phone....","body_html":"<div class = \"md\"> <p> Пока кто-нибудь не схватит ваш телефон .... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjjj57/","name":"t1_exjjj57","created":1566380837,"created_utc":1566352037,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exk5l5t","author":"nocivo","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"100% fraud proof... how naive.","body_html":"<div class = \"md\"> <p> 100% доказательство мошенничества ... как наивно. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk5l5t/","name":"t1_exk5l5t","created":1566402945,"created_utc":1566374145,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exkipsx","author":"trancefate","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Another in a long line of horribly thought out buzzword plans.","body_html":"<div class = \"md\"> <p> Еще один в длинной череде ужасно продуманных планов модных слов. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkipsx/","name":"t1_exkipsx","created":1566419542,"created_utc":1566390742,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exkqxil","author":"TriSamples","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"There is no reason that it should not be used as a secondary confirmation system and check. But using as a sole method is beyond stupid and dangerous. The blockchain might be unhackable in theory but phones, people and circumstances can be. Just imagine click farms devoted to voting fraudulently or gangs roaming around to threaten people not to vote or getting blocked by taking services and internet down to deny votes.\n\nMobile phone voting would get out young democratic votes for sure but it would also be much more vulnerable.","body_html":"<div class = \"md\"> <p> Нет причин, по которым его нельзя использовать в качестве вторичной системы подтверждения и проверки. Но использование в качестве единственного метода вне глупо и опасно. Блокчейн теоретически может быть не взломан, но телефоны, люди и обстоятельства могут быть. Представьте себе клик-фермы, посвященные мошенническому голосованию или бандитам, бродящим вокруг, чтобы угрожать людям не голосовать или быть заблокированными из-за того, что отказались от услуг и интернета, чтобы отказать в голосовании. </P>\n\n<p> Голосование по мобильному телефону наверняка получит голоса молодых демократических избирателей, но оно также будет гораздо более уязвимым. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkqxil/","name":"t1_exkqxil","created":1566425666,"created_utc":1566396866,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":30,"link_id":"t3_ct5i93","id":"exiuem7","author":"EdisonClayton","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"\"It is 100% technically possible to have fraud proof voting on our mobile phone\"\n\nHey, everybody! This guy who doesn't have much technological knowledge himself has apparently found out how to do that thing that literally everyone with technical knowledge says is a horrible fucking idea that should never be tried!","body_html":"<div class = \"md\"> <p> \"Технически возможно провести голосование с защитой от мошенничества на нашем мобильном телефоне\" </p>\n\n<p> Привет всем! Этот парень, который сам не имеет большого технического знания, очевидно, узнал, как сделать то, что буквально каждый, у кого есть технические знания, - ужасная чертова идея, которую никогда не следует испытывать! </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiuem7/","name":"t1_exiuem7","created":1566364590,"created_utc":1566335790,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":22,"link_id":"t3_ct5i93","replies":[{"ups":9,"link_id":"t3_ct5i93","id":"exjcka0","author":"zer0cul","parent_id":"t1_exj0yp7","subreddit_id":"t5_2wlj3","body":"[Tom Scott explains](https://youtu.be/w3_0x6oaDmI)\n\nShort summary- ideal elections have no trust involved. When counting votes everyone with a stake in the election should be able to check and verify the count. There should be a record in case a recount is needed and the voting should be anonymous to prevent coercion. Attacks should be hard to scale up and involve as many people as possible who could blow the whistle on the operation. Electronic voting offers none of that.","body_html":"<div class = \"md\"> <p> <a href=\"https://youtu.be/w3_0x6oaDmI\"> Том Скотт объясняет </a> </p>\n\n<p> Краткое резюме: идеальные выборы не требуют доверия. При подсчете голосов каждый, кто заинтересован в выборах, должен иметь возможность проверить и проверить подсчет голосов. Должна быть запись в случае, если требуется пересчет, и голосование должно быть анонимным, чтобы предотвратить принуждение. Атаки должны быть трудно масштабируемыми и вовлекать как можно больше людей, которые могут свистеть в операции. Электронное голосование не предлагает ничего подобного. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjcka0/","name":"t1_exjcka0","created":1566375818,"created_utc":1566347018,"subreddit_name_prefixed":"r/CryptoCurrency","depth":2}],"id":"exiv0eb","author":"eastsideski","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Andrew Yang is wrong","body_html":"<div class = \"md\"> <p> Эндрю Ян не прав </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiv0eb/","name":"t1_exiv0eb","created":1566364938,"created_utc":1566336138,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exjzwj8","author":"gnovos","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"If you do that, we don't even need congress.  We could directly vote for every law.  BEEP.  New law just reached the top of Lawddit and arrived on your phone, read through the text, read the comments, upvote or downvote, and boom, new laws.  This could be all the government we ever need.","body_html":"<div class = \"md\"> <p> Если вы сделаете это, нам даже не понадобится конгресс. Мы могли бы напрямую голосовать за каждый закон. ЗВУК. Новый закон только что достиг вершины Lawddit и прибыл на ваш телефон, прочитал текст, прочитал комментарии, повысил или понизил голос, и бум, новые законы. Это может быть все правительство, которое нам когда-либо понадобится. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjzwj8/","name":"t1_exjzwj8","created":1566395326,"created_utc":1566366526,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exk47u3","author":"jamespunk","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"There is a reason why you go to a public box where you cant be forced by a gun by anyone. Should not be hard to understand. Voting will never be digital ’from you home’","body_html":"<div class = \"md\"> <p> Есть причина, по которой вы идете в публичную коробку, где никто не может быть подвергнут принудительному воздействию оружия. Не должно быть трудно понять. Голосование никогда не будет цифровым \"из вашего дома\" </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk47u3/","name":"t1_exk47u3","created":1566400951,"created_utc":1566372151,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exk4kvy","author":"CrozRM","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"After watching The Great Hack last night, I think this is definitely what we need to see. We're seeing more fair and transparent blockchain platforms (Hyperleder, Pledgecamp, Dfinityet al) being developed whereby a voting system could take some notes from. I doubt it'll be in place for next year though! 😂","body_html":"<div class = \"md\"> <p> После вчерашнего просмотра The Great Hack, я думаю, это то, что нам нужно увидеть. Мы наблюдаем разработку более справедливых и прозрачных платформ блокчейнов (Hyperleder, Pledgecamp, Dfinityet и др.), Благодаря которым система голосования могла бы делать некоторые заметки. Я сомневаюсь, что это будет в следующем году! 😂 </р>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk4kvy/","name":"t1_exk4kvy","created":1566401458,"created_utc":1566372658,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exkbc12","author":"emobe_","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"its racist to do that","body_html":"<div class = \"md\"> <p> расист, чтобы сделать это </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkbc12/","name":"t1_exkbc12","created":1566411526,"created_utc":1566382726,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exklhjb","author":"teknic111","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Democrats would never win again.","body_html":"<div class = \"md\"> <p> демократы больше никогда не победят. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exklhjb/","name":"t1_exklhjb","created":1566421818,"created_utc":1566393018,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exklt2k","author":"stevenglansberg94","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"But where does he stand on voter ID? It’s all useless unless people can prove they’re a citizen","body_html":"<div class = \"md\"> <p> Но где он стоит на ID избирателя? Это все бесполезно, если люди не могут доказать, что они гражданин </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exklt2k/","name":"t1_exklt2k","created":1566422063,"created_utc":1566393263,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exktbdx","author":"Stringdaddy27","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"He's right, but the conservatives would never allow something like this because they'd be royally screwed. All their voters wouldn't know how to vote.","body_html":"<div class = \"md\"> <p> Он прав, но консерваторы никогда не допустят ничего подобного, потому что они будут по-королевски облажаны. Все их избиратели не знают, как голосовать. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exktbdx/","name":"t1_exktbdx","created":1566427257,"created_utc":1566398457,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exl1hdx","author":"allsunny","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Wait so dead people, underage people and illegal people won’t be able to vote anymore?  Why would we want this system then???","body_html":"<div class = \"md\"> <p> Ждать, чтобы мертвые, несовершеннолетние и нелегалы ​​больше не могли голосовать? Зачем нам тогда эта система ??? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exl1hdx/","name":"t1_exl1hdx","created":1566432717,"created_utc":1566403917,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exkaj19","author":"AaronBonBarron","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"DNC isn't interested in fraud-proof voting.","body_html":"<div class = \"md\"> <p> DNC не заинтересован в мошенничестве. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exkaj19/","name":"t1_exkaj19","created":1566410393,"created_utc":1566381593,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":4,"link_id":"t3_ct5i93","id":"exivvi8","author":"Thefriendlyfaceplant","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I love Yang, I think he'd be a great president. But he's wrong here. We don't need more technology, we need less in this case. We need paper ballots. Not every problem has an engineering solution.","body_html":"<div class = \"md\"> <p> Я люблю Янга, думаю, он был бы великим президентом. Но он здесь не прав. Нам не нужно больше технологий, нам нужно меньше в этом случае. Нам нужны бумажные бюллетени. Не у каждой проблемы есть техническое решение. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exivvi8/","name":"t1_exivvi8","created":1566365437,"created_utc":1566336637,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exjqero","author":"BudandDoyle69","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Holy shit, Yang finally said something that makes sense.  Too bad the rest of his platform is end of times inducing shit.","body_html":"<div class = \"md\"> <p> Черт возьми, Ян наконец сказал что-то, что имеет смысл. Жаль, что остальная часть его платформы в конце времен вызывает дерьмо. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjqero/","name":"t1_exjqero","created":1566386109,"created_utc":1566357309,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exjznuw","author":"herbivorous-cyborg","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I've spent a lot of time studying this subject and what I learned is that blockchain based voting using voter-owned hardware is still not as good as a voting booth in at least 1 way. Let's say someone offers to pay me to vote for a particular candidate. When I enter the booth, there is not any way for the person to verify who I voted for. For this reason, it would be pointless to try to buy votes in this manner. When voters are using their own phones to vote, now you have a situation where someone can buy votes. If you have the option to vote without privacy, then someone who is buying votes will simply demand that you do so in order to receive the money. I know everyone wants blockchain to be a perfect solution, but the sad truth is that it isn't, and \"muh blockchain tho\" will never solve that particular problem.","body_html":"<div class = \"md\"> <p> Я потратил много времени на изучение этого предмета, и я узнал, что голосование на основе блокчейнов с использованием аппаратного обеспечения, принадлежащего избирателю, по-прежнему не так хорошо, как в кабине для голосования, по крайней мере, в одном направлении. , Допустим, кто-то предлагает заплатить мне, чтобы я проголосовал за конкретного кандидата. Когда я вхожу в кабину, у человека нет возможности проверить, за кого я проголосовал. По этой причине было бы бессмысленно пытаться покупать голоса таким образом. Когда избиратели используют свои телефоны для голосования, теперь у вас есть ситуация, когда кто-то может купить голоса. Если у вас есть возможность голосовать без приватности, то тот, кто покупает голоса, просто потребует, чтобы вы сделали это, чтобы получить деньги. Я знаю, что все хотят, чтобы блокчейн был идеальным решением, но печальная правда в том, что это не так, и «много блокчейн тхо» никогда не решит эту конкретную проблему. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjznuw/","name":"t1_exjznuw","created":1566395050,"created_utc":1566366250,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":3,"link_id":"t3_ct5i93","id":"exiyijs","author":"Astralarogance","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"He is the first candidate (with a strong following) to suggest it.  Badass!","body_html":"<div class = \"md\"> <p> Он - первый кандидат (с сильным последователем), чтобы предложить это. Пиздец! </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exiyijs/","name":"t1_exiyijs","created":1566366990,"created_utc":1566338190,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exjcczr","author":"Mister2JZ-GTE","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"He is actually terrible.  Do research on him.  He wants to regulate the shit out of crypto and not for the better.","body_html":"<div class = \"md\"> <p> Он на самом деле ужасен. Исследуйте его. Он хочет регулировать дерьмо из крипто, а не в лучшую сторону. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjcczr/","name":"t1_exjcczr","created":1566375671,"created_utc":1566346871,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":2,"link_id":"t3_ct5i93","id":"exjl89u","author":"GethD4d","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"This guy is incredible. Look him up, seriously, you won't regret it.","body_html":"<div class = \"md\"> <p> Этот парень невероятный. Ищите его серьезно, вы не пожалеете об этом. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjl89u/","name":"t1_exjl89u","created":1566382090,"created_utc":1566353290,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exix9ez","author":"jasselnorm","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Such technology should be used in voting but secured with a paper ballot backup system.","body_html":"<div class = \"md\"> <p> Такая технология должна использоваться при голосовании, но должна быть защищена системой резервного копирования бумажных бюллетеней. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exix9ez/","name":"t1_exix9ez","created":1566366256,"created_utc":1566337456,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj1uta","author":"SeahawkerLBC","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Or just mail-in voting.","body_html":"<div class = \"md\"> <p> Или просто голосование по почте. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj1uta/","name":"t1_exj1uta","created":1566368980,"created_utc":1566340180,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj3y60","author":"ADistantSignal","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I used to think this was a good solution, but at the rate state governments are being hacked and held for ransom, I am not convinced government officials are capable of adequately securing a blockchain voting system, let alone protecting their own email systems from crippling malware.  I think paper ballots are just fine and less prone to hacking, immune from malware, extremely simple and actually makes you get out and go interact with people when you're voting.","body_html":"<div class = \"md\"> <p> Раньше я считал, что это хорошее решение, но по мере того, как правительства штатов подвергаются взлому и удерживаются за выкуп, я не уверен, что правительственные чиновники способны адекватно обеспечить систему голосования в блокчейне. не говоря уже о защите своих почтовых систем от нанесения вреда вредоносным программам. Я думаю, что бумажные бюллетени просто хороши и менее подвержены взлому, невосприимчивы к вредоносным программам, чрезвычайно просты и фактически заставляют вас выходить и общаться с людьми, когда вы голосуете. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj3y60/","name":"t1_exj3y60","created":1566370245,"created_utc":1566341445,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj45qu","author":"JonnyIndica","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I don't have a mobile phone :(","body_html":"<div class = \"md\"> <p> У меня нет мобильного телефона: (</p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj45qu/","name":"t1_exj45qu","created":1566370376,"created_utc":1566341576,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj55q2","author":"bobafe6604","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"this.","body_html":"<div class = \"md\"> <p> this. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj55q2/","name":"t1_exj55q2","created":1566371014,"created_utc":1566342214,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj60jc","author":"djdsf","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Someone call Joe Rogan!","body_html":"<div class = \"md\"> <p> Кто-то звонит Джо Рогану! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj60jc/","name":"t1_exj60jc","created":1566371560,"created_utc":1566342760,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj817d","author":"newphonewhodizz","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Suggesting that a 100% fraud proof electronic voting system is possible is the same as suggesting that a 100% secure system is possible, which is asinine.\n\nAny security expect will laugh at you for suggesting a 100% secure system is possible. \n\nThis is such an idiotic statement that I dont actually think that Yang believes it himself. It's just political pandering to the less tech savvy people, which ironically this sub is full of.","body_html":"<div class = \"md\"> <p> Предполагать, что возможна система электронного голосования с 100% защитой от мошенничества, - то же самое, что предполагать, что возможна система с 100% безопасностью, что является абсолютным. </p>\n\n<p> Любые ожидания в области безопасности будут смеяться над вами, предполагая, что система на 100% безопасна. </Р>\n\n<p> Это такое идиотское утверждение, что я даже не думаю, что Ян сам в это верит. Это просто политическое потворство менее технически подкованным людям, которым по иронии судьбы эта субмарина полна. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj817d/","name":"t1_exj817d","created":1566372813,"created_utc":1566344013,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj895t","author":"jmart193","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Checkout voatz a startup that does just this. 9 mil in initial funding I think and some initial case studies.","body_html":"<div class = \"md\"> <p> Оформить заказ - это запуск, который делает именно это. 9 миллионов первоначального финансирования, я думаю, и некоторые первоначальные тематические исследования. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj895t/","name":"t1_exj895t","created":1566372954,"created_utc":1566344154,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj8kxc","author":"somanyroads","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"He need to head the Dept of Technology. I'm hopeful that Bernie will win office next year: he will listen to the people on this manner. It's not reasonable to make voting this difficult.","body_html":"<div class = \"md\"> <p> Ему нужно возглавить отдел технологий. Я надеюсь, что Берни получит должность в следующем году: он будет слушать людей таким образом. Это не разумно, чтобы сделать голосование таким трудным. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj8kxc/","name":"t1_exj8kxc","created":1566373155,"created_utc":1566344355,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exj9z6e","author":"mach1rcode","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"The end of the Democratic party... Ying yang in this thang!","body_html":"<div class = \"md\"> <p> Конец Демократической партии ... Инь Ян в этом банде! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exj9z6e/","name":"t1_exj9z6e","created":1566374034,"created_utc":1566345234,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjau45","author":"capitalistsanta","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"He might not be right, but this already shows me that he actually gives a shit about voting security and that he knows what Blockchain is","body_html":"<div class = \"md\"> <p> Возможно, он не прав, но это уже показывает мне, что он действительно насрал на безопасность голосования и что он знает, что такое Blockchain </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjau45/","name":"t1_exjau45","created":1566374580,"created_utc":1566345780,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjetpk","author":"whatwhatwhataa","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"it's not technically possible, even now.\n\nsome aspects are possible, not all","body_html":"<div class = \"md\"> <p> это технически невозможно, даже сейчас. </p>\n\n<p> некоторые аспекты возможны, не все </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjetpk/","name":"t1_exjetpk","created":1566377456,"created_utc":1566348656,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"body":"Here is a good podcast about a company that is doing blockchain voting. They address a lot of issues with there solution, but one of them is the coercion issue that people keep bringing up.\n\nhttps://blockteq.com/2018/11/02/how-votem-makes-elections-more-accessible-trustworthy-and-transparent-by-using-a-blockchain/\n\nBasically, the ballot get hashed on their blockchain and then still has to be physically submitted. \n\nCheck it out! It’s a good podcast!","ups":1,"link_id":"t3_ct5i93","id":"exjhov1","author":"so-pitted-wabam","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body_html":"<div class = \"md\"> <p> Вот хороший подкаст о компании, которая проводит голосование за блокчейн. Они решают многие проблемы, но одним из них является проблема принуждения, которую люди продолжают поднимать. </P>\n\n<p> <a href=\"https://blockteq.com/2018/11/02/how-votem-makes-elections-more-accessible-trustworthy-and-transparent-by-using-a-blockchain/\"> https://blockteq.com/2018/11/02/how-votem-makes-elections-more-accessible-trustworthy-and-transparent-by-using-a-blockchain/ </a> </р>\n\n<p> В основном, бюллетень хешируется на блокчейне, а затем все еще должен быть представлен физически. </Р>\n\n<p> Проверьте это! Это хороший подкаст! ​​</P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjhov1/","name":"t1_exjhov1","created":1566379509,"created_utc":1566350709,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjip4j","author":"AadamAtomic","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Seriously, the government already makes crypto exchanges use KYS verification for cryptocurrency, why don't they use it for voting too?","body_html":"<div class = \"md\"> <p> Серьезно, правительство уже заставляет криптообменники использовать проверку KYS для криптовалюты, почему они тоже не используют ее для голосования? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjip4j/","name":"t1_exjip4j","created":1566380239,"created_utc":1566351439,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjknl5","author":"Nrdrsr","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I am pretty sure this would require a constitutional amendment. \n\nSo 2/3rds majorities in both houses and then ratification by 3/4ths of all state legislatures.\n\nYeah I don't see it","body_html":"<div class = \"md\"> <p> Я почти уверен, что для этого потребуется конституционная поправка. </Р>\n\n<p> Итак, 2/3 большинства в обеих палатах, а затем ратификация 3/4 всех законодательных собраний штатов. </p>\n\n<p> Да, я этого не вижу </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjknl5/","name":"t1_exjknl5","created":1566381663,"created_utc":1566352863,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjnyzu","author":"[deleted]","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjnyzu/","name":"t1_exjnyzu","created":1566384169,"created_utc":1566355369,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjokgn","author":"CryptoRamble","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"There is a project that has actually done a kind of pilot test on this. I'll try to remember the name. It involved the military voting from overseas","body_html":"<div class = \"md\"> <p> Существует проект, который фактически провел своего рода пилотное тестирование по этому вопросу. Я постараюсь запомнить имя. Это связано с военным голосованием из-за рубежа </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjokgn/","name":"t1_exjokgn","created":1566384633,"created_utc":1566355833,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjpbd7","author":"[deleted]","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"https://xkcd.com/2030/","body_html":"<div class = \"md\"> <p> <a href=\"https://xkcd.com/2030/\"> https://xkcd.com/2030/ </a> </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjpbd7/","name":"t1_exjpbd7","created":1566385228,"created_utc":1566356428,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjpiuj","author":"Bocsta","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Clearpoll already have a working product","body_html":"<div class = \"md\"> <p> У Clearpoll уже есть рабочий продукт </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjpiuj/","name":"t1_exjpiuj","created":1566385394,"created_utc":1566356594,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjr3pq","author":"tommytoan","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"'fraud-proof' i know what he means and all, and i do agree, but it will never be a smooth easy transition.","body_html":"<div class = \"md\"> <p> «защищенный от мошенничества», я знаю, что он имеет в виду, и все, и я согласен, но это никогда не будет легким плавным переходом. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjr3pq/","name":"t1_exjr3pq","created":1566386676,"created_utc":1566357876,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjr9oq","author":"Bifrons","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Tom Scott had an amazing video on his YouTube channel (or maybe computerphile) about why it's a very bad idea to use computers to vote. Block chain or no, I think paper ballots are more secure in this scenario...","body_html":"<div class = \"md\"> <p> У Тома Скотта было потрясающее видео на его канале YouTube (или, может быть, компьютерный файл) о том, почему очень плохо использовать компьютеры для голосования. Блок-цепочка или нет, я думаю, бумажные бюллетени более безопасны в этом сценарии ... </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjr9oq/","name":"t1_exjr9oq","created":1566386815,"created_utc":1566358015,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjrevg","author":"andrewfenn","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"So people can vote like they do on reddit. Less than a brain fart of mental effort put into clicking an upvote button to make boatymcboatface the president? Sounds horrible.\n\nThey should just make it a mandatory national holiday and let the people who put effort to actually go to the polling stations to vote with exceptions for disabled, etc. of course.. not everything should be convenient especially not voting. I even disagree with electronic records, just makes it easier for a party to hack somehow. It's not so easy to hack paper ballots and they can be recounted. I understand blockchain but i still don't think it should be used in voting. What you're doing is making something simple complicated, and in making the implementation of voting complicated it's easier to hide things. Anyone can double check paper ballots. Only blockchain experts would be able to look for maliciousness in blockchain voting.","body_html":"<div class = \"md\"> <p> Поэтому люди могут голосовать так же, как и на Reddit. Меньше, чем просто умственные усилия, вложенные в нажатие кнопки upvote, чтобы сделать лодку лицом к президенту? Звучит ужасно. </P>\n\n<p> Они должны просто сделать его обязательным национальным праздником и позволить людям, которые прилагают усилия, на самом деле идти на избирательные участки, чтобы голосовать с исключениями для инвалидов и т. д., конечно ... не все должно быть удобно, особенно не голосовать. Я даже не согласен с электронными записями, просто для вечеринки легче каким-то образом взломать. Не так легко взломать бумажные бюллетени, и их можно пересчитать. Я понимаю блокчейн, но все еще не думаю, что его следует использовать при голосовании. То, что вы делаете, это делает что-то простое сложным, а в усложнении процесса голосования легче скрыть вещи. Любой может проверить бумажные бюллетени дважды. Только эксперты по блокчейну смогут искать вредоносность при голосовании по блокчейну. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjrevg/","name":"t1_exjrevg","created":1566386939,"created_utc":1566358139,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjsj7d","author":"urbanhood","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Yes , i vote .","body_html":"<div class = \"md\"> <p> Да, я голосую. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjsj7d/","name":"t1_exjsj7d","created":1566387903,"created_utc":1566359103,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjubuo","author":"_jt","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"BULLSHIT - saying something that ignorant is disqualifying. WHAT blockchain project is even close to secure enough for national elections??","body_html":"<div class = \"md\"> <p> BULLSHIT - говорить что-то, что невежественный дисквалифицирует. КАКИЕ блокчейн-проекты даже достаточно близки к безопасным для общенациональных выборов? </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjubuo/","name":"t1_exjubuo","created":1566389533,"created_utc":1566360733,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjv5tx","author":"BakuRetsuX","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"How about you standardize the ballot sheet and make it the same for the Presidential vote for all states.  People get sent the sheet or download them and fill them out.  Then they take it to get notarized at a bank or post office or a poll notarization location and submitted.  After the document is notarized, a picture of it is taken and sent to be digitally processed.  A copy is made for the voter, and then the original document is sent to a voting official place. We allow a week for all votes to come in and tallied up.","body_html":"<div class = \"md\"> <p> Как насчет того, чтобы стандартизировать избирательный бюллетень и сделать его одинаковым для президентского голосования для всех штатов. Люди получают листы или скачивают их и заполняют. Затем они берут его для нотариального заверения в банке или почтовом отделении или в месте нотариального заверения и отправляют. После того как документ заверен нотариально, его фотографируют и отправляют для цифровой обработки. Для избирателя делается копия, а затем оригинал документа отправляется на официальное место голосования. Мы даем неделю, чтобы все голоса пришли и подсчитали. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjv5tx/","name":"t1_exjv5tx","created":1566390323,"created_utc":1566361523,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjv73v","author":"willing2die4myGANG","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Lmao wether its hacked or not voting does nothing.","body_html":"<div class = \"md\"> <p> Lmao, взломанный или не голосующий, ничего не делает. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjv73v/","name":"t1_exjv73v","created":1566390358,"created_utc":1566361558,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjvuzj","author":"mentevagante","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"YES! That's what I've claiming for, now imagine all government transactions being public!!!","body_html":"<div class = \"md\"> <p> ДА! Вот на что я претендую, теперь представьте, что все правительственные сделки являются публичными !!! </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjvuzj/","name":"t1_exjvuzj","created":1566390998,"created_utc":1566362198,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjwbin","author":"solotronics","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"yes but then you would have to be registered somewhere with credentials to vote, one of the two parties in America is totally opposed to any kind of voter identification or verification","body_html":"<div class = \"md\"> <p> да, но тогда вам нужно было бы зарегистрироваться где-нибудь с учетными данными, чтобы проголосовать, одна из двух партий в Америке категорически против любого рода идентификации или проверки избирателей </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjwbin/","name":"t1_exjwbin","created":1566391446,"created_utc":1566362646,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjwo14","author":"sensuallyprimitive","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I've been downvoted and upvoted heavily on this idea on r/politics and such, depending on the way the wind blows.","body_html":"<div class = \"md\"> <p> За эту идею меня понизили и проголосовали за <a href=\"/r/politics\"> r / policy </a> и т. д., в зависимости от того, как ветер дует. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjwo14/","name":"t1_exjwo14","created":1566391791,"created_utc":1566362991,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjxhpg","author":"ThatIsFuckingStupid","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"*fraud proof*\n\nAnd how exactly do you prevent ineligible people from voting?","body_html":"<div class = \"md\"> <p> <em> защита от мошенничества </em> </p>\n\n<p> А как именно вы препятствуете голосованию неподходящих людей? </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjxhpg/","name":"t1_exjxhpg","created":1566392632,"created_utc":1566363832,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjxumy","author":"fnzystore","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Win = fair / lose = fraud 😊","body_html":"<div class = \"md\"> <p> Win = честный / проигрыш = мошенничество 😊 </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjxumy/","name":"t1_exjxumy","created":1566393011,"created_utc":1566364211,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjy4mv","author":"shadowmainia98","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Then we no longer need a representative in Congress to do our voting either. The people can finally be represented.","body_html":"<div class = \"md\"> <p> Тогда нам больше не нужен представитель в Конгрессе для голосования. Люди, наконец, могут быть представлены. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjy4mv/","name":"t1_exjy4mv","created":1566393307,"created_utc":1566364507,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjyczz","author":"zhantoo","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"I just want to put in, that in some civilized countries, we don't wait more than a few minutes..","body_html":"<div class = \"md\"> <p> Я просто хочу сказать, что в некоторых цивилизованных странах мы не ждем более нескольких минут. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjyczz/","name":"t1_exjyczz","created":1566393559,"created_utc":1566364759,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjz053","author":"BN_Boi","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Booths ? Here in Switzerland we get the voting stuff by mail, fill it then send it back","body_html":"<div class = \"md\"> <p> Стенды? Здесь, в Швейцарии, мы получаем материалы для голосования по почте, заполняем их и отправляем обратно </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjz053/","name":"t1_exjz053","created":1566394280,"created_utc":1566365480,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exjzhkp","author":"miketout","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Verus has been working on this for some time. Here's the vision paper for those interested, and the project has been making great strides since its fair 50% PoW/50% PoS launch. [https://veruscoin.io/downloads/papers/VerusVision.pdf](https://veruscoin.io/downloads/papers/VerusVision.pdf)\n\nThe core of the idea is public blockchains as a service and confidential, verifiable, and transparent polls and elections commissioned on the public chains and ultimately secured by the specific voters involved.","body_html":"<div class = \"md\"> <p> Верус работал над этим в течение некоторого времени. Вот документ о перспективах для интересующихся, и проект добился больших успехов с момента его справедливого запуска 50% PoW / 50% PoS. <a href=\"https://veruscoin.io/downloads/papers/VerusVision.pdf\"> https://veruscoin.io/downloads/papers/VerusVision.pdf </a> </p>\n\n<p> В основе идеи лежат публичные цепочки блоков как услуга, а также конфиденциальные, проверяемые и прозрачные опросы и выборы, проводимые в общественных сетях и в конечном итоге защищаемые конкретными вовлеченными избирателями. </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exjzhkp/","name":"t1_exjzhkp","created":1566394843,"created_utc":1566366043,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exk0q3k","author":"Spats_McGee","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"This is a dumb idea. Voting requires registration, which requires a centralized database. Also, in the case of fraud or whatever you have to be able to invalidate votes, which means you need some kind of centralized authority that can reverse all \"transactions\" on this \"blockchain.\"\n\nSoooo it's basically just an SQL database. There's no reason for it to be decentralized, in fact it probably *can't* be decentralized for a variety of legal reasons, but even if it could what's the incentive for decentralized notes to maintain state? What prevents double voting?","body_html":"<div class = \"md\"> <p> Это глупая идея. Для голосования требуется регистрация, для чего требуется централизованная база данных. Кроме того, в случае мошенничества или чего-либо еще, что вы должны иметь возможность сделать недействительными голоса, это означает, что вам нужен какой-то централизованный орган, который может отменить все «транзакции» в этой «цепочке блоков». </P>\n\n<p> Так что это просто база данных SQL. Нет причин для его децентрализации, на самом деле, вероятно, <em> не может </em> быть децентрализованным по ряду юридических причин, но даже если это может быть стимулом для децентрализованных банкнот сохранять государство? Что мешает двойному голосованию? </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk0q3k/","name":"t1_exk0q3k","created":1566396297,"created_utc":1566367497,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exk0tn1","author":"FuckertyMcFuckface","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"....if Google as anything to do with it? Fuck that!","body_html":"<div class = \"md\"> <p> .... если гугл как нибудь с этим связан? Трахни это! </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk0tn1/","name":"t1_exk0tn1","created":1566396416,"created_utc":1566367616,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exk12wf","author":"Larky999","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Other developed countries don't wait for hours lol","body_html":"<div class = \"md\"> <p> Другие развитые страны часами не ждут </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk12wf/","name":"t1_exk12wf","created":1566396736,"created_utc":1566367936,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exk2gln","author":"btc-forextrader","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Yes. It. Is.","body_html":"<div class = \"md\"> <p> Да. Это. Является ли. </P>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk2gln/","name":"t1_exk2gln","created":1566398513,"created_utc":1566369713,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0},{"ups":1,"link_id":"t3_ct5i93","id":"exk39m0","author":"framed1234","parent_id":"t3_ct5i93","subreddit_id":"t5_2wlj3","body":"Election problem isn't about the tech itself mostly. It's about social engineering. Russia didn't directly hack the machines, they used sns to influence voter's minds","body_html":"<div class = \"md\"> <p> В основном проблема с выборами связана не с самой технологией. Это о социальной инженерии. Россия напрямую не взломала машины, они использовали sns, чтобы влиять на сознание избирателей </p>\n</DIV>","permalink":"/r/CryptoCurrency/comments/ct5i93/andrew_yang_wants_to_employ_blockchain_in_voting/exk39m0/","name":"t1_exk39m0","created":1566399601,"created_utc":1566370801,"subreddit_name_prefixed":"r/CryptoCurrency","depth":0}]}