{"subreddit":{"display_name":"CryptoCurrency"},"subreddit_loc":"криптовалюта","selftext":"Редактировать: ** Мне угрожали судебным иском. **\n\nОтредактируйте: ** ТАК, ЧТО ОНИ РЕАГИРОВАЛИ ПОСЛЕ ТОГО, КАК Я СДЕЛАЛ ЭТОТ ПОЧТУ, И ПОЛУЧИЛ МНЕ МОЙ ДЕНЬГ.\n\nКороче говоря: их дебетовые карты не работают, но они принимают заказы. Ожидание моего почти 6 месяцев, вы также ничего не можете сделать с кредитом в долларах на вашем счете. Прочитайте детали ниже:\n\n* 19 июня: * присоединился к платформе Paycent и заказал дебетовую карту Mastercard.\n\n* 20 июня: * Я проверен. ** \"Проверка успешна! Теперь вы можете пользоваться функциями и возможностями Paycent. Если у вас есть какие-либо вопросы, напишите нам по адресу hello@paycent.com. Благодарим вас за доверие к Paycent, где каждая отправленная информация имеет значение! С уважением, ваша команда Paycent «**\n\n* 19 июля: * Мастеркард получен, но он не работает - невозможно назначить ПИН через мобильное приложение. Mastercard не активирован, независимо от того, что они сказали, что собираются его активировать. В тот же день они снова запросили мой паспорт, несмотря на то, что я уже проверен. ** \"Мы собираемся активировать вашу карту пасьянса Paycent, чтобы мы могли это сделать, пожалуйста, отметьте в соответствии с нашими записями ваш: · Паспорт должен быть целым документом. Пожалуйста, отправьте нам документ как можно скорее, приложив в ответе по электронной почте, чтобы мы могли активировать вашу карту в нашем банке. Заранее благодарим вас за оперативные действия. С уважением, ваша команда Paycent \"**\n\n* 3 августа: * Они снова запросили мое подтверждение адреса, независимо от того, был ли я уже подтвержден, я предоставил его.\n\n* 25 августа: * Они предложили, и я согласился заменить Mastercard на дебетовую карту UPayInternational (UPI). По сей день (8 ноября) я его не получил. ** \"Заказ вашей карты теперь обновлен и изменен на UPI. Пожалуйста, подождите, пока банк завершит процесс проверки и активирует карту. Надеюсь, я все четко объяснил. Пожалуйста, дайте нам знать, если вам нужна дополнительная информация. Вид С уважением, Лиам Б. Команда по работе с клиентами \"**\n\n* 10 сентября: * Они сказали, что активируют виртуальную карту UPI - не активирован по сей день. ** «Спасибо, что сообщили нам о своем недавнем опыте работы с Paycent. Я прошу прощения, если наш сервис не оправдал ваших ожиданий, и я благодарен вам за то, что вы уделили время и поделились своими соображениями. Что касается доставки UPI, мы фактически полагаемся на нашего партнера банк, поскольку они являются теми, кто распространяет карту, которую мы отправляем. Обратите внимание, что мы доставляем карты партиями. Так как я проверил, что ваш документ в порядке, я буду следить за ними, чтобы ускорить активацию вашего виртуального карты, так что вы можете, по крайней мере, использовать карту для онлайн-транзакций. Благодарим вас за терпение в этом вопросе. По дополнительным вопросам, пожалуйста, не стесняйтесь отвечать на это письмо. С уважением, Jen S. Customer Experience Team \"**\n\nЯ совершил огромную ошибку, обменяв 10 ETH на их платформе, которые сейчас практически недоступны. Не могу их потратить, не могу конвертировать обратно в крипто.\n\n* 25 октября: * Они предложили China UPay карту. Я отклонил его и сказал, что хочу вернуть свои деньги (плата за выдачу карты + 10 долларов США, которые у меня есть на моем счете. Они запросили мой адрес BTC, я дал его в тот же день. Я все еще ничего не получил.\n\n* 1 ноября: * Они сказали, что вернут мой BTC через 5 рабочих дней. Прошли эти дни - ничего не произошло, они все еще должны мне мои деньги: ** \"Я выразил вашу обеспокоенность нашей финансовой команде за немедленную обработку и получил уведомление о том, что полный возврат средств будет обработан в течение 5 рабочих дней. Пожалуйста, обратите внимание, что суббота и воскресенье нерабочие дни, чтобы оправдать ваши ожидания. Будьте уверены, что мы предпринимаем немедленные действия по вашей проблеме. Спасибо за понимание. С уважением, Янсен М. Команда по работе с клиентами \"**\n\nСделайте свои собственные выводы. С моей точки зрения, это как минимум выборочная мошенническая тактика продления и лжи. И теперь у меня осталось только время и воля, чтобы все знали. Вы найдете этот пост везде. Спасибо!","title":"ВНИМАНИЕ: Не используйте Paycent.com, они обманули меня за 1141,6 долларов США + комиссия за выпуск дебетовой карты.","subreddit_name_prefixed":"r/CryptoCurrency","ups":661,"created":1573239118,"link_flair_background_color":"","id":"dtds75","author":{"name":"trancephorm"},"permalink":"/r/CryptoCurrency/comments/dtds75/warning_do_not_use_paycentcom_they_scammed_me_for/","url":"https://www.reddit.com/r/CryptoCurrency/comments/dtds75/warning_do_not_use_paycentcom_they_scammed_me_for/","created_utc":1573210318}