{"subreddit":{"display_name":"AgingBiology"},"subreddit_loc":"AgingBiology","selftext":"Привет форум,\n\nЯ хотел бы представить вам новую и действительно необычную гипотезу о происхождении старения и связанных со старением медицинских явлений, включая болезнь Альцгеймера.\n\nЧтобы получить первое впечатление о гипотезе, достаточно прочитать часть 1 = 800 слов.\n\nЧАСТЬ 1: ГИПОТЕЗА\n\nГипотеза основана на следующих 4 предпосылках:\n\n1 След памяти, когда-то сформированный в нейронных сетях мозга, никогда не бывает полностью неактивным. Скорее, он постоянно активен в незначительной степени (скажем, около микро-процентов) по сравнению с его активностью во время восстановления памяти. Механизмы, вызывающие это явление:\n\n\n- Существующие следы памяти постоянно слегка активируются как входящей, так и внутренней нейрональной активностью, которая происходит в системах памяти (см., Например, Pubmed-Ids: 18319728 и 10980021).\n\n- В частности, отвращающие воспоминания имеют тенденцию терять небольшие пропорции своего сдерживающего контроля со временем, что приводит к их незначительной, постоянной сверхактивности (более подробно ниже).\n\nЯ называю эту крошечную базовую активность следа памяти, генерируемой вышеупомянутыми механизмами, «СУПЕРЭКСПРЕССИЕЙ» памяти.\n\n\n2 Сверхэкспрессия _aversive_ памяти, например, болевой памяти, имеет чрезвычайно слабое, анти-гомеостатическое воздействие на организм и мозг.\n\nЭто следует из результатов исследований медицины мозга-тела, которая исследует влияние эмоций на физическое здоровье.\n\nОсновной аргумент, лежащий в основе этого утверждения, заключается в том, что если отрицательная эмоция обладает доказанным антигомеостатическим эффектом, то сверхэкспрессированная память об этой эмоции будет иметь тот же эффект, только намного слабее (см., Например, Pubmed-Id: 19524045; подробнее следует также ниже) ,\n\n\n3 Теперь совершенно сумасшедшая часть: нормальные механизмы восприятия памяти, которые существуют у всех животных с нервной системой, приводят к бессознательному восприятию СУПЕР-ВЫРАЖЕННЫХ ЭМОЦИОНАЛЬНЫХ КОМПОНЕНТОВ отвращающих воспоминаний ...\n\n... И к НЕПРЕРЫВНОЙ И БЕСПЛАТНОЙ РЕМОМОРИЗАЦИИ этих сверхэкспрессированных эмоциональных компонентов как части эмоциональности нормальных, текущих автобиографических событий ... с последующим их ПЕРЕОБЫВАНИЕМ, ... и последующим повторным запоминанием ... и так далее ... мгновение за мгновением, всю жизнь.\n\nХорошо, это звучит очень странно. Поэтому снова шаг за шагом:\n\nШаг 1: Все воспоминания об отвращающих событиях вашей жизни постоянно немного активны (то есть «сверхэкспрессированы»), тем самым слегка сдвигая ваше настроение в сторону негатива.\n\nШаг 2: Это (сознательно незаметное) слегка негативное состояние настроения запоминается как отвращающая эмоциональная память вместе с текущим автобиографическим событием. Поскольку эта вновь сформированная память также сверхэкспрессируется, этот шаг увеличивает количество аверсивных воспоминаний, которые сверхэкспрессируются.\n\nШаг 3: Теперь увеличенное количество сверхэкспрессируемых неприятных воспоминаний, в свою очередь, в меньшей степени увеличивает негативность вашего состояния настроения, которое снова запоминается, как на шаге 2 ... и так далее, момент за моментом, вся жизнь длинная.\n\nТаким образом, количество отвратительных воспоминаний, которые сверхэкспрессируются, а также их комбинированный антигомеостатический эффект (помните пункт 2 выше), постоянно увеличивается неудержимым образом. Это, очевидно, порочный круг (далее называемый просто «ВК»). Злобный, потому что он вызывает постоянно увеличивающийся антигомеостатический эффект в организме, который может реагировать с потенциально опасными проблемами со здоровьем (см. Ниже).\n\nПоскольку новое автобиографическое событие генерируется и запоминается примерно каждую секунду (фактически, когда новая визуальная сцена возникает после движения глаза), сверхэкспрессированные воспоминания запоминаются также примерно каждую секунду. Таким образом, ВК создает в течение человеческой жизни около МИЛЛИАРДА очень, очень, очень немного неприятных воспоминаний - и каждый из них оказывает очень, очень, очень слабое антигомеостатическое воздействие на организм.\n\n(Да, вы правильно прочитали, один МИЛЛИАРД, 10 ^ 9, 1000 МИЛЛИОНОВ воспоминаний ... без шуток.)\n\nПримечание: это звучит немного нелепо, но ВК в основном работает как механизм «сложный процент с вкладами» в финансовом секторе. Это начинается, как только формируется первая неприятная память. Отвращающие воспоминания, которые впоследствии формируются негативным жизненным опытом, являются «вкладом». И, как сложный интерес, ВК имеет огромный эффект в течение более длительного периода времени.\n\nЕще одно примечание: поскольку будущая актуальность отвращающих воспоминаний не может быть предсказана, они остаются запомненными на всю жизнь и никогда не разрушаются полностью (доказано в экспериментах на животных; у людей травматические воспоминания являются примером долгой жизни отвращающих воспоминаний). Поэтому ВК действительно создает постулируемое большое количество неприятных воспоминаний. Но многие из них теряют много своей контекстуальной информации в течение жизни. Для справочной информации, Google «тихая инграмма».\n\n\n4 Теперь последнее и решающее утверждение гипотезы:\n\nКОМБИНИРОВАННЫЕ АНТИГОМЕОСТАТИЧЕСКИЕ ЭФФЕКТЫ ОЧЕНЬ, ОЧЕНЬ, ОЧЕНЬ МАЛЕНЬКОГО СУПЕР-ЭКСПРЕССИИ ВСЕХ ПАМЯТ, ФОРМИРОВАННЫХ ВК, СОЗДАЮТ В ДЛИННОМ РАБОТЕ, В основном, подавляя КЛЕТОЧНЫЙ РЕМОНТ И МЕТОД ОБОРОТОВ, ИСПОЛЬЗОВАНИЕ ФАКТА.\n\n(Чтобы держать вас в курсе, я хотел бы показать, что исследование экспрессии генов действительно предполагает, что самая важная область памяти человека, гиппокамп, на самом деле вызывает каскад физического старения в некоторых тканях. Кроме того, есть исследование, показывающее, что кожа мышей автоматически омолаживается, как только блокируется определенная провоспалительная молекула, активность которой определяется ВК. Подробнее ниже ...)\n\n\nЧАСТЬ 2: ТОЧНЫЕ МЕХАНИЗМЫ И ВАЖНЫЕ СВОЙСТВА ВК\n\nКраткое примечание: ради краткости вместо использования сложной фразы:\n\n«Сверхэкспрессия неприятных воспоминаний, созданных ВК, вызывает эффект Х ...»,\n\nЯ буду использовать следующую фразу:\n\n«ВК-воспоминания индуцируют эффект Х ...»,\n\nили, что еще проще, «ВК вызывает эффект Х ...».\n\nКАК VC ЗАПРЕЩАЕТ РЕМОНТНЫЕ МЕХАНИЗМЫ?\n\nПрежде чем перейти к точным механизмам, с помощью которых ВК ингибирует механизмы репарации и тем самым в конечном итоге создает фенотип старения, позвольте мне сначала объяснить, как ВК обычно активирует физиологические механизмы.\n\nСогласно моей гипотезе, как кратко объяснено в пункте 2, VC-воспоминания генерируют свой антигомеостатический эффект, вызывая серию механизмов мозг-тело.\n\nКак также кратко объяснено в пункте 2, основной аргумент в пользу этого утверждения заключается в том, что если отрицательная эмоция оказывает доказанный отрицательный физиологический эффект, то сверхэкспрессированная память об этой эмоции имеет тот же физиологический эффект, только слабее.\n\nСледующие цитаты из фундаментальной обзорной статьи о медицине мозга и тела поддерживают этот аргумент:\n\nПрежде всего, следующая цитата кратко суммирует ситуацию с данными, которая мотивирует независимое лекарство для мозга и тела:\n\n«... то, что показывает это сопоставление [научных работ], заключается в том, что в этих [нейровизуализаторах мозга] снова и снова появляются удивительные общие области мозга и механизмы мозга. Эта общность, которая превзошла наши ожидания, говорит о том, что существует связная область нейробиологии, которая связывает эмоции, регуляцию эмоций и стресс, с одной стороны, с системными медицинскими расстройствами и периферическими физиологическими процессами, с другой ». (Lane and Wager, 2009, p. 1135)\n\nСледующая цитата демонстрирует вредные физиологические эффекты отрицательных эмоций:\n\n«Область медицины мозга и тела ... однозначно продемонстрировала, что негативные эмоциональные состояния, такие как депрессия и стресс, оказывают вредное воздействие на физическое здоровье» (Lane and Wager, 2009, p. 1135)\n\nСледующая решающая цитата демонстрирует отрицательный физиологический эффект постоянно активных механизмов мозга и тела, вызванных отрицательными эмоциями или постоянными отрицательными эмоциональными состояниями.\n\n«Поскольку эти механизмы [мозг-тело], связанные с [негативными] эмоциями, находятся в постоянном действии, их интегрированное влияние в течение месяцев или лет, вероятно, окажет клинически важное влияние на процессы и результаты заболевания. В самом деле, именно об этом свидетельствуют эпидемиологические данные ... »(Lane and Wager, 2009, p. 1135)\n\nВажным выводом сейчас является:\n\nПОСЛЕ ТОГО, ЧТО ПАМЯТИ, СОЗДАННЫЕ ВК, ПОСТОЯННО, 24/7, ПЕРЕДВИЖЕНЫ И НЕПРЕРЫВНО ВЗГЛЯДЯТ СООТВЕТСТВУЮЩИЕ УДАЛЕННЫЕ МЕХАНИЗМЫ МОЗГА, ОНИ ВЫЯВЛЯЮТ ЗНАЧИТЕЛЬНЫЙ ФИЗИОЛОГОВ С ИСПОЛЬЗОВАНИЕМ, НЕЗАВИСИМО С ФИЛЬТОМ ИЛИ БЕЗ РЕГИОНА ЭМОЦИОНАЛЬНЫЕ МЕХАНИЗМЫ МОЗГА, КОТОРЫЕ НАХОДЯТСЯ В НЕПРЕРЫВНОЙ ЭКСПЛУАТАЦИИ.\n\nЭто, в свою очередь, приводит непосредственно к выводу, что ВК может вызывать все заболевания, которые, согласно медицине мозга и тела, могут быть вызваны негативными эмоциями: сердечно-сосудистые заболевания, высокое кровяное давление, хроническая боль и т. Д.\n\n(Пожалуйста, обратите внимание, что обоснованность этого заключения зависит только от количественных факторов, поскольку явление сверхэкспрессии воспоминаний, а также возникающее влияние на механизмы мозга и тела, безусловно, существуют в некоторой степени. Единственный вопрос заключается в том, является ли феномен Сверхэкспрессия памяти достаточно сильна, чтобы оказывать значительное активирующее влияние на механизмы мозга и тела.)\n\nЭто были объяснения того, как ВК обычно запускает механизмы мозга и тела. Чтобы доказать, что ВК продуцирует фенотип старения, остается показать, что среди механизмов «мозг-тело», активируемых отвращающими воспоминаниями, есть и такие, которые ингибируют механизмы восстановления. В этом случае ВК будет генерировать характеристики фенотипа старения, такие как накопление повреждений клеток и тканей и продуктов молекулярных отходов, путем ингибирования механизмов восстановления.\n\nДоступная литература по механизмам мозга и тела показывает, что ВК достигает постулируемого ингибирующего действия на механизмы репарации, главным образом потому, что сверхэкспрессированные аверсивные воспоминания активируют механизмы мозга и тела, которые нарушают регуляцию нейроиммуноэндокринной системы (то есть ANS, иммунной и эндокринной систем).\n\nОсновным результатом этой дерегуляции (примеры следуют ниже) является тенденциозный сдвиг клеточного механизма от анаболического к катаболическому. Этот сдвиг ингибирует механизмы репарации, включая активность стволовых клеток, необходимую для регенерации тканей.\n\nТаким образом, основной вывод моей гипотезы заключается в том, что ингибирующее действие ВК на механизмы репарации, действующие в течение десятилетий, в конечном итоге приводит к накоплению продуктов молекулярных отходов и повреждению клеток и тканей, тем самым предотвращая возникновение фенотипа старения. Это означает, что ВК не является прямой, а причинно ответственной за процесс старения.\n\nВ качестве примера я хотел бы описать здесь один механизм «мозг-тело», который запускается отвращающими воспоминаниями и фактически дает ВК тормозящий эффект на механизмы восстановления.\n\nСогласно медицине мозга-тела, неприятные переживания вызывают выброс гормонов стресса:\n\n-> Из этого следует, что сверхэкспрессированные воспоминания об отвращении испытывают таким же образом к высвобождению гормонов стресса.\n\n-> Это также относится к неприятным воспоминаниям, генерируемым ВК.\n\n-> Поскольку VC-память постоянно сверхэкспрессируется, это означает, что VC запускает непрерывный выброс гормонов стресса. (И действительно, уровень гормонов стресса в крови неуклонно возрастает с возрастом.)\n\n-> Поскольку гормоны стресса оказывают катаболическое действие (см., Например, PMID 6365973 или Википедию о «катаболизме»), из этого следует, что ВК обладает постоянным катаболическим эффектом и, следовательно, постоянно ингибирует механизмы восстановления клеток. Что и требовалось доказать\n\nПоскольку результаты медицины мозга-тела очень обширны и включают в себя различные механизмы мозга-тела, можно легко получить дополнительные механизмы, которые оказывают ингибирующее воздействие на ВК на механизмы репарации. Ниже приведен пример того, как ВК подавляет механизмы восстановления посредством автономной нервной системы.\n\nЧтобы лучше понять основную важность, область применения и детали медицины мозга, я настоятельно рекомендую прочитать рефераты и введения в следующие обзорные статьи:\n\nНовая область медицины головного мозга: чему мы научились и куда направляемся?\nЛейн и Вейджер, 2009; PMID 19524045; https://canlabweb.colorado.edu/files/Lane_2009_Neuroimage.pdf\n\nПути мозга и тела, связывающие психологический стресс и физическое здоровье.\nGianaros PJ, et al., 2015; PMID 26279608; https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4535428/\n\nВозрождение нейробиологии в психосоматической медицине, Часть I: исторический контекст, методы и соответствующие фундаментальные науки., Лейн Р.Д. и др., 2009; PMID 19196808; https://www.researchgate.net/profile/Douglas_Drossman/publication/23983171_The_Rebirth_of_Neuroscience_in_Psychosomatic_Medicine_Part_I_Historical_Context_Methods_and_Relevant_Basic_Science/links/59f5dcc3458515547c230606/The-Rebirth-of-Neuroscience-in-Psychosomatic-Medicine-Part-I-Historical-Context-Methods-and-Relevant- Basic-Science.pdf? происхождение = publication_detail\n\nВозрождение нейробиологии в психосоматической медицине, часть II: клиническое применение и значение для исследований., Lane RD, et al., 2009; PMID 19196806; https://www.researchgate.net/profile/Margaret_Chesney/publication/23983169_The_Rebirth_of_Neuroscience_in_Psychosomatic_Medicine_Part_II_Clinical_Applications_and_Implications_for_Research/links/5a4d0b53a6fdcc3e99d14ccc/The-Rebirth-of-Neuroscience-in-Psychosomatic-Medicine-Part-II-Clinical-Applications-and-Implications-for- Research.pdf? происхождение = publication_detail\n\nКаковы «уникальные точки продажи» гипотезы VC?\n\nНи одна из приблизительно 300 теорий старения не может объяснить все аспекты процесса старения. Основной проблемой многих из этих теорий является отсутствие четкой причинно-следственной связи между процессом старения и его предполагаемым происхождением. Например, в теории старения свободных радикалов отнюдь не ясно, приводит ли образование свободных радикалов к процессу старения или является его следствием. То же самое относится ко всем теориям повреждений старения (теория повреждений ДНК, теория возрастов, теория повреждений белков и т. Д.).\n\nВ гипотезе ВК, однако, причинно-следственная связь однозначна. Цепочка причинности, ведущая к процессу старения, начинается с формирования неприятных воспоминаний и заканчивается на молекулярных конечных точках механизмов мозг-тело, запускаемых неприятными воспоминаниями.\n\nПричина, по которой этот механизм до сих пор игнорировался, заключается в том, что среди множества молекулярных изменений (АФК, ВОЗРАСТ, повреждение ДНК и т. Д.), Вызванных ВК в организме, нет однозначных свидетельств того, что система памяти ясно указывает на происхождение всех этих изменений. Цепи причинности, приводящие к этим изменениям, просто слишком длинны, слишком разнообразны и слишком пространственно разделены, чтобы распознавать их только по молекулярным изменениям в конечных точках цепей причинности.\n\nДругой важной уникальной особенностью гипотезы ВК является ее способность объяснять, как единственную среди теорий старения, некоторые экспериментальные вмешательства, ведущие к автоматическому омоложению тканей. Этот момент более подробно обсуждается ниже.\n\nПОСЛЕДСТВИЯ УСИЛЕННОГО ПОБЕДНОГО ЦИКЛА\n\nЧасть 1 этого текста описала ВК, как он работает с нормальной скоростью у всех животных с нервной системой.\n\nПри этой «нормальной» скорости VC, по моей гипотезе, уже оказывает сильное вредное воздействие и вызывает или стимулирует у людей, главным образом благодаря его провоспалительному действию, все основные связанные со старением заболевания: рак, диабет 2 типа, сердечно-сосудистые заболевания, и т.п.\n\nЭто уже плохие новости. Но, к сожалению, поскольку VC имеет несколько внутренних контуров положительной обратной связи, различные воздействия способны сдвинуть VC в усиленное состояние, где он обладает еще более сильным вызывающим заболевание эффектом.\n\nВ этом усиленном состоянии он создает значительно более сильные отвращающие воспоминания, количество которых варьируется от десятков до сотен миллионов, в зависимости от того, когда в жизни происходило усиливающее событие.\n\nПоследствия усиленного ВК катастрофичны по нескольким причинам:\n\n- Все связанные со старением заболевания могут возникать на десятилетия раньше.\n\n- Существующие проблемы со здоровьем любого рода, возникающие в любом возрасте, усиливаются значительным антигомеостатическим эффектом усиленного ВК.\n\n- Может возникнуть целый ряд новых проблем со здоровьем, характерных для усиленного ВК (см. Вторую часть страницы «Введение» на моем веб-сайте).\n\n\nИНИЦИАТИВНЫЕ СОБЫТИЯ\n\nОсновные исходные события, которые приводят к усиленному VC:\n\n- Формирование травматических воспоминаний. Его сверхэкспрессия и повторное запоминание значительно увеличивают силу воспоминаний, создаваемых ВК, и, следовательно, их антигомеостатический эффект.\n\n- индукция хронического, субклинического воспаления мозга из-за различных факторов, таких как сильные инфекции, сотрясение мозга, токсические явления и т. Д. Это усиливает ВК двумя, весьма удивительными, способами:\n\nА) Цитокины, высвобождаемые во время воспаления головного мозга, вызывают субклиническое «болезненное поведение» (см. Google), что влечет за собой слегка неприятное состояние настроения. Это усиливает ВК, так как отныне воспоминания, генерируемые ВК, стали немного более отвратительными.\n\nБ) Воспаление головного мозга косвенно подавляет неприятные воспоминания, повышая уровень гибели клеток среди особого типа очень чувствительных к стрессу нейронов, которые контролируют неприятные воспоминания (так называемые «PV + interneurons», см. Больше на моем веб-сайте или в Google «Interneuron Energy» Гипотеза »и PMID 24256726). Это приводит к повышенной гиперэкспрессии затронутых неприятных воспоминаний, что, в свою очередь, усиливает ВК.\n\nПроцесс B, по моей гипотезе, также в определенной степени вызван нормальным старением мозга и, следовательно, представляет собой второй общий механизм - помимо постоянной активности нейронов в системах памяти, упомянутой в предпосылке 1 - который приводит к сверхэкспрессии памяти.\n\nВлияния, которые используют этот второй механизм сверхэкспрессии памяти, по моему мнению, являются наиболее важными и наиболее опасными точками входа в усиленный ВК.\n\nКроме того, неприятные воспоминания, особенно травматические, скорее всего, вызывают воспаление мозга (поскольку их сверхэкспрессия вызывает легкий стресс, который, в свою очередь, способствует воспалению мозга, см. PMID 23537508). Это дополнительно усилило бы ВК, вызывая две дополнительные петли положительной обратной связи в ВК через два механизма А и В, описанные в предыдущих параграфах.\n\n\nВИДЯЩИЙ ЦИКЛ ДОЛЖЕН БЫТЬ ОТЛИЧЕН ОТ МЕХАНИЗМОВ КЛАССИЧЕСКОЙ БОЛЕЗНИ\n\nВК в основном является естественным процессом, который медленно выводит многие биологические регуляторные системы в организме и мозге из состояния равновесия. Это подразумевает несколько специфических свойств для ВК, которые отличают его от классических механизмов заболевания:\n\n- VC-индуцированные заболевания имеют общее происхождение. НО ОНИ БУДУТ БЫТЬ ПОЛНОСТЬЮ РАЗЛИЧНЫМИ МЕДИЦИНСКИМИ ЯВЛЕНИЯМИ, ПОТОМУ ЧТО КАЖДЫЙ БИОЛОГИЧЕСКИЙ РЕГУЛЯТОРНЫЙ МЕХАНИЗМ, РЕГУЛИРУЕМЫЙ ВК, ПРОИЗВОДИТ СВОЙ КОМПЛЕКС СИМПТОМОВ.\n \n- Сложно предсказать, какие болезни будет создан VC в индивиде, потому что VC прорабатывает биологические механизмы регулятивного регулирования в экстремально сложном способе в отношении генетики, раннего возраста, эпигенетического возраста, и т.д.\n\n- ПОСЛЕ ТОГО, КАК ВСЕГДА ДЕРЕГУЛЯЕТ НЕ ОДИН, НО НЕСКОЛЬКО БИОЛОГИЧЕСКОГО РЕГУЛЯТОРНОГО МЕХАНИЗМА, ВПРОЧНЫЕ ЗАБОЛЕВАНИЯ ИМЕЮТ ВЫСОКУЮ СОБСТВЕННОСТЬ.\n\n\nОсновные сходства венерических заболеваний:\n\n- Они вызваны хроническим воспалением (так как основной вредный эффект, вызываемый ВК, - это хроническое воспаление в мозге и теле, а хроническое воспаление имеет множественные повреждающие ткани эффекты).\n\n- Их основным фактором риска является старение (поскольку, как правило, анти-гомеостатические эффекты ВК требуются десятилетия, чтобы подняться до уровня, вызывающего заболевание).\n\n(Стоит отметить, что на этом этапе большинство заболеваний, связанных со старением, действительно вызвано хроническими воспалительными процессами. См., Например, https://harvardmagazine.com/2019/05/inflammation-disease-diet)\n\n\nЧАСТЬ 3: ПОДДЕРЖКА ИССЛЕДОВАНИЙ\n\nГипотеза подтверждается следующими результатами исследований:\n\nГЕНОВОЕ ВЫРАЖЕНИЕ АНАЛИЗ ПРЕДЛАГАЕТ ВАЖНУЮ СИСТЕМУ ПАМЯТИ ЧЕЛОВЕКА, ЧТОБЫ ВЫЗВАТЬ СТАРЕНИЕ В НЕКОТОРОЙ ТКАНИ\n\nВ 2011 году исследование Huang et al. относительно экспрессии генов, связанных со старением, в различных тканях (https://www.ncbi.nlm.nih.gov/m/pubmed/21751870/), делается вывод, что «старение гиппокампа вызвало некоторый каскад старения в других тканях» ,\n\nГиппокамп - это область мозга, ответственная за автобиографическую память. Гиппокамп также известен своей решающей ролью в подавлении неприятных воспоминаний. Таким образом, повреждение гиппокампа лишает неприятные воспоминания.\n\nТаким образом, (после моей гипотезы) повышение уровня воспаления в мозге в основном повредило бы гиппокамп, потому что это одна из наиболее чувствительных структур мозга. Это еще больше ослабит неприятные воспоминания, и так далее, и так далее.\n\nЭто означает, что гиппокамп может быть областью мозга, которая одновременно является источником и мишенью одного из механизмов, которые формируют и усиливают ВК.\n\nЭта возможная роль гиппокампа в качестве основного источника и мишени для ВК и, следовательно, в качестве основного _causal_ источника стимулирующего старение влияния на организм, может быть причиной, по которой Хуанг и др., 2011 нашли гиппокамп как _causal_ источник связанных с возрастом изменений экспрессии генов в некоторых тканях организма.\n\n\nКОЖА МЫШЕЙ АВТОМАТИЧЕСКИ ОБОГАЩАЕТ, КОГДА БЛОКИРУЕТ МОЛЕКУЛЯРНЫЙ МЕХАНИЗМ, КОТОРЫЙ ДВИЖЕТСЯ ВК\n\nМоя гипотеза постулирует, что ВК вызывает старение у всех животных с нервной системой, подавляя механизмы восстановления и омоложения (точные механизмы см. На моем сайте). Интересно, что исследование показывает, что молекулярный механизм (провоспалительная активность молекулы NF-κB) действительно существует в коже мышей, что\n\nа) становится все более активным по мере взросления мышей, и\n\nб) БЛОКИРОВАНИЕ, КОТОРОЕ ПРИВОДИТ К АВТОМАТИЧЕСКОМУ ОЦЕНКЕ КОЖИ.\n\nЭто, на самом деле, говорит о том, что старение, согласно моей гипотезе, возникает из-за подавления механизмов восстановления и омоложения. В этом случае ингибирование механизмов восстановления и омоложения связано с повышенной активностью NF-κB (подробности см. PMID 18055696).\n\nКроме того, поскольку VC обладает сильным провоспалительным действием и, следовательно, сильно усиливает активность NF-κB (см., Например, PMID 19408108), VC может отвечать за связанную со старением повышенную активность NF-κB и, таким образом, также за результирующее старение кожи через NF-κB-индуцированное ингибирование механизмов репарации. Следовательно, ВК действительно может представлять происхождение процесса старения кожи у мышей.\n\n\nПРИЧИННАЯ ЦЕПЬ ОТ ВК, К АВТОНОМНОЙ НЕРВНОЙ СИСТЕМЕ, К СТАРЕНИЮ\n\nНаправление исследований (см. PMID\n(29932493 и 30303708) обнаружили, что основным источником старения ткани, снижением пролиферации стволовых клеток в процессе старения, является (по крайней мере, in vitro) дисбаланс в активности двух ветвей автономной нервной системы, симпатический (SNS) и парасимпатический (PNS) (см., например, https://www.fightaging.org/archives/2018/10/neurotransmitters-envisaged-as-controllers-of-stem-cell-activity/).\n\nКак уже упоминалось, одним из основных вредных эффектов VC является нарушение регуляции ANS, то есть постоянно увеличивающийся дисбаланс в активности SNS и PNS во время старения. Таким образом, благодаря этой дерегуляции VC может быть причиной снижения пролиферации стволовых клеток, происходящего во время старения, и из-за этого свойства фактически представляют происхождение процесса старения.\n\n\nХАРАКТЕРИСТИКИ АЛЖАЙМЕРА ПРЕДЛАГАЮТ ПРИЧИНУ ВК\n\nТеперь, как мне прийти к выводу, что ВК также вызывает болезнь Альцгеймера? Недавно я прочитал эту статью (https://www.nytimes.com/2019/04/08/health/alzheimers-dementia-stroke.html), в которой говорится, что болезнь Альцгеймера, за исключением случаев, вызванных конкретными генами Альцгеймера, главным образом, болезнь, связанная со старением.\n\nКак болезнь, связанная главным образом со старением, болезнь Альцгеймера может быть следствием венерического синдрома, если он в течение десятилетий проходил у субъекта в особом «режиме генерации болезни Альцгеймера». Другими словами, если он медленно дерегулирует ряд биологических механизмов, так что фенотип болезни Альцгеймера в конечном итоге развивается. Тот факт, что ВК вызывает хронический энцефалит, и болезнь Альцгеймера всегда сопровождается этим, подтверждает эту идею.\n\nВ статье также предполагается, что болезнь Альцгеймера часто сопровождается атрофией гиппокампа. Поскольку ВК, вероятно, протекает преимущественно в гиппокампе и повреждает его, вполне возможно, что и атрофия гиппокампа и причинно-следственная болезнь Альцгеймера вызваны ВК.\n\nГипотеза описана (извините, к сожалению, несколько громоздко) более подробно здесь: https://sites.google.com/site/emdhypothesis/notes\n\nНадеюсь, вы немного повеселились (по крайней мере, это замедлит ВК ;-))\n\nС наилучшими пожеланиями, Руджер","title":"Новая гипотеза о происхождении старения","subreddit_name_prefixed":"r/AgingBiology","ups":3,"created":1558074292,"link_flair_background_color":"","id":"bpj27q","author":{"name":"emdhypothesis"},"permalink":"/r/AgingBiology/comments/bpj27q/a_novel_hypothesis_on_the_origin_of_aging/","url":"https://www.reddit.com/r/AgingBiology/comments/bpj27q/a_novel_hypothesis_on_the_origin_of_aging/","created_utc":1558045492}