{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Извиняюсь, если это было обращено прежде, но я не могу найти ответ. Я спортсмен среднего возраста, который в основном занимается альпинизмом и бегом летом, а зимой занимается скалолазанием и катанием на лыжах. Я получаю достаточное количество травм и всегда ищу способы оптимизировать лечение.\n\nЯ заинтересовался ящуром из-за его потенциала заживления травм. Я дважды запускал 5-дневный ящур, и оба раза испытывал заживление ноющего тендинита или даже растяжений связок. Я попробовал 72-часовой пост воды и не получил такого же преимущества, предполагая, что более продолжительный пост необходим для стимулирования того типа аутизма, который мне нужен. Все идет нормально.\n\nМне, однако, интересно, как ввести в действие ящур или 5-дневные голодания с моим графиком тренировок. Я не могу тренироваться во время поста, и период времени сразу после поста кажется, что это было бы уязвимое время с разрушением тканей и ослаблением иммунной системы из-за аутофагии. Есть мысли по этому поводу? И сколько времени действительно нужно спортсмену, чтобы оправиться от продолжительного поста?\n\nМои тренировки по горному бегу следуют традиционной волнистой периодичности, с тремя неделями увеличения пробега и увеличения по вертикали, затем легкой неделей, а затем повторением до пары событий / приключений в конце лета. Давайте назовем этот 4-недельный период блоком.\n\nЯ обычно полагаюсь на легкую неделю, чтобы исцелиться. Сможет ли замена его постной неделей сделать меня уязвимым для перетренированности, так как на самом деле я не буду лечить, а буду стимулировать аутофагию?\n\nМного вопросов! Жду отзывов.\n\nСпасибо!","title":"Программирование ящура с тренировочным циклом","subreddit_name_prefixed":"r/FMD","ups":5,"created":1553915961,"link_flair_background_color":"","id":"b71gf0","author":{"name":"gravityraster"},"permalink":"/r/FMD/comments/b71gf0/programming_fmd_with_athletic_training_cycle/","url":"https://www.reddit.com/r/FMD/comments/b71gf0/programming_fmd_with_athletic_training_cycle/","created_utc":1553887161}