{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"На 3 день, в настоящее время. Написание этого для тех, кто может быть заинтересован в n = 1 опыт работы с комплектом Prolon FMD.\n\nНемного обо мне: я делал «жирные посты» раньше в течение приблизительно двух дней, где я ем немного чистого жира, если я чувствую голод, в дополнение к воде и / или минимально калорийным напиткам, таким как бульон или кофе / чай. Я чувствую, что быстро перехожу на кетоз и начинаю ощущать положительный эффект от поста скорее, чем позже. После жирного поста я чувствую себя очень энергичным и ясным, а мой кишечник чувствует себя потрясающе - очень легким и чистым, без вздутия, судорог или неприятных ощущений.\n\nЯ также делал фруктовые и овощные \"посты\" около 4 дней. Я позволяю себе есть столько фруктов, овощей и зеленых соков, сколько я хочу, вместе с водой. Я делал это всего несколько раз и предпочитаю поститься с высоким содержанием жира.\n\nЯ постился, потому что страдаю от усталости и тумана мозга. У меня гипотиреоз, и я постоянно страдаю от этих симптомов, поэтому я всегда ищу пути их улучшения. У меня также есть идеопатический гастрит (боль в животе без известной причины), которая, кажется, хорошо контролируется диетой с высоким содержанием жиров, низким содержанием углеводов и низким содержанием животного белка.\n\nКроме того, из-за моей постоянной усталости я пью много кофеина в день. По крайней мере, 2 чашки кофе, в хороший день. Итак, я решил взять 1 C кофе, разрешенный ящуром.\n\nИтак, ящур. Я был взволнован, чтобы попробовать это, потому что я беспокоюсь о потенциальных негативных последствиях поста - иногда, когда я постился, я становлюсь очень легкомысленным и затаившим дыхание, и волнуюсь, что я собираюсь потерять сознание. Я также хотел сделать это, потому что это может привести к аутофагии, что, поскольку я никогда не постился достаточно долго для этого, я не думаю, что смог испытать. С моим аутоиммунным заболеванием мне любопытно, как аутофагия может помочь «перезагрузить» мою иммунную систему.\n\nВот мой опыт:\n\n1 день\n- Была только одна чашка кофе, так что, вероятно, проходила через прием кофеина.\n- чувствовал усталость и простор\n- содержание углеводов в батончике (инулин) и в супах заставило меня чувствовать себя разболтанным и вздутым. Я придерживаюсь диеты с высоким содержанием жиров и редко употребляю такое же крахмалистое, как эти супы. Первым ингредиентом в них является инулин или рисовая мука. Я чувствовал, что если бы у меня был выбор, у меня был бы суп, который был чистым протертым овощем с добавленным жиром, как кокосовое молоко или оливковое масло. Супы с низким содержанием жира и высоким содержанием углеводов, и мое тело плохо реагирует на это.\n\nЯ работал дома в первый день, а днем ​​приходилось спать, и в тот день я не чувствовал себя очень продуктивно. Я отменил свою однодневную встречу.\n- во время сна мне снились тревожные сны, похожие на паралич сна, когда я не могла двигаться, и меня предала моя семья\n\nДень 2: суббота - нет работы\n- Чувствовал себя намного лучше после того, как одна моя чашка кофе была выделена в AM.\n- Чувствовал себя действительно паршиво, хотя, в общем. Крэбби, злой, вспыльчивый. В итоге я выпил большой стакан соленой воды, чтобы попытаться компенсировать некоторые негативные симптомы. Я думаю, что это сработало немного.\n- Мои мышцы болят, и не в хорошем смысле «растягивают меня». Больше в стиле «у меня грипп, и я не хочу двигаться».\n- устала и не может хорошо сосредоточиться. Просто пытаюсь \"пройти через это\"\n- Не чувствуйте себя сытым после любого приема пищи. Интересно, почему я вообще их ем, и если бы я их не ел, я бы быстрее заболел кетозом\n- Я мочился на кето-палку около 5 вечера и не обнаружил никаких обнаруживаемых кетонов. Если бы я быстро делал жир, думаю, я бы уже был в кетозе\n- дремал как 3 часа днем\n\nДень 3: воскресенье, нет работы\n- Не хотел вставать с кровати\n- все еще чувствую себя больным и \"похожим на грипп\"\n- Ел ореховый батончик по утрам - ореховые батончики вкусные, но излишне сладкие. Опять же, почему мы не можем использовать эти калории для большего количества жира и быстрее попасть в кетоз?\n- Я позволил себе вторую чашку черного кофе, потому что я думаю, что это поможет мне пройти через это с минимальными негативными последствиями для поста\n- Вообще-то, очень хочу добавить большую порцию жира в мой кофе и пить соленый бульон с кокосовым маслом вместо тех супов-караби; но все еще планирую упорствовать\n- Завтра я возвращаюсь на работу, поэтому очень надеюсь, что я \"поверну за угол\" в День 4, как и другие\n\nЭто где я сейчас ... продолжу обновлять в комментариях.\n\nСпасибо за любые отзывы! Просто хочу поделиться своим опытом, так как я не нашел много отзывов в Интернете.","title":"Мой опыт на Пролоне ящура пока, День 3","subreddit_name_prefixed":"r/FMD","ups":14,"created":1556492118,"link_flair_background_color":"","id":"bic1h5","author":{"name":"lizzardbeth9"},"permalink":"/r/FMD/comments/bic1h5/my_experience_on_prolon_fmd_so_far_day_3/","url":"https://www.reddit.com/r/FMD/comments/bic1h5/my_experience_on_prolon_fmd_so_far_day_3/","created_utc":1556463318}