{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Справочная информация: я 10 лет трезвый от алкоголя, и как часть этого и других изменений образа жизни я потерял около 40 фунтов с тех пор, как стал трезвым. Я потерял вес в основном из-за палео-диеты и физических упражнений. С тех пор я стал больше на растительной основе.\n\n\n\nОколо трех недель назад я рассказывал своему терапевту о том, как у меня развилась некоторая сахарная зависимость, когда обычно один раз в неделю, даже после сытного обеда, я получал пинту пива и все остальное. на диване во время просмотра телевизора. Она рекомендовала ящур как «перезагрузку».\n\n\n\nЯ 38-летний мужчина и 5'7 \", в 150 фунтов.\n\n\n\nЯ прочитал некоторые из главных постов здесь и придумал версию DIY, которая состояла из: овсянки Steel Cut с кокосовым молоком, грецкими орехами, миндалем, оливками, цветной капустой, кукурузой, картофелем, брокколи, капустой, цветной капустой, клубникой, черникой, ребенком Морковь, острый авокадо, хумус и, конечно же, авокадо. По сути, я бы вводил материал в Chronometer, проходя весь день, чтобы достичь своих целей в области макро / калорий. Последние три дня я комбинировал овощи в своем горшке для приготовления супа и добавлял авокадо сверху. Много соли, перца, итальянской приправы и т. Д.\n\n\n\nПокупка всего этого за целые 5 дней, вероятно, обошлась мне в $ 20-30 от Трейдера Джо.\n\n\n\nНачиная с 150 фунтов. и 19,3% BF, закончился на 146,2 фунтов. и 17,7% BF этим утром. BF измеряется по шкале Tanita BIA. Это может быть неточной мерой, однако, хорошо для измерения трендов.\n\n\n\nВот мои мысли:\n\n* Это было намного проще, чем я предполагал, если бы не социальные обязательства. Я мог видеть, что я делаю это один раз в месяц.\n* Я не чувствовал себя супер голодным в любой момент\n* Сроки приема пищи были важны для сдерживания голода, я ждал до 10 утра, чтобы позавтракать, пообедать около 2 часов дня, поужинать около 7 часов вечера.\nОтказаться от кофеина было для меня тяжело, самая трудная часть диеты. Сильные головные боли в дни 2 и 3. Взял немного Aleve (я очень редко использую обезболивающие), и это было решено.\n* Понял, как я зависим от кофеина!\n* Пили много травяного чая и приличное количество кофе эспрессо без кофеина (да, понял, что в нем содержится незначительное количество кофеина)\n* Почувствовал эйфорию и ясность ума на 4 и 5 дни\n* Проснулся, чувствуя себя очень счастливым и энергичным вчера (последний день)\n* Дерьмо мои штаны один раз\n* Очень трудно не обедать с друзьями в течение 5 дней, но можно обойтись, если встретиться с кофе без кофеина, покататься на велосипеде, выпить чай и т. Д.\n* Определенно заметил улучшения в моей внешности. Моя кожа выглядела яснее и ярче, на лбу ощущалась как морщина. Это может быть просто из-за большей гидратации / здорового жира / смещения подтверждения.","title":"Только что сделал мой первый 5-дневный DIY-раунд ящура","subreddit_name_prefixed":"r/FMD","ups":13,"created":1560467814,"link_flair_background_color":"","id":"c072pk","author":{"name":"Shootlawd"},"permalink":"/r/FMD/comments/c072pk/just_did_my_first_5_day_diy_round_of_fmd/","url":"https://www.reddit.com/r/FMD/comments/c072pk/just_did_my_first_5_day_diy_round_of_fmd/","created_utc":1560439014}