{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Привет всем, мне было очень полезно читать ваши отчеты о том, как вы пытались делать диету, имитирующую пост, и, так как я только что закончил свой первый раунд, я подумал, что было бы целесообразно записать свои собственные мысли, прежде чем я начну забывать.\n\nЯ очень полагался на информацию из этого subreddit, чтобы выяснить меню. Я решил основывать свою еду на салате с зеленью и авокадо, который можно найти на [DrJockers.com] (https://drjockers.com/fasting-mimicking-diet-benefits/) с некоторыми консервированными консервными баночками с чечевицей + Эми. Эти решения были в основном взяты из информации и ссылок в этих сообщениях:\n\n[https://www.reddit.com/r/FMD/comments/bml6ld/question\\_regarding\\_upper\\_limits\\_absolut\\_compiled/](https://www.reddit.com/r/FMD/comments/bml6ld / question_regarding_upper_limits_absolut_compiled /)\n\n[https://www.reddit.com/r/FMD/comments/9080a6/diy\\_menu\\_for\\_fastingmimicking\\_diet\\_35/](https://www.reddit.com/r/FMD/comments/9080a6 / diy_menu_for_fastingmimicking_diet_35 /)\n\nТак что в большинстве дней я бы съел суп на 7 унций + маленький зеленый салат с половиной авокадо на один прием пищи (обычно на обед), затем большой зеленый салат с другой половиной авокадо плюс столовая ложка семян тыквы для другая еда (обычно ужин) - все, что добавляло до 720-800 калорий в течение дней 2-5. Заправка для салата была лимонным соком, оливковым маслом, солью и перцем, или иногда просто лимонным соком, солью и перцем, если у меня не осталось калорий для оливкового масла. В первый день у меня был большой салат с жареными овощами, такими как цветная капуста и тыквенный орех на обед. Я был удивительно хорошо с повторением еды каждый день, поскольку салат из авокадо был довольно вкусным. Я пошел с тыквенными семечками для моего варианта орехов / семян, потому что это то, что мы случайно обнаружили в кладовой. Основой зелени была в основном руккола, потому что мне это нравится, и плоская петрушка или кинза, чтобы поддерживать высокий уровень вкуса. \\ [Править: Я добавил немного огурца и / или сырой спаржи несколько раз для дополнительного хруста. \\] Суп был немного безвкусным, когда я купил версию с низким содержанием натрия, но с дополнительной солью и чайной ложкой оливкового масла, когда у меня было возможность добавлять эти калории, не переходя, это улучшило ситуацию. \\ [Правка 2: Мне действительно нравилось пить горячий суп раз в день, потому что это было больше похоже на настоящую еду, чтобы иметь суп + салат и меньше лишений, поэтому я буду держать суп в смеси в следующий раз. \\]\n\nДля этого раунда я ТОЛЬКО подсчитал калории. Я не выяснил, согласуются ли все макросы с формулой Вальтера Лонго, но старался вообще думать о том, чтобы сохранить низкое содержание белка и больше жира. Я хотел, чтобы в этот раз все было просто, но в следующий раз я буду более конкретен с процентным содержанием жира, углеводов и белков.\n\nЯ (по глупости?) Решил вырезать свой утренний кофе и попытаться каждый день пить одну чашку зеленого чая в качестве источника кофеина. Я потерпел неудачу в этом счете, так как мне удалось выпить до 2 чашек чая в течение дней 4 и 5. Несмотря на это, у меня почти постоянно были головные боли в течение дней 3-5 (дни 1 и 2, я все еще пил кофе, хотя меньшее количество, чем я привык). Я предполагаю, что это были головные боли, связанные с отменой кофеина, а не вызванные самим ящуром, но они определенно повлияли на мое «удовольствие» от ящура. В следующем раунде я продолжу пить черный кофе в своих обычных количествах. Кроме того, на 5-й день мой кофеин состоял из одной чашки черного чая и одной чашки зеленого чая, когда я попытался добавить черный чай, чтобы посмотреть, помогает ли это от головной боли, и я обнаружил, что черный чай натощак меня тошнит. Так что это тоже было ошибкой.\n\nЧто касается голода, да, я был голоден. На 4-й день мой голод был намного меньше, и в начале 5-го дня, когда меня тошнило, я не был так голоден, но я принял некоторые китайские травы для пищеварения, чтобы устранить тошноту, а затем я снова стал голодным. Тем не менее, это было намного проще для меня, чем полное водное голодание. До сих пор с водой натощак я сделал только до 63 часов, прежде чем сдаться - частично из-за беспокойства по поводу электролитного баланса. Я не получал удовольствия от приема соли и калия во время голодания на воде, так что было проще обильно солить салаты и получать калий из авокадо на этот раз. Я принимал поливитамины пару раз, но не каждый день - думаю, это помогло бы быть более строгим, принимая его каждый день.\n\nДругие симптомы - на 3 и 4 дни я был уставшим и вялым, плюс немного болел. К счастью для меня это были оба легкие рабочие дни, поэтому это не сильно повлияло на меня. Я закончила спать, когда вернулась домой в оба дня. Я предполагаю, что это был \"кето грипп\" и будет улучшен в следующем раунде. Я также заметил несколько точек покраснения кожи на моем туловище на 4-й день. Обратите внимание на меня: я дважды пытался полностью использовать кето-диету, и оба раза приходилось сдаваться из-за неумолимой «кето сыпи», поэтому я считаю, что моя кожа очень чувствительна / реагирует на кетоны в поту. На четвертый день я воспринял красные точки как признак того, что у меня начинается кетоз. Однако покраснение прошло на 5-й день, так что, возможно, это было просто совпадение.\n\nМудрая потеря веса, я потерял 4,5 кг. Я 50-летняя женщина, у которой умеренный вес, но она очень медленно проигрывает. Я ожидаю, что получу это обратно. Мой живот действительно сильно расплющился, что было приятно. У меня не было никаких пищеварительных побочных эффектов, кроме тошноты на 5 день.\n\nРедактировать 3: Одна неделя спустя - я удивлен, что я все еще на 1-1,5 фунта меньше своего начального веса (в зависимости от дня). Я предполагал, что получу все это очень быстро, но пока что немного осталось. Мне было трудно придерживаться режима кормления с ограничением времени 16: 8 после ящура, которого обычно достаточно, чтобы поддерживать свой вес, но не терять его. Я чувствовал себя голоднее и, как будто, мне нужно больше завтракать на прошлой неделе Я не знаю, потому ли это, что я пытался съесть немного больше углеводов и меньше белка, чем обычно, чтобы следовать советам Лонго во время повторного кормления - возможно, это заставило меня чувствовать себя голоднее, или, возможно, это было просто похмелье от ящура. Несмотря на это, я еще не набрал вес. Я буду прилагать больше усилий с 16: 8 в течение следующих нескольких недель до следующего ящура, чтобы попытаться остаться ниже моего начального веса. Головная боль, которую я испытывал во время ящура, не исчезала даже с ведром кофе утром 6-го дня. Это продолжалось до 6-го дня после обеда, так что теперь я полагаю, что это был хотя бы частично либо электролитный дисбаланс, либо, возможно, это было связано с низким потреблением белка.\n\ntl; dr: сделай сам ящур на основе салата из авокадо было довольно легко сделать, хотя побочные эффекты немного высосали. Повторится снова в следующем месяце с черным кофе и только небольшим изменением меню.","title":"DIY FMD раунд 1 отчет","subreddit_name_prefixed":"r/FMD","ups":9,"created":1561329360,"link_flair_background_color":"","id":"c45m04","author":{"name":"epipin"},"permalink":"/r/FMD/comments/c45m04/diy_fmd_round_1_report/","url":"https://www.reddit.com/r/FMD/comments/c45m04/diy_fmd_round_1_report/","created_utc":1561300560}