{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"M40s 5'10 \"SW: 245 # с. EW: 235 # с CW: 231 Я немного более приземленный, GW: 200\n\n\nЦель - использовать ящур, чтобы сбросить вес и сбросить привычки в еде и подходить к порциям, надеемся получить положительные результаты. Почему Пролон? Любопытно о последствиях, таких как тот факт, что он был высоко структурирован и разработан для соответствия моей личной мотивации / соответствия. Также стоимость помощи соответствия - лол.\n\n\nПротокол - Пролон, с минимальной физической активностью, как рекомендуется.\n\n\nРазличия - я вышел после полуночной смены, когда начал ящур, поел в 1:00 и начал на следующий день. В тот первый день я также был довольно активным садоводством / плющом, тянущим около полудня. Я оставался без поста до 5,5 дня, поэтому я все еще считаю, что общий период времени такой же, как протокол. В День 4 я выпил одну чашку черного кофе, так как у меня был напряженный рабочий день, и я не хотел замедляться во второй половине дня, как в дни 2 и 3.\n\n\nУ меня была сильная головная боль и туман в мозге днем ​​и вечером 2 и 3 дня, очень похожий на кето-грипп. Я ощутил подъем в день 4-5, но это не было супер энергией или эйфорией, просто повышенная осознанность и энергия, но это было также в основном утром, к середине дня я был просто ме.\n\n\nProlon FMD был прост в использовании, я нашел еду достаточно вкусной и насыщающей. Я только использовал электрический чайник или получал горячую воду от машины с дистиллированной водой на работе, без варки на плите. Просто дайте этому впитаться достаточно долго, чтобы смягчить все и удостовериться, что вы пережевываете что-то, что не полностью смягчено. Все было очень удобно и удобно. Мне действительно очень понравились крекеры. Основным недостатком, конечно, являются расходы.\n\n\nБуду ли я сделать это снова? Да. Самая сложная часть - это 5 дней с минимальной физической активностью, поэтому я с большей вероятностью попробую самодельный ящур с повышенной активностью или более короткие 2-3-дневные голодания, которые начинаются с физической активности, истощающей гликоген, чтобы вызвать кетоз. Я понимаю, что, возможно, я не получу те же преимущества из-за этой деятельности, но пройдет около 6 месяцев, прежде чем я смогу провести еще 5 невысоких ключевых дней подряд. Я также чувствую, что у меня, возможно, было мало электролитов в День 4 и 5.\n\n\nРид был определенно удивительным. У меня «сильный желудок», и меня не так легко расстраивать большинство предупреждений. Я испытал некоторый дискомфорт, нарастающий на моем повторном кормлении. Я ела с небольшими закусками с большим количеством оливок и очень маленькими порциями еды, но первая средняя порция, которую я съела, определенно заставила меня чувствовать себя не так хорошо в гастрономическом регионе. Только через +4 дня я почувствовал себя комфортно, съев любой размер порции.\n\n\nИзменения после ящура - я пытаюсь увеличить потребление растений для улучшения питательных веществ и клетчатки / кишечника и развить свой вкус в этом направлении. Я готовил суп из овощей каждые 10 дней или около того. Также тренируюсь, если я решу заняться делом ящуром. Я также добавил в мои закуски оливки, соленые огурцы и немного веганской хрустящей капусты, чтобы помочь мне избежать других обработанных закусок и свиной кожуры. Я также чувствую, что эти закуски как бы возвращают мое мышление к посту и вспоминают, почему мне нужно оставаться на пути, и что мне не нужно просто подавать себе достаточную миску с едой только потому, что я чувствую голод или это время еды ,\n\n\nPoop report: Я довольно хорошо тренировал свое тело, чтобы принимать BM каждое утро по мере необходимости. D1 нормальный, D2 большой, но легкий и свободный, D3 минимальный, D4 пропущенный, D5 маленький. D4 и D5 я чувствовал, что у меня гипоатренемия. Каждый раз, когда я пил воду, мне приходилось мочиться через 10-15 минут. Я не был слишком обеспокоен, учитывая ограничение в пять дней и то, что большинство продуктов были солеными, но я думаю, что у меня был дефицит соли.\n\n\nРад ответить на все, что касается моего опыта. Если я куплю Пролон снова, я также куплю глюкометр и кетоновые счетчики для мониторинга.\n\n\nВопрос к исследователям ВЛ ящура. Будет ли противопоказано потребление / дополнение электролита чем-либо в связи с попыткой получить «полную» выгоду от ящура, которую предположил Лонго? Я чувствую, что это помогло бы с кето-подобными симптомами, которые я испытывал. Я могу себе представить, что электролиты могут создавать ложный «пищевой» сигнал, похожий на сладкий, который может задерживать или препятствовать получению организмом полной пользы от ящура с помощью IGF-1 mTOR, но особо об этом не видел.\n\n\n\nETA: только приготовление электрочайника, удобство, мой пол и возраст, куплю мониторы в следующий раз.","title":"YA FMD-Prolon Report","subreddit_name_prefixed":"r/FMD","ups":12,"created":1562989878,"link_flair_background_color":"","id":"ccfq1a","author":{"name":"rkt88edmo"},"permalink":"/r/FMD/comments/ccfq1a/ya_fmdprolon_report/","url":"https://www.reddit.com/r/FMD/comments/ccfq1a/ya_fmdprolon_report/","created_utc":1562961078}