{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Через четыре недели после моего [первого поста по ящуру] (https://www.reddit.com/r/FMD/comments/c45m04/diy_fmd_round_1_report/) я вернулся, чтобы сообщить о втором раунде.\n\n** Что случилось после моего первого ящура: **\n\nЯ потерял 4,5 фунта во время ящура и вернул 4 фунта в течение следующих недель, в результате чего я потерял 0,5 фунта. В то время я ничего не делал, чтобы изменить свои привычки в еде, и фактически обнаружил, что я ем больше углеводов и молочных продуктов, чем обычно - я постараюсь быть лучше в этом отношении на этот раз. Я отслеживаю, как долго я постился в одночасье, и определенно в первую неделю после ящура я обнаружил, что привлекательность завтрака невероятно сильна, поэтому я часто опускался до 12-часового ночного поста. Я не мог вернуться к 16-часовым постам до второй недели.\n\nПо совпадению, примерно через 10 дней после ящура у меня была назначена некоторая кровь. Я надеялся увидеть некоторые изменения в моих ЛПНП и ЛПВП, так как они были немного ранее, но нет, у меня не было никаких реальных изменений ни в чем. Один раунд ящура может быть слишком мал, чтобы увидеть какие-либо улучшения, или, возможно, мои цифры были слишком близки к норме. Мой HbA1C на самом деле поднялся, но так как он был от 4,8 до 5,0, я не буду жаловаться, так как все в порядке. Я также не знаю, означает ли это что-либо, кроме моей СКФ (оцененной скорости клубочковой фильтрации, показателя здоровья почек), которая вернулась к норме / превысила 90 (на самом деле 93). Последние 5 лет он прыгал между 79 и 86 годами. Это может быть просто случайное колебание, но, как правило, СКФ, как правило, уменьшается с возрастом, я был счастлив с этим изменением.\n\nНаконец, я купил книгу Вальтера Лонго «Диета долголетия» и прочитал ее, готовясь ко второму ящуру. Я на самом деле не думаю, что это было супер полезно. Я действительно думал, что общее описание диеты долголетия, которую он хочет, чтобы вы ели большую часть времени, было в порядке, но отчасти это сбивало с толку. Мол, он рекомендует есть сложные углеводы, но потом говорит о пасте. Предлагаемый план еды в конце книги, кажется, включает сладкие закуски / десерты каждый день, которые, кажется, не соответствуют общему учению книги, но, возможно, это просто убедить скептически настроенных людей в том, что у них все еще могут быть сладости. , Он также говорит, что вы должны есть то, что ели ваши предки, что просто смутило меня, потому что тогда я был похож на ... молочных продуктов и картофель? Также не было много информации о самом ящуре и полезной информации о том, как структурировать DIY версию.\n\nНаконец я просмотрел патенты для информации. Это гораздо лучший источник информации для любителей, но мне нужно время, чтобы изучить их более тщательно.\n\n** Что я изменил на этот раз **:\n\nЯ ввел информацию о питании для множества продуктов в электронную таблицу и отслеживал все. В прошлый раз я сосредоточился только на подсчете калорий и вообще думал о том, чтобы сохранить его низким содержанием белка / высоким содержанием жира. На этот раз я посчитал цифры по патентам и стремился к количеству калорий, белков, жиров и углеводов. Тем не менее, количество углеводов казалось пугающе высоким для тех, кто привык думать, что кето и полное голодание - единственный способ снизить уровень глюкозы / инсулина. Поэтому каждый день я часто получал немного меньше углеводов и больше жира, чем рассчитанный идеал.\n\nБлагодаря электронной таблице я расширил свое меню, так как я мог изменить свой план на день, исходя из того, что я чувствовал, как есть. В прошлый раз я в основном жил на салате с зеленью + авокадо, овощным супом Эми с чечевицей и тыквенными семечками. Я держал эти вещи по очереди, но добавил оливки, жареные закуски из морских водорослей, грецкие орехи, киноа, овощной бульон, малину, ежевику, мини-бары Kind, гуакамоле, хумус, виноградные помидоры и салат из черной фасоли. Это было больше похоже на нормальное питание и более устойчивое, как то, что я могу повторить много раз. Я планировал на самом деле готовить овощи, но обнаружил, что не хочу готовить (кроме теплого супа).\n\nИз-за головных болей в первом туре я также продолжал пить мой обычный черный кофе по утрам.\n\n** Результаты / побочные эффекты: **\n\nВо время первого раунда у меня были сильные головные боли, начиная с 3-го дня и продолжая до обеда в 6-й день (то есть после завтрака и обеда, и 2 горшки кофе). Я также был очень утомлен большую часть времени, и мне приходилось спать в дни 3 и 4. На этот раз у меня была слабая / умеренная головная боль, начинающаяся вечером 1 дня и продолжающаяся до утра 3 дня. Затем она поднялась и Я чувствовал себя хорошо после этого. Никакой настоящей усталости, за исключением того, что я чувствовал себя слабее при легкой тренировке. Я чувствовал боль и боль во второй день, но в первый день у меня был массаж, и она действительно работала над некоторыми из моих напряженных мышц, поэтому боль, вероятно, была от этого. У меня не было абсолютно никаких проблем с желудочно-кишечным трактом (во время первого раунда тоже не было)\n\nВ дни 4 и 5 мой аппетит был ниже, чем в другие дни. Это не произошло в первый раз. В итоге оба дня я съел около 600 калорий вместо 725, которые были у меня в дни 2 и 3. Я не заставлял себя есть больше, поскольку патенты на ящур дали диапазон потребления 3-7 калорий на фунт массы тела. так что я знал, что был в этом диапазоне.\n\nЯ потерял 6 фунтов. Так что это был лучший результат для меня, чем первый раунд.\n\n** Что я буду делать по-другому в следующий раз: **\n\nЯ попытаюсь снова бросить кофе в следующий раз.\n\nЯ начну отслеживать сахар. Ближе к концу этого раунда ящура я заметил в одном из патентов, что рекомендуемое потребление сахара составляет <30 г в день 1 и <20 г в дни 2-5. Я отслеживал уровень сахара в дни 4 и 5 и фактически закончился в день 5, так как в итоге я набрал 21,5 г (я виню ежевику и мини-добрый батончик - в последний день я был немного более слаб в употреблении сладкой пищи).\n\nЯ чувствовал потребность в хрустящей еде, поэтому я намеревался отыскать несколько крекеров из капусты или что-то в этом роде, но в остальном был довольно доволен своими вариантами еды.\n\nЯ буду изучать патенты перед следующим туром, чтобы чувствовать себя более уверенно в своей базе знаний.","title":"DIY FMD раунд 2 отчет","subreddit_name_prefixed":"r/FMD","ups":9,"created":1563745340,"link_flair_background_color":"","id":"cfz3y1","author":{"name":"epipin"},"permalink":"/r/FMD/comments/cfz3y1/diy_fmd_round_2_report/","url":"https://www.reddit.com/r/FMD/comments/cfz3y1/diy_fmd_round_2_report/","created_utc":1563716540}