{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Я хотел поделиться сокращенной версией журнала, который я хранил в течение пяти дней с момента своего первого ящура на случай, если он кому-нибудь поможет. Я также опубликовал [специальное меню]  (https://imgur.com/xxe0QGs) , за которым я следовал.\n\nОбо мне: 37 лет, мужчина, 178,6 фунтов (81 кг) утром 1-го дня, 6'2 \"(188 см), история болезни, тревожность, экзема, дерматография и прыщи (обычно непокорная кожа). Вегетарианец в дома, но есть яйца и дневник (и, редко, рыбу), находясь вне дома или в качестве гостя. Подходит, но не исключительно. Моя мотивация делать ящур - помочь мне начать терять около 10 фунтов, которые мне не кажутся Я также надеялся «перезагрузить» мое отношение к еде, так как я могу быть немного небрежным, особенно в отношении сладостей.\n\nДень 1: в 9 утра был короткий эпизод острого голода, который, оглядываясь назад, был, вероятно, самым интенсивным эпизодом голода, который у меня был за все пять дней. Остальная часть дня была довольно легкой. Я закончил день с некоторыми орехами пекан, и они были на вкус невероятно хорошими. Интересно, мое чувство вкуса уже немного усиливается?\n\nДень 2: Некоторый острый голод в начале дня, вскоре после моего первого приема пищи, который был приготовлен на пару с небольшим количеством масла чили. Пытался удовлетворить себя овсянкой, которая немного помогла, но я обычно чувствовал, что ограничение калорий настигло меня. Ужин был отличным, и я чувствовал себя очень довольным после этого, что я понимаю, потому что почти весь жир моего дня был на обеде.\n\nДень 3: Я подошел к этому дню с некоторым страхом, потому что все говорят, что это самое сложное. Проснулся с чувством слабости и нехватки координации, который оставался со мной весь день. В какой-то момент я немного потерял равновесие во время ходьбы и был убежден, что вот-вот потерял сознание. Это часть общей картины, когда мой мозг кричал на меня: «Что, если это не здорово!?! Вам следует есть больше!» Ближе к вечеру я начал чувствовать себя больным, лихорадочным и вообще несчастным. Завтра будет напряженный день, и я действительно не могу чувствовать себя так. Если я не чувствую себя значительно лучше утром, я думаю, что мне придется добавить полотенце.\n\nДень 4: Оглядываясь назад, это был лучший день. Все было легко. У меня был небольшой аппетит в течение большей части дня, поэтому я держал свою еду довольно простой и просто пытался достичь своих макро-целей.\n\nДень 5: Опять же, у меня нет сильного аппетита, но я также готов к этому. Прежде всего, это потому, что я так зациклился на еде. Кроме того, я действительно готов вернуться в спортзал. В значительной степени воспроизведено вчерашнее меню. Никаких физических жалоб, просто чувствовал себя очень нормально.\n\nУтром 6-го дня я весил 174,0 фунта (79 кг). Странно, область, где я заметил наибольшую потерю жира, была на моей груди, которую я с радостью приму. Я также заметил, что моя дерматография значительно спокойнее, чем до ящура. Я могу провести пальцем по коже, и появляется только едва заметная красная метка, тогда как раньше это было совершенно очевидно, в любое время моя кожа испытывала какие-либо трения.\n\nЯ хотел бы сделать ящур снова, возможно, ежеквартально. Это было тяжело для меня, но я рад, что сделал это и чувствую, что достиг своих целей. Улучшение моей дерматографии было хорошим бонусом.","title":"Журнал о новом DIY FMD","subreddit_name_prefixed":"r/FMD","ups":14,"created":1564094950,"link_flair_background_color":"","id":"choo6t","author":{"name":"ossicones"},"permalink":"/r/FMD/comments/choo6t/journal_of_a_firsttime_diy_fmd/","url":"https://www.reddit.com/r/FMD/comments/choo6t/journal_of_a_firsttime_diy_fmd/","created_utc":1564066150}