{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Это было хорошо. Я рад, что сделал это - потерял 6,2 фунта, чувствовал, что действительно добился чего-то хорошего для себя, и я чувствую себя совершенно замечательно сегодня, в день 7.\n\nДень 1 был немного сложным, но не невозможным. День 2 был тяжелым, и я провел день довольно мало энергии. После этого все было хорошо с точки зрения того, что я чувствовал, мне просто надоело ничего не делать с едой. На 4-й день я ненавидел суп - я не суп, - поэтому я сел с этикетками питания для супа и MyFitnessPal, и сам сделал себе немного свежих продуктов с теми же макросами и сахарами и всем, что и супы , Завелась немного хорошего тыквенного ореха, обжаренного в оливковом масле, немного огурца, немного шпината и риса и несколько белых бобов. Это было НАМНОГО больше наполнения и удовлетворения, чем супы, и сделало последние пару дней совершенно безболезненными. Я все еще использовал все остальное из коробки - я пью и чаи и ореховые батончики.\n\nМне нравится, что этот продукт существует. Это делает это супер легко. Я бы порекомендовал сделать это хотя бы один раз перед тем, как делать что-либо, если вы можете себе это позволить. Это берет все догадки из этого.\n\nАма, я думаю!","title":"Только что закончил мой первый раунд Пролон","subreddit_name_prefixed":"r/FMD","ups":19,"created":1566476200,"link_flair_background_color":"","id":"cts9nv","author":{"name":"MissPredicament"},"permalink":"/r/FMD/comments/cts9nv/just_finished_my_first_round_of_prolon/","url":"https://www.reddit.com/r/FMD/comments/cts9nv/just_finished_my_first_round_of_prolon/","created_utc":1566447400,"replies":[{"ups":2,"link_id":"t3_cts9nv","id":"eyigagk","author":"DoctorRuddy","parent_id":"t3_cts9nv","subreddit_id":"t5_3il0m","body":"I'm on Day 3 of my 4th cycle of FMD.  I, too, have grown tired of the soup.  I tried to hack my way into a DIY version of Prolon's FMD, but it's very tricky to do anything but approximate it.  Actually, I'm working on designing an at-home version of FMD, but that will take a bit of work.  You see, I appreciate the 30 years of research that Longo put into designing FMD for use by the general public.  I've no doubt that every micro and molecule in the 5-day Prolon formulation is backed by an Everest-pile of supporting data.  For instance, the two hibiscus tea bags, one spearmint tea bag, and one spearmint/lemon tea bag on Days 2-5 are there for a reason (or several), yet it's not clear just why.  So, as I move ahead to design an at-home hack of FMD I am mindful that Longo has all the scientific and clinical data at hand and we can only extrapolate from what's on the ingredient list of our little soup and snack packets to try to get to where he \"lives and rocks\" on his amazing breakthrough.  As a bridge between the mind-numbing diet of increasingly boring dried soup twice a day for five days, I've added the following extremely low-carb additions that bring a bit of zing and sparkle to the mix:  a small handful of home-dehydrated kale and basil leaves, a minced clove of garlic, a cup of fresh mushrooms, sea salt, and pepper.  That seems to do the trick.  But, I have to say, that I look forward to cracking the code for an at-home hack, not just to save money - that's not a trivial issue - but because I'm certain, and I'm confident that Longo would agree, that fresh food contains more nutrients and provides more energy than all that dried and compacted \"stuff\" - even if the Prolon \"stuff\" is scientifically sound and credible.  Now, on to solving the at-home FMD puzzle.  Coming soon.  Would appreciate all feedback.  Doc","body_html":"<div class = \"md\"> <p> У меня третий день четвертого цикла ящура. Я тоже устал от супа. Я попытался взломать свой собственный вариант FMD от Prolon, но очень сложно сделать что-либо, кроме приблизительного. На самом деле, я работаю над созданием домашней версии версии ящура, но это займет немного работы. Видите ли, я ценю 30 лет исследований Лонго, направленных на разработку ящура для широкой публики. Я не сомневаюсь, что каждая микро и молекула в 5-дневном препарате Prolon подкреплена кучей подтверждающих данных Эвереста. Например, два чайных пакетика из гибискуса, один пакетик чая из мяты и один пакетик чая из мяты / лимона в дни 2-5 есть по какой-то причине (или несколько), но неясно, почему. Так что, когда я продвигаюсь вперед в разработке домашнего взлома ящура, я не забываю, что Лонго располагает всеми научными и клиническими данными, и мы можем только экстраполировать то, что в списке ингредиентов наших маленьких суповых и закусочных пакетов, чтобы попытаться добраться туда, где он «живет и качается» на своем удивительном прорыве. В качестве связующего звена между ошеломляющей диетой, состоящей из все более скучного сухого супа два раза в день в течение пяти дней, я добавил следующие добавки с чрезвычайно низким содержанием углеводов, которые привносят в смесь немного остроты и блеска: небольшая горстка домашних обезвоженная капуста и листья базилика, измельченный зубчик чеснока, чашка свежих грибов, морская соль и перец. Это, кажется, делает трюк. Но я должен сказать, что я с нетерпением жду взлома кода для домашнего взлома, не только для того, чтобы сэкономить деньги - это не тривиальная проблема - но потому, что я уверен, и я уверен, что Лонго согласится Эта свежая пища содержит больше питательных веществ и обеспечивает больше энергии, чем все высушенные и уплотненные «продукты», даже если «материал» Prolon является научно обоснованным и заслуживающим доверия. Теперь, чтобы решить домашнюю загадку ящура. Скоро будет. Буду признателен за все отзывы. Doc </p>\n</DIV>","permalink":"/r/FMD/comments/cts9nv/just_finished_my_first_round_of_prolon/eyigagk/","name":"t1_eyigagk","created":1567130863,"created_utc":1567102063,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":1,"link_id":"t3_cts9nv","id":"ey792q6","author":"YallABunchaAssholes","parent_id":"t3_cts9nv","subreddit_id":"t5_3il0m","body":"did the weight stay off for you?","body_html":"<div class = \"md\"> <p> вес для вас не изменился? </p>\n</DIV>","permalink":"/r/FMD/comments/cts9nv/just_finished_my_first_round_of_prolon/ey792q6/","name":"t1_ey792q6","created":1566904075,"created_utc":1566875275,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":1,"link_id":"t3_cts9nv","id":"f0lrvj0","author":"hvypilot","parent_id":"t3_cts9nv","subreddit_id":"t5_3il0m","body":"What weight were you when starting?","body_html":"<div class = \"md\"> <p> Какой у вас был вес при запуске? </p>\n</DIV>","permalink":"/r/FMD/comments/cts9nv/just_finished_my_first_round_of_prolon/f0lrvj0/","name":"t1_f0lrvj0","created":1568756756,"created_utc":1568727956,"subreddit_name_prefixed":"r/FMD","depth":0}]}