{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"[object Object][object Object][object Object][object Object][object Object][object Object][object Object][object Object][object Object][object Object]","title":"Сравнение DIY FMD (5d) с обычным постом (4d)","subreddit_name_prefixed":"r/FMD","ups":18,"created":1571446495,"link_flair_background_color":"","id":"djqb0w","author":{"name":"verysmallbluebird"},"permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/","url":"https://www.reddit.com/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/","created_utc":1571417695,"replies":[{"ups":2,"link_id":"t3_djqb0w","id":"f4863xm","author":"jubjub07","parent_id":"t3_djqb0w","subreddit_id":"t5_3il0m","body":"Great write up, thanks!\n\nI'm on a similar path...\n\nMonth 1 I did the real Prolon kit FMD\n\nMonth 2 I did the real Prolon kit FMD\n\nMonth 3 I did a 5 day WCT only (Water, coffee (black), and Tea) fast\n\nDidn't feel much difference between the three, except the WCT only felt longer.   I'm in a deeper ketosis on the WCT version - which makes sense.\n\nI also kept my normal exercise schedule - I bike intensely (90 min) twice a week, Moderate+long (3+ hours) once a week and very easy (90 min) once or twice a week.  I do resistance training for 1 hour 3x a week.\n\nI did dial down the intensity of the exercise a bit.  5th day, was lacking the top end power in each fasting period, again, makes total sense.\n\nThrough the three cycles I've lost about 12-15 pounds (still waiting for the rebound from the last cycle to settle out).  I'm pretty pleased with how easy that's gone.\n\nBetween Month 2 and Month 3 I maintained a 18/6 Time restricted eating pattern.\n\nHad my blood-work done just before Month 3, and it was pretty much perfect... will have it done next week as I've just concluded month 3, for comparison.\n\nI'll probably take a break for November, but I plan to continue until with TRE and FMD until I hit my goal weight - about 15 more pounds to go...\n\nThanks again!","body_html":"<div class = \"md\"> <p> Отлично, пишите, спасибо! </p>\n\n<p> Я нахожусь на аналогичном пути ... </p>\n\n<p> Месяц 1 я сделал настоящий набор Prolon FMD </p>\n\n<p> Месяца 2 я сделал настоящий набор Prolon FMD </p>\n\n<p> Месяц 3 Я провел только 5-дневный WCT (вода, кофе (черный) и чай) быстро </p>\n\n<p> Разницы между ними не было, за исключением того, что ДАП чувствовал себя только дольше. Я нахожусь в более глубоком кетозе на версии WCT - что имеет смысл. </P>\n\n<p> Я также сохранил свой обычный график тренировок - я интенсивно езжу на велосипеде (90 минут) два раза в неделю, умеренный + продолжительный (3+ часа) один раз в неделю и очень легкий (90 минут) один или два раза в неделю. Я тренируюсь с отягощениями в течение 1 часа 3 раза в неделю. </P>\n\n<p> Я немного понизил интенсивность упражнения. На 5-й день не хватало максимальной мощности в каждом посте, опять же, имеет смысл. </P>\n\n<p> За три цикла я потерял около 12-15 фунтов (все еще ожидая восстановления после последнего цикла). Я очень доволен тем, как легко все прошло. </P>\n\n<p> Между 2-м и 3-м месяцами я придерживался режима питания, ограниченного по времени 18/6. </p>\n\n<p> Моя кровная работа была сделана незадолго до 3-го месяца, и она была в значительной степени идеальной ... сделаю это на следующей неделе, как я только что завершил 3-й месяц, для сравнения. </p>\n\n<p> Я, вероятно, сделаю перерыв на ноябрь, но я планирую продолжать с TRE и FMD, пока не достигну своего целевого веса - еще около 15 фунтов вперед ... </p>\n\n<p> Еще раз спасибо! </p>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4863xm/","name":"t1_f4863xm","created":1571461892,"created_utc":1571433092,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":2,"link_id":"t3_djqb0w","replies":[{"ups":1,"link_id":"t3_djqb0w","id":"f4l9vl5","author":"jubjub07","parent_id":"t1_f4hj5ps","subreddit_id":"t5_3il0m","body":"He did a Q&A on his facebook page on Sunday (10/20/19) where he did claim that it had better results and sort of asked people not to mess around with water only fasts.  I'll try to go back and catch the replay where he says this - he didn't get too specific, but my take away is that he believes FMD performs better.\n\nLink to video:   [https://www.facebook.com/profvalterlongo/videos/415422885828251/](https://www.facebook.com/profvalterlongo/videos/415422885828251/)","body_html":"<div class = \"md\"> <p> В воскресенье (20.10.19) он сделал вопрос и ответ на своей странице в Facebook, где он утверждал, что это дает лучшие результаты, и как-то просил людей не возиться с водой только постами. , Я попытаюсь вернуться и поймать повтор, где он говорит это - он не стал слишком конкретным, но мое мнение состоит в том, что он считает, что ящур работает лучше. </P>\n\n<p> Ссылка на видео: <a href=\"https://www.facebook.com/profvalterlongo/videos/415422885828251/\"> https://www.facebook.com/profvalterlongo/videos/415422885828251/ </a> </р>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4l9vl5/","name":"t1_f4l9vl5","created":1571693126,"created_utc":1571664326,"subreddit_name_prefixed":"r/FMD","depth":2}],"id":"f48lmfq","author":"ElHoser","parent_id":"t3_djqb0w","subreddit_id":"t5_3il0m","body":"Doesn't Longo make the claim the FMD has better results than water only fasting?","body_html":"<div class = \"md\"> <p> Разве Лонго не заявляет, что ящур имеет лучшие результаты, чем голодание только водой? </p>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f48lmfq/","name":"t1_f48lmfq","created":1571470946,"created_utc":1571442146,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":1,"link_id":"t3_djqb0w","id":"f4882e4","author":"nikterian","parent_id":"t3_djqb0w","subreddit_id":"t5_3il0m","body":"Thanks for the info","body_html":"<div class = \"md\"> <p> Спасибо за информацию </p>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4882e4/","name":"t1_f4882e4","created":1571462777,"created_utc":1571433977,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":1,"link_id":"t3_djqb0w","replies":[{"ups":1,"link_id":"t3_djqb0w","id":"f4butcn","author":"slimeskunk","parent_id":"t1_f4adt50","subreddit_id":"t5_3il0m","body":"OK, wow. interesting. thanks clarifying.\nand you are first one I’ve read of the gut biome issue. Not found it on any of the famous doctors etc , such as Fung. And he has many fasting tips.\n\nTo be clear, this is NOT me doubting you. Rather, something I feel you discovered (or I’ve missed).","body_html":"<div class = \"md\"> <p> Хорошо, вау. интересный. спасибо, проясняю.\nи вы первый, кого я прочитал о проблеме кишечного биома. Не найдено ни на одном из известных врачей и т. Д., Таких как Fung. И у него есть много постов. </P>\n\n<p> Чтобы быть ясным, это не я сомневаюсь в тебе. Скорее, то, что я чувствую, вы обнаружили (или я пропустил). </P>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4butcn/","name":"t1_f4butcn","created":1571547671,"created_utc":1571518871,"subreddit_name_prefixed":"r/FMD","depth":2},{"ups":1,"link_id":"t3_djqb0w","id":"f4lhvzy","author":"jubjub07","parent_id":"t1_f4adt50","subreddit_id":"t5_3il0m","body":"I found exactly the same thing after my first FMD cycle.  Went from eating red meat every day to dead stop.  Just a lack of desire.","body_html":"<div class = \"md\"> <p> Я обнаружил то же самое после первого цикла ящура. Пошел от еды красного мяса каждый день до полной остановки. Просто отсутствие желания. </P>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4lhvzy/","name":"t1_f4lhvzy","created":1571696022,"created_utc":1571667222,"subreddit_name_prefixed":"r/FMD","depth":2}],"id":"f4a1npu","author":"slimeskunk","parent_id":"t3_djqb0w","subreddit_id":"t5_3il0m","body":"Great write up. You mentioned going from not tolerating plants on refeed because of gut biome, to not tolerate meat?\n\nI understand the plants. What’s the meat issue?","body_html":"<div class = \"md\"> <p> Отлично, напишите. Вы упомянули о том, что вы отказываетесь от непереносимых растений из-за кишечного биома, чтобы не переносить мясо? </P>\n\n<p> Я понимаю растения. В чем проблема мяса? </P>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4a1npu/","name":"t1_f4a1npu","created":1571516424,"created_utc":1571487624,"subreddit_name_prefixed":"r/FMD","depth":0},{"ups":1,"link_id":"t3_djqb0w","replies":[{"ups":1,"link_id":"t3_djqb0w","id":"f4u87q0","author":"wild_vegan","parent_id":"t1_f4tm6cq","subreddit_id":"t5_3il0m","body":"Interesting, thanks. I was kind of wondering if you'd eat more calories than you need to kind of rebuild, or if you just go back to whatever you want to eat. I think it makes sense that you wouldn't be as hungry at first (ketosis reduces appetite, plus stomach gets a new relationship with food), I know I wasn't, but that could be partly because I cheated on one of the days. Oops. It also makes sense to emphasize protein on the refeeding days.","body_html":"<div class = \"md\"> <p> Интересно, спасибо. Мне было интересно, будете ли вы есть больше калорий, чем нужно для восстановления, или вы просто вернетесь к тому, что хотите съесть. Я думаю, что имеет смысл, что сначала вы не будете так голодны (кетоз снижает аппетит, плюс желудок получает новые отношения с едой), я знаю, что нет, но это может быть отчасти потому, что я изменял в один из дней , К сожалению. Также имеет смысл подчеркнуть белок в дни кормления. </P>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4u87q0/","name":"t1_f4u87q0","created":1571830566,"created_utc":1571801766,"subreddit_name_prefixed":"r/FMD","depth":2}],"id":"f4eh8wg","author":"wild_vegan","parent_id":"t3_djqb0w","subreddit_id":"t5_3il0m","body":"Definitely a great write up, thanks for taking the time.\n\nI've only tried the FMD once. I think I'll do a slightly gentler one next time. I definitely see the benefit of keeping the gut biome happy.\n\nIf I may ask, do you do anything special for refeeding other than keeping your protein intake higher? And is that only for one day? The refeeding is something I may have missed in looking over Longo's work.","body_html":"<div class = \"md\"> <p> Определенно отличная статья, спасибо, что нашли время. </p>\n\n<p> Я только один раз попробовал ящур. Я думаю, что в следующий раз сделаю немного мягче. Я определенно вижу выгоду от поддержания кишечного биома счастливым. </P>\n\n<p> Если я могу спросить, делаете ли вы что-то особенное для повторного кормления, кроме того, чтобы поддерживать повышенное потребление белка? И это только на один день? Повторное кормление - то, что я, возможно, упустил, просматривая работу Лонго. </P>\n</DIV>","permalink":"/r/FMD/comments/djqb0w/comparing_diy_fmd_5d_to_straightup_fasting_4d/f4eh8wg/","name":"t1_f4eh8wg","created":1571586682,"created_utc":1571557882,"subreddit_name_prefixed":"r/FMD","depth":0}]}