{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Просто небольшое обновление, о котором я хотел сообщить в День 6 - Переходный день, следуя пятидневному протоколу ProLon.\n\nЯ делал фотографии до и после. Лучший способ описать это было бы чуть менее пухлым: руки, ноги, живот, лицо - все это выглядит немного более обученным. Это супер минор - ничто, что кто-нибудь остановит меня, чтобы сказать: «Эй, что отличается?». И я полностью согласен с этим. Не ожидал серьезных изменений в течение пяти дней, так что, во всяком случае, я думаю, что это здоровое улучшение менее чем за неделю.\n\nНа 6-й день я проснулся со своим обычным стаканом лимонной воды с порошком супер-зелени, затем выпил чашку кофе и затем отправился в спортзал. После этого, протеиновый напиток веганский, и на обед протеиновый коктейль шпинат-ягодно-бананово-веганский (все это звучит так чисто, когда я набираю его, но действительно чувствую себя так снисходительно LOL).\nПоздно днем ​​у меня была миска супа мисо с рисовой лапшой, а вечером несколько простых начос и сальса - все было довольно мягко.\n\nСамым большим выводом для меня было признание того, как мало еды на самом деле нужно, чтобы чувствовать себя насыщенным, и истинный голод против голода от скуки. Кроме того, есть веганский в течение почти недели было очень приятно. Я всеядный, который в прошлом был вегетарианцем и в течение последних двух лет неуклонно сокращал животный белок - это подтолкнуло меня немного дальше в этом направлении.\n\nЯ также поражаюсь той огромной энергии, которая у меня была на протяжении всего процесса. Я понимаю, что, возможно, тяжелая гимнастика не рекомендуется, но для меня это сработало: это то, что помогло мне почувствовать себя «нормально», придерживаясь диеты, которая сильно отличается от того, как я обычно ем. По общему признанию, это могло также сыграть роль в моем следующем пункте ...\n\nНе было достаточно информации о головной боли / «кето-гриппе» / чем бы это ни было: я могу принять и понять, что у людей будут разные физиологические реакции на радикальные изменения в диете. Я бы ожидал этого. Я понимаю, что это быстрое, своего рода очищение, но я действительно чувствовал, что частью моего дискомфорта было то, что мое тело было истощено электролитами от непрерывного питья воды и чая. Поверьте мне, когда я говорю, что я очень сильно пью воду в обычный день, но это было чрезмерно. Конечно, ProLon, возможно, не защищает чрезмерное потребление воды, но это способ справиться с голодом, и поэтому я хотел бы добавить еще одну добавку в мою воду, чтобы компенсировать это.\n\nС другой стороны, это мог быть просто переход моего тела от сжигания углеводов в качестве топлива к сжиганию жира. У меня нет возможности узнать, так ли это, но этих головных болей было достаточно, чтобы помешать мне снова пройти через это. Если это было в «кетозе», я не хочу возвращаться.\n\nВ конечном итоге для меня лучшие части ProLon немного переориентировали мое тело, и я понял, что на самом деле могу это сделать. Я когда-нибудь упоминал, что пять дней, которые я выбрал для своего поста, совпали с пятью днями, когда мой муж уехал в гольф? Это был законный ключ к моему успеху! Через месяц или около того я могу попробовать несколько дней в одиночку, и если я это сделаю, я вернусь сюда, чтобы написать еще раз.\n\nСпасибо всем за внимание!","title":"ProLon Day 6 - Переходный день (отложенный отчет!)","subreddit_name_prefixed":"r/FMD","ups":12,"created":1574547276,"link_flair_background_color":"","id":"e0idbf","author":{"name":"Sweetmona1"},"permalink":"/r/FMD/comments/e0idbf/prolon_day_6_transition_day_delayed_report/","url":"https://www.reddit.com/r/FMD/comments/e0idbf/prolon_day_6_transition_day_delayed_report/","created_utc":1574518476}