{"subreddit":{"display_name":"FMD"},"subreddit_loc":"FMD","selftext":"Это шестой день, и я рад сообщить, что прошел первый раунд ящура. Я застрял в программе, как клей! Честно говоря, я не был уверен, смогу ли я придерживаться этого, поэтому я очень рад, что успешно завершил. Это было сложно, но не слишком.\n\nЯ постился с собственной едой. Я нашел трекер электронных таблиц / питания на [genxlifeisgood.com]  (https://genxlifeisgood.com) , который я нашел очень полезным при планировании своей еды. Я съел 720 калорий в день 1 и около 600 калорий в дни 2-5. Я ел почти одинаковые продукты каждый день. Мои жиры были из сырого миндаля и авокадо. Мои углеводы были получены из тыквы и других овощей с низким содержанием белка. Я обычно ем вегетарианскую диету, но обычно она не чистая.\n\nМне 5'1 \"и 46 лет. В начале первого дня у меня было 119,2 фунта, а в начале шестого дня - 114,4 фунта, что привело к потере 4,8 фунта. Я вернусь через несколько дней, чтобы сообщить на пополнение и мой вес.\n\nВот разбивка моего опыта:\n\nДень 1 - Не так уж плохо. Очень голоден перед сном. Ел с 12:30 до 19:30. (Это было вообще мое окно кормления во все дни.)\n\nДень 2 - Легкая головная боль большую часть дня. Войлок просторный Определенно, был какой-то мозговой туман. Очень голодный. Самый тяжелый день для меня.\n\nДень 3 - Проснулся, чувствуя себя более бдительным. Немного головная боль большую часть дня. Голодный, но не голодный. Показания артериального давления на последующем приеме у моего ручного хирурга = 121/55. Интересно, что диастолическое давление было таким низким. Мое кровяное давление обычно находится в пределах нормы.\n\nДень 4 - Лучшая энергия и меньше головная боль. Чувствуй себя более опустошенным, чем голодным. Это был лучший день для меня!\n\nДень 5 - Еще один хороший день. Никакой головной боли и приличной энергии, пока я не достигну полуденного спада. Снова, чувствуя себя пустым, но не сумасшедшим голодным.\n\nМой сон был хорошим в течение пяти дней. Мои испражнения были меньше по объему, но в остальном нормальные (хотя у меня не было BM на 3-й день). Я был мотивирован сделать это, чтобы потерять несколько фунтов, убить некоторые плохие пристрастия / предпочтения в еде и, возможно, избавиться от розацеа на моем лице, которое постепенно ухудшалось за последние несколько месяцев. Честно говоря, я не вижу разницы в моей розацеа, но это только первый раунд. Я планирую сделать это снова - если не позже, то в январе 2020 года.\n\nСпасибо всем, кто внес свой вклад. Ваши посты помогли мне узнать, чего ожидать во время этого опыта!","title":"Результаты 1 раунда ящура - 46 лет. женский пол","subreddit_name_prefixed":"r/FMD","ups":9,"created":1574553337,"link_flair_background_color":"","id":"e0jm54","author":{"name":"SweetStillness"},"permalink":"/r/FMD/comments/e0jm54/fmd_round_1_results_46_yo_female/","url":"https://www.reddit.com/r/FMD/comments/e0jm54/fmd_round_1_results_46_yo_female/","created_utc":1574524537}