{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Простой пример: допустим, появляется транспортер, механизм которого фактически уничтожает пассажира и создает его клона (с памятью его жизни до 1 минуты назад) в новом месте. Все знают, как это работает.\n\nЧеловек А, придерживающийся традиционного определения себя (как непрерывного паттерна индивидуального сознания), приходит в ужас от мысли быть убитым и отказывается использовать транспортер.\n\nЧеловек Б, обладающий гораздо более гибкой онтологией, не думает, что это большая проблема - быть убитым (если он мгновенный и безболезненный). По его словам, использование транспортера не более, чем перерыв в работе, чем вздремнуть. Таким образом, он добровольно умирает без колебаний для удобства своего скоро существующего клона. Человек B и его клоны теперь имеют доступ к псевдопутешествиям, близким к скорости света, тогда как Человек A должен использовать традиционные методы передвижения.\n\nЧеловек B больше не может быть человеком по определению лица A. Он может быть чем-то другим. Серия клонов. Мерзость Я не философ. Я пропускаю вопрос о том, кто он, и вместо этого перехожу к рассмотрению того, какая система убеждений дает преимущество.\n\nКажется неоспоримым, что Человек В будет иметь огромное преимущество перед теми, кто не мыслит так, как он, во всех сферах. Выживание. Экономические. Сила. Это преимущество только возрастает, если учесть все связанные технологии, которые будут доступны в таком мире.\n\nТак скажите мне, ребята: вы бы использовали транспортер?","title":"Сильное предпочтение единственной, непрерывной непрерывности сознания было бы огромным недостатком.","subreddit_name_prefixed":"r/transhumanism","ups":25,"created":1543893858,"link_flair_background_color":"","id":"a2rz26","author":{"name":"slowmoon"},"permalink":"/r/transhumanism/comments/a2rz26/a_strong_preference_for_the_singular_unbroken/","url":"https://www.reddit.com/r/transhumanism/comments/a2rz26/a_strong_preference_for_the_singular_unbroken/","created_utc":1543865058}