{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я был трансгуманистом в течение нескольких лет, и я был рад видеть большой прогресс, достигнутый движением, но есть несколько вещей, которые волнуют меня, которые могут произойти в течение следующего десятилетия.\n\nВ последнее время я часто говорил, что я думаю, что трансгуманизм обладает таким большим потенциалом, чтобы добиться большого прогресса, чтобы положить конец ненужным страданиям в мире и сделать ранее сложные и / или опасные задачи тривиальными. Однако, хотя в следующем десятилетии может произойти много замечательных вещей, я также глубоко обеспокоен тем, как правительства отреагируют на эти новые события.\n\nХотя я думаю, что важно иметь ограничения на то, какие типы технологий могут быть разработаны, я также беспокоюсь о том, как некоторые государства могут использовать эти новые технологии для ведения войн, угнетения и распространения пропаганды. Будь то новые достижения в области искусственного интеллекта, кибернетические усовершенствования, невероятные новые медицинские технологии и множество других новых вещей, я думаю, что вполне вероятно, что все эти вещи могут быть использованы в своих интересах.\n\nНедавно я написал в этом подредакте о том, что одним из крупнейших рынков для этих новых технологий станет рынок военных технологий. С этими вещами превращаются в оружие войны или для других целей «Национальной обороны».\n\nПоэтому я скептически отношусь к тому, чтобы быстро и с готовностью привнести эти новые технологии в общество. Не потому, что я верю, что это опасные или плохие вещи, как я уже говорил, я полагаю, что от новых разработок, которые мы наблюдаем, может быть много преимуществ. Это потому, что я боюсь последствий правительств или вообще каких-либо групп, которые на самом деле используют эти вещи для пропаганды и применения идеологий с помощью войны или других средств.\n\nЯ не пишу это как способ препятствовать любым усилиям в трансгуманизме, но скорее, что мы должны знать и опасаться потенциальных злоупотреблений властью, которые могут возникнуть в результате этих фантастических новых технологий различными группами.","title":"Некоторые заботы о будущем","subreddit_name_prefixed":"r/transhumanism","ups":21,"created":1543960500,"link_flair_background_color":"","id":"a30v4v","author":{"name":"Esoteric_Innovations"},"permalink":"/r/transhumanism/comments/a30v4v/some_concerns_about_the_future/","url":"https://www.reddit.com/r/transhumanism/comments/a30v4v/some_concerns_about_the_future/","created_utc":1543931700}