{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Мы думаем о трансгуманизме как о выгодном для его последствий расширения жизни, но для того, чтобы на самом деле создать политический климат, в котором трансгуманизм пропагандируется мировыми правительствами, мы должны доказать, что это экономически и социально осуществимо. Общие аргументы против трансгуманизма вращаются вокруг экономических осложнений радикального продления жизни, таких как:\n\n- Разве богатые и власть не используют это, чтобы остаться у власти?\n\n- не будет ли проблема перенаселения?\n\n- не будет ли нехватка ресурсов по проблеме?\n\n- Разве пенсионные и социальные фонды не будут, потому что невозможно дорого?\n\nЯ не согласен, что эти проблемы будут стоять на пути; скорее, я думаю, что трансгуманистическое общество на самом деле было бы обществом, которое * решило * эти проблемы.\n\nПодумайте, какие предположения вы можете сделать в отношении общества, в котором средняя продолжительность жизни составляет 300 человек. Что можно предположить? Можно предположить, что технологические и инженерные способности значительно более продвинуты, очевидно, поскольку то, что сейчас невозможно, сейчас является нормой. Это почти наверняка выйдет за рамки биоинженерии и медицинских технологий; В таком обществе были бы достигнуты успехи в производстве энергии, сельском хозяйстве, транспорте и т. д. Такое общество также нуждалось бы в гораздо большей политической и социальной сплоченности, в противном случае необходимая реализация любой технологии, расширяющей жизнь, была бы невозможной.\n\nИтак, рассмотрим 4 контрпункта выше:\n\n > Разве богатые и власть не используют это, чтобы остаться у власти?\n\nВозможно, но в худшем случае это ничем не отличается от того, что есть сегодня. Вместо того, чтобы жить в низшем классе и умирать в 80, вы будете жить в низшем классе в более чистом и здоровом мире и умрете 300. В лучшем случае у людей будет больше шансов подняться по социальной лестнице. Люди не будут сдерживаться проблемами со здоровьем (которые будут вылечены), и общее экономическое состояние, скорее всего, будет лучше.\n\nЯ расскажу о трех других в двух частях: ресурсы, перенаселение, социальное обеспечение и т. Д. Разве это не будет невозможной проблемой для преодоления? Нет, на самом деле все будет наоборот.\n\nВо-первых, люди, живущие и оставшиеся биологически молодыми гораздо дольше, будут «лучше» для экономики, потому что теперь люди остаются в своем первичном производительном состоянии гораздо дольше. Рассмотрим время, проведенное в школе и на пенсии в течение 80 лет; почти половина жизни людей тратится на чистую потерю ресурсов, а не на добычу ресурсов и уплату налогов (школа до 21 года, выход на пенсию в 65 лет). При 300-летней продолжительности жизни люди могут работать до 250 лет, поэтому большая часть жизни людей тратится на работу, производство и уплату налогов. Люди также будут здоровее, а это значит, что государство будет меньше расходов на здравоохранение. Кроме того, подумайте, как достижения в области производства и производства энергии могут улучшить экономику и сократить расходы.\n\nЧто касается ресурсов и проблем народонаселения, снова обращайтесь к улучшенным технологиям. Даже при населении в 7 миллиардов 99% земной массы не развито. Огромные пустыни и ледяные щиты лежат пустыми. Мы могли бы построить [плавающие города и фермы]  (https://imgur.com/a/WAvB3t0)  над океанами и стеклянными башнями для роста [вертикальные фермы] <span translate = \"нет\"> (https://imgur.com/a/6WKrOhq) </ SPAN>.\n\nТаким образом, экономические проблемы были бы значительно улучшены в посттрансгуманистическом мире.\n\nПримечание, мы действительно должны объединиться с r / transhuman. Нет смысла расщеплять сабвуферы и иметь больший центральный сабвуфер, что облегчит рост и увеличит видимость","title":"Трансгуманизм является ответом на политические и экономические проблемы.","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1544737775,"link_flair_background_color":"","id":"a5tnda","author":{"name":"BlueOrange22"},"permalink":"/r/transhumanism/comments/a5tnda/transhumanism_is_the_answer_to_political_and/","url":"https://www.reddit.com/r/transhumanism/comments/a5tnda/transhumanism_is_the_answer_to_political_and/","created_utc":1544708975}