{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я потратил много времени, думая о том, чтобы довести желания до крайности, как на личном, так и на философском уровне. Хороший пример проблем, которые это вызвало у меня, лежит в осознанных сновидениях; До того, как я смог осознать сон, я знал об этом долгое время и был очарован этим, искал надежный метод и тренировал свой ум, чтобы быть способным к этому одновременно. Это началось в детстве и заняло много лет. Теперь, будучи взрослым человеком, который достиг этого, я обнаружил, что это вызывает у меня больше стресса, чем удовольствия. Когда это начинается, или когда я думаю о том, что делать, и концептуальная реальность принадлежит мне на ночь, я чувствую, что ничто не настолько забавно по своей сути, что это стоит делать в мире, который полностью контролируется моими сознательными желаниями.\n\nПосле долгого размышления об этом я получил больше удовольствия от полусознательных снов, в которых я нахожусь в мире подсознательного творения и действую как я сам, и имею дело с ситуациями, когда они возникают, а не создаю ситуацию также.\n\nВот как это связано с трансгуманизмом:\n\nОдной из основных целей, определяющих различные фракции сторонников, является продление жизни, конечной целью которой является постоянная жизнь. Однако, на мой взгляд, последствия этого очень схожи с наличием свободы, которую приносит вам осознанное сновидение, и, следовательно, могут сделать жизнь менее воспринимаемой ценностью - или быть \"особенной\" - чем когда мы живем с уверенностью возможная смерть\n\nПоразмыслив над потенциальными решениями в течение некоторого времени, мне пришло в голову, что одним из способов борьбы с этим будет ситуация, в которой ваше физическое тело живет вечно с совершенным здоровьем, но человечество изобретает способ перенести ваше сознание в различные предустановленные сценарии в что вы могли бы сделать, например, стереть свои знания об этом мире, находясь в программе, или как бы вы это ни называли (фанаты Рика и Морти вспоминают игру Роя). Это может быть как футуристическая форма Netflix или RPG-игр для тех, кто способен жить вечно, как таковой. Просто прыгайте через разные миры, заранее соглашаясь со сценарием, но не зная вашей реальной жизни, пока игра не будет завершена.\n\nЧто-то вроде бокового касания. Делая этот шаг дальше, подумав немного, я задаюсь вопросом: а что, если наши жизни уже такие? Или даже когда-нибудь стать таким? Было бы более правдоподобным думать, что кто-то может застрять в «игровой реальности» (то, что я хотел бы назвать их сейчас), преследуя вечную жизнь в вечной жизни, осуждая их добровольно и неосознанно в ловушке от их «реальной» жизни, пока тот не стал единственным реальным и, возможно, принял тот же поворот событий? Хотя я не хочу слишком увлекаться этим ...\n\nВ любом случае, что вы, ребята, думаете об этом? Мне интересно, думают ли люди, что это было бы жизнеспособным решением потенциальных мотивационных проблем с вечной жизнью, таким же образом, как я нашел утешение в полусознательных сновидениях, где я все еще ограничен, но поэтому становлюсь творческим и решаю проблемы по пути, вместо того, чтобы всегда знать, что я могу иметь или делать что-либо, что как бы побеждало меня, когда я действительно достиг этого.\n\n\n\n","title":"Осознанные сновидения и постоянное продление жизни","subreddit_name_prefixed":"r/transhumanism","ups":9,"created":1545147946,"link_flair_background_color":"","id":"a790nc","author":{"name":"nonchristiankristian"},"permalink":"/r/transhumanism/comments/a790nc/lucid_dreaming_and_permanent_life_extension/","url":"https://www.reddit.com/r/transhumanism/comments/a790nc/lucid_dreaming_and_permanent_life_extension/","created_utc":1545119146}