{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Совсем недавно я сильно заинтересовался трансгуманизмом, и один из них, который я считаю очень интересным, - это загрузка ума. Поскольку я очень новичок в этом вопросе и все еще занимаюсь собственным исследованием, мне интересно, может ли кто-нибудь из моих собратьев иметь больше информации о перспективном исследовании возможности загрузки мыслей. Главный вопрос, который у меня есть, заключается в том, возможно ли с научной точки зрения перевести сознание человеческого мозга в искусственное тело, или это будет больше похоже на искусственный дубликат человеческого сознания? Или передовые нанотехнологии (синтетические стволовые клетки?) Могут быть использованы для «перезаписи» биологических клеток. Кроме того, проводится ли какое-либо исследование сенсорной информации с помощью искусственного интеллекта? Я могу видеть зрение (камеры), слух (микрофоны) и, возможно, касание (что-то похожее на сенсорные экраны, но это также может быть расширением технологии камеры). Однако идея искусственного запаха и вкуса кажется чрезвычайно сложной.\n\nЯ осознаю, что многие технологии, обсуждаемые в трансгуманистическом сообществе, могут звучать больше похоже на научную фантастику, чем на науку, но я думаю, что с той скоростью, с которой мы движемся вперед, технологический прогресс может привести к тому, что многие или, возможно, даже все эти технологии возможно в будущем (скорее всего отдаленный).\n\nЕсли у кого-то есть дополнительная информация, пожалуйста, не стесняйтесь поделиться.","title":"Есть ли многообещающие исследования в области загрузки мыслей, искусственных чувств и т. Д.?","subreddit_name_prefixed":"r/transhumanism","ups":9,"created":1546517105,"link_flair_background_color":"","id":"ac1qbe","author":{"name":"HomoSapiens91"},"permalink":"/r/transhumanism/comments/ac1qbe/is_there_any_promising_research_into_mind/","url":"https://www.reddit.com/r/transhumanism/comments/ac1qbe/is_there_any_promising_research_into_mind/","created_utc":1546488305}