{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"транс · Hu · человек · изма\n/ Tranzhyo͞omənizm /\nсуществительное\nвера или теория о том, что человеческая раса может эволюционировать за пределы своих нынешних физических и умственных ограничений, особенно посредством науки и техники.\n\nЧто меня больше всего беспокоит, так это то, что у вас есть три вечеринки. Вы могли бы действительно сделать это 2, но это лучше объясняет мою точку зрения с 3.\nПервая партия: сторонники.\nЗдесь просто есть люди, которые поддерживают движение трансгуманизма и обсуждают его.\nВторая сторона: полный отказ\nЗдесь есть люди, которые отвергают трансгуманизм как «старшего брата», шпионящего и «играющего в бога». Вы также можете назвать эту группу заговорщиками.\nТретья сторона: религиозные орешки\nВ основном они пытаются связать это с Книгой Бытия из-за небольшого сходства. Они проповедуют: «Армагеддон! Новая Вавилонская Башня! Судный день!\"\nПроблема, с которой я столкнулся, заключается в том, что, во-первых, у вас есть люди, которые не понимают основополагающего принципа трансгуманизма, и во-вторых, у вас есть люди, которые пытаются связать его с Библией любым возможным способом. Я хотел бы, чтобы люди могли просто понять это и не сразу сравнить это с игрой в бога, а старший брат всегда смотрит. Да, я признаю, что есть некоторые жуткие аспекты трансгуманизма, но основной принцип трансгуманизма заключается в улучшении человечества. Есть много примеров трансгуманизма в СМИ. «Измененный углерод» от Netflix (хотя это довольно мрачное изображение), грядущая игра Cyberpunk 2077. Даже в реальной жизни с ГМО (это отдельная дискуссия). Люди даже сами занимаются биоинженерией из дома! Вы можете буквально купить комплект CRISPR онлайн примерно за 170 долларов. То, что я думаю, пугает людей - это огромный потенциал трансгуманизма, и с ним идет этическая и неэтичная битва. Например, проектирование вашего ребенка в соответствии с вашими предпочтениями с помощью CRISPR или внедрение ложных воспоминаний, хранящихся на ленте (съешьте ваше сердце заговорщиками). Это может показаться подавляющим при рассмотрении в целом. Но правда в том, что он здесь, чтобы помочь, а не контролировать. Вы можете убежать от этого или отклонить его, но правда в том, что поезд трансгуманизма сильно пыхтит. Я надеюсь, что это, по крайней мере, заставит вас задуматься о трансгуманизме в новом свете или даже передумать.","title":"Люди не понимают трансгуманизм","subreddit_name_prefixed":"r/transhumanism","ups":18,"created":1546576774,"link_flair_background_color":"","id":"ac9xwl","author":{"name":"randommemoryaccess"},"permalink":"/r/transhumanism/comments/ac9xwl/people_dont_understand_transhumanism/","url":"https://www.reddit.com/r/transhumanism/comments/ac9xwl/people_dont_understand_transhumanism/","created_utc":1546547974}