{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Под трансгуманистическим Blogger (или vlogger) я имею в виду кого-то, пишущего о:\n\n1: Самоэксперименты (например, биохакерство)\n\n2: Системы жизнеобеспечения (как мобильные, так и стационарные).\n\n3: Рациональность\n\n4: Беспристрастность (например, прекращение страданий, стоицизм)\n\n5: Мозговые компьютерные интерфейсы\n\n6: Трансгуманистическая политика и активизм\n\n7: «Сделай сам» носимые улучшения (например, сенсорная замена, экзосюиты, электронные татуировки) или био-носки.\n\n8: Профилактическая медицина (например, предотвращение или ослабление старения)\n\n\nЯ работаю над трехуровневой системой коллективного интеллекта, которая облегчает и стимулирует экономически устойчивое создание СМИ, соединяя технопрогрессивистов и трансгуманистов через списки рассылки (это будет нижний слой). Люди, которые регистрируются в контакт-бюро, могут затем продвигаться (писать хорошо, не спамить) через зоны доверия, чтобы им доверяли больше адресов электронной почты (средний уровень).\n\nНаконец, мы реализуем процесс коллективной оптимизации для получения новых получателей, используя своего рода эволюционный алгоритм толпы (верхний уровень). Свяжитесь со мной напрямую, если вы хотите больше информации о волонтерстве для этого.\n\nВот ссылка на главную страницу, чтобы вы могли лучше понять, о чем я говорю.\n\nhttps://invardin.com/contact-office/\n\n> Добавьте свой адрес электронной почты в один из списков ниже, чтобы получать информацию по этой теме из техно-прогрессивной экосистемы. Войдите в зону доверия 1, и каждую субботу с 11 до 12 часов мы будем отправлять вам список адресов электронной почты в соответствии с наивысшим уровнем доверия, в котором вы находитесь.\n\n> Эта система предназначена для расширения техно-прогрессивного и трансгуманистического философского движения.\n\n> Присоединяйтесь к зонам доверия и продвигайтесь вперед, публикуя отличный контент (который можно монетизировать) и следя за тем, чтобы вы не нарушали наше доверие спамом получателей. По мере продвижения вверх вам будут доверять больше адресов электронной почты.\n\n\nРЕДАКТИРОВАТЬ: Я собираюсь перевести его в состояние «В стадии разработки», необходимо внести несколько изменений в формы.","title":"Любые трансгуманистические блоггеры / микроблоггеры (или люди, заинтересованные в создании блога)?","subreddit_name_prefixed":"r/transhumanism","ups":21,"created":1547250878,"link_flair_background_color":"","id":"aewp7o","author":{"name":"--Aeo--"},"permalink":"/r/transhumanism/comments/aewp7o/any_transhumanist_bloggersmicrobloggers_or_people/","url":"https://www.reddit.com/r/transhumanism/comments/aewp7o/any_transhumanist_bloggersmicrobloggers_or_people/","created_utc":1547222078}