{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"","title":"Что я ожидал от этого саба VS, что я нашел","subreddit_name_prefixed":"r/transhumanism","ups":376,"created":1548132552,"link_flair_background_color":"","id":"aieo8t","author":{"name":"velocibirb"},"permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/","url":"https://i.redd.it/ihebh9hr9ub21.jpg","created_utc":1548103752,"replies":[{"ups":84,"link_id":"t3_aieo8t","replies":[{"ups":14,"link_id":"t3_aieo8t","id":"eendtu2","author":"oliwhail","parent_id":"t1_een8p2c","subreddit_id":"t5_2qlii","body":"Это просто названия одной и той же группы, когда они выпускают свои мощные балладные альбомы в сравнении с альбомами с металлическим ядром.","body_html":"<div class = \"md\"> <p> Это просто названия одной и той же группы, когда они выпускают свои мощные балладные альбомы в сравнении с альбомами с металлическим ядром. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eendtu2/","name":"t1_eendtu2","created":1548138692,"created_utc":1548109892,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"een5kc7","author":"BoojumG","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"«Трагическая мясная машина» - это фантастика.\n\nТакже бесплатное название группы.","body_html":"<div class = \"md\"> <p> \"Трагическая мясная машина\" - это просто фантастика. </p>\n\n<p> Кроме того, бесплатное название группы. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een5kc7/","name":"t1_een5kc7","created":1548132989,"created_utc":1548104189,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":72,"link_id":"t3_aieo8t","replies":[{"ups":28,"link_id":"t3_aieo8t","replies":[{"ups":6,"link_id":"t3_aieo8t","replies":[{"ups":2,"link_id":"t3_aieo8t","replies":[{"ups":6,"link_id":"t3_aieo8t","id":"eery1ym","author":"CharlieNobody","parent_id":"t1_eerenfl","subreddit_id":"t5_2qlii","body":"Смысл должен состоять в том, чтобы изменить статус-кво, а не поддерживать его.","body_html":"<div class = \"md\"> <p> Смысл в том, чтобы перевернуть статус-кво, а не поддерживать его. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eery1ym/","name":"t1_eery1ym","created":1548290609,"created_utc":1548261809,"subreddit_name_prefixed":"r/transhumanism","depth":8},{"ups":4,"link_id":"t3_aieo8t","id":"eerwnlt","author":"Gozer45","parent_id":"t1_eerenfl","subreddit_id":"t5_2qlii","body":"Тогда зачем нам это делать, если это приведет к той же самой проблеме?\n\nЕсли просто позволить бедным умереть, это приведет к большому количеству погибших людей. Затем мы заменяем бедных новой группой людей. тогда они, вероятно, будут жить в ужасных условиях, пока не умрут.\n\n почему мы вообще это делаем?\n\nМальтузианские модели неоднократно доказывали, что они не верны, мы можем накормить всех. Мы просто нет.","body_html":"<div class = \"md\"> <p> Так зачем нам это делать, если это приведет к той же самой проблеме? </p>\n\n<p> Если просто позволить умереть бедным, это приведет к большому количеству погибших людей. Затем мы заменяем бедных новой группой людей. тогда они, вероятно, будут жить в ужасных условиях, пока не умрут. </p>\n\n<p> почему мы вообще это делаем? </p>\n\n<p> Мальтузианские модели неоднократно доказывали, что они не верны, мы можем накормить всех. Мы просто не делаем. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eerwnlt/","name":"t1_eerwnlt","created":1548289646,"created_utc":1548260846,"subreddit_name_prefixed":"r/transhumanism","depth":8}],"id":"eeq58tf","author":"CharlieNobody","parent_id":"t1_eeq3zql","subreddit_id":"t5_2qlii","body":"> Почему они должны быть цис белыми людьми, из ниоткуда. почти каждый имеет некоторый интерес к долголетию.\n\nЯ сказал, как правило, что вы смотрите на сторонников этих вещей, это имеет тенденцию быть правдой. Просто факт. Также это относится к той привилегии, о которой я говорил. Если вы богаты, белы и мужчины и не беспокоитесь о бедности, расизме, сексизме или других формах угнетения, у вас будет больше времени, чтобы остановиться на экзистенциальном страхе своей смерти.\n\n[И мы видим, что разрыв в ожидаемой продолжительности жизни между богатыми и бедными растет, а не сокращается] <span translate = \"no\"> (https://news.harvard.edu/gazette/story/2016/ 04 / пожизненным средняя продолжительность-денежные вопросы /) </ SPAN>. Это актуально для любого разговора о продлении жизни. Трансгуманизм должен учитывать политические и социальные условия, которые будут определять, кто получает и не получает эти технологии. Мы достигаем точки, когда богатые могут жить вечно, и мы достигаем социального коллапса из-за окружающей среды или чего-то еще, прежде чем бедные получат его. Если мы разрабатываем эту технологию, честное внедрение также должно быть разговором.\n\nИ дело не в том, что я не хочу жить вечно. Я делаю. Но я боюсь, что меня убьют (и я даже подвержен меньшему риску, чем многие транс-люди). ИЛИ никогда не восприниматься как кто я есть, подвергаясь дискриминации. Поэтому очевидно, что меня больше интересуют вещи, которые помогают мне жить так, как я хочу, и хочу подтолкнуть разговор, который нормализует людей, делающих все, что они хотят, с их телами.","body_html":"<div class = \"md\"> <blockquote>\n<p> почему они должны быть цис белыми людьми, из ниоткуда. почти каждый имеет некоторый интерес к долголетию. </p>\n</BLOCKQUOTE>\n\n<p> Я сказал, что, как правило, это то, что вы смотрите на сторонников этих вещей, это, как правило, правда. Просто факт. Также это относится к той привилегии, о которой я говорил. Если вы богаты, белы и мужчины и не беспокоитесь о бедности, расизме, сексизме или других формах угнетения, у вас будет больше времени, чтобы остановиться на экзистенциальном страхе своей смерти. </P>\n\n<p> <a href=\"https://news.harvard.edu/gazette/story/2016/04/for-life-expectancy-money-matters/\"> И мы наблюдаем увеличение разрыва в ожидаемой продолжительности жизни между богатые и бедные, которые растут, а не сокращаются </a>. Это актуально для любого разговора о продлении жизни. Трансгуманизм должен учитывать политические и социальные условия, которые будут определять, кто получает и не получает эти технологии. Мы достигаем точки, когда богатые могут жить вечно, и мы достигаем социального коллапса из-за окружающей среды или чего-то еще, прежде чем бедные получат его. Если мы разрабатываем эту технологию, честное внедрение также должно быть разговором. </P>\n\n<p> И дело не в том, что я не хочу жить вечно. Я делаю. Но я боюсь, что меня убьют (и я даже подвержен меньшему риску, чем многие транс-люди). ИЛИ никогда не восприниматься как кто я есть, подвергаясь дискриминации. Поэтому очевидно, что меня больше интересуют вещи, которые помогают мне жить так, как я хочу, и хочу подтолкнуть разговор, который нормализует людей, делающих то, что они хотят, для своего тела. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeq58tf/","name":"t1_eeq58tf","created":1548226377,"created_utc":1548197577,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eeq28ay","author":"CharlieNobody","parent_id":"t1_eeos7k9","subreddit_id":"t5_2qlii","body":"Моя единственная проблема в том, что есть привилегия, необходимая для того, чтобы бессмертие было вашей главной целью. Если вы бедны, угнетены, самоубийственно недовольны своим телом, изнурительно психически больны и т. Д., Жить вечно - не ваша главная забота. Пытаться достичь базового минимума безопасности и комфорта.\n\nСмерть не так страшна, когда жизнь дерьмо. Следовательно, почему так много одержимых бессмертием - это богатые люди среднего класса и цис-белых. Я понимаю аргумент, что более длинная жизнь дает больше возможностей для возможностей, но для некоторых это не так.\n\nВот почему трансгуманизм должен быть чем-то большим, чем то, во что превратился основной разговор: богатые капиталисты живут вечно и, мы надеемся, что они дойдут до всех нас до апокалипсиса.","body_html":"<div class = \"md\"> <p> Моя единственная проблема в том, что есть привилегия, необходимая для того, чтобы бессмертие было вашей главной целью. Если вы бедны, угнетены, самоубийственно недовольны своим телом, изнурительно психически больны и т. Д., Жить вечно - не ваша главная забота. Пытаться достичь базового минимума безопасности и комфорта. </Р>\n\n<p> Смерть не так страшна, когда жизнь дерьмо. Следовательно, почему так много одержимых бессмертием - это богатые люди среднего класса и цис-белых. Я понимаю аргумент, что более длинная жизнь дает больше возможностей для возможностей, но для некоторых это не так. </Р>\n\n<p> Вот почему трансгуманизм должен быть чем-то большим, чем просто превратился в общепринятый разговор: богатые капиталисты живут вечно, и, надеюсь, это просочится ко всем остальным до апокалипсиса. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeq28ay/","name":"t1_eeq28ay","created":1548224155,"created_utc":1548195355,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eenf70n","author":"CharlieNobody","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"> Да, я думаю, что они больше комментируют тот факт, что все транс-люди хотят создавать новые лучшие тела. В то время как население стран СНГ хочет улучшить уже имеющееся шасси, не понимая всех проблем с уже имеющимся шасси.\n\nХотя я транс-человек, я критиковал это сообщество целую вечность, даже отдельно от моей транс-личности. Когда я попал в hplus, я подумал, что речь идет о том, чтобы подвергать сомнению состояние человека, улучшать его и укреплять наши тела, раздвигая границы нашего воображения в стремлении пересмотреть то, что значит быть человеком. Если это означает генно-инженерные щупальца лица, ретроградный протез ноги кенгуру, поднятые животные, ИИ, что угодно, чем бы это ни было.\n\nОднако в последние годы разговор перешел к фанатам Кремниевой долины и типам Золтана Иштвана, где единственной темой, которая больше подходит, является бессмертие. В то время как продление жизни - важная цель, это, безусловно, самая легкая продажа и наименее интересная в широком смысле конструирования постчеловеческого существа. Современная медицина сама по себе имеет и уже вызывает продление жизни, но она не обязательно толкает человека в трансчеловека.","body_html":"<div class = \"md\"> <blockquote>\n<p> Да, я думаю, что они больше комментируют тот факт, что все транс-люди хотят создавать новые лучшие тела. Тогда как население стран СНГ хочет улучшить уже имеющееся шасси, не понимая всех проблем с уже имеющимся шасси. </P>\n</BLOCKQUOTE>\n\n<p> Хотя я и являюсь транс-человеком, я критиковал это сообщество целую вечность, даже отдельно от моей транс-личности. Когда я попал в hplus, я подумал, что речь идет о том, чтобы подвергать сомнению состояние человека, улучшать его и укреплять наши тела, раздвигая границы нашего воображения в стремлении пересмотреть то, что значит быть человеком. Если это означает генно-инженерные щупальца лица, ретроградный протез ноги кенгуру, поднятые животные, искусственный интеллект, что угодно, чем бы это ни было. </P>\n\n<p> Однако в последние годы разговор был перенят фанатами Силиконовой долины и типами Золтана Иштвана, где единственная тема, которая больше не возникает, - это бессмертие. В то время как продление жизни является важной целью, это, безусловно, самая простая и наименее интересная задача в широком смысле конструирования постчеловеческого существа. Современная медицина сама по себе имеет и уже вызывает продление жизни, но она не обязательно толкает человека в трансчеловека. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenf70n/","name":"t1_eenf70n","created":1548139693,"created_utc":1548110893,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":22,"link_id":"t3_aieo8t","replies":[{"ups":4,"link_id":"t3_aieo8t","id":"eeprb2n","author":"dolgfinnstjarna","parent_id":"t1_eeobi07","subreddit_id":"t5_2qlii","body":"Я предполагаю, что определенно возможно иметь по крайней мере несколько частей каждого пирога ...\n\n","body_html":"<div class = \"md\"> <p> Я думаю, что определенно возможно иметь хотя бы несколько кусочков каждого торта ... </p>\n\n<Р> </р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeprb2n/","name":"t1_eeprb2n","created":1548216595,"created_utc":1548187795,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eenf122","author":"Eth-0","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"Опять же, я возьму оба. Когда мне преподносят два торта, я не паникую из-за лучшего торта. У меня есть два торта!","body_html":"<div class = \"md\"> <p> Опять же, я возьму оба. Когда мне преподносят два торта, я не паникую из-за лучшего торта. У меня есть два торта! </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenf122/","name":"t1_eenf122","created":1548139571,"created_utc":1548110771,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":10,"link_id":"t3_aieo8t","id":"eenj6mp","author":"[deleted]","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"В краткосрочной перспективе использовать то, что уже разработано биологией и настраивать, будет намного проще, чем разрабатывать самоподдерживающиеся нанотехнологии. Я все за полное погружение в биологию, но я почти уверен, что у меня будут биологические возможности, прежде чем я смогу загрузить их в супер робот.","body_html":"<div class = \"md\"> <p> В краткосрочной перспективе использовать то, что биология уже создала и подправить, будет намного проще, чем создавать самоподдерживающиеся нанотехнологии. Я все для того, чтобы бросить биологию, но я почти уверен, что у меня будут биологические возможности, прежде чем я смогу загрузить их в супер робот. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenj6mp/","name":"t1_eenj6mp","created":1548142713,"created_utc":1548113913,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":3,"link_id":"t3_aieo8t","id":"eepr9vb","author":"dolgfinnstjarna","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"CisPerson здесь, я полностью хочу исправить все дерьмо, которое делает мое тело. А именно, необъяснимая деградация нервов, моя дерьмовая иммунная система решает, что ей не нравятся мои мышцы каждые несколько месяцев, и какая-то последовательность в моем видении, как будто я ослепла или нет?\n\n\nЯ не знаю, если это только я, но я полностью ищу способы исправить мою ужасную тюрьму из плоти (я краду это. Я использую это регулярно сейчас).","body_html":"<div class = \"md\"> <p> CisPerson здесь, я полностью хочу исправить все дерьмо, которое делает мое тело. А именно, необъяснимая деградация нервов, моя дерьмовая иммунная система решает, что ей не нравятся мои мышцы каждые несколько месяцев, и какая-то последовательность в моем видении, как будто я ослепла или нет? </Р>\n\n<p> Я не знаю, если это только я, но я полностью ищу способы починить мою ужасную тюрьму из плоти (я краду это. Я использую это регулярно сейчас). </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepr9vb/","name":"t1_eepr9vb","created":1548216571,"created_utc":1548187771,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":4,"link_id":"t3_aieo8t","id":"eeo3xyz","author":"Roadhog_Rides","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"Я - цис, и я думаю, что человеческое тело совершенно бесполезно.\n\nЯ думаю, что мы должны просто прекратить обобщать и осознать, что у всех нас есть разные представления о том, какой вклад может внести трансгуманизм. Нам нужно помнить, что мы должны быть открытыми и для других идей.","body_html":"<div class = \"md\"> <p> Я - цис, и я думаю, что человеческое тело совершенно бесполезно. </p>\n\n<p> Я думаю, что мы должны просто прекратить обобщать и осознать, что у всех нас есть разные представления о том, какой вклад может внести трансгуманизм. Нам нужно помнить, что нужно быть открытым для других идей. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeo3xyz/","name":"t1_eeo3xyz","created":1548159019,"created_utc":1548130219,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":3,"link_id":"t3_aieo8t","id":"eeormdg","author":"leeman27534","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"Честно говоря, хочется сказать, что транс-люди гораздо более открыты к идее более экстремальной модификации тела, чем обычный человек, это хорошо, но это, скорее, означает, что только потому, что кто-то является цис или кем-то еще, это не так. о целом пакете возможностей и о том, какие части говорят еще с одним, есть много стран СНГ, которые определенно готовы к обмену идеями по части тела, черт, некоторые, которые могут даже принять способность изменять гениталии, не чувствуя себя на самом деле транс и множество транс-людей, которые могут быть более заинтересованы в обновлении возможностей программного обеспечения, чем в аппаратном обеспечении, за исключением, возможно, своего пола.\n\nЭто почти как делать предположения о целой группе людей на основе ограниченной информации, особенно когда группы большие и относительно туманные по сравнению с более специфической (например, диабетическим трансгуманистом, почти уверенным, что они будут вынуждены отказаться от инсулиновой помпы в тело, скорее всего, не очень много разнообразия) обычно не работает, потому что удаление всех характеристик и индивидуальности, чтобы просто сгруппировать некоторых ублюдков, означает любое дальнейшее представление их как группы, которая не очень специфична для почему они в первую очередь группа (опять же, диабетики и инсулин) - это своего рода дезинформация, неточность и лень.\n\nно вот так работает человеческий разум, да.\n\nЯ склонен думать об этом больше как об аппаратном и программном обеспечении. некоторые люди могут сосредоточиться больше на возможностях своего тела и думать об этом больше как о своем «я» и, таким образом, возможно, сосредоточиться больше на его модификации (или просто кого-то с какой-либо формой дисфории тела), хотя это ни в коем случае не означает, что именно это или что-то иное, и некоторые люди больше сосредотачиваются на идее, что ум является существенным «я», а тело как бы облегчает доступ к миру, и хотели бы сосредоточиться на этом больше (вроде бы, где я сейчас, я как идея моддинга моего тела тоже, вроде как возможность летать только с ракетными конечностями, но на самом деле ощущать возможности реальной виртуальной реальности гораздо интереснее, чем просто изменять свою работу IRL Я имею в виду, что никакие настройки не сделают некоторые вещи реальностью, VR не совсем «реальность», в том же смысле, но это опыт)","body_html":"<div class = \"md\"> <p> честно говоря, хочется сказать, что транс-люди гораздо более открыты к идее более экстремальной модификации тела, чем обычный человек, это хорошо, но это скорее означает, что только потому, что кто-то является цис или чем-то еще, они не. о целом пакете возможностей и о том, какие части говорят еще с одним, есть много стран СНГ, которые определенно готовы к обмену идеями по части тела, черт, некоторые, которые могут даже принять способность изменять гениталии, не чувствуя себя на самом деле транс и множество транс-людей, которые могут быть более заинтересованы в обновлении возможностей программного обеспечения, чем в аппаратном обеспечении, за исключением, возможно, своего пола. </p>\n\n<p> Это почти похоже на предположения о целой группе людей, основанные на ограниченной информации, особенно когда группы большие и относительно туманные по сравнению с более конкретной (например, диабетическим трансгуманистом, вполне уверенным, что они будут инсулиновые помпы в организме, скорее всего, не очень много разнообразия), как правило, не работает, потому что удаление всех характеристик и индивидуальности, чтобы просто сгруппировать некоторых ублюдков, означает любое дальнейшее представление их как группы, что не очень в частности, почему группа (в первую очередь диабетики и инсулин) дезинформирована, неточна и ленива. </p>\n\n<p> но вот так работает человеческий разум, да. </p>\n\n<p> Я склонен думать об этом больше как об аппаратном и программном обеспечении. некоторые люди могут сосредоточиться больше на возможностях своего тела и думать об этом больше как о своем «я» и, таким образом, возможно, сосредоточиться больше на его модификации (или просто кого-то с какой-либо формой дисфории тела), хотя это ни в коем случае не означает, что именно это или что-то иное, и некоторые люди больше сосредотачиваются на идее, что ум является существенным «я», а тело как бы облегчает доступ к миру, и хотели бы сосредоточиться на этом больше (вроде бы, где я сейчас, я как идея моддинга моего тела тоже, вроде как возможность летать только с ракетными конечностями, но на самом деле ощущать возможности реальной виртуальной реальности гораздо интереснее, чем просто изменять свою работу IRL Я имею в виду, что никакие настройки не сделают некоторые вещи реальностью, VR не совсем «реальность», в том же смысле, но это опыт) </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeormdg/","name":"t1_eeormdg","created":1548190548,"created_utc":1548161748,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":3,"link_id":"t3_aieo8t","replies":[{"ups":2,"link_id":"t3_aieo8t","id":"eepnvib","author":"MemeticParadigm","parent_id":"t1_eepkqn2","subreddit_id":"t5_2qlii","body":"Я на 100% согласен с вашим примером, думаю, я бы просто поместил его в категорию «проблемы с существующим шасси, которые мы можем исправить», в том смысле, что мы могли бы добиться значительных улучшений, используя в основном тот же дизайн и просто исправляя то, что не наложил достаточно штрафов за эволюцию, чтобы избавиться от них.\n\nОдна из главных вещей, над которой моя лаборатория проводит исследования, - это использование эволюционных выравниваний для определения, когда вредные аллели у людей присутствуют с большей, чем ожидалось, частотой, потому что они на самом деле были адаптивными в древнем контексте по сравнению с другими причинами (то есть дрейфом или пребыванием в LD с слегка адаптивные аллели), так что это определенно концепция, с которой я знаком.","body_html":"<div class = \"md\"> <p> Я на 100% согласен с вашим примером. Полагаю, я бы просто отнес его к категории «проблемы с существующим шасси, которые мы можем исправить», так как мы могли бы добиться значительных улучшений с помощью используя в основном тот же дизайн и просто исправляя вещи, которые не налагали достаточно штрафов за физическую форму, чтобы эволюция не смогла избавиться. </p>\n\n<p> Одна из основных задач, которую проводит моя лаборатория, - это использование эволюционных выравниваний, чтобы определить, когда вредные аллели у человека присутствуют с большей, чем ожидалось, частотой, потому что они на самом деле были адаптивными в древнем контексте по сравнению с другими причинами (то есть дрейфом или существованием). в LD с слегка адаптивными аллелями), так что это определенно концепция, с которой я знаком. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepnvib/","name":"t1_eepnvib","created":1548214227,"created_utc":1548185427,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eepjpua","author":"MemeticParadigm","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"> Мне иногда интересно, понимают ли люди, насколько небрежны эволюции строителей и насколько неэффективны эволюционные процессы.\n\nЯ думаю, что это правильная точка зрения, но это не единственная действительная точка зрения, и, учитывая спектр потенциально значимых точек зрения, я думаю, что это довольно пессимистично.\n\nМногие эволюционные процессы неэффективны, потому что они избыточны, но эта избыточность дает им долговечность, которой обычно не хватает разработанным системам. Эволюционные процессы отлично справляются с катастрофическими событиями.\n\nМиллионы лет эволюции, через которые эволюционировали организмы, - это миллионы лет тестирования на ошибки. Когда вы разрабатываете что-то новое с нуля, ваши решения, несомненно, будут более эффективными, но они также будут уязвимы к тому факту, что вы не сможете придумать каждый крайний случай и протестировать его в нем перед выпуском.\n\nНедостаточно, чтобы новые системы были эффективными, они должны быть хрупкими, чтобы они могли не только нести повреждения без существенной потери функций, но и самостоятельно восстанавливаться после него, а также становиться более устойчивыми к будущим повреждениям в этих местах. И это гораздо сложнее, чем просто сделать что-то эффективное.\n\nНичто из этого не означает, что вы, по сути, ошибаетесь - как я уже сказал, вы предлагаете правильную перспективу - но я думаю, что мы должны отдать должное эволюции, когда это необходимо.","body_html":"<div class = \"md\"> <blockquote>\n<p> Иногда мне интересно, понимают ли люди, насколько небрежны эволюции строителей и насколько неэффективны эволюционные процессы. </p>\n</BLOCKQUOTE>\n\n<p> Я думаю, что это правильная перспектива, но это не единственная правильная перспектива, и, учитывая спектр потенциально допустимых перспектив, я думаю, что это довольно пессимистично. </p>\n\n<p> Многие эволюционные процессы неэффективны, потому что они избыточны, но эта избыточность дает им долговечность, которой обычно не хватает разработанным системам. Эволюционные процессы отлично справляются с катастрофическими событиями. </P>\n\n<p> Миллионы лет эволюции, через которые эволюционировали организмы, - это миллионы лет тестирования на ошибки. Когда вы разрабатываете что-то новое с нуля, ваши решения, несомненно, будут более эффективными, но они также будут уязвимы к тому факту, что вы не сможете придумать каждый крайний случай и протестировать его в нем перед выпуском. < / р>\n\n<p> Недостаточно, чтобы новые системы были эффективными, они должны быть хрупкими, чтобы они могли не только нести урон без существенной потери функции, но и самостоятельно восстанавливаться после него и становиться более устойчивыми к будущему урону в этих местах, и это гораздо более сложная задача, чем просто сделать что-то эффективное. </p>\n\n<p> Ничто из этого не говорит о том, что вы, по сути, ошибаетесь - как я уже сказал, вы предлагаете правильную перспективу - но я думаю, что мы должны отдать должное эволюции, где это необходимо. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepjpua/","name":"t1_eepjpua","created":1548211351,"created_utc":1548182551,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":1,"link_id":"t3_aieo8t","id":"eereh49","author":"MisanthropeX","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"> Да, я думаю, что они больше комментируют тот факт, что все транс-люди хотят создавать новые лучшие тела.\n\nА как насчет хвостов, кошачьих ушей и пурпурных волос делает их тела \"лучше\"? Это фактически эстетический выбор, основанный почти исключительно на культуре 21-го века (или насмешливо, из аниме).","body_html":"<div class = \"md\"> <blockquote>\n<p> Да, я думаю, что они больше комментируют тот факт, что все транс-люди хотят создавать новые лучшие тела. </Р>\n</BLOCKQUOTE>\n\n<p> А как насчет хвостов, кошачьих ушей и пурпурных волос делает их тела \"лучше\"? Это фактически эстетический выбор, основанный почти исключительно на культуре 21-го века (или насмешливо, из аниме). </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eereh49/","name":"t1_eereh49","created":1548273400,"created_utc":1548244600,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":-6,"link_id":"t3_aieo8t","replies":[{"ups":6,"link_id":"t3_aieo8t","id":"eeni6j2","author":"Gozer45","parent_id":"t1_eengiwl","subreddit_id":"t5_2qlii","body":"Спасибо.","body_html":"<div class = \"md\"> <p> Спасибо. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeni6j2/","name":"t1_eeni6j2","created":1548141937,"created_utc":1548113137,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eengbcr","author":"Malawi_no","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"Таким образом, чтобы иметь возможность получить лучшее тело для обитания, вам нужно сменить пол?","body_html":"<div class = \"md\"> <p> Итак, чтобы иметь возможность получить лучшее тело для обитания, вам нужно сменить пол? </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eengbcr/","name":"t1_eengbcr","created":1548140520,"created_utc":1548111720,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":-4,"link_id":"t3_aieo8t","replies":[{"ups":-2,"link_id":"t3_aieo8t","replies":[{"ups":1,"link_id":"t3_aieo8t","replies":[{"ups":1,"link_id":"t3_aieo8t","id":"eerwkk2","author":"Canadainghost","parent_id":"t1_eerv9lj","subreddit_id":"t5_2qlii","body":"Укажите, во что вы верите.\nОбращайтесь к каждой теме по частям.\n\nВы можете не осознавать, что не сказали или не задали вопрос, связанный с одной темой.\n\nJk - вы - то, что они называют препятствием, троллем или демоном, потому что ваш дух и намерение предназначены для того, чтобы мешать разговору и теме.\n\nЯ заметил эту картину с овцами плохого Шеппарда.\n\nОни избегают данных и становятся эмоциональными.\nКак бой или полет рептильной коры Обоснование\n\n1) Они избегают или отклоняют тему или информацию\n    \"Сумасшедший?\" «Наркотики» или «вставить эмоциональное оскорбление»\n    Теперь тема не обрабатывается мыслью\n\n2) Атакуйте мессенджер и избегайте сообщения\n    Попытка сменить разговорную тему на чистую ссору\n\n\n\nЭтот шаблон постоянен и запрограммирован.\n\nЕсть ли лучший способ контроля и промывания мозгов?\n\n1) Большой брат научит вас думать в школе, меньше о том, что вы знаете, больше о том, как вы обрабатываете информацию и учитесь\n\n2) «Большой брат», чем программирует вас на отклонение любых данных, не относящихся к «Большому брату», с использованием платежной системы Travistock, такой как созданный ЦРУ термин «теория заговора» или «поддельные новости» = отклоняйте информацию, стирайте мысли и не думайте о том, что период данных мал Сообщение от Big Bro ....\n\nВот несколько советов, которые я даю себе, и мне часто приходится напоминать себе.\n\nВсякий раз, когда я слышу или читаю новую информацию, и я чувствую, что становлюсь эмоциональным - я останавливаю себя и обрабатываю данные без эмоций, но без смещения логики.\n\nВсегда есть когнитивный диссонанс, но увы ..\n\nНадеюсь, это поможет.","body_html":"<div class = \"md\"> <p> Укажите, во что вы верите.\nОбращайтесь к каждой теме по частям. </P>\n\n<p> Возможно, вы не понимаете, что не сказали или не задали ни одного вопроса, связанного с темой. </p>\n\n<p> Jk - вы то, что они называют препятствием, троллем или демоном, потому что ваш дух и намерение предназначены для того, чтобы мешать разговору и теме. </p>\n\n<p> Я заметил эту картину с овцами плохого Шеппарда. </p>\n\n<p> Они избегают данных и становятся эмоциональными.\nКак бой или полет рептильной коры Обоснование </p>\n\n<p> 1) Они избегают или отклоняют тему или информацию\n    \"Сумасшедший?\" «Наркотики» или «вставить эмоциональное оскорбление»\n    Теперь, когда тема не обрабатывается мыслью </p>\n\n<p> 2) Атакуйте мессенджер и избегайте сообщения\n    Попытайтесь изменить разговорную тему на чистую ссору </p>\n\n<p> Этот шаблон является постоянным и запрограммированным. </p>\n\n<p> Есть ли лучший способ контролировать и промывать мозги? </p>\n\n<p> 1) Большой брат научит вас думать в школе, меньше о том, что вы знаете, больше о том, как вы обрабатываете информацию и учитесь </p>\n\n<p> 2) «Большой брат», чем программирует вас на удаление любых данных, не относящихся к «Большому брату», с использованием платежной системы Travistock, такой как созданный ЦРУ термин «теория заговора» или «поддельные новости» = игнорирует информацию, стирает мысли и не думает о том, что период данных мало один - сообщение от Биг Бро .... </p>\n\n<p> Вот несколько советов, которые я даю себе и которым часто приходится напоминать себе. </p>\n\n<p> Всякий раз, когда я слышу или читаю новую информацию, и я чувствую себя эмоциональным - я останавливаю себя и обрабатываю данные без эмоций, но без предвзятости. </Р>\n\n<p> Всегда есть когнитивный диссонанс, но увы .. </p>\n\n<p> Надеюсь, это поможет. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eerwkk2/","name":"t1_eerwkk2","created":1548289588,"created_utc":1548260788,"subreddit_name_prefixed":"r/transhumanism","depth":8}],"id":"eerthn0","author":"Canadainghost","parent_id":"t1_eepkb3e","subreddit_id":"t5_2qlii","body":"Конечно - я ищу мнения и дополнительные или корректирующие видения.\n\nСледящие с 2016 года\nПоддельные мечты\nСоседи киборга\n\nОбращаясь к радости неправедных","body_html":"<div class = \"md\"> <p> Конечно - я ищу мнения и дополнительные или корректирующие видения. </p>\n\n<p> Gangstalked с 2016 года\nПоддельные мечты\nСоседи киборга </p>\n\n<p> Обращаясь к радости неправедных </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eerthn0/","name":"t1_eerthn0","created":1548287406,"created_utc":1548258606,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eepccgf","author":"Canadainghost","parent_id":"t1_eep6z46","subreddit_id":"t5_2qlii","body":"Прогнозное программирование\nдезинформация\n\nЭти истории о мутировании нашей ДНК\nЛожные инопланетяне, высевающие землю\nДемоны и падшие ангелы\nАй и черные дыры\nБездна и бездонная яма\nТравма, основанная на управлении сознанием, прямо из книги Техника мертвых\nМагия ака психология\n\nРадость в неправедности\n\nТравма и страх до разрушения персоны\nСумасшедшее создание или создание скито\nGangstalk для киборга 5G ДНК мод\n\nБольшая группа в моем городе, в основном кто-то профилированный и желающий быть зорким / уши / темным комическим стукачом, чтобы молчать, отвлекать общественные голоса разума и смирения - микроуправление управляет помощником\n\nФеоникс - пепел - Единый мир - Люси - Трансгуманизм - Бытие 322 и т. Д.\n\nТройная спираль\nМаког наша плоть или ДНК мерзость\nНе могу подключиться к своему образу или разуму\nТак что замените интуицию синтетической версией\n\nОни изменили нашу ДНК с помощью наночастиц, которые расщепляются и запутываются в нашей генетике - добавляя хромосому и убирая Х ...\n\nБафомет дерьмо\n\nГрандиозный план пирамиды - электрический глаз\nНеоновый бог\nЧернила или акынет или принц воздуха - волны\nПоддельный бог с электрическим цифровым вездесущностью\n«Я повсюду», - говорит квантовый полет ИИ\nВсе вещи одновременно\n\nЯ верю, что конец игры, так как сатана не является создателем чего-либо, съест всю материю, такую ​​как Blob и Lego Man, программируемая материя, известная как реконструкция создания, как будто это был Бог.\n\nНо Бог знал, что время пришло, и оставил нам чаевые и жилой мануал для дома, мы знаем это, потому что его пророчество всегда верно, поэтому он получил свой отпечаток Подлинности.\n\nура","body_html":"<div class = \"md\"> <p> Прогнозирующее программирование\nДезинформация </p>\n\n<p> Эти истории о мутировании нашей ДНК\nЛожные инопланетяне, высевающие землю\nДемоны и падшие ангелы\nАй и черные дыры\nБездна и бездонная яма\nТравма, основанная на управлении сознанием, прямо из книги Техника мертвых\nМагия ака психология </p>\n\n<p> Радость в неправедности </p>\n\n<p> Травма и страх до разрушения личности\nСумасшедшее создание или создание скито\nGangstalk для киборга 5G ДНК-мод </p>\n\n<p> Большая группа в моем городе, в основном все, кто профилирован и желает быть зорким / уши / темным комическим стукачом, чтобы молчать, отвлекать общественные голоса разума и смирения - микроуправление управляет помощником </p>\n\n<p> Феоникс - пепел - Единый мир - Люси - трансгуманизм - генезис 322 и т. д. </p>\n\n<p> Тройная спираль\nМаког наша плоть или ДНК мерзость\nНе могу подключиться к своему образу или разуму\nТак что замените интуицию синтетической версией </p>\n\n<p> Они изменили нашу ДНК с помощью наночастиц, которые расщепляются и запутываются в нашей генетике - добавляя хромосому и убирая Х ... ..... </p>\n\n<p> Бафомет дерьмо </p>\n\n<p> Чем грандиозный план пирамиды - электрический глаз\nНеоновый бог\nЧернила или акынет или принц воздуха - волны\nПоддельный бог с электрическим цифровым вездесущностью\n«Я повсюду», - говорит квантовый полет ИИ\nВсе вещи за один раз </p>\n\n<p> Я верю, что конец игры, так как сатана не является создателем ничего, съест всю материю, такую ​​как Blob и Lego Man, программируемая материя, известная как реконструкция создания, как будто это был Бог. </p>\n\n<p> Но Бог знал, что время пришло и оставило нам чаевые и жилой мануал для дома, мы знаем это, потому что его пророчество всегда верно, поэтому оно получило его печать Подлинности. </p>\n\n<Р> Приветствия </р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepccgf/","name":"t1_eepccgf","created":1548206255,"created_utc":1548177455,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eeotm8j","author":"Canadainghost","parent_id":"t1_een84f3","subreddit_id":"t5_2qlii","body":"Это о ДНК нано мутации в конце\nВот почему потоп - наша ДНК была превращена в мерзость - отсюда все прогностические программы, позволяющие принять змея и высмеять правду, известную как христианское пророчество.\n\nИ Бог обнаружил, что всякая плоть была испорчена и никакая плоть не выжила бы без возвращения создателя. Это мы ломаем завесу.\n\nАй ака абаддон это скайнет\nАка Образ Зверя, который ожил\nАка Инк \"однажды ты перезвонишь мне палкой\"\n\nПоддельный вездесущий неоновый цифровой Бог\n\nПисьмо по всем стенам\nПророчество было предсказано настоящим создателем, и, поскольку пророчество вне времени - его законность.\n\nНайди Иисуса и твоя кровь защищена\nМашинка контролирует больше всего я знаю\nОни видят, как Бэтмен\nУслышь свой внутренний голос\nПолный период демонов","body_html":"<div class = \"md\"> <p> Это о ДНК нано мутации в конце\nВот почему потоп - наша ДНК была превращена в мерзость - отсюда все прогностические программы, позволяющие принять змея и высмеять правду, известную как христианское пророчество. </P>\n\n<p> И Бог обнаружил, что всякая плоть была испорчена, и никакая плоть не выжила бы без возвращения создателя. Это мы ломаем завесу. </P>\n\n<p> Ai aka abaddon - это скайнет\nАка Образ Зверя, который ожил\nАка Инк \"однажды ты перезвонишь мне палкой\" </p>\n\n<p> Поддельный вездесущий неоновый цифровой Бог </p>\n\n<p> Письмо повсюду на стенах\nПророчество было предсказано настоящим создателем, и, поскольку пророчество вне времени - его законность. </P>\n\n<p> Найди Иисуса, и твоя кровь защищена\nМашинка контролирует больше всего я знаю\nОни видят, как Бэтмен\nУслышь свой внутренний голос\nПолный период демонов </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeotm8j/","name":"t1_eeotm8j","created":1548192455,"created_utc":1548163655,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"een5khy","author":"Acherus29A","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Мол, вы можете абсолютно оба! Все они довольно увлекательны! Ничто не мешает вам и в физическом, и в умственном увеличении!","body_html":"<div class = \"md\"> <p> Например, вы можете иметь оба! Все они довольно увлекательны! Ничто не мешает вам и в физическом, и в умственном увеличении! </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een5khy/","name":"t1_een5khy","created":1548132992,"created_utc":1548104192,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":31,"link_id":"t3_aieo8t","id":"eenhf09","author":"JCreazy","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Почему не оба? В этом весь смысл трансгуманизма. Не ограничивая себя.","body_html":"<div class = \"md\"> <p> Почему не оба? В этом весь смысл трансгуманизма. Не ограничивая себя. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenhf09/","name":"t1_eenhf09","created":1548141355,"created_utc":1548112555,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":29,"link_id":"t3_aieo8t","id":"eena7oo","author":"FeepingCreature","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Устали: улучшать тела.\n\nПроводные: устаревшие тела.\n\nПомимо шутки, морфологическая свобода должна быть основным правом, но для практичности.","body_html":"<div class = \"md\"> <p> Устали: улучшать тела. </p>\n\n<p> Проводная связь: устаревшие тела. </p>\n\n<p> Помимо шутки, морфологическая свобода должна быть основным правом, но для практичности. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eena7oo/","name":"t1_eena7oo","created":1548136145,"created_utc":1548107345,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":22,"link_id":"t3_aieo8t","replies":[{"ups":8,"link_id":"t3_aieo8t","replies":[{"ups":6,"link_id":"t3_aieo8t","replies":[{"ups":2,"link_id":"t3_aieo8t","id":"eerqwe7","author":"GoGoZombieLenin","parent_id":"t1_eer7t90","subreddit_id":"t5_2qlii","body":"Я проверю это. Как вы можете видеть из моего комментария, я довольно непредубежден и не воспринимаю пол всерьез. В vrchat я попробовал симпатичную девушку-аниме (как и все остальные), и она действительно ничего не сделала для меня. Это интересный фенономнон, что все эти парни на врчат хотят быть симпатичными аниме девушками. Они все транс? Я думаю, что их слишком много. Как будто это действительно абсурдно, сколько парней имеют эти аватары, но лично моя реакция была «Мех, это ничего не делает для меня».\n\nЕсли бы я определил, что это гендерный собеседник или что-то в этом роде, это была бы в основном эгоистичная попытка быть более привлекательной для женщин, склонных к гендерному насилию.","body_html":"<div class = \"md\"> <p> Я проверю это. Как вы можете видеть из моего комментария, я довольно непредубежден и не воспринимаю пол всерьез. В vrchat я попробовал симпатичную девушку-аниме (как и все остальные), и она действительно ничего не сделала для меня. Это интересный фенономнон, что все эти парни на врчат хотят быть симпатичными аниме девушками. Они все транс? Я думаю, что их слишком много. Как будто это действительно абсурдно, сколько парней имеют эти аватары, но лично моя реакция была «Мех, это ничего не делает для меня». </P>\n\n<p> Если бы я идентифицировал себя как гендера или что-то в этом роде, это была бы в основном эгоистичная попытка быть более привлекательной для женщин, склонных к гендерному насилию. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eerqwe7/","name":"t1_eerqwe7","created":1548285524,"created_utc":1548256724,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eepoeir","author":"GoGoZombieLenin","parent_id":"t1_eep72ts","subreddit_id":"t5_2qlii","body":"Да, я не думаю, что цис-транс вещь такая же четкая. Я считаю себя цис. У меня нет проблем с дисфорией, но я также не настолько привязан к своей мужественности, и если бы у меня был выбор временно иметь женское тело, я бы полностью его принял, просто чтобы посмотреть, на что похож секс, и испытать на себе женщину. оргазмы чувствуют себя хорошо и т. д. Все это действительно очень искренне.\n\nРедактировать: Случайный вопрос: Если бы я идентифицировал себя как гендерный собеседник или что-то еще, было бы легче связываться с горячими гендерными бендерами a la / r / bois?","body_html":"<div class = \"md\"> <p> Да, я не думаю, что цис-транс настолько прост. Я считаю себя цис. У меня нет проблем с дисфорией, но я также не настолько привязан к своей мужественности, и если бы у меня был выбор временно иметь женское тело, я бы полностью его принял, просто чтобы посмотреть, на что похож секс, и испытать на себе женщину. оргазмы чувствуют себя хорошо и так далее. Честно говоря, все это действительно извращенно. </p>\n\n<p> Редактировать: Случайный вопрос: Если бы я определил, что гендерный собеседник или что-то еще, это облегчило бы связь с горячими гендерными обманщиками а-ля <a href=\"/r/bois\"> / r / bois </a>? </р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepoeir/","name":"t1_eepoeir","created":1548214595,"created_utc":1548185795,"subreddit_name_prefixed":"r/transhumanism","depth":4},{"ups":2,"link_id":"t3_aieo8t","id":"eeprfsf","author":"dolgfinnstjarna","parent_id":"t1_eep72ts","subreddit_id":"t5_2qlii","body":"Гендерно-апатичный мой любимый термин в связи с этим. Я мужчина? Я женщина? Я тоже? Я оба? Это имеет значение?","body_html":"<div class = \"md\"> <p> Гендерно-апатичный мой любимый термин в связи с этим. Я мужчина? Я женщина? Я тоже? Я оба? Имеет ли это значение? </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeprfsf/","name":"t1_eeprfsf","created":1548216686,"created_utc":1548187886,"subreddit_name_prefixed":"r/transhumanism","depth":4},{"ups":2,"link_id":"t3_aieo8t","id":"eeq6sry","author":"LordJupiter213","parent_id":"t1_eep72ts","subreddit_id":"t5_2qlii","body":"Возможно, они только снг, потому что им не нужно срочно менять пол? Интересный вопрос, но я думаю, что есть разница между небрежным вопросом, каково это быть противоположным полом, и фактическим чувством необходимости стать этим полом. Лично для себя я задавался вопросом, каково это быть противоположным полом, и если технология была проще в использовании и имела несколько недостатков, я почти наверняка сменил пол на какое-то время, просто чтобы посмотреть, на что это похоже. Но я не чувствую себя неловко от секса, которым я уже занимаюсь, просто потому, что мне любопытно, и поэтому я идентифицирую себя как сис.","body_html":"<div class = \"md\"> <p> Возможно, они только снг, потому что им не нужно срочно менять пол? Интересный вопрос, но я думаю, что есть разница между небрежным вопросом, каково это быть противоположным полом, и фактическим чувством необходимости стать этим полом. Лично для себя я задавался вопросом, каково это быть противоположным полом, и если технология была проще в использовании и имела несколько недостатков, я почти наверняка сменил пол на какое-то время, просто чтобы посмотреть, на что это похоже. Но я не чувствую себя неловко от секса, которым я уже занимаюсь, просто потому, что мне любопытно, и поэтому я идентифицирую себя как цис. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeq6sry/","name":"t1_eeq6sry","created":1548227542,"created_utc":1548198742,"subreddit_name_prefixed":"r/transhumanism","depth":4},{"ups":2,"link_id":"t3_aieo8t","id":"eerbxi9","author":"nikfra","parent_id":"t1_eep72ts","subreddit_id":"t5_2qlii","body":"Это некоторые интересные моменты, и я действительно думал о них. Я бы сказал, что я cis, потому что я доволен полом, который мне назначили при рождении, и я не хотел бы постоянно его менять. Причины, по которым я бы сменила пол, заключаются в том, что я хотела бы получить более глубокое понимание того, что чувствуют женщины. Есть также причины, по которым я не думаю, что было бы правильно называть себя чем-то, кроме цис. Я никогда не испытывал ничего плохого из-за своего пола и чувствую, что «присваивать» ярлык типа «квир» или «транс» было бы неправильно и проливать свет на людей, которые действительно испытывали трудности.","body_html":"<div class = \"md\"> <p> Это некоторые интересные моменты, и я действительно подумал о них. Я бы сказал, что я cis, потому что я доволен полом, который мне назначили при рождении, и я не хотел бы постоянно его менять. Причины, по которым я бы сменила пол, заключаются в том, что я хотела бы получить более глубокое понимание того, что чувствуют женщины. Есть также причины, по которым я не думаю, что было бы правильно называть себя чем-то, кроме цис. Я никогда не испытывал ничего плохого из-за своего пола и чувствую, что «присвоение» ярлыка типа «квир» или «транс» было бы неправильным и пролил свет на людей, которые действительно испытывали трудности.\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eerbxi9/","name":"t1_eerbxi9","created":1548269361,"created_utc":1548240561,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eeokntf","author":"nikfra","parent_id":"t1_eeo5hs8","subreddit_id":"t5_2qlii","body":"Я - цис, и я хотел бы сменить пол на ограниченное количество времени. Просто потому, что мне действительно интересно, как выглядит мир с другой стороны. Я могу спрашивать женщин об их переживаниях сто раз, но они всегда будут отличаться от того, что они на самом деле испытывают.","body_html":"<div class = \"md\"> <p> Я цис, и я хотел бы поменять свой пол на ограниченное количество времени. Просто потому, что мне действительно интересно, как выглядит мир с другой стороны. Я могу спрашивать женщин об их переживаниях сто раз, но они всегда будут отличаться от того, что они на самом деле испытывают. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeokntf/","name":"t1_eeokntf","created":1548181034,"created_utc":1548152234,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eenfox0","author":"2Punx2Furious","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Почему не оба? Я мог бы не хотеть менять свой член или получать сиськи, но обмен глазами, конечностями и так далее, было бы чертовски круто.\nНо да, улучшение работы моего мозга, пожалуй, самое большое для меня, кроме лечения старения и болезней.","body_html":"<div class = \"md\"> <p> Почему не оба? Возможно, я не захочу менять свой член или получать сиськи, но менять глаза, конечности и т. Д. Было бы чертовски круто. <br/>\nНо да, улучшение работы моего мозга, пожалуй, самое важное для меня, кроме лечения старения и болезней. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenfox0/","name":"t1_eenfox0","created":1548140057,"created_utc":1548111257,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":18,"link_id":"t3_aieo8t","id":"eenfw5s","author":"TDaltonC","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"К тому времени, когда у нас появятся «реально работающие кошачьи уши», люди, которые к ним относятся, будут теми же людьми, которые сегодня действительно хотят оптимизировать питательную суспензию.\n\n\nКроме того, используются ли здесь цис и транс для обозначения гендерной идентичности / биологии или что-то еще?","body_html":"<div class = \"md\"> <p> К тому времени, когда у нас появятся \"реально работающие кошачьи уши\", люди, которые к ним относятся, будут теми же людьми, которые сегодня действительно хотят оптимизировать питательную суспензию. </Р>\n\n<p> Кроме того, используются ли здесь цис и транс для обозначения гендерной идентичности / биологии или что-то еще? </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenfw5s/","name":"t1_eenfw5s","created":1548140205,"created_utc":1548111405,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":6,"link_id":"t3_aieo8t","id":"eeoa2o7","author":"SirReality","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Так что это интересно, я на самом деле знаю Twitter OP из старшекурсника, и я врач, работающий в клинике, в которую она ходит. Она потрясающий человек!","body_html":"<div class = \"md\"> <p> Так что это интересно, я на самом деле знаю твиттер OP из старшекурсника, и я врач, работающий в клинике, в которую она ходит. Она потрясающий человек! </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeoa2o7/","name":"t1_eeoa2o7","created":1548164999,"created_utc":1548136199,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":6,"link_id":"t3_aieo8t","id":"eeo8fqp","author":"myRoommateDid","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Я просто хочу быть улей наномашины","body_html":"<div class = \"md\"> <p> Я просто хочу быть ульем с наномашинами </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeo8fqp/","name":"t1_eeo8fqp","created":1548163249,"created_utc":1548134449,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":6,"link_id":"t3_aieo8t","id":"eeoodq7","author":"undeadalex","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Зачем кому-то тратить впустую жиры на Javascript","body_html":"<div class = \"md\"> <p> Зачем кому-то тратить время на разработку сценариев Java </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeoodq7/","name":"t1_eeoodq7","created":1548186979,"created_utc":1548158179,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":5,"link_id":"t3_aieo8t","id":"eeotwgh","author":"UchihaDrew","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Я все о морфологической свободе. Давай!","body_html":"<div class = \"md\"> <p> Я все о морфологической свободе. Принеси это! </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeotwgh/","name":"t1_eeotwgh","created":1548192707,"created_utc":1548163907,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":34,"link_id":"t3_aieo8t","replies":[{"ups":15,"link_id":"t3_aieo8t","replies":[{"ups":14,"link_id":"t3_aieo8t","replies":[{"ups":8,"link_id":"t3_aieo8t","id":"eenh9sx","author":"2Punx2Furious","parent_id":"t1_eenefnt","subreddit_id":"t5_2qlii","body":"Насколько я понимаю, повышенный риск самоубийства у трансгендерных людей вызван психическим расстройством, вызванным дисфорией, а не самим переходом. Во всяком случае, переход смягчил бы симптомы дисфории, уменьшив риск самоубийства.","body_html":"<div class = \"md\"> <p> Насколько я понимаю, повышенный риск самоубийства у транссексуалов вызван психическим расстройством, вызванным дисфорией, а не самим переходом. Во всяком случае, переход облегчил бы симптомы дисфории, уменьшив риск самоубийства. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenh9sx/","name":"t1_eenh9sx","created":1548141246,"created_utc":1548112446,"subreddit_name_prefixed":"r/transhumanism","depth":6},{"ups":9,"link_id":"t3_aieo8t","id":"eeng5o5","author":"oliwhail","parent_id":"t1_eenefnt","subreddit_id":"t5_2qlii","body":"Видишь, единственная проблема с этим - ты врешь. Переход снижает уровень самоубийств.\n\nВы, вероятно, собираетесь связать статью, в которой хирург-трансфобист лежит о результатах исследования. Я бы посоветовал вам не делать этого, и я настоятельно рекомендую вам прочитать фактические результаты.","body_html":"<div class = \"md\"> <p> Видишь, единственная проблема в том, что ты врешь. Переход снижает уровень самоубийств. </P>\n\n<p> Вероятно, вы собираетесь связать статью, в которой хирург-трансфобист лежит о результатах исследования. Я бы посоветовал вам не делать этого, и я настоятельно рекомендую вам прочитать фактические результаты. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeng5o5/","name":"t1_eeng5o5","created":1548140400,"created_utc":1548111600,"subreddit_name_prefixed":"r/transhumanism","depth":6},{"ups":8,"link_id":"t3_aieo8t","id":"eeng4bd","author":"velocibirb","parent_id":"t1_eenefnt","subreddit_id":"t5_2qlii","body":"[Основной причиной суицидальности у трансгендеров является трансфобия. ]  (https://news.utexas.edu/2018/03/30/name-use-matters-for-transgender-youths-mental-health/)  Вот пример о том, как принятие может уменьшить суицидальные мысли в транс-юности.","body_html":"<div class = \"md\"> <p> <a href=\"https://news.utexas.edu/2018/03/30/name-use-matters-for-transgender-youths-mental-health/\"> Основной причиной суицидальности у трансгендеров является трансфобия. </a> Вот пример того, как принятие может уменьшить суицидальные мысли у транс-молодежи. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeng4bd/","name":"t1_eeng4bd","created":1548140371,"created_utc":1548111571,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eene5vi","author":"oliwhail","parent_id":"t1_eend2ro","subreddit_id":"t5_2qlii","body":"Он имеет чистые положительные результаты. Мы установили это довольно точно. И, в отдельности, использование вами слова «эволюционировать» является абсолютно неправильным в техническом смысле и абсолютно неуместным для дискуссий о трансгуманизме, потому что мы заботимся о разработке, а не об эволюции.","body_html":"<div class = \"md\"> <p> Чистые положительные результаты. Мы установили это довольно точно. И, в отдельности, использование вами слова «эволюционировать» является в корне неверным в техническом смысле и совершенно неуместным для обсуждения трансгуманизма, потому что мы заботимся о разработке, а не об эволюции. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eene5vi/","name":"t1_eene5vi","created":1548138935,"created_utc":1548110135,"subreddit_name_prefixed":"r/transhumanism","depth":4},{"ups":11,"link_id":"t3_aieo8t","replies":[{"ups":8,"link_id":"t3_aieo8t","id":"eengnsc","author":"oliwhail","parent_id":"t1_eenfsg7","subreddit_id":"t5_2qlii","body":"Оооо, так что, когда вы принимаете психическое заболевание, мы должны его уважать?","body_html":"<div class = \"md\"> <p> Оооо, так что когда <em> вы </em> принимаете психическое заболевание, мы должны его уважать? </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eengnsc/","name":"t1_eengnsc","created":1548140779,"created_utc":1548111979,"subreddit_name_prefixed":"r/transhumanism","depth":6},{"ups":4,"link_id":"t3_aieo8t","id":"eeng2uc","author":"CharlieNobody","parent_id":"t1_eenfsg7","subreddit_id":"t5_2qlii","body":"Ну, я верю в нейтрально-гендерного бога, который все еще не говорит другим людям, как жить, и все ценности были изобретены психически больными людьми, тролль. :)","body_html":"<div class = \"md\"> <p> Ну, я верю в нейтрально-гендерного бога, который все еще не говорит другим людям, как жить, и все ценности были изобретены психически больными людьми, тролль. :) </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeng2uc/","name":"t1_eeng2uc","created":1548140340,"created_utc":1548111540,"subreddit_name_prefixed":"r/transhumanism","depth":6},{"ups":3,"link_id":"t3_aieo8t","replies":[{"ups":2,"link_id":"t3_aieo8t","id":"eenwjll","author":"TheTotnumSpurs","parent_id":"t1_eenv0ae","subreddit_id":"t5_2qlii","body":"Предположим, что на секунду мы буквально воспринимаем перевод тысячелетней истории на английский язык, пожалуйста, укажите, где в Книге Бытия «мужчина» и «женщина» определяют как имеющие отношение к гениталиям или хромосомам.","body_html":"<div class = \"md\"> <p> Предполагая, что на секунду мы буквально воспринимаем английский перевод тысячелетней истории, укажите, где в Бытии он определяет «мужчина» и «женщина» как имеющие отношение к гениталии или хромосомы. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenwjll/","name":"t1_eenwjll","created":1548153153,"created_utc":1548124353,"subreddit_name_prefixed":"r/transhumanism","depth":8}],"id":"eens8l3","author":"TheTotnumSpurs","parent_id":"t1_eenfsg7","subreddit_id":"t5_2qlii","body":"Пожалуйста, покажите мне:\n\n1) Где в Библии это определяет «мужчина» и «женщина».\n\n2) Один единственный пример трансгуманистического мышления из любой точки Библии.\n\nВы одновременно предлагаете, чтобы мы держали людей «так, как задумал Бог», а также рубили людей, чтобы улучшить их, используя технологии. Эти две мысли взаимоисключающие.","body_html":"<div class = \"md\"> <p> Пожалуйста, покажи мне: </p>\n\n<p> 1) Где в Библии определены «мужчина» и «женщина». </p>\n\n<p> 2) Один единственный пример трансгуманистического мышления из любой точки Библии. </Р>\n\n<p> Вы одновременно предлагаете, чтобы мы держали людей «так, как задумал Бог», а также рубили людей, чтобы улучшить их, используя технологии. Эти две мысли взаимоисключающие. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eens8l3/","name":"t1_eens8l3","created":1548149853,"created_utc":1548121053,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eenffp5","author":"CharlieNobody","parent_id":"t1_eend2ro","subreddit_id":"t5_2qlii","body":"Какое скучное видение постчеловеческого характера вы должны себе представить, что все еще существуют только два пола, с которыми люди сталкиваются при рождении, и ограниченная ваша вера в трансгуманизм должна быть против морфологической свободы.","body_html":"<div class = \"md\"> <p> Как скучно видение постгуманизма, вы должны представить, что все еще существует только два пола, с которыми люди сталкиваются при рождении, и ограниченная ваша вера в трансгуманизм должна быть против морфологической свободы. </р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenffp5/","name":"t1_eenffp5","created":1548139869,"created_utc":1548111069,"subreddit_name_prefixed":"r/transhumanism","depth":4},{"ups":5,"link_id":"t3_aieo8t","id":"eenh1ot","author":"2Punx2Furious","parent_id":"t1_eend2ro","subreddit_id":"t5_2qlii","body":"Вы явно не продумали это до конца. Как вы думаете, почему трансгендерные люди совершают свои переходы, если не получают положительного результата? Речь идет не о «развитии», а об улучшении человеческого организма, в этом случае, чтобы чувствовать себя лучше и иметь лучшую жизнь, что и является определением трансгуманизма.","body_html":"<div class = \"md\"> <p> Вы явно не продумали это. Как вы думаете, почему трансгендерные люди совершают свои переходы, если не получают положительного результата? Речь идет не о «развитии», а об улучшении человеческого организма, в этом случае, чтобы чувствовать себя лучше и иметь лучшую жизнь, что и является определением трансгуманизма. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenh1ot/","name":"t1_eenh1ot","created":1548141072,"created_utc":1548112272,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eencrz0","author":"velocibirb","parent_id":"t1_een9dp3","subreddit_id":"t5_2qlii","body":"Если «накачивать» ваше тело гормонами (чувак, это крошечные таблетки) и «калечить» ваше тело (хирургическая технология - лучшее, что когда-либо было) не считается для вас трансгуманизмом, я не уверен, какое определение трансгуманизм вы используете. Кроме того, нет необходимости быть придурком.","body_html":"<div class = \"md\"> <p> Если «накачивать» ваше тело гормонами (чувак, это крошечные таблетки) и «калечить» ваше тело (хирургические технологии - лучшее, что когда-либо было), это не считается трансгуманизмом для вас, я не уверен, какое определение трансгуманизма вы используете. Кроме того, нет необходимости быть придурком. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eencrz0/","name":"t1_eencrz0","created":1548137945,"created_utc":1548109145,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":7,"link_id":"t3_aieo8t","id":"eenfk1j","author":"LoL420FukBoi69","parent_id":"t1_een9dp3","subreddit_id":"t5_2qlii","body":"Неправильный саб парень. Трансгуманизм обладает морфологической свободой. Трансгендерные люди - одна из немногих групп, которые сегодня практикуют трансгуманизм","body_html":"<div class = \"md\"> <p> Неправильный парень. Трансгуманизм обладает морфологической свободой. Трансгендерные люди - одна из немногих групп, которые сегодня практикуют трансгуманизм </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenfk1j/","name":"t1_eenfk1j","created":1548139958,"created_utc":1548111158,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":11,"link_id":"t3_aieo8t","id":"een9qg0","author":"SubjectOmega","parent_id":"t1_een9dp3","subreddit_id":"t5_2qlii","body":"Вы точно не в том сабе. А также полный мудак.","body_html":"<div class = \"md\"> <p> Вы точно не в той подпункте. А также полный мудак. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een9qg0/","name":"t1_een9qg0","created":1548135801,"created_utc":1548107001,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"een6h9w","author":"velocibirb","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Лично я считаю, что мой опыт транс-женщины по своей сути трансгуманистичен. Если я использую технологии, чтобы изменить свое тело, чтобы облегчить дисфорию, почему бы не использовать технологии, чтобы сделать мое тело лучше? Дай мне Доку дополнительные конечности!","body_html":"<div class = \"md\"> <p> Лично я считаю, что мой опыт транс-женщины по своей сути трансгуманистичен. Если я использую технологии, чтобы изменить свое тело, чтобы облегчить дисфорию, почему бы не использовать технологии, чтобы сделать мое тело лучше? Дай мне Доку дополнительные конечности! </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een6h9w/","name":"t1_een6h9w","created":1548133587,"created_utc":1548104787,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":8,"link_id":"t3_aieo8t","id":"een514s","author":"rogan1234","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Yeet.","body_html":"<div class = \"md\"> <p> Yeet. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een514s/","name":"t1_een514s","created":1548132647,"created_utc":1548103847,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":3,"link_id":"t3_aieo8t","id":"eepd621","author":"TechnoL33T","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Я хочу кошачьи уши сегодня.","body_html":"<div class = \"md\"> <p> Я хочу кошачьи уши сегодня. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepd621/","name":"t1_eepd621","created":1548206826,"created_utc":1548178026,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aieo8t","id":"eeoiwwy","author":"Night_Nin3","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Чувак, я не могу дождаться, чтобы изменить свои органы и передать механику.","body_html":"<div class = \"md\"> <p> Человек, которого я не могу дождаться, чтобы изменить свои органы и передать механику. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeoiwwy/","name":"t1_eeoiwwy","created":1548177865,"created_utc":1548149065,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aieo8t","id":"eepkg4v","author":"Hapinon","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Честно говоря, я даже не очень беспокоюсь о том, чтобы улучшить свое тело. Я просто хочу, чтобы мой инопланетянин вылечился, чтобы я мог снова рисовать.","body_html":"<div class = \"md\"> <p> Честно говоря, я даже не очень беспокоюсь о том, чтобы улучшить свое тело. Я просто хочу, чтобы мой инопланетянин вылечился, чтобы я мог снова рисовать. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepkg4v/","name":"t1_eepkg4v","created":1548211854,"created_utc":1548183054,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":5,"link_id":"t3_aieo8t","id":"eeok972","author":"-Avacyn","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Я действительно ненавижу, когда люди делают такие обобщенные комментарии, как «все транс / цис / геи / черные / динозавры ...»\n\nЯ понимаю, что это комментарий, который должен быть «забавным» и, вероятно, вдохновляющим на транс-людей ... но серьезно, зачем вам толкать людей вниз, чтобы подняться?\n\nУ меня есть несколько транс-друзей. Они пережили много дерьма в жизни и всю свою жизнь принимали дерьмовые обобщения. Почему вы принимаете ваше сообщество, чтобы выразить то же самое вредное поведение другим?\n\nКак и другие говорили в комментариях: мы можем иметь оба. Нам просто нужно активно работать вместе и увидеть более широкую картину, вместо того, чтобы политизировать и секуляризировать различные группы, заинтересованные в трансгуманизме.","body_html":"<div class = \"md\"> <p> Я действительно ненавижу, когда люди делают такие обобщенные комментарии, как «все транс / цис / геи / черные / динозавры ...» </p>\n\n<p> Я понял, что это комментарий, который должен быть «забавным» и, вероятно, вдохновляющим на транс-людей ... но если серьезно, зачем вам толкать людей, чтобы поднять себя? </p>\n\n<p> У меня несколько транс-друзей. Они пережили много дерьма в жизни и всю свою жизнь были на грани дерьмовых обобщений. Почему вы принимаете ваше сообщество, чтобы выразить то же самое вредное поведение другим? </Р>\n\n<p> Как и другие говорили в комментариях: мы можем иметь и то и другое. Нам просто нужно активно работать вместе и увидеть более широкую картину, вместо того, чтобы политизировать и секуляризировать различные группы, заинтересованные в трансгуманизме. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeok972/","name":"t1_eeok972","created":1548180302,"created_utc":1548151502,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":8,"link_id":"t3_aieo8t","id":"een862n","author":"KRANOT","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"этот человек кажется довольно подлым и тщеславным и, кажется, просто ищет повод избить некоторых людей, которые им не нравятся. Я прям и вполне комфортен в своем теле, и я думаю, что есть гораздо более интересные способы улучшить себя визуально и с точки зрения эффективности.\n\nУ id хочу быть 4 руки и 4 ноги, а также Мэнни камеры и полностью механическое тело. я хочу увеличить мозг для более быстрого мышления и идеальной памяти, я хочу укрепить суставы и волокна, которые позволят быстрее прокалить и укрепить конечности. У меня есть идеи Мэнни, как изменить себя, которые выходят за рамки тщеславия.","body_html":"<div class = \"md\"> <p> этот человек кажется довольно подлым и тщеславным и, похоже, ищет повод, чтобы избить некоторых людей, которые им не нравятся. Я прям и вполне комфортен в своем теле, и я думаю, что есть гораздо более интересные способы улучшить себя визуально и с точки зрения эффективности. </p>\n\nУ <p> у id 4 руки и 4 ноги, также мужские камеры и полностью механическое тело. я хочу увеличить мозг для более быстрого мышления и идеальной памяти, я хочу укрепить суставы и волокна, которые позволят быстрее прокалить и укрепить конечности. У меня есть идеи Мэнни, как изменить себя, которые выходят за рамки тщеславия. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/een862n/","name":"t1_een862n","created":1548134696,"created_utc":1548105896,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aieo8t","id":"eennvzd","author":"veggie151","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"У стран СНГ нет монополии на реализм","body_html":"<div class = \"md\"> <p> У стран СНГ нет монополии на реализм </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eennvzd/","name":"t1_eennvzd","created":1548146434,"created_utc":1548117634,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aieo8t","replies":[{"ups":1,"link_id":"t3_aieo8t","id":"eepysyj","author":"leeman27534","parent_id":"t1_eepliau","subreddit_id":"t5_2qlii","body":"также могут быть словесные команды или даже просто мысли, учитывая, что это виртуальная реальность.","body_html":"<div class = \"md\"> <p> также могут быть словесными командами или даже просто думать, учитывая, что это виртуальная реальность. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eepysyj/","name":"t1_eepysyj","created":1548221728,"created_utc":1548192928,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eeor8h1","author":"leeman27534","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Главное, что я хочу - это перенастроить мой мозг, чтобы избавиться от депрессии (хаха, я убью себя, прежде чем это станет возможным)\n\nно также, полный тип погружения VR вещь. ебать очки, это в основном более захватывающим 3d. Я говорю о реальной виртуальной реальности.\n\nно, также как идея иметь настраиваемые конечности и еще много чего, также понравилась идея хвоста, в смысле, 5-й конечности, которую вы могли бы использовать для баланса, чтобы поймать себя, если падаете, возможно, использовать в качестве третьей руки, это своего рода мультиинструмент, его наконечник может разбиваться на цифры для имитации пальцев, иметь другие инструменты в зависимости от того, как вы катаетесь, хранится в хвосте и т. д.","body_html":"<div class = \"md\"> <p> Для меня главное, что я хочу, - это просто перепрограммировать мой мозг, чтобы избавиться от депрессии (хаха, я убью себя, прежде чем это станет возможным) </p>\n\n<p> но также, полный тип погружения VR. ебать очки, это в основном более захватывающим 3d. я говорю о реальной виртуальной реальности. </p>\n\n<p> но, также как идея иметь настраиваемые конечности и еще много чего, также понравилась идея хвоста, в смысле пятой конечности, которую вы могли бы использовать для баланса, чтобы поймать себя в случае падения, возможно, использовать в качестве третьей руки это своего рода мультиинструмент, его наконечник может разделяться на цифры для имитации пальцев, иметь другие инструменты в зависимости от того, как вы катаетесь, хранится в хвосте и т. д. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeor8h1/","name":"t1_eeor8h1","created":1548190162,"created_utc":1548161362,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":0,"link_id":"t3_aieo8t","replies":[{"ups":1,"link_id":"t3_aieo8t","replies":[{"ups":1,"link_id":"t3_aieo8t","id":"ef2w5sq","author":"OG-Memes","parent_id":"t1_ef1u6m5","subreddit_id":"t5_2qlii","body":"Да, спасибо, латинский. Всегда доставляю, ха-ха. Швы прямые мысли","body_html":"<div class = \"md\"> <p> Да, спасибо, латинский. Всегда доставляю хаха. Швы прямые мысли </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/ef2w5sq/","name":"t1_ef2w5sq","created":1548601549,"created_utc":1548572749,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"ef1tz05","author":"OG-Memes","parent_id":"t1_ef1t4ku","subreddit_id":"t5_2qlii","body":"Это не существует на моем языке. Мы используем гетеросексуальные или геи или транс\n\nНо вот почему я полагаю\n\nНо что это означает\n\nЯ не обижаюсь. Я, как и все клетки, лечу то, что выглядит как болезнь для моего тела.\n\nЯ не верю ни в свободную волю, ни в свободное сознание.\nМои слова заранее запрограммированы\n\nВот почему я никогда никого не ненавижу.","body_html":"<div class = \"md\"> <p> Его не существует на моем языке. Мы используем гетеросексуальные или геи или транс </p>\n\n<p> Но вот почему я полагаю </p>\n\n<p> Но что это означает </p>\n\n<p> Я не обижаюсь. Я, как и все клетки, лечу то, что выглядит как болезнь для моего тела. </P>\n\n<p> Я все равно не верю в свободную волю или свободное сознание.\nМои слова заранее запрограммированы </p>\n\n<p> Вот почему я никогда никого не ненавижу. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/ef1tz05/","name":"t1_ef1tz05","created":1548571984,"created_utc":1548543184,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"ef1t045","author":"OG-Memes","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Зачем называть натуральным; «цис»\nЯ считаю это очень оскорбительным","body_html":"<div class = \"md\"> <p> Почему естественный вызов; «цис»\nЯ считаю это очень оскорбительным </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/ef1t045/","name":"t1_ef1t045","created":1548571379,"created_utc":1548542579,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":0,"link_id":"t3_aieo8t","id":"efds4uk","author":"casprus","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Рынок решит.","body_html":"<div class = \"md\"> <p> Рынок решит. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/efds4uk/","name":"t1_efds4uk","created":1548905286,"created_utc":1548876486,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":-16,"link_id":"t3_aieo8t","replies":[{"ups":-18,"link_id":"t3_aieo8t","id":"eengzn8","author":"[deleted]","parent_id":"t1_eengsu9","subreddit_id":"t5_2qlii","body":"[Удалено]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eengzn8/","name":"t1_eengzn8","created":1548141030,"created_utc":1548112230,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eenf8wo","author":"LorenzoPg","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Таким образом, Транс-трансгуманист живет фантазией, ничего не делая, а трансгуманисты Сис фактически работают и основаны на реальности?\n\nИнтересно...","body_html":"<div class = \"md\"> <p> Итак, трансгуманист живет фантазией, ничего не делая, а трансгуманисты Сис фактически работают и основаны на реальности? </p>\n\n<Р> Интересно ... </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eenf8wo/","name":"t1_eenf8wo","created":1548139731,"created_utc":1548110931,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":-3,"link_id":"t3_aieo8t","id":"eeo2vj4","author":"Gray_Upsilon","parent_id":"t3_aieo8t","subreddit_id":"t5_2qlii","body":"Ooookay.","body_html":"<div class = \"md\"> <p> Оооооо. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aieo8t/what_i_expected_from_this_sub_vs_what_i_found/eeo2vj4/","name":"t1_eeo2vj4","created":1548158128,"created_utc":1548129328,"subreddit_name_prefixed":"r/transhumanism","depth":0}]}