{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Друзья, сторонники и любители науки, присоединяйтесь ко мне в эту субботу, 26 января, в 14:11 на кинофестивале Raw Science в историческом Объединенном театре артистов в Лос-Анджелесе для международного дебютного показа художественного документального фильма «Бессмертие или бюст». Это фильм о моей поездке по стране на автобусе для гробов, когда я баллотировался в президенты США в 2016 году, чтобы распространять [\\ #transhumanism] <span translate = \"no\"> (https://www.facebook.com/hashtag/ трансгуманизм? источник = feed_text & ЕР = хэштег) </ SPAN>. Особенно это касается продления жизни и того, как близкие нам люди умирают каждый день. Фильм получил награду Breakout Award на фестивале. Если вам нужен бесплатный билет, пожалуйста, напишите мне. Они доступны, однако я призываю вас получить свой собственный. Важно поддерживать независимые кинофестивали - особенно те, которые касаются НАУКИ. Ваш билет включает в себя церемонию награждения и еду и напитки, если вы хотите остаться на целый день и для вечеринки после. Показ моего 77-минутного фильма, снятого Даниэлем Соллингером, состоится в 14:11. Вы уже видели Объединенный театр артистов? Удивительно! 1700 человек. Пожалуйста, ПОМОГИТЕ заполнить это! Нажмите, пожалуйста, напишите мне для частного просмотра или билетов. www.rawsciencefilmfestival.tv","title":"Отмеченный наградами трансгуманистический полнометражный документальный фильм «Бессмертие или бюст» с международным дебютом на кинофестивале Raw Science в этот суббот, 26 января, 14:11 - некоторые бесплатные билеты","subreddit_name_prefixed":"r/transhumanism","ups":22,"created":1548389849,"link_flair_background_color":"","id":"ajgjy9","author":{"name":"Zoltan_Istvan"},"permalink":"/r/transhumanism/comments/ajgjy9/award_winning_transhumanist_feature_documentary/","url":"https://www.reddit.com/r/transhumanism/comments/ajgjy9/award_winning_transhumanist_feature_documentary/","created_utc":1548361049}