{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Привет, это снова я, парень из коллективного разума, который пытается создать борг.\n\nЕсли серьезно, я парень, который считает, что шаблоны проектирования коллективного интеллекта могут помочь нам выйти за рамки традиционной политики, предоставив нам альтернативные механизмы коллективного принятия решений (помимо голосования и надежды). Я также считаю, что коллективный разум является наиболее подходящей структурой, которую трансгуманисты и постгуманисты могут принять, когда они приближаются к политической арене. Прерогуманизм мыслителей является прерогативой деконструкции и выхода за пределы политики.\n\n Что такое деньги, но механизм координации? Что такое представительная демократия, а не коллективная система принятия решений? Что такое рынок, кроме комплекса распределения ресурсов? Полностью ли мы исследовали пространство возможных механизмов координации, систем принятия решений и систем распределения ресурсов? Думаю, нет.\n\nМы должны стремиться к пониманию общества так же, как мы стремимся понять человеческое тело и разум, чтобы мы могли, наконец, прекратить применять эфемерные решения для вечных проблем.\n\nТочно так же, как мы можем стремиться к сверхразуму (супер-продуктивности, супер-рациональности), супер-счастью и супер-долголетию на индивидуальном уровне, мы должны стремиться к достижению тех же результатов на коллективном уровне.\n\n\n* Снятие с мыльной коробки *\n\n\nТеперь к бизнесу под рукой. В / r / Overminds я создал совместный авторский проект, чтобы продемонстрировать потенциал коллективного разума и умного сотрудничества.\n\nНазвание книги - «Образцы прогресса». Он связан с футурологией, за исключением того, что он использует иной подход к социальному и технологическому прогрессу, рассматривая его с точки зрения коллективного разума.\n\nЦель книги - создать вневременную «библию» для тех, кто интересуется размышлениями об изменениях в обществе, независимо от периода времени или вида.\n\nЕсли вы заинтересованы в участии, знайте, что ваше имя будет включено в список авторов.\n\nНа днях я хочу создать некоммерческую организацию, задача которой обновлять эту книгу каждые 1 или 2 года по мере появления новых знаний и идей.\n\nЕсли вы заинтересованы, зайдите в / r / overminds или прокомментируйте ниже, если у вас есть вопросы и предложения.\n\n\nРЕДАКТИРОВАТЬ: K Я переместил проект в Google Docs.\n\nНажмите на эту ссылку, чтобы пригласить, если вы хотите внести свой вклад\n\n\nhttps://docs.google.com/document/d/1RK_bgHrYqXkeF5QIPHJwjKLcdaY6NnaJWwKHU-AISBI/edit?usp=sharing","title":"Кто-нибудь заинтересован в волонтерстве для совместного авторского проекта?","subreddit_name_prefixed":"r/transhumanism","ups":14,"created":1548468095,"link_flair_background_color":"","id":"ajrp1x","author":{"name":"--Aeo--"},"permalink":"/r/transhumanism/comments/ajrp1x/anyone_interested_in_volunteering_for_a_joint/","url":"https://www.reddit.com/r/transhumanism/comments/ajrp1x/anyone_interested_in_volunteering_for_a_joint/","created_utc":1548439295}