{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я думаю, что идея имплантатов для увеличения мозга привлекательна, учитывая, что действительно возможно добавить дополнения в наш мозг, и эти дополнения повысят благосостояние. Тем не менее, я полагаю, что эта технология может привести к сценариям «контроля сознания», которые, как-то, я нахожу антиутопичными. Даже если общество найдет способ предотвратить использование технологии в таких целях под открытым небом, на данный момент каждый компьютер кажется / может быть взломан в принципе, если физически доступен или подключен к более широкой сети.\n\n\n\nХотя, например, культуру, право, рекламу и пропаганду уже можно в некоторой степени рассматривать как контроль над разумом, взаимодействие мозга разрушит иллюзию свободной воли до крайности и создаст угрозу нашему чувству свободы.\n\n\n\nОдно дело подчиняться закону причинно-следственной связи и не иметь свободной воли, потому что этого требует вселенная, которая имеет смысл, но способность других людей, компаний или учреждений напрямую контролировать ваши мысли кажется довольно жуткой. Вы бы согласились?\n\n\n\nКак можно предотвратить это? По крайней мере, его программное обеспечение не должно быть проприетарным, верно?\nИ где можно провести черту? когда что-то можно назвать контролем над разумом? Изменение любого входа в мозг может изменить ваше состояние сознания и последующий процесс принятия решений.\n\n\n\nМожет быть, это просто культурный или (21-й век) человеческий артефакт, который, похоже, многие ценит чувство ожидаемой автономии по сравнению с ожидаемым рабством, даже если последний случай позволяет контролируемому быть эйфоричным все время?\n\n\n\nЧто вы думаете?","title":"Как можно предотвратить использование интерфейса человек-мозг или нервных шнурков для злоупотребления?","subreddit_name_prefixed":"r/transhumanism","ups":19,"created":1549040730,"link_flair_background_color":"","id":"am07yz","author":{"name":"Abiogenejesus"},"permalink":"/r/transhumanism/comments/am07yz/how_could_one_prevent_humanbraininterfaces_or/","url":"https://www.reddit.com/r/transhumanism/comments/am07yz/how_could_one_prevent_humanbraininterfaces_or/","created_utc":1549011930}