{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Большинство разговоров, которые я вижу среди трансгуманистов, похоже, связаны с такими вещами, как продление жизни, бессмертие, имплантация и крутые гаджеты.\n\nС которым у меня все в порядке.\n\nНо как насчет технологии социальных структур и социальных изменений?\n\nКак насчет перехода на экономику после дефицита?\n\nМногие трансгуманистические дискуссии кажутся более обидными постгуманизмом. Я тоже сторонник, не поймите меня неправильно.\n\nНо во время «транс» фазы эволюции, что мы должны делать, чтобы улучшить качество жизни людей, в сферах экономики, энергетики, питания, жилья, выполнения, управления?\n\nЭто также области развития, которые являются частью человеческого состояния. В дополнение к изменениям и развитию наших тел и умов, к чему мы могли бы стремиться, чтобы управлять ресурсами? Изменение нашей среды? Устранить бедность и человеческие страдания?\n\nКакие типы правительства и социальных технологий мы должны развивать, в отличие от физических технологий?\n\nКак мы будем платить за возвышение людей? Какие шаги мы предпринимаем, чтобы туда добраться? Какие изменения, какие ступени необходимы для этой грандиозной мечты?\n\nЯ вижу некоторые из следующих необходимых и достойных целей, которые помогут нам достичь того, что может произойти дальше:\n\nЛучший доступ к медицинскому обслуживанию и жизненным потребностям, таким как еда, вода, жилье.\nЧистые, устойчивые, обильные источники энергии.\nИнвестиции в открытия - способ не только финансировать новые технологии, но и сделать их доступными для всех.\nУниверсальный доступ к образованию и открытие новых методов преподавания и обучения.\nБолее эффективные методы управления, обеспечивающие личную свободу, а также устойчивость к коррупции и играм. Другими словами, более продвинутая политика.\nНовые формы экономики, также не азартные, которые обеспечивают рациональное использование ресурсов и их справедливое распределение. Где поведение, которое приносит пользу человечеству, поощряется, а не наказывается.\nПродвинутые методы производства и повторного использования ресурсов, возможно, включая повсеместное распространение устройств, которые позволяют любому создавать инструменты и полезные продукты, которые им нужны.\nБыстрые, эффективные, чистые способы транспортировки и связи.\nЛучшие способы обмена знаниями и сотрудничества.\n\nВ жизни есть нечто большее, чем кибер-глазные яблоки, интерфейсы головного компьютера и бессмертная продолжительность жизни.\n\nИ на пути к достижению этих целей тоже есть препятствия.\n\nКак мы добираемся отсюда туда и как мы приводим всех?","title":"Трансгуманизм для социальных изменений","subreddit_name_prefixed":"r/transhumanism","ups":41,"created":1549792808,"link_flair_background_color":"","id":"aozhg6","author":{"name":"CoyoteConscious"},"permalink":"/r/transhumanism/comments/aozhg6/transhumanism_for_social_change/","url":"https://www.reddit.com/r/transhumanism/comments/aozhg6/transhumanism_for_social_change/","created_utc":1549764008}