{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Книга Яшера, собрание высказываний известных раввинов 16-го века, содержит много деталей из еврейской традиции, которая не соответствовала Торе, но, тем не менее, считалась подлинной ведущими еврейскими учеными того времени.\n\n\n\nИстория Ноя может быть историей более ранней трансчеловеческой эпохи. Я не собираюсь углубляться в это, но это была метафора для века, который был потерян навсегда. В любом случае, Книга Иешера, в главе 6, стих 17,\n\n\n\nговорит\n\n 17 И собрались сыны человеческие, около семисот тысяч мужчин и женщин, и пришли к Ною в ковчег.\n\n\n\nДругими словами, во времена Ноя численность человека в мире составляла около 700 000 человек.\n\n\n\nЯ думаю, что это будет общее количество трансгуманов. Случайно, раввины 16-го века дали нам номер для другого возраста.\n\n\n\n\n\nЭто не практично и рационально, чтобы сделать всех на земле трансчеловеком. Человеческая / трансчеловеческая природа не такая. После того, как критическая масса людей превратится в трансчеловека, лестница будет выгнана навсегда.\n\n\n\nКортес позволил ровно одному человеку, Донне Марии, войти в испанское владычество. Ей и ее племени, тласакаланцам, разрешили обращаться с людьми, в некоторой степени похожими на испанцев, и многие из них позже эмигрировали в Нью-Мексико и Аризону, называли свои имена и по-прежнему живут зажиточно.\n\n\n\nТласакаланцы, а также несколько членов ацтекской королевской семьи были введены в новый порядок, а остальные стали скотом при конкистадорах. То же самое произойдет и с трансчеловеческой революцией - некоторые счастливчики, такие как друзья исследователей, занимающихся трансчеловеческими исследованиями, могут оказаться и занять нишу в новом мире, но эта роскошь не распространится на большинство из нас. Еврейская библия также рассказывает историю о Рахабе и Руфи, двух женщинах, которые смогли попасть в еврейское общество. (Первоначально Рахаб и Руфь не имели ничего общего друг с другом, но ко времени Иисуса два иностранца стали идентифицироваться вместе, поэтому автор Евангелия от Матфея писал, что Руфь была невесткой Рахаба. Другими словами даже после всех этих лет мейнстрим никогда не принимал потомков Рахаба и Руфи такими же, как они.)\n\n\n\nОпять же, когда у нас около 700 000 трансгуманов, которые, я думаю, являются критической массой для них, чтобы они были неуязвимы против любой человеческой реакции, они будут вести войну, порабощать людей вечно и начинать свое завоевание космоса после интеграции себя в AGI (Искусственный Генерал). Intelligence).\n\n\n\nНекоторые люди с неправильной стороны треков будут увлечены удачей, хитростью или чем-то еще. Они были бы слишком благодарны и трепетны, чтобы позволить этому новому обществу богов слишком сердиться на своих братьев, убитых трансгуманами.","title":"Сколько человек станет критической массой невозврата?","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1549947593,"link_flair_background_color":"","id":"apky1a","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/apky1a/how_many_transhumans_will_be_the_critical_mass_of/","url":"https://www.reddit.com/r/transhumanism/comments/apky1a/how_many_transhumans_will_be_the_critical_mass_of/","created_utc":1549918793}