{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я сыт по горло тем, насколько далеко зашли левые трансгуманисты. Первоначальной концепцией трансгуманизма в 1980-х годах были либертарианство и капитализм, свободные рынки. Почему он внезапно повернул налево?\n\nУ капитализма ОДНО ОДНО ОПРЕДЕЛЕНИЕ: ДОБРОВОЛЬНЫЕ сделки между СОГЛАСОВАННЫМИ сторонами. Коммуны, Компании, Социальное обеспечение и т. Д. Считаются капиталистическими, поэтому они ДОБРОВОЛЬНЫЕ и СОГЛАСОВАННЫЕ.\n\nКапитализм никогда не умрет, вот почему: предположим, 2101 год, у нас высокоразвитая нанотехнология, вы можете построить практически все по доступной цене, будь то жилье, электроника, еда, теплицы, солнечная энергия и т. Д. Какой тип экономическая система будет возможна?\n\n\n\nОчень легко вообразить краудфанд, который бы создал какую-то негосударственную систему социального обеспечения для всех, подумайте о каком-то каком-то государственном центре распределения ресурсов, в котором жители в пределах определенного периметра, которые живут там по крайней мере пару лет, имеют доступ. на бесплатное ежедневное / еженедельное рациональное использование ресурсов из распределительного центра. Пределом является недопущение того, чтобы люди заказывали что-то идиотское, например, 18,7 квадриллиона галлонов молока. Если вы хотите превышать лимит рациона, вам будет разрешено совершать покупки за какие-то деньги. Центр распределения ресурсов будет сильно, если не полностью автоматизирован. Система собирает мусор, использует ассемблеры и другие механизмы переработки, чтобы превратить мусор и сырье обратно в полезные ресурсы для перераспределения.\n\n\n\nВы можете создавать свои собственные продукты и продавать их, хотя имейте в виду, что распределительный центр будет конкурировать с вами, и они предлагают вещи бесплатно до ежедневного / еженедельного лимита, так что вам будут брошены вызовы.\n\n\n\nЭто может быть то, как капитализм может обеспечить всех. Нам не нужен социализм, чтобы обеспечить нас. Я считаю, что, как капиталисты, мы можем создать все виды систем, чтобы каждый получил то, что ему нужно.\n\n","title":"Почему капитализм никогда не закончится.","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1550212712,"link_flair_background_color":"","id":"aqpms4","author":{"name":"Destroyer-of-SJWs"},"permalink":"/r/transhumanism/comments/aqpms4/why_capitalism_will_never_end/","url":"https://www.reddit.com/r/transhumanism/comments/aqpms4/why_capitalism_will_never_end/","created_utc":1550183912}