{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Текущее количество населения говорит о том, что ислам является самой быстрорастущей религией. Ислам также является самой опасной религией для прогресса человечества. В сущности, в отличие от христианства и подобных религий, в стране нет истинных демократий с большинством исламского населения. Это печальная правда в этом вопросе.\n\nС быстро растущим исламским населением увеличивается число исламских фундаменталистов. Они представляют собой существенную угрозу для Соединенных Штатов и других западных держав. Исламские фундаменталисты хотят распространяться по всему миру, как саранча, пожирающая все, к чему они прикасаются. И они убьют нас всех, если их не остановить. Как выразился Рэй Курцвейл, технология - это обоюдоострый меч. Западные державы могут использовать технологии для улучшения жизни граждан, однако террористическая группа джихадистов мало интересуется свободой и хотела бы использовать технологии, чтобы насильно промыть мозги нам, поверив в их культ смерти.\n\nЯ считаю исламский фундаментализм большей угрозой, чем даже самые крайние прогнозы изменения климата. Infact, если бы мне пришлось выбирать между возможным худшим сценарием изменения климата, при котором мир становится 152 градуса по Фаренгейту 75% влажности из-за безудержного изменения климата во влажное парниковое состояние против мира, где исламский фундаментализм вступил во владение, худший случай сценарий изменения климата гораздо предпочтительнее.\n\nИ наихудший сценарий изменения климата предполагает уничтожение более 99% всех видов. Вот насколько серьезна угроза для исламистов-фундаменталистов.\n\nЯ считаю, что мы должны найти законные способы использования промывания мозгов для лечения исламского фундаментализма. Они предотвращают экзистенциальную угрозу человечеству. Человечество, которое было принудительно обращено в ислам, - это человечество, которое перестает существовать. Мы выйдем на перекресток, где придется принимать трудные решения.","title":"Каким образом технологии могут быть использованы для защиты нас от захвата исламских фундаменталистов?","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1550325173,"link_flair_background_color":"","id":"ar5xaw","author":{"name":"Destroyer-of-SJWs"},"permalink":"/r/transhumanism/comments/ar5xaw/in_what_ways_can_technology_be_used_to_safeguard/","url":"https://www.reddit.com/r/transhumanism/comments/ar5xaw/in_what_ways_can_technology_be_used_to_safeguard/","created_utc":1550296373}