{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Заглавие. Вы бы хорошо с генно-инженерным иммунитетом к болезни? Увеличение мышечной массы или обмена веществ? Устранение необходимости есть, увеличение прочности костей? Будете ли вы довольны тем, что будете полностью био, просто усилены генной инженерией, на уровне Стив Роджерс? Или использовать генную инженерию для повышения своего интеллекта? Или как насчет технологии; Вы бы хорошо с заменой органа? Несколько органов? Все они? Наличие имплантата в вашем глазу или его полная замена, чтобы вы могли видеть в инфракрасном, ультрафиолетовом, рентгеновском, гамма-излучении и т. Д. По желанию? Есть ли в вашем видении система HUD в стиле Iron Man? Полностью заменить конечность или увеличить ее на полпути?\n\nКак насчет графена под кожей или подобного тонкого и прочного материала под кожей? Как насчет полной замены кожи? Если вы решили пойти частично кибер части биологии, как далеко? 10% синтетический? 25%? 50%? 80%? 99%? Хорошо, если вы положите голову на тело андроида или просто мозг? Имплантаты мозга любого рода? А как насчет загрузки вашего разума в компьютер, позволяющего вам получить доступ ко всем виртуальным мирам, эксклюзивным для немногих загруженных, и иметь возможность мгновенно путешествовать по всему миру через компьютерную сетку, помещая себя в тело андроида, когда вам нужно физически? Небо это предел, но у каждого есть свой. Я просто хотел узнать мнение людей.","title":"Если бы расширение, биотехнология и генная инженерия стали легко доступны для среднего человека, насколько бы вы улучшили себя?","subreddit_name_prefixed":"r/transhumanism","ups":37,"created":1550490271,"link_flair_background_color":"","id":"arstyd","author":{"name":"Gamerboy11116"},"permalink":"/r/transhumanism/comments/arstyd/if_augmentation_biotechnology_and_genetic/","url":"https://www.reddit.com/r/transhumanism/comments/arstyd/if_augmentation_biotechnology_and_genetic/","created_utc":1550461471}