{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"","title":"Почему средства массовой информации - это рак, и это замедляет ваш трансгуманистический прогресс","subreddit_name_prefixed":"r/transhumanism","ups":326,"created":1551153507,"link_flair_background_color":"","id":"aupjjs","author":{"name":"swiet"},"permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/","url":"https://i.redd.it/y6f0qoqhx0h21.jpg","created_utc":1551124707,"replies":[{"ups":17,"link_id":"t3_aupjjs","replies":[{"ups":7,"link_id":"t3_aupjjs","id":"eh9r2aa","author":"grawa427","parent_id":"t1_eh9qe89","subreddit_id":"t5_2qlii","body":"I know this is a joke but I am afraid some people really think that.","body_html":"<div class = \"md\"> <p> Я знаю, что это шутка, но боюсь, что некоторые люди действительно так думают. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9r2aa/","name":"t1_eh9r2aa","created":1551156159,"created_utc":1551127359,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":3,"link_id":"t3_aupjjs","id":"eha7ykr","author":"examachine","parent_id":"t1_eh9qe89","subreddit_id":"t5_2qlii","body":"Scientists are just a bunch of assholes trying to figure out shit. 😂😂😂","body_html":"<div class = \"md\"> <p> Ученые - просто кучка придурков, пытающихся выяснить дерьмо. 😂😂😂 </р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eha7ykr/","name":"t1_eha7ykr","created":1551168049,"created_utc":1551139249,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":2,"link_id":"t3_aupjjs","replies":[{"ups":0,"link_id":"t3_aupjjs","replies":[{"ups":1,"link_id":"t3_aupjjs","id":"ehbjwl5","author":"Angeldust01","parent_id":"t1_eha14c8","subreddit_id":"t5_2qlii","body":"I'm not the guy, and I don't agree with the idea of ethics being a problem because it might slow down scientific progress. \n\nI've talked with people with similar views. His argument would be something like \"without having to pay attention to ethics, we'd progress quicker and since scientific advances benefit mankind as whole, ethics is hurting us.\"\n\nOccasionally the most hard-core followers of this idea mention Josef Mengele or Unit 731 and how their experiments advanced medical knowledge about human body. I usually ask whether they'd volunteer to be test subjects to advance medicine, and so far nobody has been willing. They're only okay with it if *someone else has to be the test subject.*","body_html":"<div class = \"md\"> <p> Я не парень, и я не согласен с идеей этики, являющейся проблемой, потому что это может замедлить научный прогресс. </Р>\n\n<p> Я разговаривал с людьми с похожими взглядами. Его аргументом будет что-то вроде «без необходимости уделять внимание этике, мы будем прогрессировать быстрее, и поскольку научные достижения приносят пользу человечеству в целом, этика наносит нам вред». </P>\n\n<p> Иногда самые решительные последователи этой идеи упоминают Йозефа Менгеле или 731-й блок и то, как их эксперименты способствовали распространению медицинских знаний о теле человека. Я обычно спрашиваю, добровольно ли они будут подопытными для продвижения медицины, и пока никто не желал. Они согласны с этим только в том случае, если <em> кто-то другой должен быть объектом испытаний. </Em> </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbjwl5/","name":"t1_ehbjwl5","created":1551219292,"created_utc":1551190492,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"eh9z1qe","author":"vaelroth","parent_id":"t1_eh9w18t","subreddit_id":"t5_2qlii","body":"You misunderstand, ethics hold us back.","body_html":"<div class = \"md\"> <p> Вы неправильно поняли, этика сдерживает нас. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9z1qe/","name":"t1_eh9z1qe","created":1551161401,"created_utc":1551132601,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"eh9v1si","author":"vaelroth","parent_id":"t1_eh9qe89","subreddit_id":"t5_2qlii","body":"Ethics are the real problem.","body_html":"<div class = \"md\"> <p> Этика - настоящая проблема. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9v1si/","name":"t1_eh9v1si","created":1551158737,"created_utc":1551129937,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eh9owds","author":"examachine","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"Please let's ask Zoltan and his band of drug addled teabaggers first because who cares about scientists? ","body_html":"<div class = \"md\"> <p> Пожалуйста, сначала спросим Золтана и его группу наркозависимых пакетиков, потому что кого волнуют ученые? </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9owds/","name":"t1_eh9owds","created":1551154807,"created_utc":1551126007,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":37,"link_id":"t3_aupjjs","replies":[{"ups":3,"link_id":"t3_aupjjs","id":"eh9y6ri","author":"Gadaeus1","parent_id":"t1_eh9x8ch","subreddit_id":"t5_2qlii","body":">If you look behind the scenes of academic publishing\n\n>but you need to go look\n\n\nThat is the problem. That isn't going to cut it when its opponents are in everyone's faces with megaphones and paying to be there.\n\n\nA fraction of people are going to look and of those some will be dismissive. We need academics DEMANDING to be heard, and we need very real backlash for perpetuating easily proven falsehoods. \n\n\nWe see scientists talk about how their studies are misconstrued, but we do not see them actually holding those journalists accountable. We don't see them demanding recourse. Those journalists should be publicly humiliated for their UNACCEPTABLE and ABHORENT behavior. The calm and detached demeanor that serves them for academia can not be translated to the public at large.","body_html":"<div class = \"md\"> <blockquote>\n<p> Если вы посмотрите за кулисы академической публикации </p>\n\n<p> но вам нужно пойти посмотреть </p>\n</BLOCKQUOTE>\n\n<p> В этом проблема. Это не остановит его, когда его противники с мегафоном сталкиваются у каждого и платят, чтобы быть там. </P>\n\n<p> Часть людей будет смотреть, и некоторые из них будут пренебрежительными. Нам нужны академики, ТРЕБУЮЩИЕ быть услышанными, и нам нужна очень реальная обратная реакция для увековечения легко доказанной лжи. </Р>\n\n<p> Мы видим, как ученые говорят о том, как их исследования неверно истолкованы, но мы не видим, чтобы они на самом деле привлекали этих журналистов к ответственности. Мы не видим их требовать помощи. Эти журналисты должны быть публично унижены за их неприемлемое и отвратительное поведение. Спокойное и независимое поведение, которое служит им для научных кругов, не может быть передано широкой публике. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9y6ri/","name":"t1_eh9y6ri","created":1551160812,"created_utc":1551132012,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eh9s4er","author":"Gadaeus1","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"To be fair, I don't think scientists often put very much effort to being heard. They mostly just put their stuff out there and hope it just magically takes a life of its own. Celebs are constantly fighting for attention.\n\nScientists need to stop taking a back seat and focus more on being more forceful with the knowledge they have. Public opinion isn't a fire and forget kind of game. Public opinion is about fighting tooth and nail, and that is a quality rarely seen in academics. Furthermore, they let the media bastardize their work and don't do a damn thing to hold them accountable for horrible science journalism.","body_html":"<div class = \"md\"> <p> Честно говоря, я не думаю, что ученые часто прикладывают много усилий, чтобы быть услышанными. В основном они просто выкладывают свои вещи и надеются, что это просто волшебным образом унесет собственную жизнь. Знаменитости постоянно борются за внимание. </P>\n\n<p> Ученым нужно перестать сидеть на заднем сиденье и больше сосредоточиться на том, чтобы быть более энергичными благодаря своим знаниям. Общественное мнение - это не пожар, и забывай такую ​​игру. Общественное мнение о борьбе зуба и гвоздя, и это качество редко встречается в академических кругах. Кроме того, они позволяют СМИ убивать их работу и не делают ничего, чтобы привлечь их к ответственности за ужасную научную журналистику. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9s4er/","name":"t1_eh9s4er","created":1551156834,"created_utc":1551128034,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":8,"link_id":"t3_aupjjs","replies":[{"ups":-1,"link_id":"t3_aupjjs","replies":[{"ups":0,"link_id":"t3_aupjjs","replies":[{"ups":0,"link_id":"t3_aupjjs","id":"ehbo2fl","author":"examachine","parent_id":"t1_ehbnpqj","subreddit_id":"t5_2qlii","body":"It's just a meme and what I say is true, I don't care if you believe you somehow equal me in wisdom. Note that home schooling is in fact no education. I understand that uneducated people hate expertise buy try to express your disdain elsewhere and stop downvoting my comments just because you're too ignorant. Now buzz off.","body_html":"<div class = \"md\"> <p> Это просто мем, и то, что я говорю, правда, мне все равно, если вы верите, что вы как-то сравните меня в мудрости. Обратите внимание, что домашнее обучение фактически не является образованием. Я понимаю, что необразованные люди ненавидят опыт, пытаясь выразить свое презрение в другом месте и прекратить опускать мои комментарии только потому, что вы слишком невежественны. Теперь отключись. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbo2fl/","name":"t1_ehbo2fl","created":1551222695,"created_utc":1551193895,"subreddit_name_prefixed":"r/transhumanism","depth":6}],"id":"ehbnbd0","author":"examachine","parent_id":"t1_ehbn25t","subreddit_id":"t5_2qlii","body":"I think you misunderstood the intent of my comment. I don't oppose science education. It's just not my job when I'm communicating transhumanist ideas. You're basically saying that we have to address the lowest common denominator and that ignorant people are right to hate intellectuals. I don't see your point if you have any.","body_html":"<div class = \"md\"> <p> Я думаю, вы неправильно поняли смысл моего комментария. Я не против научного образования. Это просто не моя работа, когда я передаю трансгуманистические идеи. Вы в основном говорите, что мы должны обратиться к наименьшему общему знаменателю и что невежественные люди имеют право ненавидеть интеллектуалов. Я не понимаю вашу точку зрения, если у вас есть. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbnbd0/","name":"t1_ehbnbd0","created":1551222110,"created_utc":1551193310,"subreddit_name_prefixed":"r/transhumanism","depth":4}],"id":"ehbm6gw","author":"examachine","parent_id":"t1_ehblqhp","subreddit_id":"t5_2qlii","body":"Right. What makes you think I am responsible for educating people who are that stupid? Or that I need to convince the least educated people in the world? I think there are enough people who will ally with a transhumanist cause but the attacks from ignorant people are really frustrating. It's equally dumb to try to accommodate those people in the transhumanist community, such as creationists. It will never work and the reason is they are stupid beyond repair. We can argue against them, we don't need to educate them or somehow lower our intellectual standards. ","body_html":"<div class = \"md\"> <p> Верно. Что заставляет вас думать, что я несу ответственность за обучение таких глупых людей? Или в том, что мне нужно убедить наименее образованных людей в мире? Я думаю, что есть достаточно людей, которые присоединятся к трансгуманистическим причинам, но нападения невежественных людей действительно разочаровывают. Столь же глупо пытаться приспособить этих людей в трансгуманистическом сообществе, таких как креационисты. Это никогда не сработает, и причина в том, что они глупы и не подлежат ремонту. Мы можем спорить с ними, нам не нужно обучать их или каким-то образом снижать наши интеллектуальные стандарты. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbm6gw/","name":"t1_ehbm6gw","created":1551221214,"created_utc":1551192414,"subreddit_name_prefixed":"r/transhumanism","depth":2},{"ups":-1,"link_id":"t3_aupjjs","id":"ehbo469","author":"examachine","parent_id":"t1_ehblqhp","subreddit_id":"t5_2qlii","body":"Aren't you Max More's ex neonazi son? ","body_html":"<div class = \"md\"> <p> Разве ты не бывший сын неона Макса Моря? </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbo469/","name":"t1_ehbo469","created":1551222732,"created_utc":1551193932,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"ehaakl7","author":"examachine","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"The current capitalist/idiocratic \"civilization\" is basically the dictatorship of the stupid. It's gotten comical. 😂 You can't even talk about transhumanism without some idiot objecting with you are Nazis because eugenics, or AI is gonna kill us all sort of dumb remarks. They really have no knowledge beyond the stupidest movies and TV shows. Invalids.","body_html":"<div class = \"md\"> <p> Нынешняя капиталистическая / идиократическая \"цивилизация\" - это, по сути, диктатура глупых. Это стало смешным. 😂 Вы даже не можете говорить о трансгуманизме, если какой-то идиот не возражает против того, что вы нацисты, потому что евгеника или ИИ убьет нас всех глупых замечаний. Они действительно ничего не знают, кроме самых глупых фильмов и сериалов. Инвалиды. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehaakl7/","name":"t1_ehaakl7","created":1551170114,"created_utc":1551141314,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":3,"link_id":"t3_aupjjs","id":"ehb3g8u","author":"JenYen","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"I could say the same of many so-called \"transhumanist\" groups I've seen on social media which were more like ....\"yes Elon Musk plug your big renewable rocket inside my slutty Tesla charging port\" fan support groups.","body_html":"<div class = \"md\"> <p> Я мог бы сказать то же самое о многих так называемых «трансгуманистических» группах, которые я видел в социальных сетях, которые были больше похожи на… ». Да, Элон Маск вставил вашу большую ракету из возобновляемых источников внутрь моя шлюшка Тесла, заряжающая порт \"группы поддержки поклонников. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehb3g8u/","name":"t1_ehb3g8u","created":1551196819,"created_utc":1551168019,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aupjjs","id":"ehc00yo","author":"Phoenix13_uk","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"can we stop saying the things \"are cancer\". i understand and agree with OP, however saying that something is cancer when it isnt 1. isnt helpful 2. nice for those that want to agree and help with whatever the cause and/or point of the post is that actually have cancer.\n\nEspecially for those that have cancer, like myself. And yes i do agree with you that mainstream massmedia is bad, im trying to educate my son and now grand-daughters to take every story that is forced upto them with the largest grain of salt.\n\n","body_html":"<div class = \"md\"> <p> мы можем перестать говорить, что вещи \"являются раком\". Я понимаю и согласен с OP, однако говорю, что что-то является раком, когда это не 1. не полезно 2. хорошо для тех, кто хочет согласиться и помочь с любой причиной и / или точкой сообщения, которые действительно имеют рак. </р>\n\n<p> Особенно для тех, у кого рак, как и у меня. И да, я согласен с вами, что массовые СМИ - это плохо, я пытаюсь научить моего сына, а теперь и внучек, рассказывать каждую историю, которую им принуждают, с наибольшей долей соли. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehc00yo/","name":"t1_ehc00yo","created":1551231323,"created_utc":1551202523,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aupjjs","id":"ehc1b4g","author":"AlexWIWA","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"God forbid people try to zone out in this awful, god-fosaken, neoliberal hellscape. Most people don't have the mental capacity to care because they're too busy getting shit on by life and their 9 hour a day job. \n\nI agree celebrity worship is dumb as fuck, but that's what some people need to stay sane. ","body_html":"<div class = \"md\"> <p> Дай Бог, чтобы люди пытались объединиться в этот ужасный, забытый богом, неолиберальный адский пейзаж. У большинства людей нет умственных способностей заботиться, потому что они слишком заняты тем, чтобы получать дерьмо от жизни и своей 9-часовой работы. </Р>\n\n<p> Я согласен, что поклонение знаменитостям глупо, но это то, что нужно некоторым людям, чтобы оставаться в здравом уме. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehc1b4g/","name":"t1_ehc1b4g","created":1551232204,"created_utc":1551203404,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":3,"link_id":"t3_aupjjs","id":"eh9u2bx","author":"pyriphlegeton","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"I read \"Fuck as dumb\".  \nI feel I'm disqualified from judging people on their intelligence...","body_html":"<div class = \"md\"> <p> Я читаю \"Трахнись как тупой\". <br/>\nЯ чувствую, что не могу судить людей по их интеллекту ... </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9u2bx/","name":"t1_eh9u2bx","created":1551158099,"created_utc":1551129299,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":5,"link_id":"t3_aupjjs","id":"eha9ty3","author":"[deleted]","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eha9ty3/","name":"t1_eha9ty3","created":1551169520,"created_utc":1551140720,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_aupjjs","id":"ehbav37","author":"randdude220","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"Average person IS dumb as fuck so celebrities are actually just a represantation of the average person. \n\nPeople interesting in science are sadly a minority.","body_html":"<div class = \"md\"> <p> Средний человек глуп, как черт, поэтому знаменитости на самом деле просто репрезентация среднего человека. </Р>\n\n<p> Люди, интересующиеся наукой, к сожалению, меньшинство. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbav37/","name":"t1_ehbav37","created":1551209420,"created_utc":1551180620,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehae5k9","author":"veggie151","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"Eloquent","body_html":"<div class = \"md\"> <p> Eloquent </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehae5k9/","name":"t1_ehae5k9","created":1551172942,"created_utc":1551144142,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehbf4mt","author":"truguy","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"Sure, a technocracy would be the fastest route to turning us all into robots. ","body_html":"<div class = \"md\"> <p> Конечно, технократия была бы самым быстрым способом превратить нас всех в роботов. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbf4mt/","name":"t1_ehbf4mt","created":1551214784,"created_utc":1551185984,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehbqfs9","author":"examachine","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"I must expand what I mean wrt this \"mean\" meme. There's a great example. As you know they're trying to make the dumb historian Harari famous just because he once got a made up job at Google -- it does not seem like he has any qualifications whatsoever to speak about technology but he does, at length. Maybe it's the ethnic background or someone likes him, but there is that.\n\nHe appears everywhere talking smack about transhumanism and technology and he makes zero sense but the common people buy into that ignorant crap just because some media people decided to promote his personal brand, probably to sell his books. Just like Nick Bostrom who is another ignorant guy who speaks nonsense about transhumanism.\n\nNow that's very harmful to transhumanism because it completely misrepresents AI technology. Just because some ignorant historian doesn't understand the massive benefits of AI technology and what it actually does, the public is fed a wrong picture of the most important transhumanist technology, essentially demonizing it.\n\nIt's really a can of worms. If the public and media choose to amplify the most ignorant \"celebrity\" voices like Harari, Bostrom, and Musk, this harms transhumanism. That's why I criticize this appeal to the lowest common denominator. It doesn't help our cause, it hurts it. Not every kind of PR is good PR.\n\nIf the proclamations of ignorant but unfortunately famous people like Bostrom were NOT harming our cause, I wouldn't worry about that. That's what the meme suggests and it's entirely correct. We do not have to accommodate these dumb celebrities or their ideas. We can argue against them but we do not have to stoop down to their level. There are lots of smart pro-science people in the world. Millions of them. We can certainly address them, and we will then cease to be a fringe movement that's only parodied in mainstream culture with foolish bits like \"AI is the devil\", or \"AI will destroy democracy\".\n\nThe dumb trivializations and \"death by a thousand cuts\" sort of strawman objections to transhumanism make it impossible to discuss these matters further. We have to maintain a level above them I believe without succumbing to debates about AI doomsaying or other dumb ideas like \"dataism\" that random ignorant celebrities promulgate.\n\n","body_html":"<div class = \"md\"> <p> Я должен расширить то, что имею в виду, в отношении этого \"среднего\" мема. Там отличный пример. Как вы знаете, они пытаются прославить немого историка Харари только потому, что он однажды устроился на работу в Google - не похоже, что у него есть какая-либо квалификация, чтобы говорить о технологиях, но он делает это подробно. Может быть, это этническое происхождение или кто-то любит его, но это так. </P>\n\n<p> Он появляется повсюду, говоря о трансгуманизме и технологиях, и он не имеет никакого смысла, но простые люди покупают это невежественное дерьмо только потому, что некоторые представители СМИ решили продвигать его личный бренд, вероятно, чтобы продать его книги. Так же, как Ник Бостром, еще один невежественный парень, который говорит глупости о трансгуманизме. </P>\n\n<p> Теперь это очень вредно для трансгуманизма, потому что оно полностью искажает технологию ИИ. Просто потому, что какой-то невежественный историк не понимает огромных преимуществ технологии искусственного интеллекта и того, что она на самом деле делает, общественность получает неправильное представление о наиболее важной трансгуманистической технологии, по сути демонизируя ее. </P>\n\n<p> Это действительно банка червей. Если общественность и средства массовой информации решат усилить самые невежественные голоса «знаменитостей», таких как Харари, Бостром и Маск, это наносит вред трансгуманизму. Вот почему я критикую это обращение к наименьшему общему знаменателю. Это не помогает нашему делу, оно причиняет ему боль. Не каждый вид пиара является хорошим пиаром. </P>\n\n<p> Если бы заявления невежественных, но, к сожалению, известных людей, таких как Бостром, НЕ вредили нашему делу, я бы об этом не беспокоился. Это то, что предлагает мем, и это совершенно правильно. Мы не должны приспосабливаться к этим тупым знаменитостям или их идеям. Мы можем спорить с ними, но нам не нужно опускаться до их уровня. В мире много умных про-научных людей. Миллионы из них. Мы, безусловно, сможем их решить, и тогда мы перестанем быть второстепенным движением, которое пародирует только мейнстримную культуру с такими глупыми фразами, как «ИИ - дьявол» или «ИИ уничтожит демократию». </P>\n\n<p> Тупые тривиализации и «смерть тысячей порезов», своего рода бессмысленные возражения против трансгуманизма, делают невозможным дальнейшее обсуждение этих вопросов. Мы должны поддерживать уровень выше их, я полагаю, не поддаваясь дебатам о гибели ИИ или другим глупым идеям, таким как «dataism», которые провозглашают случайные невежественные знаменитости. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbqfs9/","name":"t1_ehbqfs9","created":1551224500,"created_utc":1551195700,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","replies":[{"ups":1,"link_id":"t3_aupjjs","id":"ehqcfyn","author":"examachine","parent_id":"t1_ehpnx5k","subreddit_id":"t5_2qlii","body":"That is simply poor magical skyhook thinking. Transhumanism is not some dumb FAITH in future magical tech that fixes everything. That's precisely WHY I advocated transhumanist politics and I resent that some stupid teabaggers tried to take that over for that very reason. If you believe in any of global warming denialist bullshit claims, including some appeal to future tech that doesn't exist, nor can be even imagined maybe you're talking out of your ass. That's not scientific or transhumanist.","body_html":"<div class = \"md\"> <p> Это просто плохое магическое мышление. Трансгуманизм - это не какая-то глупая ВЕРА в будущую магическую технику, которая все исправляет. Именно поэтому я выступал за трансгуманистическую политику и негодую на то, что некоторые глупые пакетики попытались захватить это по той же самой причине. Если вы верите в какое-либо из дерьмовых утверждений о глобальном потеплении, включая какое-то обращение к будущим технологиям, которых не существует, и даже не можете вообразить, возможно, вы говорите из своей задницы. Это не научный и не трансгуманистический. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehqcfyn/","name":"t1_ehqcfyn","created":1551684736,"created_utc":1551655936,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"ehbqy9h","author":"examachine","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"Another example. Max More comes into my old FB community Scientific Transhumanism (taken over by a bunch of stupid tea party fanatics and AI doomsayers shortly afterwards), and promotes global warming denialism. How can you argue against that without wasting a lot of time trying to educate someone who clearly hates science and scientists? You can't educate a dogmatic person, you will only be distracted, it does not make economical sense. You have to avoid death by a thousand cuts and not waste time. Instead, let's prefer educated opinions from scientists and philosophers who do care about Transhumanism for a change, and let's help spread THEIR word.","body_html":"<div class = \"md\"> <p> Еще один пример. Макс Мор входит в мое старое сообщество FB Scientific Transhumanism (перешло к группе глупых фанатиков чаепития и последователей искусственного интеллекта вскоре после этого) и пропагандирует отрицание глобального потепления. Как вы можете возразить против этого, не теряя много времени, пытаясь обучить кого-то, кто явно ненавидит науку и ученых? Вы не можете воспитать догматичного человека, вы будете только отвлекаться, это не имеет экономического смысла. Вы должны избежать смерти тысячами порезов и не тратить время. Вместо этого давайте предпочитаем образованные мнения ученых и философов, которым небезразличен трансгуманизм, и давайте поможем распространить их слово. </P>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehbqy9h/","name":"t1_ehbqy9h","created":1551224878,"created_utc":1551196078,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehpo6z6","author":"advancedatheist","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"It's 2019, but we aren't getting real superhumans. Instead we're getting movies about make-believe superhumans, including ones portrayed by mediocre-looking actresses. \n\nBTW, I haven't seen *Alita: Battle Angel*, but I have to ask: Is this thing really a \"girl\"? I mean, does she have the girl parts for sex and reproduction? ","body_html":"<div class = \"md\"> <p> Это 2019 год, но мы не получаем настоящих сверхчеловеческих людей. Вместо этого мы снимаем фильмы о выдуманных сверхчеловеках, в том числе изобразившихся посредственно выглядящими актрисами. </Р>\n\n<p> Кстати, я не видел <em> Алиту: Боевой Ангел </em>, но я должен спросить: действительно ли эта вещь \"девушка\"? Я имею в виду, у нее есть части девушки для секса и размножения? </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehpo6z6/","name":"t1_ehpo6z6","created":1551666260,"created_utc":1551637460,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehacr20","author":"4productivity","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"The media is the tool, not the wielder. They talk about what people want to hear. ","body_html":"<div class = \"md\"> <p> Носитель - это инструмент, а не владелец. Они говорят о том, что люди хотят услышать. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehacr20/","name":"t1_ehacr20","created":1551171864,"created_utc":1551143064,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_aupjjs","id":"ehb1m7x","author":"Aedann--","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"The problem is not the mass medias but the masses that listen to them.","body_html":"<div class = \"md\"> <p> Проблема не в средствах массовой информации, а в массах, которые их слушают. </p>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/ehb1m7x/","name":"t1_ehb1m7x","created":1551194112,"created_utc":1551165312,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":-5,"link_id":"t3_aupjjs","id":"eh9swqu","author":"_molotovcocktail","parent_id":"t3_aupjjs","subreddit_id":"t5_2qlii","body":"“Kill your TV” on a transhumanist sub. Neat.","body_html":"<div class = \"md\"> <p> «Убей свой телевизор» на трансгуманистическом сабвуфере. Ухоженная. </Р>\n</DIV>","permalink":"/r/transhumanism/comments/aupjjs/why_massmedia_is_cancer_and_it_slows_down_our/eh9swqu/","name":"t1_eh9swqu","created":1551157342,"created_utc":1551128542,"subreddit_name_prefixed":"r/transhumanism","depth":0}]}