{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Рассмотрим следующий сценарий. Геномная технология секвенирования продолжает снижаться в геометрической прогрессии. Чтобы получить секвенирование полного человеческого генома, уже стоит всего 200 долларов. Как только стоимость станет достаточно низкой, больницы начнут секвенировать весь геном каждого новорожденного при рождении, создав полный генетический профиль со всеми унаследованными состояниями и факторами риска. Некоторые взрослые, родившиеся десятилетия назад, могут отказаться от секвенирования своего генома, а некоторые захотят, но, несмотря на это, каждый / большинство людей, родившихся после определенного момента, будут знать, какова их генетика.\n\nПару десятилетий спустя, когда у этого последовательного поколения появятся дети, любой, кто является носителем генетического заболевания, примет это знание во внимание, имея детей. Возможно, они просто решат не иметь детей, возможно, они усыновят, или, возможно, они будут использовать PGD или CRISPR, чтобы не передавать их своим детям. Фактическое число тех, кто использует PGD или CRISPR, может быть небольшим меньшинством (со всеми остальными не в серьезном риске, воспроизводящем старомодный способ).\n\nНезависимо от этого, после универсального секвенирования второго поколения обнаружится гораздо меньше носителей генетических дефектов / заболеваний. Затем этот процесс повторяется снова и снова с каждым поколением, пока дефектные гены не исчезнут из генофонда и появятся только в результате случайных мутаций. И наоборот, генетически отредактированные и отобранные люди сами будут распространять свои отобранные / отредактированные гены через генофонд, даже если они решат иметь детей естественным путем (и людям, которые являются продуктом PGD / CRISPR, может быть более комфортно иметь своих детей тем же методом ).\n\nЭтот процесс может начинаться только с самых смертельных генетических заболеваний, но постепенно расширяется и включает менее серьезные нарушения и наследственные факторы риска. При этом интеллектуальные нарушения могут становиться все менее и менее распространенными среди населения. Хотя немногие люди могут захотеть редактировать или выбирать для более высокого интеллекта, мало кто будет возражать против выбора или редактирования, чтобы предотвратить низкий интеллект. Если никто не попытается создать сверхинтеллектуальных трансчеловеков, средний IQ населения будет расти со временем. То, что считается средним интеллектом (т. Е. IQ 100), будет продолжать корректироваться выше, и распределение IQ кривой колокольчика будет смещаться вправо от графика на протяжении поколений.\n\nПродолжайте в том же духе в течение нескольких поколений, и мы получим значительно увеличенное население, даже без каких-либо героических усилий по созданию сверхчеловеческих ресурсов.","title":"Может ли трансгуманизм продвигаться незаметно?","subreddit_name_prefixed":"r/transhumanism","ups":1,"created":1553827237,"link_flair_background_color":"","id":"b6mjx3","author":{"name":"TrudeaulLib"},"permalink":"/r/transhumanism/comments/b6mjx3/could_transhumanism_advance_imperceptibly/","url":"https://www.reddit.com/r/transhumanism/comments/b6mjx3/could_transhumanism_advance_imperceptibly/","created_utc":1553798437}