{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Думайте об этом так, смысл всего человеческого существования до сих пор заключался в том, чтобы порождать или просто творить. Мы рождаемся и заботимся до тех пор, пока не сможем заботиться о себе, а затем либо создадим мир, немного отличающийся от того, когда мы родились, и иногда мы рождаем кого-то, кто будет нести наш генетический код на случай нашей смерти. Если вы откажетесь от необходимости производить потомство, как это сделает бессмертие, это только оставит потребность в «содействии продолжению человеческого рода». Таким образом, тем из нас, кто не способствует улучшению / совершенствованию «человеческого опыта», не нужно «загружать» новое роботизированное существование. Или новому правящему классу роботов, которые сейчас живут тысячи, если не миллионы лет, нужны более дешевые роботы, чтобы обслуживать их цифровыми бургерами и чистить их цифровые туалеты?\n\nВсе это при условии, что если мы выяснили, как загрузить действительное сознание, то, очевидно, у нас есть роботы, выполняющие все другие простые задачи, которые включают в себя создание новых роботов и загрузку сознания ». И в соответствии с тем же предположением, что и у роботов, у нас больше не будет физических ощущений удовольствия (а значит, и секса), вкуса или потребности в еде и / или боли (а значит, не нужны врачи), кроме психологических проблем, которые могут возникнуть тысячелетняя эволюция больше не актуальна для наших нечувствительных тел роботов. Это поднимает массу вопросов и новых наборов вопросов, но это может быть отдельный пост. Конечно, это вряд ли произойдет в течение короткого периода времени, но сколько времени может потребоваться, чтобы заменить достаточное количество людей сознательно вселенными роботами, чтобы больше не нуждаться в людях вокруг.\n\nКак только мы переходим к тому моменту, когда «жизнь» больше не ограничена временем, которое человеческое тело может выдержать, мы можем буквально отправлять себя в роботу во вселенную на неопределенные миссии к звездам. Вероятно, в то время как здесь, на земле, держится другой робот. Что возвращается к моей первоначальной точке зрения, если нам больше не нужно есть, создавать отходы или размножаться, понадобится ли большинству из нас вообще?","title":"Будет ли перевод нашего сознания в тело робота или механическое существование даже доступным для тех из нас, кто не является серьезно богатым или активно способствует расширению человеческой расы (т.е. ученому)? И если да, то какой цели он будет служить?","subreddit_name_prefixed":"r/transhumanism","ups":29,"created":1555812592,"link_flair_background_color":"","id":"bff74s","author":{"name":"Mongoose72"},"permalink":"/r/transhumanism/comments/bff74s/would_transferring_our_consciousness_into_a/","url":"https://www.reddit.com/r/transhumanism/comments/bff74s/would_transferring_our_consciousness_into_a/","created_utc":1555783792}