{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Там ниже TLDR.\n\nЦель этого поста - объединить наши идеи и стратегии. В идеале, что было бы наилучшим способом действий для одного человека / небольшой группы людей, желающих добиться прогресса и заняться исследованиями в областях, связанных с трансгуманизмом (например, взаимодействие между мозгом и машиной, в котором в настоящее время доминирует Neuralink) ?\n\nПервое, что приходит на ум, - это стать академиком, то есть получить докторскую степень и работать в соответствующей лаборатории. Но это, кажется, имеет относительно небольшой эффект в общей схеме вещей: ни один исследователь не может сделать огромный прогресс самостоятельно. Не говоря уже о том, что лаборатории часто имеют широкий круг целей, некоторые из которых могут быть только косвенно связаны с основными проблемами / вопросами.\n\nСледующее, что приходит на ум, - это создание частной исследовательской компании (я определяю частную, потому что научные исследования часто ограничены и медленнее, чем частный сектор / правительство). Таким образом, многие ученые будут работать над одной и той же целью, и я чувствую, что исследования по большей части являются вопросом количества, а не качества, с точки зрения умственных способностей: чем больше исследователей, тем лучше. Хотя я могу быть совершенно неправ в этом.\n\n\n** TLDR **\n\nОбласть трансгуманизма в целом все еще находится на очень ранних стадиях, и существует большой потенциал для адаптивного излучения.\nВсе мы здесь можем стать пионерами в области трансгуманизма, который вскоре станет жизненно важным для будущего человечества; Я задаюсь вопросом, каков оптимальный путь для пионерства в любой из многих ниш этой области.\n\nЛюбые идеи приветствуются и ценятся.","title":"Что может сделать человек, чтобы колонизировать трансгуманистические области исследований?","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1556409474,"link_flair_background_color":"","id":"bi0gsu","author":{"name":"VioletMana"},"permalink":"/r/transhumanism/comments/bi0gsu/what_can_an_individual_do_to_colonize/","url":"https://www.reddit.com/r/transhumanism/comments/bi0gsu/what_can_an_individual_do_to_colonize/","created_utc":1556380674}