{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Даже самые богатые на сегодняшний день оказались в ловушке своих стареющих тел. Независимо от того, сколько улучшений сделано, они погибнут однажды.\n\n\n\nЧтобы сохранить свое правление на земле и извлечь выгоду из их постоянного присутствия в эпоху диссеников, было бы целесообразно загрузить свои мозги в новое тело, чтобы они могли жить вечно для всех практических целей.\n\n\n\nНечто, что на самом деле никто не предлагал, - это перенести мозг на тело ребенка, чтобы у ребенка был весь опыт сегодняшних победителей при продлении его жизни. Если победителю не понравится рост ребенка, можно найти заменяющее тело.\n\n\n\nЯ знаю, что это не этично, но, возможно, необходимо продолжать сегодняшнюю цивилизацию, завоевывать пространство и приносить новую эпоху человеческой цивилизации. Таким образом, сегодняшние победители будут становиться богаче навсегда и добавлять новое измерение своей власти богатства по всей известной вселенной.\n\n\n\nСкажем, 101 миллиардер умирает и пересаживается на тело 4-летнего ребенка. Сейчас ему / ей 101 год. Когда ребенку исполняется 8 лет, ему / ей фактически 105 лет. Во время катания на лыжах ребенок попадает в большую аварию и парализован от шеи вниз. Владелец тела выбрасывает его и пересаживает себя в 3 года; когда ему исполнится 10 лет, его владельцем будет 112. Конечно, он / она продолжит собирать медицинскую помощь, поскольку, хотя он / она имеет более молодое тело, он / она ЮРИДИЧЕСКИ является пожилым человеком.\n\n\n\nТакие привилегии не будут распространяться на простых людей, поэтому они будут продолжать править всеми.\n\n\n\nЯ думаю, что библейские патриархи, которые жили сотни лет, могли бы использовать такие технологии. Однако после Ноевого Потопа тело ребенка уже не было доступно, поэтому патриархи не могли пересаживаться и умерли в старости. То же самое относится ко многим легендарным королям, которые жили очень долго.\n\n\n\nПредставьте себе бессмертные тела с их сотнями лет опыта, завоевывающего пространство. Было бы полезно клонировать Эрнана Кортеса от генов его потомков (которые являются испанскими герцогами и все еще владеют большим количеством земли в Испании и Мексике - не ясно, выжили ли гены Франциско Писарро), так что вечно живущий Кортес может преподать космическим пришельцам урок, который они никогда не забудут.","title":"Бессмертие для сегодняшних победителей - загрузка мозгов неограниченное количество раз","subreddit_name_prefixed":"r/transhumanism","ups":1,"created":1557548862,"link_flair_background_color":"","id":"bn3civ","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/bn3civ/immortality_for_todays_winners_uploading_brains/","url":"https://www.reddit.com/r/transhumanism/comments/bn3civ/immortality_for_todays_winners_uploading_brains/","created_utc":1557520062}