{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"В настоящее время я собираю ресурсы для проведения эксперимента по расширению сознания посредством многочленного познания (с использованием органоидов мозга в качестве второго дома для ума) в UCSD. У меня есть опыт и доступ, в котором я нуждаюсь, но все же нуждаюсь в финансировании. Таким образом, я задавался вопросом, знаете ли вы какой-либо возможный источник финансирования для этого. Теоремы, которые мы проверяем, почти наверняка приведут к передаче сознания и радикальному продлению жизни; это потому, что если ум может мигрировать за пределы тела, то тело можно восстановить на более фундаментальном уровне, чем когда-либо прежде.\n\nЯ приложил теоремы, поскольку все их детали не обязательно поддаются быстрому обобщению, но суть того и другого заключается в том, что человеческий разум является продуктом когнитивной работы, и эти операции могут быть расширены с использованием современных технологий, таких как интерфейсы мозг-мозг (BBI), мозг-компьютерные интерфейсы (BCI) или прямые нейронные интерфейсы (DNI). Это позволяет нам на мгновение вывести разум за пределы его первоначального мозга, разделив его между несколькими сосудами, и, тем самым, позволяет использовать методы decellularization и scaffolding для регенерации тела без разрушения ума.\n\nЛюбая обратная связь, которую вы можете предоставить, будет наиболее ценной.\n\n[https://docs.google.com/a/g.emporia.edu/document/d/13tX57BZw0zbxPi-Ep2NNRIwXvlQ\\_Id8QNeDUUibkttc/edit?usp=drive\\_web]<span translate = \"no\"> (https: docs.google.com/a/g.emporia.edu/document/d/13tX57BZw0zbxPi-Ep2NNRIwXvlQ_Id8QNeDUUibkttc/edit?usp=drive_web) </ SPAN>\n\n\n\n[https://docs.google.com/a/g.emporia.edu/document/d/1R6zjZnv\\_0P-E4SwSRgobMmvko52aNw7W0hHZPKPqVGo/edit?usp=drive\\_web]<span translate = \"no\"> (https: docs.google.com/a/g.emporia.edu/document/d/1R6zjZnv_0P-E4SwSRgobMmvko52aNw7W0hHZPKPqVGo/edit?usp=drive_web) </ SPAN>","title":"Как я могу финансировать проект по расширению сознания?","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1558420274,"link_flair_background_color":"","id":"br2ckm","author":{"name":"EldritchEmber1412"},"permalink":"/r/transhumanism/comments/br2ckm/how_could_i_go_about_funding_a_consciousness/","url":"https://www.reddit.com/r/transhumanism/comments/br2ckm/how_could_i_go_about_funding_a_consciousness/","created_utc":1558391474}