{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я как бы черпаю вдохновение в том, как Кроганы описаны в массовом эффекте.\n\n> У большинства кроганов их тело обладает первичными, вторичными и даже третичными органами и резервными копиями, вплоть до избыточной нервной системы, причем их первичная система представляет собой систему электропроводящей жидкости, а не нервной.\n\nЯ также использовал для модификации (с небольшим количеством головной пушки) своего персонажа в shadowrun-dragonfall с учетом этого (добавление дополнительных искусственных головных мозга, расположенных в туловище, а не в черепе, добавление дополнительных сердец, расположенных в ногах и руках, для увеличения выживаемости от травма и поддержка новых мозгов, которые могли бы быть подключены к их кибердекам).\n\n\nДобавление избыточности, разнообразия и модульности - это давний путь обеспечения долгосрочного выживания организмов и популяций в условиях неопределенности и нестабильности. Это не так эффективно, но более адаптивно, а адаптивность важнее, чем эффективность в природе.\n\nОн функционирует почти во всех системах (организациях, рынках, видах, телах). Было бы интересно посмотреть, как такие принципы могут быть в дальнейшем применены для повышения долгосрочной жизнеспособности человеческого организма.\n\nИ я полагаю, что также возможно сделать кого-то более разумным, поместив концентрированные кластеры нейронов в их теле, соединенные с внешним миром через компьютерный интерфейс мозга. Он даже не должен был бы быть «внутри» тела, это могло бы даже быть своего рода биологическим носимым (или присоединяемым и отделяемым) дополнением.\n\nОн даже не должен быть биологическим, он может включать достижения в области мягкой робототехники.","title":"Кто-то сейчас работает над избыточными системами органов (очень маленькие сердца, дополнительные нервные кластеры мозга).","subreddit_name_prefixed":"r/transhumanism","ups":26,"created":1558637375,"link_flair_background_color":"","id":"bs1fec","author":{"name":"--Aeo--"},"permalink":"/r/transhumanism/comments/bs1fec/is_someone_out_there_currently_working_on/","url":"https://www.reddit.com/r/transhumanism/comments/bs1fec/is_someone_out_there_currently_working_on/","created_utc":1558608575}