{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Привет всем,\nЯ встретил некоторых очень проницательных людей на этом сабе и не мог не расстраиваться из-за недостаточной эффективности общения между нами (reddit не самый лучший вариант для полноценной дискуссии).\n\nЯ знаю, что есть некоторые серверы Discord для трансгуманизма, расширения в реальном времени, AGI и т. Д., Но заметил, что не существует ни одного сервера для взаимодействия мозг-машина / мозг-компьютер - тема, которая имеет ключевое значение для будущего человечества.\n\nЯ бы даже сказал, что тема BCI важнее других актуальных для будущего тем, таких как продление жизни или AGI, потому что, в отличие от вышеупомянутых областей, которые имеют относительно большие объемы финансирования + исследователей + публичность, область ИМЦ практически не сдвинулись с места (например, есть только две компании, специализирующиеся на инвазивном взаимодействии (Neuralink и Paradromics), и обе они еще не выпустили какой-либо важной информации для общественности).\n\nВ любом случае, нам нужна эффективная среда для обсуждения BCI. Для этого я создал сервер Discord (https://discord.gg/uQucUCd) для взаимодействия между мозгом и компьютером. Он все еще находится на очень ранних стадиях (на данный момент его единственным участником является я), но я надеюсь, что со временем он будет заполнен (моя отправная точка - публикация этого в различных субредитах). Я не уверен, является ли это оптимальной платформой (если у вас есть какие-либо другие идеи, прокомментируйте их), но я думаю, что она вполне подходит для этой цели, и я видел много других подпрограмм, таких как / r / Futurology и / r / Долголетие также успешно его использует для этой цели.\n\n** TLDR **\n\nДля таких людей, как мы, было бы чрезвычайно полезно иметь возможность проводить обсуждения, ориентированные на BCI, по темам, которые публикуются в этой и связанных подпрограммах.\nПожалуйста, возьмите gander, если вы вообще заинтересованы.","title":"Сервер Discord для взаимодействия между мозгом и компьютером: https://discord.gg/uQucUCd","subreddit_name_prefixed":"r/transhumanism","ups":14,"created":1558688991,"link_flair_background_color":"","id":"bsase1","author":{"name":"VioletMana"},"permalink":"/r/transhumanism/comments/bsase1/discord_server_for_braincomputer_interfacing/","url":"https://www.reddit.com/r/transhumanism/comments/bsase1/discord_server_for_braincomputer_interfacing/","created_utc":1558660191}