{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Товарищи трансгуманисты и трансгуманы (и трансгуманы). Я недавно обдумывал толкование морфологической свободы, и мне бы хотелось узнать ваше мнение. Я специально спрашиваю мнения, потому что часто вижу, как люди публикуют вещи в этом разделе без особого контекста, и их идеи уже достаточно ясны. Скажем так, я не согласен с этим, но я отвлекся.\n\nВо-первых, что такое морфологическая свобода? Это относится к праву на владение собой и на изменение своего тела. Эта идея следует формулировке личной автономии Нозика и вытекает из либерализма Локка. Большинство людей здесь, вероятно, имеют хотя бы общее представление о концепции, но давайте посмотрим на точное определение. Первоначальное определение можно найти в «Технологической самопреобразовании Макса Мора 1993 года: расширение личной экстропии» *:\n\n> \\ [T \\] Он способен изменять форму тела по желанию с помощью таких технологий, как хирургия, генная инженерия, нанотехнологии, загрузка.\n\nСовсем недавно он был переформулирован Андерсом Сандбергом в [Морфологическая свобода - почему мы не просто хотим этого, но нуждаемся в этом] <span translate = \"no\"> (https://www.aleph.se/Nada/Texts /MorphologicalFreedom.htm) </ SPAN>:\n\n> \\ [A \\] n расширение права человека на свое тело, не только на владение собой, но и на право изменять себя в соответствии со своими желаниями.\n\nМне очень нравится это определение, не только потому, что я действительно люблю Сандберга, но и потому, что в той же статье он дает определение морфологической свободы как отрицательного права:\n\n> Как отрицательное право, морфологическая свобода подразумевает, что никто не может заставить нас измениться так, как мы не желаем или не можем предотвратить наши изменения.\n\nРазличие между положительными и отрицательными правами не совсем новое. Несмотря на это, негативная формулировка морфологической свободы («никто не может изменить моё тело без моего согласия») была предметом гораздо меньшего внимания, хотя я считаю, что она более интересна и та, которая несет наибольшее обещание для сопротивление и революция.\n\n(Простая) формулировка «никто не может изменять моё тело без моего согласия» - это трансчеловек * habeas corpus *. Особенно в свете новой и откровенно пугающей политики тела отрицательная концепция морфологической свободы может быть полезной. Администрация Трампа и обращение ICE к иммигрантам (включая детей младшего возраста и беременных женщин) вдоль границы Мексика-США, запреты на аборты в Алабаме и Грузии, а также бунтарское сопротивление и охрана тел трансгендерных людей - все это примеры морфологических нарушений свобода.\n\nНе говоря уже об обещании «действительно революционного сопротивления биопанкам»;)\n\nЧто вы думаете по этому поводу?","title":"Отрицательная морфологическая свобода","subreddit_name_prefixed":"r/transhumanism","ups":12,"created":1559138304,"link_flair_background_color":"","id":"buaz0m","author":{"name":"SirBadgerBoobington"},"permalink":"/r/transhumanism/comments/buaz0m/negative_morphological_freedom/","url":"https://www.reddit.com/r/transhumanism/comments/buaz0m/negative_morphological_freedom/","created_utc":1559109504}