{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я только что прочитал эту статью Николая Агар\n\nhttps://jetpress.org/v22/agar.htm\n\n\nОн утверждает, что было бы неразумно пытаться загрузить свой разум в компьютер, учитывая, что альтернативы (Paradise Engineering), которые будут доступны к моменту загрузки ума, становятся выполнимыми. Существует матрица выплат (похожая на пари Паскаля, но без существенных недостатков в этом аргументе), которая предпочитает не пытаться выполнить процедуру.\n\nНезависимо от аргументов метафизики, существует множество разумных сомнений (почти столько же, сколько сомнений в загробной жизни), чтобы заставить рационального субъекта избежать риска. Кроме того, если биологическое бессмертие уже доступно, стоимость смерти становится еще выше.\n\n\nОн упоминает версию мысленного эксперимента в китайской комнате Searles:\n\n> Китайская комната. Сирл воображает, что он заперт в комнате. Кусок бумаги с нарисованными на нем «загогулинами» передается ему. Сирл понятия не имеет, что могут значить загогулины, и действительно ли они что-то значат. Но у него есть книга правил, удобно написанная на английском языке, которая говорит ему, что определенные комбинации загогулинов должны побуждать его записывать конкретные разные загогулины, которые затем представляются людям снаружи. Это действительно очень большая книга - она ​​описывает соответствующие ответы на чрезвычайно широкий спектр комбинаций загогулинов, которые могут быть переданы в комнату. Сирл совершенно не знает, что в загонах есть китайские иероглифы, и он дает умные ответы на вопросы на китайском языке. На самом деле, схема ответов в комнате неотличима от того, что говорит носитель языка. Китаец, который ничего не знал о внутренней работе комнаты, без колебаний приписывал бы ей понимание ее языка. Но, говорит Сирл, ясно, что ни он, ни комната не понимают по-китайски. Все, что происходит, - это манипулирование символами, которые, с его точки зрения, совершенно бессмысленны.\n\n \n\n> Что Сирл говорит о Китайской комнате, он думает, что мы должны также сказать о компьютерах. Компьютеры, как и комната, манипулируют символами, которые для них совершенно бессмысленны. Эти манипуляции направляются не книгами правил, написанными на английском языке, а программами. Нас не должно обманывать программирование компьютера, заставляя его думать, что оно обладает подлинным пониманием - компьютер выполняет свои задачи, даже не понимая ничего, не развлекая ни единой мысли\n\n\nМожно утверждать, что загрузка разума сталкивается с аналогичной проблемой, за исключением того, что книга правил основана на данных о вас, а книга правил - это просто набор инструкций, которым будет следовать объект, отличный от вас. В отличие от оригинального китайского эксперимента, нам не нужно сомневаться в способности компьютеров быть в сознании. Даже если бы ИИ, следовавший вашей книге правил, имел сознание, он все равно просто следовал инструкциям и разыгрывал сценарий. И так же, как актер (независимо от того, насколько он хорош) не идентичен персонажу, которого он играет, ИИ не будет идентичен вам.\n\n\nОн также утверждает, что корабль по методу Тесуса рискует стать еще более пугающим.\n\n> Возможно, что опыт постепенной замены частей вашего мозга электронными протезами будет немного похож на нейродегенерацию. Болезнь Альцгеймера постепенно разрушает части мозга его пациентов. Люди склонны осознавать последующую потерю когнитивных навыков только тогда, когда им не удается выполнить задачи, которые когда-то были в пределах их досягаемости. Предположим, Сирл прав насчет невозможности машинного мышления. Постепенная замена систем в вашем мозгу электронными эквивалентами была бы похожа на болезнь Альцгеймера в одном существенном отношении. Это повлечет за собой постепенное разрушение ваших способностей мысли. Разница будет в том, что у вас не будет внешней проверки на эту потерю. Вы были бы как человек с болезнью Альцгеймера, у которого есть электронный помощник, который сообщает ей имена людей, которых она забыла. Пациент с болезнью Альцгеймера, вероятно, знает о помощнике. Вы, напротив, можете совершенно не обращать внимания на работу вашего имплантированного помощника. Тот факт, что вы выполняете все задачи, которые вы раньше выполняли, лишает вас какой-либо осведомленности о продолжающемся сокращении вашего ума.","title":"По какой причине мы думаем, что «загруженный ум» - это нечто иное, чем книга правил, которую компьютер использует, чтобы притвориться вами?","subreddit_name_prefixed":"r/transhumanism","ups":61,"created":1559683217,"link_flair_background_color":"","id":"bwomc1","author":{"name":"--Aeo--"},"permalink":"/r/transhumanism/comments/bwomc1/what_reason_do_we_have_to_think_an_uploaded_mind/","url":"https://www.reddit.com/r/transhumanism/comments/bwomc1/what_reason_do_we_have_to_think_an_uploaded_mind/","created_utc":1559654417}