{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Некоторое время назад я сыграл свою собственную приключенческую игру под названием «Киборг» от Трейси Кэнфилд.\n\n> Я, Киборг, это интерактивный научно-фантастический роман на 300 000 слов Трейси Кэнфилд. Он полностью основан на тексте, без графики и звуковых эффектов и питается огромной, неостанавливаемой силой вашего воображения.\n\n> Быть киборгом-копией знаменитого преступника Ипсиланти Роу имеет множество преимуществ. Но когда ваш кибернетический мозг начинает выходить из строя, только редкая и устаревшая часть может снова заставить ваши системы функционировать. Путешествуйте по галактике, выслеживая недостающую часть.\n\nПо сути, вы - пожилой клон андроида, которого бросил их пресловутый мошеннический «отец» и теперь уклоняетесь от сборщиков долгов и мстителей, обыскивая галактику для замены кибернетической части (сенсорной шины), которая с тех пор вышла из производства. Если вы не получите эту часть в ближайшее время, вы потеряете все свои чувства и окажетесь в ловушке в безмолвной темноте. Также ваш оригинал может найти вас и вернуть вам право собственности.\n\nЕсли вы хотите поиграть в нее, воспользуйтесь ссылкой [https://www.choiceofgames.com/i-cyborg/#utm_medium=web&utm_source=ourgames).\n\n\nМашины по-прежнему подвержены эрозии, износу, накоплению вредных веществ и блокированию, что может привести к неработоспособности в сильно дифференцированных, высокоинтегрированных подсистемах.\n\nИсходя из опыта, вряд ли есть основания полагать, что машины более долговечны или устойчивы в долгосрочной перспективе, чем биологические системы.\n\n\nКонечно, вы можете заменить детали машин, но мы также можем заменить биологические детали. Конечно, они могут быть некоторым ограничением для замены нейронов и нервов, но неясно, что искусственные нейроны не будут иметь такие же ограничения, возможно, нервы и нейроны в целом имеют общие ограничения.","title":"Я не думаю, что слышал о компьютере (или сложной машине) более века. Почему мы предполагаем, что замена наших биологических частей на кибернетику заставит нас жить дольше?","subreddit_name_prefixed":"r/transhumanism","ups":25,"created":1559786683,"link_flair_background_color":"","id":"bx5q10","author":{"name":"--Aeo--"},"permalink":"/r/transhumanism/comments/bx5q10/i_dont_think_i_have_heard_of_a_computer_or/","url":"https://www.reddit.com/r/transhumanism/comments/bx5q10/i_dont_think_i_have_heard_of_a_computer_or/","created_utc":1559757883}