{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Если я хочу провести какое-то исследование или, если идти дальше, какую-то новую технологию, которую я хочу разработать, каковы мои варианты? Вот что я знаю:\n\n## Academia:\nнайти подходящую лабораторию и присоединиться к ней и получить (точнее, сделать для себя) возможность работать над тем, над чем вы хотите работать. Хотя научные круги обычно не занимаются НИОКР (они занимаются исследованиями, а не разработками. Насколько я знаю).\n\n##Частный сектор:\nоснование исследовательской компании. Я думаю, что это наиболее гибкий выбор, потому что вас не пугает медленный темп и низкое финансирование большинства научных кругов. При этом, финансирование должно прийти откуда-то. Большинство исследовательских компаний / групп имеют какой-либо продукт или являются ребенком, чей родитель имеет какой-либо продукт. Я не знаю, как еще можно финансировать исследовательскую компанию ... возможно, консалтинг? Или обратиться к некоторым чрезвычайно богатым людям и изначально финансироваться исключительно за счет инвесторов?\n\n##Правительство:\nНадеюсь, что правительство заинтересовано тем же, что и вы, и согласится финансировать проект на его основе. Я знаю об этом меньше всего, и я полагаю, что вам нужно знать несколько важных кадров в правительстве, чтобы хотя бы получить шанс представить свою идею в области исследований / разработок. Также нет гарантии, что вы будете включены в проект.\n\n\n\nЕсли у вас есть какие-либо идеи, или вы видите какие-либо заблуждения или упущения в моих мыслях, пожалуйста, дайте мне знать! Любые идеи приветствуются.","title":"В целом, каковы пути получения ответа на вопрос исследования / разработки технологии?","subreddit_name_prefixed":"r/transhumanism","ups":1,"created":1561702348,"link_flair_background_color":"","id":"c6bu32","author":{"name":"schartzchild_radius"},"permalink":"/r/transhumanism/comments/c6bu32/in_general_what_paths_are_there_to_getting_a/","url":"https://www.reddit.com/r/transhumanism/comments/c6bu32/in_general_what_paths_are_there_to_getting_a/","created_utc":1561673548}