{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"«Лица, совершающие убийства и другие преступления личного насилия, часто не предумышляют свои преступления». - Американский союз гражданских свобод, дело против смертной казни\n\n\n\n\nБольше всего меня пугает угроза непроизвольного процесса, называемого эмоциями. Вы можете убежать от угроз, таких как оскорбительные родители, но не от своих собственных эмоций. Искусство, изображающее любой вид насилия (супергерои и т. Д.), Часто демонстрирует гнев, порождающий насилие (дающее нам ясное, независимое представление о насилии от третьего лица, чтобы мы могли засвидетельствовать его ужас); часто в реальной жизни, согласно ACLU, происходит то же самое, что и искусство, содержащее любую форму насилия: порожденную импульсом и эмоциями. Насколько я читал, насилие в семье связано не только с насилием (или принуждением), но и с желанием контролировать ситуацию; очень человеческое желание (под гневом насилия, я думаю, есть страх потерять контроль). Не говоря уже об импульсивности, дефиците социальных навыков и т. Д.\n\n\n\n\nЕсли мы добьемся успеха, у нас никогда не останется ни сострадания, ни импульсивного контроля, ни того, чтобы мы рассматривали других людей как людей, а не как объекты. Мы не были бы людьми в этом аспекте, но выгоды ... Я не могу понять, сколько мы получим ...\n\n\n\n\nДля меня это очарование трансгуманизма: способность управлять эмоциями. Мой оскорбительный отец однажды сказал подумать, прежде чем делать что-то из эмоционального импульса; несмотря на проявленное им лицемерие, то, что он сказал, было полностью обоснованным, даже если ребенок сказал это (и попытка опровергнуть его аргумент - это призыв к лицемерию; нападение ad hominem).","title":"Я предпочел бы быть человечнее других, чем быть человеком и способным вызвать насилие и оскорбительный контроль; hamartia, которым обладают все люди","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1562225343,"link_flair_background_color":"","id":"c8va80","author":{"name":"WeTheSummerKid"},"permalink":"/r/transhumanism/comments/c8va80/i_would_rather_be_humane_to_others_than_be_human/","url":"https://www.reddit.com/r/transhumanism/comments/c8va80/i_would_rather_be_humane_to_others_than_be_human/","created_utc":1562196543}