{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Таким образом, кажется, что в этом субмарине есть большая поддержка коммунизму / анархизму, что касается меня. Я полагаю, что сообщество трансгуманистов разумно и разумно, поэтому видеть вопиющие плохие и невозможные идеи очень проблематично. Это научное сообщество, поэтому я удивлен очевидной логике, и данные здесь игнорируются.\n\nАнархизм и коммунизм не являются реальными экономическими моделями, и их невозможно успешно поддерживать. Они не являются законными или жизнеспособными, как показывает история снова и снова. Даже так называемые \"социалистические\" страны, такие как Скандинавия, которые обычно приводятся в качестве примеров, по-прежнему являются капиталистическим и свободным рынком. Я обеспокоен, когда вижу антикапиталистические настроения на форуме по трансгуманизму.\n\nС уважением, анархизм невероятно тупой и недалекий ... действительно подумайте о том, как он работает. Откуда взялась еда? Кто согласится стать фермером? Кто согласится работать на заводе по переработке пищевых продуктов? Кто согласится ехать в продуктовые магазины или откуда вы думаете, что еда приходит? Как это все \"работает\"? Кто согласится быть дворником?\n\nКапиталистическая модель - лучшая на сегодняшний день модель, потому что она * стимулирует * выполнять необходимые задачи для социального функционирования. Как именно все будет работать в анархистском обществе? Откуда мы получим власть? Кто согласится работать на фабриках? Кто организует внедрение любых трансгуманистических биотехнологий, которые у нас есть?\n\nЯ никогда не понимаю, как люди ожидают, что общество анархизма будет работать ... нет стимула для выполнения неблагоприятных задач, это привело бы к насилию между людьми по поводу того, кто \"выбран\" для этого, и к обиде. Невозможно заставить работать и поддерживать.","title":"Итак, о коммунизме и анархизме, которые (удивительно) популярны здесь.","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1562670208,"link_flair_background_color":"","id":"cav33k","author":{"name":"Florient"},"permalink":"/r/transhumanism/comments/cav33k/so_about_communism_and_anarchism_which_seem_to_be/","url":"https://www.reddit.com/r/transhumanism/comments/cav33k/so_about_communism_and_anarchism_which_seem_to_be/","created_utc":1562641408}