{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Привет товарищи трансгуманисты! Я пришел к конкретному вопросу некоторых дезинформированных и дезинформированных представителей общественности об этом аспекте трансгуманизма.\n\nТо, что используется, - это сложная проблема сознания (HPC здесь), но они очень поверхностны. Как и известные шарлатаны Дипак Чопра и Стюарт Хамерофф, они просто используют аргумент «Субъективный опыт» и «чувства», чтобы аргументировать эту проблему. Но это неправильно и зацикленная проблема. Мы знаем, какие силы вызывают Сознательный опыт и чувства, и мы можем определенно выйти за пределы и открыть для себя все больше и больше. Мы даже разгадали одну из самых больших загадок - «Время» с помощью теории относительности Эйнштейна. Другие должны быть Cakewalk. Я верю тем, кто верит, что эти странные теории о Сознании являются Религиозными, Квази-Религиозными или просто хотят чувствовать себя особенными, или, если не какой-либо из этих категорий, они просто глупы и дезинформированы.\n\nHPC просто возвращается назад каждый раз, когда что-то пытаются доказать. Его просто не существует. Сознание не может существовать иначе, чем как вычисление. Это потому, что Сознание, если его наблюдать сам, кажется, не существует как сущность. Все ваше сознание является результатом самого объективного мира. Другим аргументом, который они приводят, является «Аргумент вечного забвения», еще одна чепуха, которую необходимо вырвать из научного мира, как и такие понятия, как первородный грех, джаханнам / геенна, призрачные души, восточное перевоплощение, теория излучения глаз и т. Д.\n\nВечный Забвение не существует из-за парадокса Времени и Ничто. Чтобы это существовало, вы должны быть в состоянии представить что-то до рождения, что невозможно. Время просто не существовало, и так будет после «смерти», которая станет паузой в наших вычислениях и возобновится после загрузки.\n\nПарадокс телетранспорта - еще один аргумент, используемый Майклом Шермером. Но и это не помогает. Как будто вы оживляете две копии с двумя POV, это не что-то о средах или частицах, а скорее координаты пространства-времени. Я уверен, что мы можем решить это довольно легко и найти то, что является настоящим «вами», а что «копией». ТТП - это просто похмелье нашего дуалистического прошлого.\n\nЧто вы, ребята, думаете об этом? Вы можете добавить больше точек, связанных с названием.","title":"Трансгуманизм и Сознание: недоразумения и решения","subreddit_name_prefixed":"r/transhumanism","ups":24,"created":1562776267,"link_flair_background_color":"","id":"cbe41m","author":{"name":"FinnicSpaceWorld"},"permalink":"/r/transhumanism/comments/cbe41m/transhumanism_and_consciousness_the/","url":"https://www.reddit.com/r/transhumanism/comments/cbe41m/transhumanism_and_consciousness_the/","created_utc":1562747467}