{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"\n\nhttps://preview.redd.it/7sfwq9dp0qa31.jpg?width=4160&format=pjpg&auto=webp&s=aabd5b45a81c5894a50359220716d5796a046bf1\n\nВ четверг 11 июля Arkam и Life Pass Filter представили свое оригинальное творение под названием «Asilomar» во время 11-й конференции «За пределами гуманизма» в Католическом университете Лилля.\n\nМы создали аудио и визуальное представление, сочетающее проекционное картирование и генеративную музыку на основе 23 принципов Асиломар. Принципы были буквально проиллюстрированы.\n\n40-минутный спектакль разделен на 23 части генеративной музыки. Каждый принцип читается голосовым преобразованием текста на разных языках. 24 языка были использованы для сопоставления с различными национальностями исследователей, приглашенных на конференцию.\n\nНа сцене слева от Антуана находится символическое оливковое дерево (Life Pass Filter) с контактным микрофоном внутри, чтобы вызывать звуки, связанные с Принципами при касании, и мгновенные видеоэффекты на картографической проекции. Справа от него находится стакан воды с гидрофоном, который также запускает видеоэффекты. Наконец, использование тактильной перчатки (созданной французской компанией Specktr) создает совершенно новый подход к взаимодействию звука и видео.\n\nПредполагается, что общая результативность отражает способность человека уважать свои этические границы, чтобы избежать катастрофических решений.\n\nМы будем рады поделиться с вами больше об этом. Не стесняйтесь, если у вас есть какие-либо вопросы :)","title":"11-я конференция «За пределами гуманизма» - Arkam & Life Pass Filter","subreddit_name_prefixed":"r/transhumanism","ups":1,"created":1563335786,"link_flair_background_color":"","id":"ce24th","author":{"name":"lifepassfilter"},"permalink":"/r/transhumanism/comments/ce24th/the_11th_beyond_humanism_conference_arkam_life/","url":"https://www.reddit.com/r/transhumanism/comments/ce24th/the_11th_beyond_humanism_conference_arkam_life/","created_utc":1563306986}