{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"","title":"Черное зеркало","subreddit_name_prefixed":"r/transhumanism","ups":443,"created":1563474925,"link_flair_background_color":"","id":"ceqs82","author":{"name":"TheAllmightyKurwaman"},"permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/","url":"https://i.redd.it/b52gb03di1b31.jpg","created_utc":1563446125,"replies":[{"ups":90,"link_id":"t3_ceqs82","replies":[{"ups":2,"link_id":"t3_ceqs82","id":"euelgxf","author":"IAmAWizard_AMA","parent_id":"t1_eudxzzl","subreddit_id":"t5_2qlii","body":"Humans can be bad, and technology makes it easier for us to be bad","body_html":"<div class = \"md\"> <p> Люди могут быть плохими, а технологии помогают нам быть плохими </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/euelgxf/","name":"t1_euelgxf","created":1563776161,"created_utc":1563747361,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eu4j1rd","author":"IAmAWizard_AMA","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"I see Black Mirror as taking some negative aspect of humanity that already exists (social media obsession, obsession with hurting criminals instead of rehabilitating them, the military dehumanizing the enemy, etc) and then using slightly advanced technology to amplify/exaggerate that aspect\n\nSo the problem isn't with technology, the problem is with how we use that technology","body_html":"<div class = \"md\"> <p> Я вижу, что «Черное зеркало» использует какой-то негативный аспект человечества, который уже существует (одержимость социальными сетями, одержимость причинять боль преступникам вместо их реабилитации, вооруженные силы, унижающие достоинство врага и т. д.), а затем использовать немного продвинутая технология, чтобы усилить / преувеличить этот аспект </p>\n\n<p> Так что проблема не в технологии, а в том, как мы используем эту технологию </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4j1rd/","name":"t1_eu4j1rd","created":1563484177,"created_utc":1563455377,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":7,"link_id":"t3_ceqs82","id":"eu4p6kt","author":"SenpaiPete","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"Technology is always balanced on a knife edge, all of the greatest human inventions and technological breakthroughs could have swung either way if you think about it. I am trying to remember a Ray Kurzweil quote, where he spoke about this exact topic but I am at a loss for the quote right now. That said, I think Neuralink is going to be amazing for humanity and the challenges we face as a global community.","body_html":"<div class = \"md\"> <p> Технология всегда балансирует на острие ножа, все величайшие человеческие изобретения и технологические прорывы могли бы пойти в любую сторону, если подумать. Я пытаюсь вспомнить цитату Рэя Курцвейла, где он говорил именно на эту тему, но сейчас я в недоумении от этой цитаты. Тем не менее, я думаю, что Neuralink будет удивительным для человечества и проблем, с которыми мы сталкиваемся как глобальное сообщество. </P>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4p6kt/","name":"t1_eu4p6kt","created":1563488753,"created_utc":1563459953,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":21,"link_id":"t3_ceqs82","id":"eu4lq0z","author":"Cryonix92","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"So true. One of the top comments on the Neuralink youtube video was something about black mirror with a ton of likes. People are stupid sometimes.\n\nThe harsh truth is, we aren't going to advance at all as a species if everyone is too afraid to try something different.","body_html":"<div class = \"md\"> <p> Так и есть. Одним из главных комментариев к видео на YouTube на Neuralink было что-то о черном зеркале с кучей лайков. Люди иногда глупы. </P>\n\n<p> Суровая правда в том, что мы вообще не будем развиваться как вид, если все слишком боятся попробовать что-то другое. </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4lq0z/","name":"t1_eu4lq0z","created":1563486271,"created_utc":1563457471,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":4,"link_id":"t3_ceqs82","id":"eu4o18e","author":"metathesis","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"The truth is, the same technology that could give us dominion over ourselves could give others new dominion over us too. Transhumanism holds power. Who gets to wield that power is an important question.\n\nPeople are right to be scared. We are also right to see potential. But we must be careful not just as individuals but as a society in order to reach that potential, and that *is* a treacherous path to walk.","body_html":"<div class = \"md\"> <p> Правда в том, что та же технология, которая может дать нам власть над собой, может дать другим и новую власть над нами. Трансгуманизм держит власть. Кто получает эту власть - важный вопрос. </P>\n\n<p> Люди правы, когда боятся. Мы также правы, чтобы увидеть потенциал. Но мы должны быть осторожны не только как личности, но и как общество, чтобы раскрыть этот потенциал, и что <em> это </em> коварный путь для прогулок. </P>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4o18e/","name":"t1_eu4o18e","created":1563487948,"created_utc":1563459148,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":9,"link_id":"t3_ceqs82","replies":[{"ups":1,"link_id":"t3_ceqs82","id":"eu4etaq","author":"[deleted]","parent_id":"t1_eu4e1om","subreddit_id":"t5_2qlii","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4etaq/","name":"t1_eu4etaq","created":1563480350,"created_utc":1563451550,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eu4bybe","author":"[deleted]","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu4bybe/","name":"t1_eu4bybe","created":1563477229,"created_utc":1563448429,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_ceqs82","id":"eu58gka","author":"usedOnlyInModeration","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"To be fair, improving cognitive intelligence without also improving emotional intelligence is just a recipe for more inequality and unrest.","body_html":"<div class = \"md\"> <p> Чтобы быть справедливым, улучшение когнитивного интеллекта без улучшения эмоционального интеллекта - это всего лишь рецепт для увеличения неравенства и волнений. </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu58gka/","name":"t1_eu58gka","created":1563500913,"created_utc":1563472113,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":2,"link_id":"t3_ceqs82","id":"eu5zpo4","author":"Yvaelle","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"Black mirror is brilliant and valuable to transhumanism because it makes people reflect on how next gen technologies could be beneficial and detrimental. \n\nThese technologies will be faster to develop and adopt because of science fiction like black mirror giving everyone a basis for comparison and a headstart on the philosophical questions new technology raises. \n\nAll black mirror episodes show both the positives and negatives of new technology. They open with the positives in the first half of the episodes,and end with the negatives. That's why its dystopian, if you flip that structure it would feel utopian (ex. Star Trek TNG, start with a problem, end with the problem resolved). \n\nThey are both equally valuable though in getting people to engage with new ideas. They help move us forward.","body_html":"<div class = \"md\"> <p> Черное зеркало блестяще и ценно для трансгуманизма, потому что оно заставляет людей задуматься о том, как технологии следующего поколения могут быть полезными и вредными. </Р>\n\n<p> Эти технологии будут быстрее развиваться и внедряться благодаря научной фантастике, подобной «черному зеркалу», которая дает каждому основу для сравнения и дает преимущество в философских вопросах, которые ставит новая технология. </Р>\n\n<p> Все эпизоды с черным зеркалом показывают как положительные, так и отрицательные стороны новой технологии. Они открываются с позитивами в первой половине эпизодов и заканчиваются негативами. Вот почему его антиутопия, если вы перевернете эту структуру, она будет выглядеть утопической (например, Star Trek TNG, начните с проблемы, закончите с решенной проблемой). </Р>\n\n<p> Они оба одинаково ценны, хотя и заставляют людей взаимодействовать с новыми идеями. Они помогают нам двигаться вперед. </P>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu5zpo4/","name":"t1_eu5zpo4","created":1563517805,"created_utc":1563489005,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_ceqs82","id":"eu67fg5","author":"Vikinglobster","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"Transhumanism style tech would be a waste on todays Humans, which is i think closer to what Black Mirror is actually trying to say (at least the early seasons) \n\nI used to be super into transhumanism but humans as a species need to make a change in our perspective and mindset before were ready for anything to take us beyond human bounds, imo. \n\nWe cant even be good to eachother and our planet with the tech we have, thinking that tech will become available and used for good and not a super expensive tool for the powers at be to continue being at power and oppressing the rest is an idyllic pipe dream unfortunately\n\ntl;dr If everyones a superhuman cyborg that lives forever but were still assholes to eachother does it really matter?","body_html":"<div class = \"md\"> <p> Технология в стиле трансгуманизма была бы пустой тратой на современных людей, что, я думаю, ближе к тому, что на самом деле пытается сказать Черное Зеркало (по крайней мере, в начале сезона) </p>\n\n<p> Раньше я был очень увлечен трансгуманизмом, но люди как вид должны были изменить нашу точку зрения и мышление, прежде чем были готовы ко всему, что могло бы вывести нас за человеческие границы, imo. </Р>\n\n<p> Мы даже не можем быть хорошими друг другу и на нашей планете с имеющейся у нас технологией, полагая, что технология станет доступной и будет использоваться для добра, а не сверхдорогим инструментом для держав, чтобы продолжать оставаться у власти и притеснять остальных. к сожалению, идиллическая несбыточная мечта </p>\n\n<p> tl; dr Если каждый человек - сверхчеловеческий киборг, который живет вечно, но все еще был придурками, то имеет ли это значение? </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu67fg5/","name":"t1_eu67fg5","created":1563522632,"created_utc":1563493832,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_ceqs82","id":"eu9iwbh","author":"Deadeye_Spider","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"They've sided with The Many. Insects....","body_html":"<div class = \"md\"> <p> Они на стороне многих. Насекомые .... </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu9iwbh/","name":"t1_eu9iwbh","created":1563610583,"created_utc":1563581783,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":1,"link_id":"t3_ceqs82","id":"eucx924","author":"theunknown9821","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"😑","body_html":"<div class = \"md\"> <p> 😑 </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eucx924/","name":"t1_eucx924","created":1563719361,"created_utc":1563690561,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":0,"link_id":"t3_ceqs82","id":"eu554cv","author":"perkam","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"Quite accurate.","body_html":"<div class = \"md\"> <p> Довольно точно. </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu554cv/","name":"t1_eu554cv","created":1563498898,"created_utc":1563470098,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":0,"link_id":"t3_ceqs82","id":"eu5er0m","author":"bstanfordb","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":"Old Black Man.","body_html":"<div class = \"md\"> <p> Старый черный человек. </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu5er0m/","name":"t1_eu5er0m","created":1563504799,"created_utc":1563475999,"subreddit_name_prefixed":"r/transhumanism","depth":0},{"ups":-2,"link_id":"t3_ceqs82","replies":[{"ups":0,"link_id":"t3_ceqs82","id":"eu620ve","author":"Le_German_Face","parent_id":"t1_eu60wn3","subreddit_id":"t5_2qlii","body":">presuming no weapons such as guns were being used.\n\nGuns are the improvement that makes us stronger.\n>Improving things like our endurance, stamina, durability, agility, and so on would do the same thing.\n\nWhat are cars? What are bicycles? What are planes?\n>And imagine what we could do as a species if we all had the computational capability for things like math and science of a supercomputer, \n\nWe already have computers and we already have a great level of control over them.\n>and instant access to all of human knowledge. \n\nInternet. Wikipedia.\n>We could conquer the galaxy for ourselves if we so wished.\n\nWhat keeps us from doing it?\n>I see nothing wrong with strapping wings to my back if I can. Why not?\n\nJust entering a plane doesn't need you to be physically altered.\n>Transhumanism is about both.\n\nNo it isn't. You are talking teenage comic book fan bullshit.\n>It's about enhancing human capabilities all-around.\n\nHumans shape their environment. They don't let the environment shape them.\n\nAnimals get shaped by their environment.\n>Shockingly, being biologically immortal won't do you much good when you get hit by a car. \n\nI wouldn't be so sure about that. Also I personally believe we will have something like black boxes that carry our conscience.\n>In that case, something like Superman levels of durability, the ability to fly, or Captain America levels of speed and reflex might help.\n\nLooking both sides before crossing the road might help too.","body_html":"<div class = \"md\"> <blockquote>\n<p> предполагая, что оружие, такое как оружие, не использовалось. </p>\n</BLOCKQUOTE>\n\n<p> Оружие - это улучшение, которое делает нас сильнее. </p>\n\n<BLOCKQUOTE>\n<p> Улучшение нашей выносливости, выносливости, выносливости, ловкости и т. д. сделало бы то же самое. </p>\n</BLOCKQUOTE>\n\n<p> Какие машины? Что такое велосипеды? Какие самолеты? </P>\n\n<BLOCKQUOTE>\n<p> И представьте, что мы могли бы сделать как вид, если бы у всех нас были вычислительные возможности для таких вещей, как математика и наука о суперкомпьютере, </p>\n</BLOCKQUOTE>\n\n<p> У нас уже есть компьютеры, и мы уже обладаем большим уровнем контроля над ними. </p>\n\n<BLOCKQUOTE>\n<p> и мгновенный доступ ко всем человеческим знаниям. </Р>\n</BLOCKQUOTE>\n\n<Р> Интернет. Wikipedia. </P>\n\n<BLOCKQUOTE>\n<p> Мы могли бы покорить галактику для себя, если бы захотели. </p>\n</BLOCKQUOTE>\n\n<p> Что мешает нам это делать? </p>\n\n<BLOCKQUOTE>\n<p> Я не вижу ничего плохого в том, чтобы привязать крылья к спине, если смогу. Почему нет? </P>\n</BLOCKQUOTE>\n\n<p> Просто входя в самолет, не нужно, чтобы вы были физически изменены. </p>\n\n<BLOCKQUOTE>\n<p> Трансгуманизм - это то и другое. </p>\n</BLOCKQUOTE>\n\n<p> Нет, это не так. Вы говорите о фуфло подросткового комикса. </P>\n\n<BLOCKQUOTE>\n<p> Речь идет об улучшении человеческих способностей во всем. </p>\n</BLOCKQUOTE>\n\n<p> Люди формируют свое окружение. Они не позволяют окружающей среде формировать их. </P>\n\n<p> Животные формируются под воздействием окружающей среды. </p>\n\n<BLOCKQUOTE>\n<p> Шокирующе, биологическое бессмертие не принесет вам большой пользы, когда вас сбьет машина. </Р>\n</BLOCKQUOTE>\n\n<p> Я не был бы так уверен в этом. Также я лично верю, что у нас будет что-то вроде черных ящиков, несущих нашу совесть. </P>\n\n<BLOCKQUOTE>\n<p> В этом случае может помочь что-то вроде уровня прочности Супермена, способности летать или уровня скорости и рефлекса Капитана Америка. </p>\n</BLOCKQUOTE>\n\n<p> Также может помочь осмотр обеих сторон перед переходом через дорогу. </p>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu620ve/","name":"t1_eu620ve","created":1563519218,"created_utc":1563490418,"subreddit_name_prefixed":"r/transhumanism","depth":2}],"id":"eu5wrm1","author":"Le_German_Face","parent_id":"t3_ceqs82","subreddit_id":"t5_2qlii","body":">Technology that could drastically improve human intelligence and physical abilities\n\nFew questions here:\n\n>could\n\nand \n\nWhy do you want to improve intelligence and physical abilities? \n\nDo you want to fly and shoot lasers from your eyes? Transhumanism is about making us immortal and not about Marvel bullshit.","body_html":"<div class = \"md\"> <blockquote>\n<p> Технология, которая может кардинально улучшить интеллект и физические способности человека </p>\n</BLOCKQUOTE>\n\n<p> Несколько вопросов здесь: </p>\n\n<BLOCKQUOTE>\n<Р> может </p>\n</BLOCKQUOTE>\n\n<p> и </p>\n\n<p> Почему вы хотите улучшить интеллект и физические способности? </Р>\n\n<p> Хотите летать и стрелять лазерами из глаз? Трансгуманизм - это то, что делает нас бессмертными, а не чушь чудо. </P>\n</DIV>","permalink":"/r/transhumanism/comments/ceqs82/blecc_mirrer/eu5wrm1/","name":"t1_eu5wrm1","created":1563515918,"created_utc":1563487118,"subreddit_name_prefixed":"r/transhumanism","depth":0}]}