{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Вы хотите разумный искусственный интеллект? Иметь ребенка. Это коренным образом изменило мою точку зрения на детей, когда я думал о них таким образом.\n\nРазновидность интеллекта произошла, когда люди эволюционировали. Мир - это просто группа животных, хаотично бегающих в течение миллиардов лет, а затем * БАМ *, за несколько тысячелетий мы экспоненциально расширились.\n\n\n\nНо, конечно, ** ИИ не ограничен пределами эволюции **. Эволюция исключительно способствует выживанию, размножению (изнасилованию) и защите потомства. Он очень медленный, полный недостатков (рак) и поощряет эгоистичное поведение (паразиты, хищники и т. Д.).\n\nМы нетерпеливы и амбициозны, и мы хотим дать понять эволюции. Хотя это может включать спасение множества животных (и людей), находящихся под угрозой исчезновения по какой-то причине, мы решаем множество проблем, которые вызывают это.\n\n\n\n** Эволюция действительно превзошла себя, когда она создала нас. **\n\nНи один другой вид не чистит зубы, потому что они предназначены, чтобы длиться до твоей смерти. Но мы выдвинули себя далеко за пределы заданной продолжительности жизни эволюции, и мы выяснили, как массово производить пищу, токсичную для наших ртов.\n\nНи один другой вид не подвергает опасности любой другой вид на планете. На самом деле, большинство наших усилий по спасению других людей связано с тем, что «именно мы» стали причиной их угрозы. Мы должны снова активно «бороться» с усилиями эволюции, чтобы заставить нас доминировать на планете (сексуально).\n\nНи один другой вид не хочет добровольно отключать себя ([не в защиту семьи]  (https://en.m.wikipedia.org/wiki/Animal_suicide) ) или не размножаться ([которую может показать Википедия]  (https://en.m.wikipedia.org/wiki/Voluunte_childlessness) ). Может быть, эволюция включала переключатель убийства.\n\n\n\nС помощью ИИ мы можем создать что-то, не подверженное эволюции, которое полностью заботится о планете и помогает нам бороться с нашим собственным властным человеческим превосходством.\n\n\n\n#TL; DR - Божий план будет дерьмом; мы создаем что-то, что работает менее «таинственными» способами, чтобы дать ему палец.","title":"В некотором смысле, многое из того, что мы хотим от будущего ИИ, уже достигнуто в природе, но теперь мы берем эволюцию в свои руки.","subreddit_name_prefixed":"r/transhumanism","ups":29,"created":1564183110,"link_flair_background_color":"","id":"ci45x9","author":{"name":"Zephandrypus"},"permalink":"/r/transhumanism/comments/ci45x9/in_a_way_a_lot_of_things_we_want_from_the_future/","url":"https://www.reddit.com/r/transhumanism/comments/ci45x9/in_a_way_a_lot_of_things_we_want_from_the_future/","created_utc":1564154310}