{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Когда Николай Кардашев, советский ученый, предложил Civ Type I (использующий всю земную энергию), концепция энергоэффективности отсутствовала, поскольку топлива было много.\n\n\n\nОднако с тех пор определение было изменено, чтобы означать что-то, что придет после этой цивилизации. Сингулярность, Космические завоевания и все такое.\n\nРанее я говорил, что свинья Наполеона на ферме Оруэлла достигла трансгуманизма (или, в данном случае, транспорцизма), получив возможность ходить двумя ногами и приобретая способность свободно вести переговоры с людьми. Другие животные смотрят на него свысока, но, по мнению Наполеона, транспортеры действительно намного более равны, чем другие животные. Наполеон достиг чего-то, о чем другие животные не могли и мечтать, как, например, Цезарь в недавней итерации «Планеты обезьян», возможно, лучший трансчеловеческий (хотя и там транссимианский) фильм, который когда-либо снимали.\n\n\n\nТрансгуманисты в цивилизации типа I с колониями в солнечной системе и за ее пределами не могут быть равны людям. Для всех практических целей они боги. Пытаться угадать, что они достигают, а сила подобна муравью, пытающемуся представить, что такое слон.\n\n\n\nДо того, как это произойдет, сегодняшние технические дорогие достигнут экономической сингулярности (то есть контролируют все активы земли), захватят США и повсюду в мире и введут технофеодализм. Только высшие члены таких компаний будут трансгуманинами класса А и, вероятно, станут богами, такими как Юпитер, Тор или Вишну.\n\n\n\nЭто трансгуманизм в цивилизации типа I. В конце концов, они могут быть смертными, но обычные люди не будут беспокоиться об этом, поскольку их продолжительность жизни будет составлять около миллиона лет.","title":"Трансгуманы и цивилизация I типа","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1564574180,"link_flair_background_color":"","id":"ck32jy","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/ck32jy/transhumans_and_type_i_civilization/","url":"https://www.reddit.com/r/transhumanism/comments/ck32jy/transhumans_and_type_i_civilization/","created_utc":1564545380}