{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я думаю, что одна из больших проблем с трансгуманистическими идеями - это огромные расходы, связанные с созданием средств, необходимых для серьезного эксперимента с трансформирующими идеями, не говоря уже о том, чтобы затем масштабировать их до тех пор, пока они не смогут охватить большие слои населения. Поэтому одна из моих собственных забот как трансгуманиста - это созерцание экономики. Экономика здравоохранения чрезвычайно печальна, но она также представляет особый интерес для трансгуманистического проекта, так как умственные способности должны быть хорошо сохранены, недостатки в медицинском доступе должны быть исправлены, а сами больницы представляют собой жизненно важный потенциальный канал распространения технологий, преобразующих технологии. человеческое состояние.\n\nХотя я признаю возможность того, что эта мысль может порождаться только желаемым мышлением, я твердо ожидаю, что потенциал хорошей экономики здравоохранения для оптимизации общего функционирования всей экономики не полностью реализуется ни в одной стране мира. Я могу продемонстрировать, рассуждая, что считаю логичным, что есть хоть один выигрыш в производительности каждой нации на Земле за счет увеличения расходов на здравоохранение.\n\nПример, который я хочу привести в подтверждение этого, заключается в том, что проводится тестирование новой вакцины против гриппа. Эта новая вакцина основана на относительно статической химической топографии стебля вируса гриппа, а не на печально известной химии химического происхождения головки вируса гриппа. Ключевая деталь этого продвижения заключается в том, что он, вероятно, обеспечит гораздо более общую и длительную устойчивость к гриппу. Вакцины - это дешевая профилактическая помощь; не требуется очень много дней потерянной работы, чтобы составить цену на вакцину. Это новое поколение вакцины против гриппа почти наверняка улучшит экономию расходов на здравоохранение, предлагая новое лечение с хорошим соотношением затрат и выгод.\n\nВсего этого достаточно для * одного * предмета. Как рассчитывается стоимость болезни и польза от лечения в целом? Я подозреваю, что мой ответ находится в учебнике колледжа того или иного рода, но по какому предмету я буду искать эту информацию?\n\nЕсли бы информация об эффективном обеспечении здравоохранения находилась или компилировалась, а затем распространялась более широко, это могло бы стать эффективным средством повышения доверия к технологиям, общей экономической мощи и доступа к дорогостоящей инфраструктуре, необходимой для трансгуманистических целей. Поддерживают ли какие-либо действующие в настоящее время НПО эту информацию? Можем ли мы с пользой поделиться им в политических пространствах?","title":"Как рассчитывается экономическая стоимость вопросов здравоохранения?","subreddit_name_prefixed":"r/transhumanism","ups":2,"created":1565091879,"link_flair_background_color":"","id":"cmlias","author":{"name":"ShengjiYay"},"permalink":"/r/transhumanism/comments/cmlias/how_is_the_economic_cost_of_health_issues/","url":"https://www.reddit.com/r/transhumanism/comments/cmlias/how_is_the_economic_cost_of_health_issues/","created_utc":1565063079}