{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Люди страдают каждый день. Бедность - очевидный пример. Невероятные акты страдания были и в настоящее время совершаются, как мы говорим. У многих людей есть желания, которые вредны для других людей (например, человек старше 20 лет, который хочет встречаться с подростком, может создать несбалансированные отношения; другой - это нарциссические родители; еще один - жадность).\n\n\n\n\nПо мере того, как компьютерная графика становится все более неотличимой от реальной жизни, так как достижения в технологии интерфейса мозг-компьютер продолжают происходить, так как совершенствуются эффективные и эффективные системы сбора энергии, как совершенствуются вычисления, так и совершенствуются технологии манипулирования памятью. продолжает происходить, возникает вопрос: будет ли это сближение технологий насыщать ненасытное желание людей потреблять и пожирать счастье (часто в ущерб другому человеку)?\n\n\n\n\nВойдите в Матри. Я имею в виду машину опыта. Теоретический сценарий - это человек 40 лет, желающий испытать «идеализированную подростковую жизнь», подключенный с его согласия к машине опыта: после погружения его предыдущие воспоминания «заблокирован» машиной: он думает как подросток; его мозг восприимчив к музыке, как подросток, и безоговорочно верит, что он подросток, у него есть идеальная девушка-подросток (все другие «человекоподобные существа» в этой машине - достаточно запрограммированные компьютерные программы, называемые p-зомби, чтобы имитировать поведение человека, настолько неразличимое, что программы не вызывают странную реакцию в долине), переходят на поп-панк и электронику хаус-шоу (с давно утерянной музыкой, синтезированной ИИ с использованием алгоритмов: другими словами: ИИ распознает паттерны в старой музыке и пытается, например, создать) , Myspace-эра электроники от старых моделей), пошли на фестиваль поп-панк музыки и т. Д. Человек, подключенный к сети, получит возможность отключиться; Кроме того, эта машина может также уменьшить фанатизм, выставляя фанатика меньшинствам, или эта машина может позволить людям с аутистическим спектром изучать социальные навыки, не причиняя вреда обществу и их друзьям.\n\n\n\n\nЭто предполагает, что мы создали достаточно запрограммированный А.И. система (ы), которая не превратит всю материю во всей Солнечной системе в сырье для изготовления скрепок.\n\n\n\n\nЭто, возможно, фальсифицирует психологический эгоизм и психологический гедонизм.\n\n\n\n\n\nЗвезда поднимает солнце до размера красного карлика (задача не из легких, учитывая, что звезда, поднимающая фунт солнечного вещества, требует энергии МОУ GBU-43 / B), и строит Мозг Стэплдона-Дайсона / Матрешки вокруг красного карлика (мы знать материалы, которые могут выдерживать температуру поверхности красного карлика), и все человечество будет счастливо в течение нескольких триллионов лет (несколько 10 ^ 13 лет, если подъем звезды будет эффективным); чтобы представить это в перспективе, космическое микроволновое фоновое излучение, свидетельство Большого взрыва, исчезнет через триллион лет. Мы еще не достигли жесткого предела для компьютеров, Ютюбер Айзек Артур заявил, что трудно моделировать 6 * 10 ^ 34 человек с одним килограммом вещества: в сочетании с обратимыми вычислениями, это моделирование может выполняться вечно (если протоны, однако, не распадаются, или мы, возможно, уже нашли способ смягчить распад протона, управляя сильной силой).","title":"Машина опыта: окончательный ответ на вопрос о счастье и неравенстве?","subreddit_name_prefixed":"r/transhumanism","ups":11,"created":1565286016,"link_flair_background_color":"","id":"cnjejd","author":{"name":"WeTheSummerKid"},"permalink":"/r/transhumanism/comments/cnjejd/the_experience_machine_the_ultimate_answer_to_the/","url":"https://www.reddit.com/r/transhumanism/comments/cnjejd/the_experience_machine_the_ultimate_answer_to_the/","created_utc":1565257216}