{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я не очень люблю Лавкрафт. Часть его беллетристики основана на плохом понимании науки. Неевклидова геометрия - предмет для изучения, а не приглашение к безумию, и свет в «Цвете из космоса» не следует этим правилам. Его расизм, безусловно, отталкивает, поскольку он склонен превозносить белую расу за счет любой другой.\n\nНо Лавкрафт был превосходным писателем. Он был, пожалуй, одним из лучших в описании одного из страхов, которые преследовали человека на протяжении веков: страх перед рассеянием. Кто может забыть Инсмута или Артура Джермина? Художественная литература полна примеров матери / отца монстров, чья кровь, кажется, существует только для создания мерзостей. Человеческие гибриды не только физически деформированы, но и морально испорчены. Когда они являются примерами моральной силы духа, они всегда должны бороться с стойким сопротивлением, осуществляемым остальным обществом. Смысл такого рода выдумки ясен: следует избегать разногласий.\n\nMiscigenation не является грехом или признаком уродства. Это путь к улучшению. Добавление разнообразия в генофонд - это еще один способ катализировать мутации и находить новые возможности и улучшения. Это не мужчины, что это должно быть соблюдено. Генетика не простая игра для манипулирования. Но мы должны помнить об этом частичке племени в духе человека, чтобы превзойти его.\n\nОчистка от этого страха особенно важна для футуристов и трансгуманистов по двум причинам. Первый - это вопрос экономики. Каждый мозг, который можно использовать для технического прогресса, незаменим и исключает помощь людей из-за предвзятых и устаревших предрассудков. Во-вторых, когда генетические изменения и манипуляции начинают становиться обычными и распространенными, предубеждение против индивидов, подвергшихся этому, становится возможностью, которая может препятствовать прогрессу.\n\nЕсли мы хотим искоренить расизм и достичь следующего состояния прогресса, этот страх должен быть очищен ради последующего поколения. И как только этот страх исчезнет, ​​могут быть открыты и исследованы новые пути для человеческого совершенствования.","title":"Страх смешения и его значение для трансгуманизма","subreddit_name_prefixed":"r/transhumanism","ups":1,"created":1565505994,"link_flair_background_color":"","id":"cooujk","author":{"name":"danielmartin4768"},"permalink":"/r/transhumanism/comments/cooujk/the_fear_of_miscegenation_and_its_importance_to/","url":"https://www.reddit.com/r/transhumanism/comments/cooujk/the_fear_of_miscegenation_and_its_importance_to/","created_utc":1565477194}