{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Прежде всего, пара важных терминов, которые я как бы угоняю:\n\n* [** Qualia **]  (https://en.wikipedia.org/wiki/Qualia)  (форма единственного числа: ** quale **) определяются как отдельные экземпляры субъективного, сознательного опыта. Может быть трудно семантически различать копии одного и того же сознания, и это должно сделать это легче.\n* «Эмуляция» - это результат загрузки мыслей.\n* «Биологический создатель» или «БК» - это изначальный человек, который загрузил свой разум.\n\n\n\n***\n\n\n\nЕсли вы не знаете о проблемах с загрузкой разума, [вот вам раздел Википедии.] <Span translate = \"no\"> (https://en.wikipedia.org/wiki/Mind_uploading#Issues) </ span>\n\nЕсли вы предпочитаете не читать все это, вот краткое резюме:\n\n* Если вы не поддерживаете идею о душах или не думаете, что они могут передаваться между телами, загрузка ума - это просто ваша копия. Ваша текущая цитата все еще умирает.\n* Никто не может проверить, было ли сознание перемещено, скопировано и т. Д. Для посторонних подражание может быть абсолютно бездушным или «беспомощным», и у них не будет никакого способа узнать.\n* Какими правами должна обладать эмуляция? Они считаются с той же «идентичностью», что и BC: SSN, имущественные и служебные должности, ценность подписи и т. Д.? Могут ли быть созданы эмуляции для использования потенциально бесчеловечных экспериментов?\n * Насколько «завершена» загрузка, чтобы это было правдой?\n* Очевидные причины расистских, ксенофобских и религиозных предрассудков.\n\n\n\n***\n\n\n\nУ меня есть ряд мыслей по этому вопросу.\n\n\n\n\\ # 1: Вы бы больше не боялись смерти, если бы знали, что ваше подражание будет влиять на вашу личность?\n\nКонечно, на этот вопрос в настоящее время невозможно ответить, независимо от того, что вы думаете. Вы не можете знать наверняка, как бы вы отреагировали, пока не столкнетесь с этим. Кроме того, мы точно не знаем тонкостей нашего страха смерти - что движет этим.\n\nС точки зрения эволюции, наш страх смерти - как и все остальное - проистекает просто из его способности помогать нашим генам выживать и размножаться. Это все, что я могу сказать по этому вопросу.\n\n\n\n\\ # 2: Я считаю, что BC должен определить права эмуляции до загрузки.\n\nВ отличие от детей, загрузка мыслей создает точную копию вас в момент загрузки. Сказать «они сами по себе» на самом деле не относится. Во многом так же, как вы можете контролировать свой собственный quale, вы должны иметь возможность контролировать копии этого quale.\n\nНесмотря на это, контракты и законы вокруг этого должны быть очень строгими. Человек не должен просто быть в состоянии подписать эмуляции для гнусных целей, не осознавая этого (то есть Cookies in Black Mirror). Вам абсолютно необходимо иметь право отобрать у кого-либо эмуляцию или прекратить ее в любое время. Ни при каких обстоятельствах эмуляция не должна принадлежать кому-либо, кроме ее БК.\n\n\n\n\\ # 3: Возможно, эмуляции должны получать модификации в зависимости от того, как они используются.\n\nНапример, устранение страха смерти, боли или чувства скуки. ** Страх смерти должен быть повсеместно исключен из эмуляций **, за исключением случая, когда его БК умирает и он занимает их место. Опять же, мы не хотим ситуации с «черным зеркалом», когда подражание эмуляции не позволяет вам прекратить его против вашего лучшего суждения. Кроме того, самосохранение неизбежно ведет к апокалипсису ИИ, и большинство из нас этого не хочет.\n\nНесмотря на ваше отношение к правам на цифровые копии, пытать их совершенно не нужно. Вы можете просто дать им эйфорию за то, что вы хотите, и они это сделают.","title":"Проблемы и последствия загрузки мыслей.","subreddit_name_prefixed":"r/transhumanism","ups":9,"created":1565991732,"link_flair_background_color":"","id":"cr6j5n","author":{"name":"Zephandrypus"},"permalink":"/r/transhumanism/comments/cr6j5n/the_issues_and_implications_of_mind_uploading/","url":"https://www.reddit.com/r/transhumanism/comments/cr6j5n/the_issues_and_implications_of_mind_uploading/","created_utc":1565962932}