{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Дни человеческих рас истекли. Они хорошо провели время, но их конец настал. Ничто не может остановить или изменить это, кроме, возможно, некоторого стихийного бедствия, которое возвращает человечество в каменный век. И даже тогда в отдаленных местах будет храниться слишком много технологий, которые человечество вернет через пару столетий.\n\n\n\nСегодняшние победители будут развиваться в различных видах трансгуманов. Некоторые смогут плавать без всяких ухищрений в космосе. Другие будут выполнять работу нескольких тяжелых оборудований. Лучше всего было бы, чтобы трансгуманы могли мигрировать от тела к телу в соответствии со своими прихотями.\n\nРанее я говорил, что те, кто первыми станут трансгуманами, станут самой умной, конкурентоспособной, враждебной и беспощадной частью человечества. Они не будут делить землю и пространство с кроткими, которые будут использоваться в качестве подопытных и выбрасываться, как лабораторные крысы.\n\n\n\nСегодняшние победители, ставшие Homo Deus, поделятся на несколько подвидов, которые не будут воспроизводимыми, но поскольку размножение больше не требуется для рода Homo Deus, это будет спорным.\n\n\n\nЦель трансгуманизма - эволюционировать в новый вид, который будет соответствовать Civilization 1.0, космической культуре, которая покорит, эксплуатирует и доминирует над всей Местной группой. Любые человеческие страдания, которые будут иметь место, не будут иметь значения и не будут записаны.\n\nВпервые в истории вселенной вид обрел способность заменять себя лучшей, гораздо более совершенной и гораздо более совершенной версией самого себя, и он будет использовать эту силу в максимальной степени, даже если это будет означать конец тех, кто не мог продвинуться. Извините, остальные обречены. Но это эволюция.","title":"Цель трансгуманизма развивается в новый вид","subreddit_name_prefixed":"r/transhumanism","ups":3,"created":1566312977,"link_flair_background_color":"","id":"cstxfg","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/cstxfg/the_goal_of_transhumanism_is_evolving_into_a_new/","url":"https://www.reddit.com/r/transhumanism/comments/cstxfg/the_goal_of_transhumanism_is_evolving_into_a_new/","created_utc":1566284177}