{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"[http://greyenlightenment.com/intelligence-is-not-additive-or-multiplicative/]<span translate = \"no\"> (http://greyenlightenment.com/intelligence-is-not-additive-or-multiplicative /) </ SPAN>\n\n\n\nД-р д-р, дюжина людей со средним интеллектом НЕ МОЖЕТ выполнять работу человека, который в 12 раз умнее их.\n\n\\> Никакое воздействие, которое можно сравнить с практикой, на длинноволновое излучение (неионизирующее излучение) не приведет к изменениям на уровне ДНК клетки, что можно сравнить с мастерством или понятием «щелчок». в то время как гамма-излучение, которое можно сравнить с высоким IQ, делает.\n\n\n\n====\n\n\n\nТрансгуманы свободны от человеческих ограничений, и они также свободны от человеческой этики. Они отличаются от людей, поэтому применяется новый набор правил - правило Природы.\n\n\n\nКороче говоря, лучшие трансгуманы обгонят меньших трансгуманов. Лучшая технология победит.\n\n\n\nЭто похоже на то, что 10 000 кораблей в стиле Второй мировой войны не могут победить ни одного современного военного корабля. Бывший быстро уйдет под воду, превзойденный вооружением и заурядный. Не сильно отличается от прежних времен, когда 100 пикинеров не могли сравниться с полностью вооруженным рыцарем.\n\n\n\nВ конце концов, я предсказываю, что племя трансгуманов превзойдет всех остальных, и только они будут доминировать. Поскольку трансгуманы не размножаются и не размножаются, они могут создавать другие формы трансчеловека для использования в различных целях, но доминирующий класс трансгуманов, которые будут совершенствоваться с помощью ИИ и всего этого, чтобы избежать захвата или захвата теми, кто даже лучше, чем они, будут требовать все плоды меньших трансгуманов и других существ.\n\n\n\nДарвинизм будет еще более распространенным среди трансгуманов, поскольку нет закона, ограничивающего их, а также нет социальных обязательств. Трансчеловеческие войны будут гораздо интереснее старых военных историй.","title":"Дарвинизм среди трансгуманов - лучший трансгуман покорит остальных","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1566506769,"link_flair_background_color":"","id":"ctwxsh","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/ctwxsh/darwinism_among_transhumans_the_best_transhuman/","url":"https://www.reddit.com/r/transhumanism/comments/ctwxsh/darwinism_among_transhumans_the_best_transhuman/","created_utc":1566477969}