{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я поражен тем, как много людей сознательно делают это недоразумение о загрузке разума и сознании, а затем утверждают, что проблема научная, когда она явно философская и парадоксальная.\n\nНам нужно только углубиться в математику и логику. Мы бы пересекли физику в этом мире. Проблема с копированием является парадоксальной, и мы можем изучить теоремы Гёделса о неполноте, чтобы лучше понять это. Как я уже сказал, дело не в науке, а в математике и логике. Метафизический? Аминь!\n\nЯ горячий читатель Макса Тегмарка, Дэвида Пирса и таких замечательных умов. И мы в значительной степени неправильно понимаем сознание.\n\nВот что я хочу уточнить. Они получат в основном метафизический наряду с математическим и логическим.\n\nНо давайте просто почистим физикализм, прежде чем идти дальше. Там нет ни реального, ни независимого. Все связано с пространством-временем и более мелкими частицами, которые еще предстоит открыть. «Неоткрытое» не означает «Ничто», как понимают простые люди. Так что нет никакого реального разрыва.\n\nВот и все о физике, и теперь мы получаем немного метафизики и философии (логики и математики). Мы знаем, что весь наш сознательный опыт - это просто состояние «Да», а состояние «Нет» просто не существует из-за его достоинства. «Нет» само по себе является небытием. Используя цикл Геделя, он возвращается назад. Отсюда мы находим, что все в состоянии «да». Вы можете легко достичь этого, загрузив Mind. Разрыв будет существовать, как он существует сейчас. Например, согласно состояниям суперпозиции, мы были мертвы навсегда с момента, когда мы существовали в последний момент, но мы все еще распознаем нашу непрерывность, пока вычисление состояния «Да» сохраняется из предыдущего состояния. «Забвение» никогда не существовало. Вот и все. Нам нужно разобраться в фундаментальной логике и математике, чтобы решить эту проблему. Это не проблема, с которой сталкивается физика, и это за ее пределами.","title":"Загрузка разума и непрерывность сознания: подробное научное разъяснение","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1566650253,"link_flair_background_color":"","id":"cup0ol","author":{"name":"Albert_NovaEinstein"},"permalink":"/r/transhumanism/comments/cup0ol/mind_uploading_and_continuity_of_consciousness_a/","url":"https://www.reddit.com/r/transhumanism/comments/cup0ol/mind_uploading_and_continuity_of_consciousness_a/","created_utc":1566621453}