{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Многие фильмы о супергероях показывают, что они испытывают финансовые трудности.\n\n\n\nТем не менее, это всего лишь фильм, чтобы сделать его приемлемым для обычных парней, которые платят за их просмотр.\n\n\n\nОбычные люди не могут избежать вытеснения трансгуманов, которые сильнее, чувствительнее и умнее их. Как инки, которые использовали неолитическое оружие против испанцев, обученных в течение столетий войны, у обычных людей нет никаких шансов.\n\n\n\nБлагодаря тому, что трансгуманы способны выполнять работу десяти человек одновременно, в сочетании с машинами, которые будут продолжать развиваться, большинство обычных людей будут безработными, маргинализированными и выписанными из генофонда.\n\n\n\nЖюль Верн видел это в 1863 году; он написал Париж в 20-м веке, который заканчивается главным героем, не имеющим рыночных навыков в механическом мире, умирает от голода. Это был неизбежный конец технического прогресса; слишком темный для аудитории того дня, его издатель похоронил его, и он был открыт только в 1994 году.\n\nТрансгуманы будут считать бедных и ненужных, которые не могут стать трансчеловеками, принадлежащими к низшему виду. Это неизбежно, поскольку их способности и социальные различия будут настолько велики, что их можно будет рассматривать как другой вид.\n\n\n\nПросто неизбежно столкнуться с крайним неравенством между трансгуманистами и остальными. И это не менее несправедливо, чем когда Стефу Карри платят значительно больше, чем кому-то, кто на несколько дюймов ниже его.","title":"Трансгуманизм и крайнее неравенство","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1567613026,"link_flair_background_color":"","id":"czhv8e","author":{"name":"kulmthestatusquo"},"permalink":"/r/transhumanism/comments/czhv8e/transhumanism_and_extreme_inequality/","url":"https://www.reddit.com/r/transhumanism/comments/czhv8e/transhumanism_and_extreme_inequality/","created_utc":1567584226}