{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"После прочтения [этой статьи о политике]  (https://www.politico.com/magazine/story/2019/09/08/shawn-rosenberg-democracy-228045)  моя догадка Такое ощущение, что большинство из нас не хотели бы, чтобы это сбылось, и что если мы хотим, чтобы «демократия, какой мы ее знаем», длилась как можно дольше, нам, возможно, придется принять трансгуманизм.\n\nОн утверждал, что человеческий мозг достаточно несовершенен, чтобы быть уязвимым для целого ряда психологических предубеждений, таких как, перефразируя его, момент, когда мы сбрасываем со счетов доказательства, когда они не соответствуют нашим целям, в то время как мы принимаем информацию, которая подтверждает наши предубеждения. Иногда слух, что мы ошибаемся, заставляет нас удвоиться. И так далее, и тому подобное, что, по утверждению автора, может оказаться фатальным для современной демократии.\n\nНо вот одна вещь; Вообще говоря, эти недостатки, связанные с человеческим мозгом, являются причиной того, что трансгуманизм или даже постгуманизм - вещь. В заключение отметим, что если бы демократия, как мы ее знаем, закончилась, неважно, нравится это ей или нет, я бы предпочел постчеловеческую технологическую уникальность с омега-точкой, чем второй темный век, такой как «Безумный Макс» и «Сказка о горничных». На самом деле я твердо верю, что парадокс Ферми может быть результатом того, что большинство инопланетных цивилизаций превратились в постбиологические объекты размером с гигантский цифровой мозг Матрешки, стремясь к более высокому уровню своего существования, хотя, с другой стороны, весь процесс должен быть мирным и добровольным, а не вынужденным и разрушительным ИМО.\n\nРедактировать: Для тех, кто отрицает это только потому, что это противный фактор или слишком новый для вас, я считаю, что вы могли бы сказать то же самое с вакцинами, если бы вы родились несколько сотен лет назад.","title":"[Личное мнение] Если мы не хотим, чтобы проклятые предсказания Политико о конце демократии сбывались, нам, возможно, придется принять трансгуманизм","subreddit_name_prefixed":"r/transhumanism","ups":0,"created":1568091355,"link_flair_background_color":"","id":"d1wyjh","author":{"name":"255972696"},"permalink":"/r/transhumanism/comments/d1wyjh/personal_opinion_if_we_dont_want_politicos/","url":"https://www.reddit.com/r/transhumanism/comments/d1wyjh/personal_opinion_if_we_dont_want_politicos/","created_utc":1568062555}