{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Загрузка разума - одна из немногих вещей, к которым я отношусь скептически. Как видно из SOMA, сканирование и запуск мозга просто создает копию. Однако перепутывание каждой отдельной субатомной частицы в мозге с другим набором субатомных частиц может позволить оцифровывать или загружать сознание в компьютер, поскольку квантовое запутывание эффективно заставляет субатомные частицы существовать одновременно в двух местах, что, возможно, позволяет переносить сознание из мозг в компьютер, с непрерывной непрерывностью. Технология, чтобы сделать это, однако, вне меня.\n\n\n\n\nС метафизической точки зрения, возможно снова существовать, выскочив из забвения без какого-либо знания о существовании ранее (и я также предполагаю, что анекдотические сообщения о «реинкарнации» могут быть просто случайным шансом формирования ложной памяти из случайных комбинаций частиц). ), но это еще более неопровержимо, чем мое первое утверждение, которое уже нельзя отрицать с самого начала. Тем не менее, я не могу исключить возможность случайного расположения частиц, которые будут разбиваться вместе, чтобы снова сформировать «я», за исключением воспоминаний о моем предыдущем существовании.\n\n\n\n\nКроме того, вступительная речь к эпизоду пространства-времени PBS, касающемуся мозга Больцмана, превосходно говорит о том, что сознание может быть возникающим явлением / возникающим свойством расположения субатомных частиц, подобно утверждению о том, что Вселенная является сформированной вселенной с нулевой энергией. от квантовой флуктуации (другой вид возникающего явления).","title":"Я крайне скептически отношусь к загрузке мыслей, за исключением квантовой запутанности (спойлеры для SOMA)","subreddit_name_prefixed":"r/transhumanism","ups":8,"created":1569812074,"link_flair_background_color":"","id":"dazf82","author":{"name":"WeTheSummerKid"},"permalink":"/r/transhumanism/comments/dazf82/i_am_extremely_skeptical_of_mind_uploading_except/","url":"https://www.reddit.com/r/transhumanism/comments/dazf82/i_am_extremely_skeptical_of_mind_uploading_except/","created_utc":1569783274}