{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"К настоящему времени мы все знаем, что скептически относимся к загрузке разума грубой силой, но есть ли другие пути оцифровки человеческого разума, которые, как мы уверены, не нарушат непрерывность сознания? Популярный подход, который я обычно слышу, состоит в том, чтобы постепенно превращать органический мозг в влажную посуду, а затем в течение нескольких лет в полностью машинное существование с использованием неких гипотетических нанотехнологий / микромашин, а затем просто переносить это сознание из тела в тело или из тела в сеть. Но я тоже скептически отношусь к этому подходу. Не будет ли процесс «передачи» также просто копировать сознание этого человека из его машинного тела и затем «вставлять» его в новый дом, фактически не перемещая разум этого человека из одного сосуда в другой? Или я в корне неправильно понимаю процесс здесь? Я просто пытаюсь понять, как вы можете в корне отделить сознание от тела (независимо от того, насколько изменено это тело), ​​не нарушая непрерывность сознания.\n\nИдея продлить мою жизнь, не прибегая к таким сравнительно рискованным методам, основывается на прорывах в методах биологического бессмертия / омоложения (по общему признанию, также и в этот момент). Если у вас есть вечно юный ум, лучший способ сохранить ваш хрупкий мозг как можно дольше без загрузки - это, на мой взгляд, удалить мозг из тела и заключить его в бронированную систему жизнеобеспечения, которую вы либо положили на орбите вокруг Земли или похоронить глубоко в астероидном / лунном реголите, где трудно получить доступ или разрушить. Относительно в безопасности от неожиданной или насильственной смерти, вы затем продеваете антенны обратно на поверхность и дистанционно управляете прокси-телом на Земле. Временная задержка была бы немного сукой, но я мог видеть, что этот метод становится популярным для тех, кто действительно хочет прожить как можно дольше, но не особенно доверяет загрузке ума.","title":"Возможные пути к бессмертию в ближайшем будущем (200-300 лет)","subreddit_name_prefixed":"r/transhumanism","ups":21,"created":1569819124,"link_flair_background_color":"","id":"db11pu","author":{"name":"Turboshraeder"},"permalink":"/r/transhumanism/comments/db11pu/plausible_pathways_to_nearfuture_immortality/","url":"https://www.reddit.com/r/transhumanism/comments/db11pu/plausible_pathways_to_nearfuture_immortality/","created_utc":1569790324}