{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"[** Может ли генетика объяснить, почему некоторые люди меньше спят? ** - Несколько членов одной семьи спят менее шести часов в сутки. Их генетика может пролить свет на то, как сон работает для всех нас., * The New York Times *] <span translate = \"no\"> (https://www.nytimes.com/2019/08/30/science/sleep- gene.html) </ SPAN>\n\n_______\n\n[Исследователи идентифицируют ген \\ [tic mutation \\], связанный с необходимостью меньше спать, * EurekAlert *] <span translate = \"no\"> (https://www.eurekalert.org/pub_releases/2019-08/cp-ria082119. PHP) </ SPAN>\n\n> Семья, чья ДНК привела к идентификации этого гена, является одной из нескольких, которые изучают Птачек и генетик UCSF Ин-Хуэй Фу, другой старший автор статьи, и в нее входят несколько членов, которые обычно функционируют только в течение шести часов сна. Ген ADRB1 был идентифицирован с использованием исследований генетической связи и секвенирования целого экзома, которые выявили новый и очень редкий вариант.\n\nВ последней статье больше внимания уделяется научно-техническим деталям, в первой содержится некоторая информация, не содержащаяся в последней.\n\n_______\n\n[* New Scientist * сообщил об этом: «Мутация ДНК позволяет некоторым людям вести здоровый образ жизни только во сне всего 4 часа»]  (https://www.newscientist.com/article/2214505-dna-mutation -lets-some-people-live-health-on-only-4-hours-sleep / amp /)  но [я не могу найти ничего в этом исследовании]  (https : //twitter.com/prototyperspect/status/1178776871267373056) , в котором говорится, что людям нужно только 4 часа сна:\n^ (в нем говорится, что «носители человеческой мутации в среднем спят на 2 часа в день меньше, чем носители без мутаций» после «носителя \\ [...]] с общим временем сна 7,5 ч. Это по-прежнему на 1 ч короче чем население означает \". Следовательно, среднее значение для носителей мутаций должно быть примерно 6,5 часов, если я правильно понимаю. Исследование также говорит о 4 часах, но только для\" естественного короткого сна \\ [ers \\] \"в целом: )\n\n> ^ (Естественный короткий сон (NSS относится к людям, которые на протяжении всей жизни склонны спать только 4–6 часов в сутки и чувствуют себя хорошо отдохнувшими. Сородич 50025 - это семья, выделяющая аутосомно-доминантный аллель для семейного естественного короткого сна (FNSS))\n\n_______\n\nИсследование называется «[Редкая мутация β1-адренергического рецептора влияет на поведение сна / бодрствования] <span translate =\" no \"> (https://www.cell.com/neuron/fulltext/S0896-6273 (19) </ span> 30652-X) \", опубликовано 1 месяц назад\n\n[Вот краткий обзор этой области исследований] <span translate = \"no\"> (https://www.labroots.com/trending/genetics-and-genomics/15548/genetic-reasons-people-sleep) < / SPAN>.\n\n_______\n\nОбнаружение мутации DEC2 произошло в 2009 году. И в статье NYT говорится:\n\n> \\ [Dr. Фу сказала, что с тех пор обнаружила еще несколько [генетических мутаций], которые ей еще предстоит описать в рецензируемых журналах.\n\n[@ SirT6]  (https://www.reddit.com/user/SirT6/)  [write]  (https: // www. reddit.com/r/Futurology/comments/czjnpb/researchers_discover_a_dna_mutation_that_lets /)  что PAM-последовательность S. pyogenes Cas9 находится ровно на 4 б.п. ниже аллеля дикого типа, и:\n\n> Благодарим @JSheltzer за то, что он указал, что сайт Cas9 находится так близко к аллелю, что позволяет предположить, что он может быть изменен CRISPR. Однако предстоит еще проделать большую работу, чтобы узнать, какие ячейки нужно изменить и какую долю нужно изменить, чтобы увидеть эффект.\n\nВ [отчете об открытии 2009 года]  (https://www.scientificamerican.com/article/genetic-mutation-sleep-less/)  Тафти и Фу подробно описывают использование случаи:\n\n> В будущем подобные открытия могут сыграть роль в разработке методов лечения для тех, у кого есть нарушения сна, или просто помочь обычным людям обрести меньше сна. «Через десятилетия мы можем действовать по этому пути и сделать сон более эффективным», - отмечает Тафти.\n>\n> Фу говорит, что помогать людям спать немного меньше, сохраняя при этом свое здоровье и благополучие, - ее главная мечта.\n\n_______\n\nЧто ты думаешь об этом? Будут ли скоро доступны лекарства, действующие на эти пути? Может быть, даже способ использовать CRISPR для модификации этого гена? Или вы думаете, что это будет в основном просто полезно для лучшего понимания сна или пока еще есть неизвестные негативные побочные эффекты, по крайней мере, для некоторых людей (никаких негативных побочных эффектов пока не обнаружено)?\nЛюбое понимание этой захватывающей области исследований? Какие еще проблемы?","title":"Исследователи идентифицируют генетическую мутацию, связанную с необходимостью меньше спать","subreddit_name_prefixed":"r/transhumanism","ups":8,"created":1570601092,"link_flair_background_color":"","id":"df75d8","author":{"name":"prototyperspective"},"permalink":"/r/transhumanism/comments/df75d8/researchers_identify_a_genetic_mutation_linked_to/","url":"https://www.reddit.com/r/transhumanism/comments/df75d8/researchers_identify_a_genetic_mutation_linked_to/","created_utc":1570572292}