{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Во-первых, я полностью принимаю движение ЛГБТ +. Мой партнер - MtF trans, и всем, кто находится за пределами трансгуманистического движения, я говорю им, что я гомосексуальный мужчина. Я говорю некоторым, которые лучше понимают, что я не бинарный / агент / мужской предпочтение. Но в глубине души и настолько честно, насколько я могу, и кое-что, что только вы - мой род - может понять: я трансгуманист. Почему это должно быть включено в более широкое движение ЛГБТ?\n\nДля начала, давайте посмотрим на трансгендерное движение - и если вы транс, вы можете присоединиться! Я хотел бы сказать, что знаю немного об этом, потому что мой партнер MtF trans и скоро будет на HRT. Трансгендерный человек рождается в теле, которое он не чувствует, отражает себя на глубоком и личном уровне. Они не чувствуют себя «хорошо» в своем собственном теле и хотят изменить его. Чем же это отличается от нас? Мы не чувствуем себя комфортно в наших телах, как они. некоторые из нас вообще не хотят человеческого тела - как я. Мы, как и трансгендерные люди, хотим выйти из нашего тела. Или, по крайней мере, изменить его, чтобы отразить, кто мы есть. Но как насчет сексуальности?\n\nСексуальные предпочтения - это еще один интересный аспект, и, по крайней мере, для меня трансгуманистическое предпочтение идеально подходит. Я не обращаю внимания на гендерную конфигурацию моего тела. Меня не волнуют роли, ожидания общества, ничего из этого. Я просто \"я\", так сказать. Партнеры (романтические и сексуальные), которых я выбираю, основаны на особенностях лица и структуры, и меня особенно интересуют фаллические системы. Но ... это значит, что я люблю мужчин? Конечно. А как насчет мужчин, которые хотят быть женщинами? Конечно. А как насчет тех, у кого есть оба набора - грудь и пенис? Абсолютно. Я призываю вас найти для этого термин сексуального предпочтения. Но они только физические - для меня важнее всего их разум. Они доминируют? Подчинение? Умный? Открытый? всеобщий интерес? Конечно, есть «сапиосексуальный», но он описывает только ОДНУ часть общей настройки предпочтений, которую я описал здесь. Если кто-то еще разделяет эти взгляды, пожалуйста, снова присоединяйтесь к разговору!\n\nИ теперь, мой последний пункт: есть некоторые мои предпочтения, которые вообще не вписываются в эти описания. Когда возникает особенность, буду ли я заниматься романтическим и сексуальным поведением со всем, что захочет взаимодействовать со мной? Конечно. Даже если речь шла о том, чтобы надеть какое-то оголовье интерфейса, чтобы воспроизвести что-то прямо из Demolition Man. Как можно отнести сегодняшний пол или сексуальные предпочтения к единственности?\n\nПо моему мнению, будучи трансгуманистом, разделяет многие из одинаковых точек зрения как по признаку пола / сексуальной идентичности, так и по предпочтениям, но полностью превосходит их. Я хочу изменить не тело, в котором я нахожусь, а новое тело. У меня есть предпочтения, которые еще выходят за рамки физического. Личность это нечто совершенно другое. И все же, он разделяет то же чувство борьбы за признание общества, что и движение ЛГБТ + ... Не так ли? Я уже чувствую себя полузакрытым как трансгумист и очень неприемлем, даже среди моих друзей. Ради бога, они все пушистые!\n\nИтак, разглагольствовать. Я хотел бы услышать мнения от других трансгуманистов.","title":"Трансгуманизм как часть движения ЛГБТ +","subreddit_name_prefixed":"r/transhumanism","ups":11,"created":1571151837,"link_flair_background_color":"","id":"di43ej","author":{"name":"roz303"},"permalink":"/r/transhumanism/comments/di43ej/transhumanism_as_part_of_the_lgbt_movement/","url":"https://www.reddit.com/r/transhumanism/comments/di43ej/transhumanism_as_part_of_the_lgbt_movement/","created_utc":1571123037}