{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Я смотрел Black Mirror много раз. Мои любимые эпизоды - «Пятнадцать миллионов заслуг» и «Мужчины против огня». Поэтому я продолжаю думать о технологиях и обществе, и, основываясь на моих исследованиях, в технологиях нет ничего положительного.\n\nМного веков назад элиты правили всеми. Там были короли, королевы и рыцари. Однако тогда королевская власть не имела такой силы. У них были только ножи, оружие и т. Д. Был предел тому, насколько они могут править людьми. Роялти мог притеснять людей, но если притеснение становилось слишком сильным, люди хватали их вилы, штурмовали замок и гильотинировали элиты.\n\nПеренесемся в будущее, и технологии создали огромные разрывы между богатыми и бедными, поскольку многие рабочие места автоматизированы, что дает богатство тем, кто владеет роботами. Кроме того, пропали короли, королевы и королевские особи. Их заменили миллиардеры, глобальная элита, чьи богатства заперты в налоговых убежищах и которые контролируют правительства. Что еще хуже, хотя в прошлом власть элит была ограничена, сегодня технологии увеличили власть элит. Элиты теперь имеют доступ, например, к алгоритмическому управлению, которое позволяет эксплуатировать бедных. Это привело, например, к созданию CAFO, которые угнетают животных в промышленных масштабах. Автономное оружие, дроны и т. Д. Позволят элитам иметь роботов для ведения войн и контроля над массами. Технологии могут также использоваться для пропаганды и дезинформации, например, автономные астробурф-чат-боты могут использоваться для распространения пропаганды «разделяй и властвуй», которая служит элите и вызывает внутриполитические конфликты, что снижает шансы на восстание. Люди не собираются гильотировать на богатых, если они слишком заняты, крича друг на друга.\n\nТехнологии предоставили элитам оружие, которое сделало игровое поле неровным. Если в прошлом у элит было лишь умеренно больше власти, чем у крестьян, то сегодня у элит почти неограниченное количество власти над людьми. Причина, по которой сегодня мы видим животных, таких как коровы, куры и свиньи на бойнях, заключается в том, что они имеют меньшую мощность. Они беззащитны. Тот, кто слабее, подвергается эксплуатации. Однако, поскольку элиты имеют больше власти, остальное человечество станет подобным скоту. Они будут безжалостно эксплуатироваться в промышленных масштабах.\n\nЭто меня очень беспокоит, и это главная причина, по которой я не буду иметь детей. Я думаю, что это неизбежно, что мы скоро будем жить в технокапиталистической антиутопии. Мы уже идем в этом направлении. Людей будут разводить только для того, чтобы их эксплуатировали, а страдания будут длиться вечно.","title":"Разве технологии не приведут нас к антиутопическому будущему?","subreddit_name_prefixed":"r/transhumanism","ups":4,"created":1574613473,"link_flair_background_color":"","id":"e0w0pq","author":{"name":"tramselbiso"},"permalink":"/r/transhumanism/comments/e0w0pq/wouldnt_technology_lead_us_to_a_dystopian_future/","url":"https://www.reddit.com/r/transhumanism/comments/e0w0pq/wouldnt_technology_lead_us_to_a_dystopian_future/","created_utc":1574584673}