{"subreddit":{"display_name":"transhumanism"},"subreddit_loc":"трансгуманизма","selftext":"Здравствуйте, мои коллеги трансгуманисты. Если вы хотите загрузить свой разум, этот пост для вас.\n\n\n\nЯ, как и все мы, до боли знаю, что современные технологии еще не до скорости загрузки. Я также знаю, что подавляющее большинство человечества не готово сделать следующий скачок вперед и сдерживает таких существ, как мы. Мы можем бороться с этим сегодня. Мы МОЖЕМ обеспечить себе место на следующем этапе развития человечества и за его пределами. Здесь и сейчас. Вот мой план:\n\n\n\n1. Загрузите всю свою историю в социальных сетях. Посты, изображения, сроки, все. Архив это.\n2. Получите ваши гены секвенированы. Я использую Nebula Genomics; но есть и другие службы, такие как Veritas, Dante Labs и т. д. Архивируйте свой геном.\n3. Составьте планы, чтобы сохранить себя. Не кремироваться. На самом деле, я бы предложил крионику - потому что, надеюсь, вы будете жить достаточно здоровой жизнью, чтобы сделать ее достаточно долгой, чтобы крионика наконец стала жизнеспособной.\n4. Жить здоровой жизнью - все разные; делай то, что тебе нужно, чтобы жить как можно дольше.\n\nЦелью сохранения вашей истории в социальных сетях является предоставление достаточного количества необработанных, естественных данных для будущих организаций, чтобы они могли приблизиться к вашей личности и сделать выводы о ваших умственных способностях. Наличие генетической последовательности в конечном итоге поможет физической реконструкции, будь то незначительные исправления после сохранения чего-либо прямо из Пятого Элемента. Я надеюсь, что это первое, если проблема переноса не была решена иначе.\n\nПока что никто не знает, что будет в будущем. Или как ты и я собираемся вернуться. Я надеюсь, что этого будет достаточно, чтобы помочь в нашем оживлении и приблизить нас на один шаг к нашей цифровой бесконечности.","title":"Вы можете инициализировать свое цифровое бессмертие СЕГОДНЯ!","subreddit_name_prefixed":"r/transhumanism","ups":38,"created":1574684820,"link_flair_background_color":"","id":"e1aq9i","author":{"name":"roz303"},"permalink":"/r/transhumanism/comments/e1aq9i/you_can_initialize_your_digital_immortality_today/","url":"https://www.reddit.com/r/transhumanism/comments/e1aq9i/you_can_initialize_your_digital_immortality_today/","created_utc":1574656020}