{"subreddit":{"display_name":"Bitcoin"},"subreddit_loc":"Bitcoin","selftext":"Это было несколько лет назад. Я никогда не продавал ни одной биткойны, и хотя мне было бы жаль, что я не продал ее, когда она достигла 19 000 долларов, я не знал, куда она пойдет. Те люди, которые говорят вам продавать по 19 тыс. Долларов, потому что было очевидно, что цена завышена, сказали бы то же самое в 9 тыс., 10 тыс., 11 тыс., 12 тыс. И т. Д. Факт в том, что если биткойн может достигать 19 тыс., Он может достигать 30 тыс., 40 тыс. Нет. проблемы.\n\nЯ купил свой первый биткойн во время увлечения биткойнами, когда он заработал 1000 долларов США. Затем он потерпел крах до 200 долларов, но в этот момент меня зацепили, и я продолжал покупать с бюджетом в 1000 долларов в месяц. Это включает в себя покупку биткойнов за 200, 300, 500 долларов и т. Д. Это включает ГОДЫ отсутствия возврата моих инвестиций в биткойны, когда акции растут.\n\nМоя мысль сегодня?\n\nНу, теперь я покупаю 2000 биткойнов каждый месяц. Я не планирую продавать в ближайшие 5+ лет, если у нас не будет сумасшедшего пробега и цена настолько высока, что я не смогу отказаться - но даже там, она будет надеяться на крах (который мы можем получить или не получить) Не верьте скептикам) чтобы купить еще больше биткойнов.\n\nЯ принципиально верю в биткойны. Я думаю, что они будут длиться Я думаю, что они будут продолжать расти, и я думаю, что это лучший способ хранить деньги, сберегательно, в долгосрочной перспективе. Люди, говорящие вам, что биткойны не основаны на акциях, а бизнес забывают, что бизнес тоже постоянно падает. Посмотрите на EA и NVDA, например, на 50% за последний месяц.\n\nУ биткойнов есть бизнес, и это параллельная финансовая система. Я не буду подробно изучать их здесь, но определенно существует потребность в биткойнах по всему миру. Я работаю не по найму, и мне часто платят в биткойнах просто потому, что это быстрее и дешевле, чем paypal et al. Paypal берет за меня до 10% комиссионных, и у меня есть дни, прежде чем я смогу получить деньги. Торгуя биткойнами лично, я могу избежать практически всех комиссий и даже взимать премию.\n\nБиткойны никуда не денутся. Эт ее может или не может добиться успеха (мое собственное предположение состоит в том, что оно будет успешным, но это то, что это: предположение), остальные криптос могут быть или не быть там через десять лет, но биткойны будут там. Другим криптам НЕОБХОДИМЫ Биткойны, чтобы преуспеть даже в существовании, потому что это золотой стандарт. 100% моих сбережений приходится на биткойны, и в заключение я скажу следующее:\n\nЛюди говорят, что биткойны \"умерли\" все время. Это было то же самое, когда в последний раз он набрал 200 долларов. Люди говорили, чтобы я продавал и возмещал часть моих потерь, биткойн шел до 1 цента и т. Д. Люди не знают дерьма. Люди не знают, куда это идет. Я не знаю, куда это идет. Я думаю, что это идет вверх, я думаю, что биткойны только начинаются, и я скажу это, компании, которые тратят 100 миллионов долларов США + на разработку новой ASICS для биткойнов, похоже, тоже считают, что биткойны тоже ценны.\n\nНаконец, торговая цена на биржах вводит в заблуждение, потому что им можно сильно манипулировать. Кошелек A может легко «продать» свой биткойн кошельку B, и это будет частью торгового оборота. Я не доверяю краткосрочной цене. Я думаю, что более справедливая цена на биткойны будет средней за последние 12 месяцев или что-то в этом роде.\n\nTLDR: Я вообще не боюсь за будущее биткойнов, он уже много используется и действительно меняет игру. Это лучшая криптография, и она наиболее вероятна. Прекратите паниковать и игнорируйте FUD от троллей. Люди бьют биткойны, потому что:\n\n1. Они завидуют тем, кто стал богатым, используя его.\n2. Они утешаются, наблюдая за недавними ценовыми действиями, и утешают себя тем, что не покупают биткойны за 200 долларов: «Видите, я знал, что это была небольшая идея, я бы так сильно упал!»\n3. Они разозлились, что акции так сильно упали. Многие люди, которые разбивали биткойны, были СЛИШКОМ инвестированы в технологии, а также в старые окаменелости, такие как GE, которые растут, и это их способ выпустить пар. Продолжайте покупать, если можете, и игнорируйте страх.\n\nМой личный прогноз состоит в том, что биткойн не сильно двигается в 2018-2019 гг., Колеблется в пределах 2,5-5,5 тыс. Долл., А затем произвольно взлетает в конце 2020 г., вероятно, достигнув 30-40 тыс. Без каких-либо проблем.","title":"Я покупаю биткойны с тех пор, как в первый раз она достигла 1000 долларов. Выслушай меня","subreddit_name_prefixed":"r/Bitcoin","ups":650,"created":1545124906,"link_flair_background_color":"","id":"a767c3","author":{"name":"graydoggames"},"permalink":"/r/Bitcoin/comments/a767c3/ive_been_buying_bitcoins_since_the_first_time_it/","url":"https://www.reddit.com/r/Bitcoin/comments/a767c3/ive_been_buying_bitcoins_since_the_first_time_it/","created_utc":1545096106}