{"subreddit":{"display_name":"Bitcoin"},"subreddit_loc":"Bitcoin","selftext":"TL; DR - медвежий прогноз (\\ * \\ * \\ * предупреждение триггера \\ * \\ * \\ *)\n\nБольшинство людей в социальных сетях с биткойнами - это мега-быки, которые сходят с ума от любого с намеком на медвежьи прогнозы. Некоторое время назад я писал о том, как фьючерсы могут негативно повлиять на цену биткойна, и в основном его за это ненавидели. Я упомянул, что уже давно был в биткойнах и получил саркастические ответы «верный друг».\n\nПосмотрим правде в глаза, половина из вас, читающих это, - в основном, азартные наркоманы, гиены, пускающие слюни во рту и злобно атакующие в стае любого, кто осмелится допросить. Биткойн - это мечта для денег от YOLO до Lambo в течение следующих 24 месяцев, или любой другой «прогнозируемый» биткойн за миллион долларов станет реальностью. Просто зайдите на YouTube и Google Bitcoin - посмотрите на результаты, это шутка. Маленькие мальчики Питера Пана, одетые в апартаменты, притворяются финансовыми экспертами.\n\nЯ не оспариваю биткойны здесь, потому что биткойны это ТВЕРДЫЕ, я осматриваю сцену, что это такое. Американские горки мем менталитет. Посмотрите на недавние дебаты с такими людьми, как Крейг Райт и Тон Вэйс - серьезно. Эти люди громкие имена в космосе и делают его похожим на цирк.\n\nКроме того, половина, если не 90% людей здесь, не заботятся о корнях биткойнов - движении \"Сайфер панки\". Если бы правительство расправилось с биткойнами, я знаю, что большинство людей здесь, вероятно, не имеют шаров, чтобы удержаться, они выпрыгнут, как только дядя Сэм скажет об этом.\n\nНесмотря на то, что говорит McAffee, или акции на ходу, правда заключается в том, что для перевода биткойнов с пары тысяч долларов на 50+ потребуется тонна денег. Люди думают, что мы на 100% собираемся получить 100 тысяч долларов из-за «математики», «деления пополам» и «надежды». Нынешние настроения на рынке очень напуганы и напоминают мне рынок дураков. Да, я собираюсь получить много ненавистных комментариев к этому посту или просто быть проигнорированным, потому что это то, что люди делают с мнениями, которые не совпадают с их мнением.\n\nДля перехода от 300 до 20 тысяч долларов потребовалось около 200 миллиардов. Чурбан смени. Вы, ребята, серьезно думаете, что триллионы в одночасье попадут в биткойны, потому что их «становится все меньше» ?! Если люди не интересуются биткойнами, им не дают дерьма, если их мало или нет.\n\nВы знаете старую поговорку, когда что-то кажется хорошим, чтобы быть правдой ... Видите ли, когда люди покупали биткойны за 300-500 долларов, не было \"будущего, слишком хорошего, чтобы быть правдой\" - это было очень рискованно и большинство людей никогда не слышали о биткойнах. Вот где была возможность. Потенциал для огромного роста был основан на ОГРОМНОМ РИСКЕ и низкой рыночной капитализации. Конечно, биткойн снова вырастет. Но вы никогда больше не получите 2000% прибыли, если, возможно, вы не продержитесь 30 лет. Даже если биткойны доходят до 50 тысяч долларов - это означает, что рыночная капитализация в триллион долларов в 10 раз больше? И тогда все снова сбросят дерьмо на 90%?\n\nОднажды я прочитал комментарий, похожий на то, что «ралли биткойнов 2017 года было похоже на первый максимум кокса, который мы будем искать вечно, но вряд ли когда-нибудь снова переживем».\n\n\n\nРЕДАКТИРОВАТЬ Я заявил в своем посте, что я все еще верю, что биткойн может в 10 раз, но меня атакуют слева направо и в центре. ДЖОН МАКАФФ КРЕЗИ ИМО - тот, кто всерьез верит в то, что в ближайшие пару лет будет больше 10 раз\n\n\\ * ЕСЛИ ЭТО ПОЧТА ПРИЧИЛА ВАШ ЛЮБОЙ ПСИХИЧЕСКИЙ ИЛИ ЭМОЦИОНАЛЬНЫЙ БЕСПОКОЙСТВО, ЗДЕСЬ - ОЧЕНЬ ПОСЛЕДНЯЯ ПАМЯТЬ HODL, чтобы успокоить ВАШИ НЕРВЫ; [https://www.reddit.com/r/Bitcoin/comments/dmf1v3/hodl/]<span translate = \"no\"> (https://www.reddit.com/r/Bitcoin/comments/dmf1v3/hodl /) </ SPAN>","title":"Реальность такова, что у нас больше никогда не будет ралли, как в 2017 году","subreddit_name_prefixed":"r/Bitcoin","ups":606,"created":1571936842,"link_flair_background_color":"","id":"dmdqx5","author":{"name":"Viruscatman"},"permalink":"/r/Bitcoin/comments/dmdqx5/the_reality_is_that_we_may_never_have_another/","url":"https://www.reddit.com/r/Bitcoin/comments/dmdqx5/the_reality_is_that_we_may_never_have_another/","created_utc":1571908042}