{"subreddit":{"display_name":"Bitcoin"},"subreddit_loc":"Bitcoin","selftext":"Чтобы достичь этого, потребовалось несколько месяцев, мудрое планирование, несколько умных сделок, пара сотен долларов и куча шаров. Я вне экстаза. Я собираюсь за один биткойн через год-два через средства торговли и депозиты. Тогда я буду продолжать держать биткойны и другие монеты до тех пор, пока они не появятся. Будущее Биткойн и криптографии в целом имеет очень светлое будущее, и я искренне верю, что мы только начали то, что будет очень многообещающим и успешным путешествием. Я чувствую опоздание к вечеринке перед игрой, но я верю, что сам по себе рано, потому что вижу, что все только начинается. Децентрализованная валюта, которая существует только в цифровой форме, подобна золотому билету на шоколадную фабрику Вилли Вонки, нет ничего лучше.\n\nДостигнет ли он миллион, как мало кто говорит? Может быть, в промежуток времени от 10 до 20 лет, но я считаю, что нынешняя цена на самом деле является низкой по сравнению с технологией. Я говорю своим бабушке и дедушке, что это как интернет-золото, оно никогда не исчезнет и всегда будет чего-то стоить. Даже если он не станет мировой валютой или чем-то еще, о чем все мечтают, Биткойн является ценным, чрезвычайно ценным и всегда будет ценным, так как технологии продолжают расти и прогрессировать. Это дикий запад с золотыми приисками снова и снова, за исключением того, что на этот раз это цифровая валюта, которая никогда не будет принадлежать ни одному юридическому или физическому лицу, поэтому я считаю, что она стоит намного больше, чем та, в которой она в настоящее время ценится.\n\nСегодня был отличный день, когда я купил свой последний 0,01, чтобы я мог закончить свой десятый. Будущее ярко!\n\nРЕДАКТИРОВАТЬ: у меня было несколько человек внизу напасть на меня за торговлю, называя меня неопытным. Так случилось, что я опытный трейдер-самоучка. Я торговал больше года или двух. Я узнал все, что нужно знать о торговле. Я узнал, как определять тенденции, что такое азартная игра и что гарантировано. Я не играю в азартные игры, но я торгую, и поэтому у меня много успеха. У меня не было бы десятого, если бы я не торговал. Период. У меня не было бы десятого, если бы я не купил несколько альтов. Знаешь, не дерьмовые монеты, а все же монеты, лучшие из них, у которых есть будущее и потенциал с многообещающей технологией, просто как биткойн. Возможно, вы не добились успеха в торговле, или ваш собеседник, возможно, потерял свой стек, пытаясь торговать, но я, я в порядке с этим. Я даже могу написать пост, чтобы помочь другим, которые кажутся одержимыми страхом торговли из-за страха потерь. Вы проигрываете, когда цена падает. Купить. Вы получаете, когда цена растет, Продайте. Найди тренд, почитай графики. Это довольно легко. Я бы заработал больше десятой, но я не хотел бы рисковать и рисковать, поэтому я беру гарантированную сделку, которая принесет мне меньше, но это все же прибыль, и точка. Пожалуйста, не нападайте на меня за мою стратегию, она была очень успешной. Спасибо.\n\nРЕДАКТИРОВАТЬ 2: Другие, кажется, смущены моей торговлей. Я торговал с небольшими суммами, чтобы учиться. Вот почему это заняло так много времени, чтобы получить прибыль, так как я делал по одной или двум долларам на каждую сделку. Я не мог позволить себе торговать большими суммами в то время. Да, я успешно торговал с 500 долларами. Это заняло время, но я научился и теперь знаю, что я делаю. Я не торгую импульсивно, я не эмоциональный трейдер, я читаю графики, смотрю на тренд и следую ордеру на покупку или продажу. То, что я делаю, работает, точка.\n\nРЕДАКТИРОВАТЬ 3: Может быть, я должен уточнить, что я владею .1 Биткойн, но это не все мои инвестиции. У меня больше, чем 0,1 в других монетах. Я не думал об этом упоминать, так как это битредин, а не биткойн и другие монеты. Так что прибыль намного выше, чем вы думаете. Извините за путаницу.","title":"У меня наконец есть десятая часть биткойнов!","subreddit_name_prefixed":"r/Bitcoin","ups":558,"created":1573327906,"link_flair_background_color":"","id":"dtutzp","author":{"name":"HookItUpCuuz"},"permalink":"/r/Bitcoin/comments/dtutzp/i_finally_own_a_tenth_of_a_bitcoin/","url":"https://www.reddit.com/r/Bitcoin/comments/dtutzp/i_finally_own_a_tenth_of_a_bitcoin/","created_utc":1573299106}