{"subreddit":{"display_name":"LongevityInvesting"},"subreddit_loc":"Долголетие Инвестирование","selftext":"Привет всем, я работаю над тем, чтобы обеспечить постоянный сбор средств для исследований по борьбе со старением, направленных на привлечение новых участников.\n\n\n\nВот ссылка на черновик, над которым я работал в последние месяцы, где вы найдете одноминутное видео с пояснениями:\n\n[https://metha.life/] (https://metha.life/) \n\n\n\nЯ пытаюсь внедрить модель самого успешного криптофандрейзинга, которая является ICO на год EOS,\n\nудалось собрать 4 миллиарда в течение года.\n\n\n\nЯ думаю, что основной причиной успеха EOS в ICO была ее разработка, которая позволила постоянно собирать средства\n\nв то время как их крипто было уже на рынках.\n\n\n\nЯ знаю, что многие люди здесь не будут знакомы с криптовалютой, но имейте в виду, что эта идея сначала направлена ​​на привлечение средств из этой области к этой, а также пытается вознаградить немного вкладов и сделать их более интересными для новых людей.\n\n\n\nМоя мысль при построении этого состояла в том, чтобы вознаградить вклад криптовалютами, которые в случае некоторого обращения,\n\nПатент или клиническая процедура обнаруживаются, валюта будет использоваться в качестве средства оплаты для доступа к лечению\n\nили купить какие-либо коммерческие права на патенты и т.д ...\n\n\n\nЯ думал, что это не изменит вклады значительным образом, за исключением случаев, когда все работает, и возникают проблемы\n\nиз исследований. В этом случае ценность токена возрастет, поскольку он вдруг станет чрезвычайно ценным.\n\nЯ думаю, что это хороший способ привлечь не только людей, которые хотят пожертвовать, но и привлечь непредубежденных спекулянтов, которые\n\nхочу попробовать. Добавив модель EOS поверх нее и с продвинутым маркетингом, я лично могу увидеть эту идею\n\nвырастить много средств для исследовательских учреждений.\n\n\n\nТакже обратите внимание, что Виталик Бутерин пожертвовал SENS большие суммы и может быть заинтересован в том, чтобы как-то помочь в создании этого\n\nинструмент финансирования. (Я использовал блокчейн ethereum для проекта).\n\n\n\nПожалуйста, имейте в виду, что проект все еще является черновиком, над которым я работал в свободное время, поэтому обратная связь и\n\nпредложения о том, что вам нравится, не нравится или изменится в идее, высоко ценится.\n\nНа веб-сайте под вкладкой «Технический документ» находится 26-страничный проект документации с дополнительной информацией о моем личном представлении о\n\nидея. Прямая ссылка на Документацию:\n\n\n\n\n\n[https://metha.life/Documents/Metha\\_Whitepaper\\_Draft\\_des\\_20181029.pdf] (https://metha.life/Documents/Metha_Whitepaper_Draft_des_20181029.pdf) \n\n\n\n\n\nДля состояния проекта я уже работал и тестировал криптовалюту и механику продажи токенов, как хочу\n\nребята, чтобы немного рассказать об этой идее, чтобы увидеть, какие изменения можно внести в нее к лучшему.\n\nЯ также управляю учетными записями в Твиттере и ФБ с последними новостями от исследователей: [https://twitter.com/MBiofund] (https://twitter.com/MBiofund) \n\nТакже, если кто-то захочет помочь, я буду очень признателен, поскольку сегодня я работаю один, и мне нужно многое\n\nбыть сделано специально во многих областях, таких как маркетинг, PR, международное право и т. д.\n\n\n\n\n\nЕсли вы сделали это далеко, спасибо за ваше время!","title":"Новый инструмент сбора средств для исследования долголетия.","subreddit_name_prefixed":"r/LongevityInvesting","ups":4,"created":1554237311,"link_flair_background_color":"","id":"b8imvl","author":{"name":"metha_biofund"},"permalink":"/r/LongevityInvesting/comments/b8imvl/new_fundraising_tool_for_longevity_research/","url":"https://www.reddit.com/r/LongevityInvesting/comments/b8imvl/new_fundraising_tool_for_longevity_research/","created_utc":1554208511}