{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Итак, у меня есть опыт работы в астрофизике, но я интенсивно изучаю биологию (у меня 810 по биологии GRE, и я также значительно изучал биохимию и молекулярную биографию при подготовке к экзамену GRE Biochem). Я также прошел курс Мэтта Кейберлейна по этому предмету (он может ручаться за мое понимание исследований в области биологии старения). Одна вещь, тем не менее, заключается в том, что я хотел бы исследования с высокой вычислительной направленностью, и я еще не видел много этого в области старения (хотя у меня складывается впечатление, что это будет расширяющаяся область в будущее - один профессор сказал мне, что это может быть из-за того, что руководитель отдела старения NIH не очень любит системную биологию, поэтому финансирование в этой области сейчас невелико). Хотя я открыт для некоторой экспериментальной работы (что, безусловно, полезно для меня, чтобы узнать о ней больше), я все же хотел бы, чтобы большая часть моей работы была вычислительной (поскольку просто гораздо проще иметь другие варианты, если я делаю в основном вычислительную работу). работать, но и по другим причинам тоже). Мне просто интересно - кто-нибудь знает, как я могу это сделать?\n\nЯ мог бы отказаться от исследований по чисто старению, если они включают крупномасштабные исследования в области вычислительной биологии, которые могли бы помочь в конечном итоге в исследованиях по вычислительному старению.\n\nКстати, я из Сиэтла. Мне все равно, оплачивается ли моя работа или нет (хотя неоплачиваемая работа будет проще всего в районе Сиэтла и, возможно, выполнимо в районе залива и Лос-Анджелеса).","title":"Кто-нибудь знает, как я могу проводить исследования в области вычислительной / системной биологии в области старения / SENS?","subreddit_name_prefixed":"r/sens","ups":13,"created":1388252274,"link_flair_background_color":"","id":"1tvatt","author":{"name":"inquilinekea"},"permalink":"/r/sens/comments/1tvatt/does_anyone_know_how_i_can_do/","url":"https://www.reddit.com/r/sens/comments/1tvatt/does_anyone_know_how_i_can_do/","created_utc":1388223474}