{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Когда-то был человек по имени Боб. Боб был плотником. У Боба кончились гвозди посреди строительства дома. Боб искал по всему городу больше гвоздей. После того, как Боб обыскал весь город и не нашел гвоздей, Боб пришел к выводу, что Бобу придется отправиться в другое место, чтобы найти то, что ищет Боб. Боб начал искать в мире ногти, а Боб провел остаток жизни Бобса в поисках ногтей, чтобы Боб мог закончить то, что начал Боб.\nСпустя много десятилетий Боб встретил человека, который показал Бобу несколько винтов и сказал: «Почему бы вам не использовать их?».\nБоб ответил: «Есть действительно много захватывающих подходов, которые можно использовать при скреплении кусков дерева вместе. Но большинство из нас, плотники, заняты поиском наиболее интересных для нас методов. Я, Боб, принадлежу к группе плотников, которые пытаются выяснить, как соединить куски дерева друг с другом, используя длинные тонкие кусочки металла, которые вбиваются в два кусочка дерева, о которых идет речь. Это очень продвинутая наука, над которой я, Боб, работал всю свою жизнь. Люди уважают меня за эту работу, и я являюсь лидером в этой работе. Если бы я, Боб, изменил поля, используя винты для соединения кусков дерева, я бы больше не считался лидером в своей области, и у меня просто не было бы этого.\nИ так пошла история о Бобе, плотнике. Очень похоже на историю Боба, исследователя рака. Всякий раз, когда исследователям рака говорят: «Эй, почему бы тебе не попробовать это, пока все говорят?», Они неизбежно отвечают так же, как Боб, плотник.\nКстати, вот ссылка на WILT, кстати, единственное предложенное лекарство от рака, которое сработает, по крайней мере, в теории. http://www.bioscience.org/2005/v10/af/1707/fulltext.htm","title":"Боб плотник.","subreddit_name_prefixed":"r/sens","ups":4,"created":1400478350,"link_flair_background_color":"","id":"25w49y","author":{"name":"ronnyhugo"},"permalink":"/r/sens/comments/25w49y/bob_the_carpenter/","url":"https://www.reddit.com/r/sens/comments/25w49y/bob_the_carpenter/","created_utc":1400449550}