{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"* Установите ежемесячный [пожертвование]  (http://sens.org/donate)  на все, что вы можете себе позволить. Даже если это всего лишь несколько долларов, все это складывается.\n\n* При необходимости публикуйте ссылки на веб-сайте SENS / беседах на YouTube / интервью AdG. Учитывая, сколько людей до сих пор не знают об этом, это необходимая тяжелая работа.\n\n* Свяжитесь с соответствующими хостами подкастов, чтобы порекомендовать AdG в качестве гостя. Сейчас это, наверное, самое эффективное использование нашего времени.\n\n* [Дайте SENS 5 звезд на GreatNonprofits]  (http://greatnonprofits.org/org/sens-research-foundation) \n\n* Размещайте рекламу для SENS в социальных сетях, на подкаст-рекламах, на пяти концертах (будьте осторожны с тем, за что вы платите, много мусора) и т. Д. Facebook дал мне $ 100 в качестве бесплатного рекламного кредита некоторое время назад, когда я сделал страницу для своих игр. блог, и Google обычно предлагают бесплатный рекламный кредит в размере 25 долларов США вскоре после того, как вы получите одобрение AdSense.\n\n* Установите для получателя Amazon Smile значение SENS. Если вы используете Chrome, надстройка [Smile Always]  (http://www.smilealways.io/)  гарантирует, что вы никогда не забудете.\n\n* Опубликовать [эти]  (https://www.fightaging.org/fund-research/#posters)  в реальной жизни. Есть много концертов, которые будут раздавать / размещать листовки для вас. Если вы хотите получить бесплатный концерт, напишите мне свой адрес электронной почты, и я буду приглашать вас в качестве моего реферала. Если в итоге вы потратите 10 долларов, я получу 5 долларов, которые затем смогу использовать для рекламы.\n\n* [Используйте ваш ЦП для свертывания белков]  (https://folding.stanford.edu/)  это то, что мы все можем выполнять в фоновом режиме и можем косвенно принести пользу этому исследованию.\n\n\nЕсть так много гранулированных возможностей, чтобы выразить свое мнение, делая то, что вы обычно делаете. Например, я много играю в видеоигры. После каждого раунда я буду ссылаться на разговор Теда или что-то в этом роде. Иногда я называю своего персонажа SENSdotORG. Я также выдаю информацию всякий раз, когда я продаю что-то онлайн. Будьте креативны.","title":"То, что мы все можем сделать","subreddit_name_prefixed":"r/sens","ups":22,"created":1431241810,"link_flair_background_color":"","id":"35fuaj","author":{"name":"K1ngN0thing"},"permalink":"/r/sens/comments/35fuaj/things_we_can_all_do/","url":"https://www.reddit.com/r/sens/comments/35fuaj/things_we_can_all_do/","created_utc":1431213010}