{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Вы видели или слышали научные статьи, видео, радиопостановки, подкасты и так далее, связанные с долголетием?\n\nПодумайте о том, чтобы связаться с вашей любимой новостной организацией (или с любыми другими, кто вам прилично нравится) и попросить предоставить им контент, связанный с чрезвычайным долголетием.\n\nЯ просто связываюсь с Science Friday, которая появляется на NPR. Я слышал всевозможные шоу по различным научным темам, но не об экстремальном долголетии. Я видел статьи и видео, но я хотел бы видеть больше.\n\nВот короткая просьба, которую я им отправил.\n\nЯ пошел на http://www.sciencefriday.com/about/contact-us/, чтобы связаться с Science Friday по поводу «Идеи, которую я хотел бы донести до персонала». Я надеюсь, что вы связываетесь с другой новостной организацией, каналом YouTube, подкастами или публикациями по вашему выбору.\n\n> Привет,\n>\n> Пожалуйста, предоставьте информацию, касающуюся исключительно долголетия, крионики, регенеративной медицины и радикального продления жизни.\n\n> Представьте, пожалуйста, такие организации, как Институт Бака по исследованию старения, Исследовательский фонд SENS, Фонд продления жизни Alcor, Human Longevity Inc. и / или Фонд Метузела. Представьте, пожалуйста, руководителей некоторых из вышеупомянутых организаций, таких как Дэвид Синклер, Обри де Грей, Макс Мур и / или Брайан К. Кеннеди.\n\n> Эти темы и некоторые из этих людей недавно были в новостях и могут представлять интерес для большого числа людей. Это все также интересует меня.\n\n> Спасибо.\n>\n> С уважением,\n>\n> [Мое имя]\n\nС какой новостной организацией вы свяжетесь? Если даже 1000 человек здесь, из более чем 4200 подписчиков здесь, обратятся в 500 различных новостных организаций, это может помочь значительно повысить интерес и осведомленность о радикальном продлении жизни и продолжительности жизни. Я только что отправил это письмо в науку пятницу.\n\nМне интересно услышать больше в СМИ об экстремальном долголетии, крионике и радикальном продлении жизни. Ты?","title":"Контакты Новости Организации! Я сделал. Вы будете? Я отправил это короткое письмо в Science Science Friday. Сколько из нас может связаться с различными новостными организациями? (Cross Post от / р / долголетия)","subreddit_name_prefixed":"r/sens","ups":10,"created":1461064238,"link_flair_background_color":"","id":"4ffnq1","author":{"name":"MichaelTen"},"permalink":"/r/sens/comments/4ffnq1/contact_news_organizations_i_did_will_you_i_sent/","url":"https://www.reddit.com/r/sens/comments/4ffnq1/contact_news_organizations_i_did_will_you_i_sent/","created_utc":1461035438}