{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Не верьте обману, здание компании является домом генерального директора, что она, вероятно, сделала по налоговым соображениям, кроме того, когда это случилось, почти все ее научно-консультативный совет покинул свои должности.\n\nКроме того, генеральный директор, который является единственным сотрудником компании, является бывшим менеджером в какой-то компьютерной компании. Это все притворство для рекламы и денег, которые она, безусловно, получила с этого момента.\n\nНикто в научном сообществе на самом деле не верит, что она это сделала, и даже если бы она это сделала, метод, в котором она это делала, не имел бы почти никакого эффекта, поскольку у нее была только плазмида, вероятно, с неправильным промотором, собранная в простом адено-вирусе, при обработке одним выстрелом количество клеток, которые, вероятно, получили что-либо, вероятно, ничего не изменит с этим, так как ген будет метилирован.\n\nTL; DR: Генеральный директор - мошенник.\n\nРЕДАКТИРОВАТЬ: я собираюсь добавить сюда ссылку на обзор компании Bloomberg (которая всегда полезна для компаний, у которых у вас есть странные вопросы): http://www.bloomberg.com/research/stocks/private/snapshot .asp? privcapId = 302346686\n\nПожалуйста, обратите внимание на адрес, Google Maps и StreetView его. А что касается еще одного интересного момента: http://www.bloomberg.com/research/stocks/private/person.asp?personId=302646403&privcapId=302346686 Алекс Салинас Директор по маркетингу для Латинской Америки, BioViva USA Inc.\n\nРЕДАКТИРОВАТЬ: две группы, которые утверждают, что они проанализировали ее клетки, которые представляют собой Т-лимфоциты, о которых известно, что они имеют различную длину теломер, - это HEALES и исследовательский фонд биогеронтологии, heales.org и bgrf.info, обе имеют один и тот же штат / доску. Это буквально две группы тех же самых людей, которые это подтверждают. Кроме того, первая лаборатория, которая выполнила эксперименты с ее длинами теломер, - это Spectracell, которая в настоящее время занимается судебными процессами для мошенников, и, просматривая их веб-сайт, трудно поверить, что кто-то действительно влюбился в нее. У них есть медицинский тест по имени MTHFR, буквально МАТЬ ФУКЕР.","title":"Самый популярный комментарий на главной странице объясняет, почему Элизабет Пэрриш, скорее всего, афера. Настоящие научные открытия подтверждаются рецензируемыми опубликованными статьями, а не пиар-релизами Элизабет Пэрриш, в которых вы просите просто доверять ей.","subreddit_name_prefixed":"r/sens","ups":15,"created":1467695238,"link_flair_background_color":"","id":"4r9ac4","author":{"name":"bigeyedbunny"},"permalink":"/r/sens/comments/4r9ac4/frontpage_most_upvoted_comment_explains_why/","url":"https://www.reddit.com/r/sens/comments/4r9ac4/frontpage_most_upvoted_comment_explains_why/","created_utc":1467666438}