{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Всем привет! Меня зовут Нина Торрес Занветтор, и я здесь, чтобы рассказать о проекте перевода книги Об окончании старения Обри де Грея на бразильский португальский. Я профессиональный переводчик с научным опытом и работаю с Николасом Чернавским, профессиональным переводчиком с 13-летним опытом, в переводе Ending Aging. Этот перевод выполняется при поддержке Обри де Грея и Фонда SENS, но финансирование проекта осуществляется нами (переводчиками) через платформу краудфандинга под названием Catarse. Catarse является крупнейшей краудфандинговой платформой в Бразилии, и вы можете проверить наш проект по этой ссылке: https://www.catarse.me/traducao_de_ending_aging. Мы перевели текст Catarse на английский (вам нужно свернуть страницу), и если вы говорите по-английски и хотите поддержать проект, вы можете изменить язык сайта (внизу страницы), чтобы внести свой вклад , Мы сделали видео с участием Обри де Грея, в котором мы объясняем проект, и вы можете посмотреть его на странице проекта с английскими субтитрами (их необходимо активировать). В этом проекте электронная книга на португальском языке будет создана и отправлена ​​всем, кто ее поддерживает, независимо от того, сколько денег вы платите (минимальный размер Catarse составляет 10 долларов США, около 3 долларов США). Кроме того, проект будет завершен, даже если мы не поставим цель, поэтому этот краудфандинг работает как предварительный заказ книги, в которой вы сами выбираете, сколько вы хотите заплатить. Книга будет готова к июню 2018 года, но если мы повысим наш целевой бюджет до этого, он будет завершен раньше.","title":"Перевод проекта по прекращению старения на бразильский португальский","subreddit_name_prefixed":"r/sens","ups":14,"created":1504733174,"link_flair_background_color":"","id":"6yflse","author":{"name":"ninatzanvettor"},"permalink":"/r/sens/comments/6yflse/translation_project_of_ending_aging_into/","url":"https://www.reddit.com/r/sens/comments/6yflse/translation_project_of_ending_aging_into/","created_utc":1504704374}