{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Каждый год vlogbrothers организует конкурс для благотворительных организаций под названием Project for Awesome: http://www.projectforawesome.com/about\n\nЛюбой, с 15 по 17 декабря, может отправить видео о своей любимой благотворительности на сайт P4A. В те же даты будет проведено голосование, и благотворительные организации, которые наберут большое количество голосов, получат более или менее 25000 долларов (это типичная цифра прошлых лет, может быть немного больше, немного меньше).\n\nИсторически сложилось так, что благотворительные организации выиграли более 10 видео. Наша цель должна состоять в том, чтобы создать 15-20 видеороликов для SENS Research Foundation, проголосовать за них и заставить людей голосовать за них. Не должно быть слишком сложно заставить SENS выиграть эти 25 тысяч. Сообщества, меньшие чем мы, уже сделали это для других благотворительных организаций. Если бы у нас было достаточно людей, мы могли бы даже делать видео, рекламирующие LEAF.\n\nВидео не должно быть высокого качества. То, сколько из них мы отправляем, имеет значение. Вы можете снимать видео с помощью телефона или даже не показывать свое лицо, регистрируя только звук и используя изображения, если вы так склонны. Предлагаемая продолжительность составляет около 2 минут. После отправки видео на сайт (15-17 декабря) вы также можете загрузить его на YouTube, чтобы организаторы (Джон и Хэнк) могли найти его и показать в прямом эфире, который они сделают для P4A.\n\nЕсли нам достаточно сделать видео для SENS, мы могли бы сделать видео и для LEAF. Из того, что я читал в группах FB, один человек теоретически мог сделать два видео для двух разных благотворительных организаций, но это не рекомендуется.\n\nЕсли вы хотите принять участие, пожалуйста, прокомментируйте и скажите, какую благотворительность вы будете продвигать! Таким образом, мы можем лучше организовать и посмотреть, достаточно ли у нас людей, готовых снимать видео для SENS и LEAF.\nИтальянская девушка уже сняла видео для SENS. Посмотрите его, если вам нужно вдохновение: https://www.dropbox.com/s/3ozw44auhv0t5gx/Project4awesome.mov?dl=0\n\nПримечание: если вы работаете в SENS или LEAF, вы, конечно, можете сделать видео!","title":"Проект для Awesome 2017 - Давайте соберем 25 тысяч долларов для SENS и LEAF (x-post r / longevity)","subreddit_name_prefixed":"r/sens","ups":15,"created":1511635085,"link_flair_background_color":"","id":"7fehne","author":{"name":"Anle-"},"permalink":"/r/sens/comments/7fehne/project_for_awesome_2017_lets_raise_25k_for_sens/","url":"https://www.reddit.com/r/sens/comments/7fehne/project_for_awesome_2017_lets_raise_25k_for_sens/","created_utc":1511606285}