{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Проблема перенаселения - это проблема, которую нам придется решать по мере развития этой технологии. Который, я бы не подумал, была космическая колонизация несколько лет назад. Я думал, что концепция космической колонизации была концепцией на несколько сотен лет в будущем.\n\nТеперь похоже, что этот процесс начнется через десять лет. Все \"трудные проблемы\" дешевого доступа в космос уже решены. Остаются только \"легкие\" дополнительные проблемы с отрывом новой ракеты BFR - SpaceX - от земли. Они планируют запустить свой новый ускоритель Falcon 9 Block 5 дважды в течение 24 часов - так что в основном это бесплатное повторное использование. Технология Block 5 используется на их новой, многоразовой ракете. Элон Маск утверждает, что цена за фунт его новой ракеты составит около 20 долларов.\n\nИ математически это имеет смысл. Тратить 400 миллионов на одну ракету. Если он может летать дважды без переоборудования, он может быть использован повторно около ста раз с переоборудованием. Используя ~ 400 миллионов (его общая стоимость составляет 430, BFR - уменьшенная версия этого, оценка, вероятно, была слишком низкой, поэтому 400 - разумно) долларовая ракета в 100 раз снижает стоимость за запуск до 4 миллионов плюс 40 миллионов топлива для 440 миллионов за те запуски в ракету и стоимость топлива. Это дает вам 260 миллионов на ремонт, чтобы достичь 21 доллара за фунт. Это происходит, и это происходит быстро. Элон Маск - единственный человек, который может назвать свою колонизацию Марса настоящим планом, а не несбыточной мечтой из-за этого.\n\nЭто прямо сейчас. К тому времени, когда технология против старения может оказать такое влияние, улучшения в области искусственного интеллекта, инфраструктуры и производства могут сократить эту цифру еще на один порядок, что позволит даже довольно бедным людям попасть в космос.","title":"Становление космической цивилизации Стиль SpaceX на самом деле может решить проблему «перенаселения»","subreddit_name_prefixed":"r/sens","ups":8,"created":1523751536,"link_flair_background_color":"","id":"8c8k4a","author":{"name":"[deleted]"},"permalink":"/r/sens/comments/8c8k4a/becoming_a_spacefairing_civilization_spacex_style/","url":"https://www.reddit.com/r/sens/comments/8c8k4a/becoming_a_spacefairing_civilization_spacex_style/","created_utc":1523722736}