{"subreddit":{"display_name":"sens"},"subreddit_loc":"смысл","selftext":"Вот некоторые вопросы SENS у меня все в одном месте\n\n1 * Во благо дела * кто-нибудь еще думает, что AdG должен постричься и отстричься? Я пытался показать его видео нескольким людям, и они всегда сразу откладывали его появление. В конце концов они получают его сообщение, но было бы легче, если бы им не пришлось преодолевать этот начальный горб.\n\n2 Является ли «обслуживание», которое мы будем выполнять, чем-то похожим на «заместительную терапию»? У нас уже есть HRT для женщин и TRT для мужчин. На веб-сайте SENS упоминается заболевание, называемое болезнью Гоше, при котором организму не хватает фермента для расщепления определенных липидов, поэтому для его лечения используется «заместительная энзимотерапия».\n\n3 В одном из видеороликов (не помню, какой именно) заявленная конечная цель состоит в том, чтобы прожить более 100, сохраняя при этом свое тело, состоящее из 20 с лишним, посредством технического обслуживания. Я упомянул об этом пару человек, и они думают, что это безумие. Но если я вместо этого упомяну, что мы сохраним наши 30 или 40 с чем-то тел, то это кажется немного более правдоподобным для них. Мысли кто-нибудь?\n\n4 А как насчет образа жизни? Я замечаю, что AdG (который, по-видимому, пьет много эля) сводит к минимуму это высказывание, что оно пренебрежимо мало по сравнению с тем, что может быть достигнуто с помощью предполагаемой антивозрастной терапии. Дает ли это бесплатный проход потребителям наркотиков и алкоголикам, чтобы они злоупотребляли собой, а затем исправлялись с помощью терапии?\n\n5 Еще одна важная проблема в жизни - наши диеты. Наша культура вырабатывает так много сахара и углеводов с высоким гликемическим индексом, что приводит к почти эпидемии людей на различных стадиях ожирения (и диабета T2) к тому времени, когда им исполняется 40 лет. Что происходит, когда люди, живущие за 100, принимают эти антивозрастные средства? методы лечения, но они продолжают набирать вес от употребления сладких безалкогольных напитков и употребления крахмалистой пищи?\n\n6 Что происходит, когда у нас есть «пустые сестры», состоящие из 50 или 60 женатых пар, чьи дети выросли, но благодаря этой антивозрастной терапии они по-прежнему выглядят моложе и окружены другими людьми своего возраста, которые также выглядят одинаково хорошо? Видим ли мы стремительный рост числа разводов за 50 или 60 лет, потому что они хотят снова начать встречаться? Брак становится временной вещью только для ребенка, растущего годами?","title":"Несколько вопросов SENS, которые я хотел бы задать в одном месте","subreddit_name_prefixed":"r/sens","ups":15,"created":1524348779,"link_flair_background_color":"","id":"8dvzda","author":{"name":"GreenReddish"},"permalink":"/r/sens/comments/8dvzda/several_sens_questions_id_like_to_ask_in_one_place/","url":"https://www.reddit.com/r/sens/comments/8dvzda/several_sens_questions_id_like_to_ask_in_one_place/","created_utc":1524319979}