{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"В этом посте я представлю свой аргумент, что незаменимые жирные кислоты не являются необходимыми:\n\n- Жир уже был продемонстрирован как несущественный, прежде чем заусенцы вмешались\n- То, что было определено как «дефицит незаменимых жирных кислот», является дефицитом цинка\n- Большинство диет с дефицитом незаменимых жирных кислот не содержат цинка\n- Цинк не считался необходимым, когда были обнаружены «незаменимые жирные кислоты»\n- Тело нуждается в некотором количестве полиненасыщенных жиров. Это может быть получено через диету или произведено эндогенно (то есть медовая кислота)\n- Производство медовой кислоты требует дополнительного цинка\n- Таким образом, диетическое требование для некоторой комбинации цинка или полиненасыщенных жиров.\n\nЦитирование:\n\nhttps://books.google.com/books?hl=en&lr=&id=vKHzAAAAMAAJ&oi=fnd&pg=PA145&dq=related:N9oSg-R9iHkJ:scholar.google.com/&ots=7VDzRd_TP9&sig=Js4o3iZHxr13_pL5nkSWjKUiRNs#v=onepage&q&f=false\n\n> По мере того, как они увеличивались, разница в потреблении «обезжиренного» по сравнению со «стандартным» рационом стала еще более поразительной ... ввиду очень быстрого роста, достигнутого этими животными в первые недели экспериментов, Можно даже обсудить, не представило ли это фактическое преимущество в питании роста.\n\nhttps://www.sciencedirect.com/science/article/pii/S0140673601227627\n\n> Казалось бы, нейтральные жиры с чисто физиологической точки зрения являются обязательными составляющими рациона, при условии, что другие продукты питания обеспечивают достаточное количество витамина, часто встречающегося в сочетании с натуральными жирами.\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC1260639/\n\n> Примерно к 200-му дню, когда стало ясно, что жир в рационе не имеет значения ... По описанному выше режиму ни у одной крысы не развилось тяжелое состояние чешуйчатого хвоста, но все показали его ощутимую степень ...\n\nhttp://www.jbc.org/content/132/2/539.full.pdf\n\n> Акродиния, как известно у крыс, может быть вылечена двумя разными способами.\n\n> Это можно вылечить с помощью так называемых \"незаменимых жирных кислот ...\"\n\n> Это можно вылечить концентратом рисовых отрубей. Это действие не зависит от жирных кислот ...\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/6815624\n\n> Ингибирующее влияние обезжиренной диеты на канцерогенез молочных желез у крыс ... Крысы, получавшие обезжиренную диету, весили несколько меньше, но не имели физических доказательств дефицита незаменимых жирных кислот.\n\nhttps://www.researchgate.net/publication/237677481_EFFECTS_OF_PROLONGED_USE_OF_EXTREMELY_LOW-FAT_DIET_ON_AN_ADULT_HUMAN_SUBJECT\n\n> Взрослый человек содержался в течение 6 месяцев на почти обезжиренной диете (менее 0,03 г жира на килограмм веса тела в день) без явного вреда.","title":"Незаменимые жирные кислоты не являются необходимыми","subreddit_name_prefixed":"r/ScientificNutrition","ups":4,"created":1543713648,"link_flair_background_color":"","id":"a24u7w","author":{"name":"AnonymousVertebrate"},"permalink":"/r/ScientificNutrition/comments/a24u7w/essential_fatty_acid_are_not_essential/","url":"https://www.reddit.com/r/ScientificNutrition/comments/a24u7w/essential_fatty_acid_are_not_essential/","created_utc":1543684848}