{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"I was recommended to post my work here after it gained some traction in other subreddits. I essentially wrote some analysis and summaries of a few studies that have to do with fitness and nutrition. However, instead of copy and pasting all of the text here, I figured I would just bring over a few studies that are more relevant to nutrition including pieces from last week. Enjoy! (All of these actually come from external sites which I originally wrote them in. I won't link those here, however. There isn't much different, just a few photos and hyperlinks. So if you're interested, you'll have to PM me.)\n\nTopics discussed: Low-carb diets, eggs, omega-3 fatty acids, intermittent caloric restriction and antioxidants.\n\n----------------------------------------------------------------------------------------------------------------------------\n\nThe bulk of this article will touch on our first study which was conducted by Ebbeling et al. (2018) investigating whether different macronutrient ratios (carbohydrates and fats specifically) have varying effects on total energy expenditure (TEE, essentially the number of calories you expended within a day) within the context of weight loss maintenance. This study has been making its rounds and has been the topic of discussion and debate amongst scientists recently. Let’s take a look at how this randomized controlled trial was carried out first.\n\n164 participants were all first put through a “run-in phase” in which they lost 12% of their body mass over 9–10 weeks. This was done to properly set up the study as the participants needed to be in a state where they are more likely to gain weight. Furthermore, as mentioned previously, this investigation needed to be done in the scope of weight loss maintenance. Once the first phase was complete, the subjects were randomized into 3 groups with differing macronutrient ratios: 20% carbohydrates (LOW), 40% carbohydrates (MOD) and 60% carbohydrates (HIGH). Protein was controlled at 20% of total dietary intake to prevent confounding by its greater thermic effect (Eisenstein, Roberts, Dallal & Saltzman, 2002). Participants were instructed to maintain this diet for a total of 20 weeks. Insulin responses to oral glucose tests were also recorded at pre-weight loss to see if people with lower or higher insulin responses had more modest/extreme changes in TEE.\n\nResults showed that LOW had a TEE 247 kcal/d higher than the TEE in HIGH. It was also discovered that those with higher insulin responses had more extreme changes in TEE with differences between LOW and HIGH being as high as 478 kcal/d with the results favoring LOW.\n\nThese are fairly substantial results and the differences between groups may be more pronounced than one would expect. Proponents of CICO (calories in, calories out) agree that low-carb diets such as the ketogenic diet have no metabolic advantage over other diets isocalorically so these numbers would definitely cause some heads to turn amongst them. Stephan Guyenet, PhD in neuroscience with specialization in eating behaviors, created an interesting graph presenting all the results of similar studies. On the extreme end of the spectrum, we can find the current study.\n\n[Credit: Stephan J. Guyenet](https://cdn-images-1.medium.com/max/800/1*KdLoJ0g6--W-kSAqvEefAQ.png)\nKevin Hall and Juen Guo wrote a response to the study outlining some potential issues with the methods used (can be read here). Firstly, they pointed out that there was a deviation from the pre-registered plan of statistical analysis. Initially, Ebbeling et al. (2018) intended to use TEE numbers from before the run-in phase but they used TEE results immediately after the run-in phase instead. This raises a problem that involves the use of doubly labeled water (a method of figuring out energy expenditure in humans). As described by Bhutani, Racine, Shriver & Schoeller (2015), there can be some inaccuracy in the use of doubly labeled water when there is a change in diet and a change in diet was occurring during the first TEE measurements (from a caloric deficit to a diet where calories were increased). Furthermore, if we follow the pre-registered plan, we see more reserved and statistically insignificant results.\n\nIn defense, the authors of the study at hand replied to the response. They essentially reinforced that the study was rigorously reviewed and they referenced previous replies they had made to other criticisms. Such points included that the reason behind having the first TEE data point after the run-in phase was because it was as close to the randomization as possible which reduces the chances of confounding (having non-measured/controlled variables affect your outcomes). Overall, the study design seems rather questionable and given how outlying the results were (compared to current literature), the generalizability and accuracy of this study is uncertain.\n\n**TL;DR:** Study showed that low-carb diet has higher metabolism than diets with higher carb ratios in the context of weight loss maintenance. However, the study’s design is contentious with accuracy at risk.\n\n---------------------------------------------------------------------------------------------------------------\n\nVliet et al. (2017) examined the metabolic responses in either consuming whole eggs or only egg whites. The consumption of egg yolk is often avoided amongst the public due to the fear of its fat and cholesterol content. Dietary cholesterol has very little effect on serum cholesterol in general and overall mortality which is further explained in a concise [Healthline article](https://www.healthline.com/nutrition/dietary-cholesterol-does-not-matter). The trial was conducted in a crossover design with 10 trained men swapping protocols after 1 week. The subjects either consumed:\n\n3 whole eggs (18g protein, 17g fat, 226 kcal)\nEgg whites (18g protein, 0g fat, 73 kcal)\nBefore consumption of the eggs, an exercise consisting of 4 sets of 10 reps of leg press and leg extensions were completed.\n\nPlasma leucine (an important amino acid for muscle protein synthesis) levels were similar between groups. The same can be said for the insulin responses. Serum triglycerides (what fat gets broken down into) were markedly higher at the 3 hour mark in the whole egg group but returned to baseline after 5 hours like the other group.\n\nWhile all the signalling pathways were activated to the same extent, muscle protein synthesis was greater in the whole egg group. The authors also explored how quickly leucine was absorbed and how it was metabolized in the body. In the whole eggs group, leucine was more rapidly absorbed but the overall availability of leucine in the blood over time was the same between groups. No differences in leucine metabolism were discovered.\n\nWith these results, we must ask why we see higher muscle protein synthesis rates in the whole eggs group despite being equated for protein intake (18g). Some may point to the higher calorie intake in whole eggs but this is likely incorrect. Additional calories on top of a fixed protein intake does not enhance muscle protein synthesis (Staples et al., 2011). Furthermore, the extra fat had no sparing effect on protein metabolism as evidenced by the lack in metabolic differences between groups. The authors proposed that whole eggs have vitamins/minerals, fatty acids and other chemicals which support muscle protein synthesis and that are not found in just the whites of an egg.\n\n**TL;DR:** Whole eggs are better than egg whites for muscle protein synthesis in young men likely due to unique substances found only in the yolk compared to the whites.\n\n--------------------------------------------------------------------------\n\nA randomized control trial studying the effects of intermittent caloric restriction(compared to a standard, continuous caloric restriction) on body composition and other bio markers in 136 men and women was recently published. Schübel et al. (2018) split all subjects into 3 groups. The first group did continuous caloric restriction where the daily caloric deficit was around 20%. The second group followed a 5:2 pattern for intermittent caloric restriction in which 2 non-consecutive days of the week consisted of a caloric deficit of 75%. The final group was a control group; a group with no advice to lose body mass.\n\nThe first 12 weeks of the study (intervention phase) had the subjects work closely with dietitians to help follow their allocated diet plans. This included face-to-face sessions as well bi-weekly phone calls. The following 12 weeks (maintenance phase) had no advice from any dietitians but the participants did receive motivational support. In the final 26 weeks (follow-up phase), the subjects received no help whatsoever. Scales and diaries were provided to everyone to help track and follow their diets.\n\nThe primary outcome chosen by the researchers was the expression (taking genetic information and turning it into a product) of 82 genes that are related to the pathophysiology of obesity. Other studied variables include body mass index, blood pressure, waist circumference, body fat, liver fat, diet compliance and quality of life.\n\nDuring the intervention phase, the intermittent caloric restriction group actually lost more body mass (-7.1%) compared to the continuous restriction group (-5.2%) but the p-value was just above significance (p=0.053). This just means that if were to repeat the experiment (assuming there is no difference between interventions and that results are obtained purely by chance), the chance of seeing a more extreme result is above a level that is considered safe. Anyways, after the 50 weeks, the percentage losses were a lot closer, -5.2% vs 4.9% for intermittent caloric restriction and continuous restriction respectively with no statistical significance. For the primary outcomes (gene expression), there was no difference. Between sub-groups like male vs female or overweight vs obese, there were no differences. There were no differences in biomarkers or quality of life.\n\nAn interesting finding was that the intermittent caloric restriction group had the worst compliance in the later weeks. From 49 participants, only 9 were doing 2 energy-restricted days per week at the final week. This may be reflected in the fact that the intermittent caloric restriction group had a higher mass re-gain after week 24 compared to the continuous restriction group. Despite this, there were never any significant differences in any body composition variables at any time point in the study.\n\n**TL;DR:** Intermittent caloric restriction is a valid method for weight loss but there does not seem to be a metabolic advantage from 5:2 intermittent caloric restriction over continuous restriction in overweight individuals. It may be harder to follow the intermittent caloric restriction diet for an extended period of time.\n\n---------------------------------------------------------------------------------------------------------------\n\nA review on omega-3 fatty acid (n-3PUFA) supplementation for sports performance was recently published (Philpott, Witward & Galloway, 2018). From the work of Smith et al. (2011), we see that n-3PUFA supplementation has the potential to increase muscle protein synthesis (MPS) rates in response to protein intake. Muscle protein synthesis is the addition of muscle proteins to muscle, the building blocks of muscle. The main acids of discussion are eicosapentaenoic acid (EPA), docosahexaenoic acid (DHA) and α-linolenic acid (ALA). EPA and DHA is mostly derived from fish oils while ALA is more from plant-based oils like soybean oil. An in-vitro (experiments done in controlled environments like laboratories instead of in living organisms like humans) study by Kamolrat & Gray (2013) found that DHA has no effect on MPS while EPA does. However, these effects on MPS may be redundant because optimal protein intake likely saturates any amelioration in MPS.\n\nUnfortunately, no studies looking at the effects of n-3PUFA supplementation of muscle strength/hypertrophy in the young and athletic exist. Although, there is some evidence suggesting muscle strength/hypertrophy and performance benefits in older men and women(Smith, et al., 2015; Rodacki, et al., 2012). There is theory for n-3PUFAs to help with synthesizing mitochondria. The mitochondria are parts of a cell that have the role of producing energy for our body. However, only one study examined this relationship and while there was a positive correlation, it was conducted in obese subjects (Laiglesia et al., 2016). Therefore, the use of n-3PUFAs for improving endurance is largely still theoretical especially in the athletic population.\n\nThere is also some theory in n-3PUFAs having a positive effect on insulin sensitivity but it is mostly not understood. In a rodent study, increased expression of GLUT4 (protein which transports glucose to muscle, lowering blood glucose) was seen with n-3PUFA supplementation but any of this has yet to be seen in human experiments (Lanza, et al., 2013). Kawabata, Neya, Hamazaki, Watanabe, Kobayashi & Tsuji (2014) found reduced oxygen consumption with n-3PUFA supplementation in untrained, young males. This may be linked to insulin sensitivity theory as increased insulin sensitivity leads to more glycogen in muscles which would displace fat use for energy and less oxygen consumption as a result. This effect may not have such a considerable effect in sporting performance as Hingley, Macartney, Brown, McLennan, & Peoples (2017) found no improvement in time trial times, strength or average power with n-3PUFA use despite an observed reduction in oxygen consumption.\n\nn-3PUFAs have anti-inflammatory properties so it has been proposed that they can support the recovery process after sport/exercise. However, the literature shows equivocal results. Finally, there is interesting discussion as to whether or not n-3PUFAs can aid in the recovery from a concussion as substantial amounts of DHA can be found in the brain. Wang et al. (2013) showed that rats had better cognitive performance with n-3PUFAs compared with rats that had soybean oil. The closest human evidence to all this theory was obtained by Oliver et al. (2016) in which less concentrations of a biomarker for head trauma was seen in American football players who ingested n-3PUFAs.\n\n**TL;DR:** Omega 3 fatty acids have potential to improve muscle strength/hypertrophy, endurance, recovery and concussion recovery but much more evidence is needed before any recommendations can be made.\n\n---------------------------------------------------------------------------------------------------------------\n\nDutra, Alex, Mota, Sales, Brown & Bottaro (2018) ran a randomized control study to evaluate the relationship between antioxidants and muscle strength, hypertrophy and fatigue. 42 young women participated in the study and they were separated into 3 groups. The first group ingested 1000mg of vitamin C and 400IU of vitamin E daily. The second group received a placebo and the last group was the control. Everyone followed a periodized training programme consisting of 2 upper body and 2 lower body exercises 2 times per week for 10 weeks.\n\nThere were no reported differences in lower body muscle thickness, fatigue or strength. Furthermore, only the placebo group showed an improvement over control in peak torque and total work done. This indicates that antioxidant supplementation has a negative effect on muscular performance. It is unknown as to why the researchers did not assess the same variables in the upper body. The use of a dynamometer as a measure of strength limits applicability to training as more specific measurements like 1RM bench press or squat would give more realistic results. Finally, there was little to no dietary control within this study.\n\n**TL;DR:** Antioxidant use was detrimental to muscular performance amongst young women.\n\n--------------------------------------------------------------------------\n\nBhutani, S., Racine, N., Shriver, T., & Schoeller, D. A. (2015). Special Considerations for Measuring Energy Expenditure with Doubly Labeled Water under Atypical Conditions. Journal of Obesity and Weight Loss Therapy, 5(2), .\n\nDutra, M. T., Alex, S., Mota, M. R., Sales, N. B., Brown, L. E. & Bottaro, M. (2018). Effect of strength training combined with antioxidant supplementation on muscular performance. Applied Physiology, Nutrition, and Metabolism, 43(8), 775–781.\n\nEbbeling, B. .C, Feldmen, H. .A & Klein, G. .L. (2018). Effects of a low carbohydrate diet on energy expenditure during weight loss maintenance: randomized trial. British Medical Journal, 363(8177), .\n\nEisenstien, J., Roberts S. B., Dallal, G., & Saltzman, E. (2002). High-protein weight-loss diets: are they safe and do they work? A review of the experimental and epidemiologic data. Nutrition Reviews, 60(7), 189–200.\n\nHall, K., & Guo, S.(2018). No Significant Effect of Dietary Carbohydrate versus Fat on the Reduction in Total Energy Expenditure During Maintenance of Lost Weight. Retrieved 30 November, 2018, from https://www.bmj.com/content/363/bmj.k4583/rr-16\n\nHingley, L., Macartney, M. J., Brown, M. A., McLennan, P. L. & Peoples, G. E. (2017). DHA-rich Fish Oil Increases the Omega-3 Index and Lowers the Oxygen Cost of Physiologically Stressful Cycling in Trained Individuals. International Journal of Sport Nutrition and Exercise Metabolism, 27(4), 335–343.\n\nKamolrat, T. & Gray, S. R. (2013). The effect of eicosapentaenoic and docosahexaenoic acid on protein synthesis and breakdown in murine C2C12 myotubes. Biochemical and Biophysical Research Communications, 432(4), 593–598.\n\nKawabata, F., Neya, M., Hamazaki, K., Watanabe, Y., Kobayashi, S. & Tsuji, T. (2014). Supplementation with eicosapentaenoic acid-rich fish oil improves exercise economy and reduces perceived exertion during submaximal steady-state exercise in normal healthy untrained men. Bioscience, Biotechnology, and Biochemistry, 78(12), 2081–2088.\n\nLaiglesia, L. M., Lorente-Cebrián, S., Prieto-Hontoria, P. L., Fernández-Galilea, M., Riberio, S. M., Sáinz, N., … Moreno-Aliaga, M. J. (2016). Eicosapentaenoic acid promotes mitochondrial biogenesis and beige-like features in subcutaneous adipocytes from overweight subjects. The Journal of Nutritional Biochemistry, 37(), 76–82.\n\nLanza, I. R., Blachnio-Zabielska, A., Johnson, M. L., Schimke, J. M., Jakaitis, D. R., Lebrasseur, N. K., Jensen, M. D., Sreekumaran Nair, K., … Zabielski, P. (2013). Influence of fish oil on skeletal muscle mitochondrial energetics and lipid metabolites during high-fat diet. American Journal of Physiology. Endocrinology and Metabolism, 304(12), 1391–403.\n\nLudwig , D. S. (2018). Author Response to Hall and Guo Regarding Data Reanalysis and Other Criticisms. Retrieved 30 November, 2018, from https://www.bmj.com/content/363/bmj.k4583/rr-17\n\nMcDonell, K. (2016). Why Dietary Cholesterol Does Not Matter (for most people). Retrieved 30 November, 2018, from https://www.healthline.com/nutrition/dietary-cholesterol-does-not-matter\n\nOliver, J. M., Jones, M. T., Kirk, K. M., Gable, D. A., Repshas, J. T., Johnson, T. A., Andréasson, U., … Zetterberg, H. (2016). Effect of Docosahexaenoic Acid on a Biomarker of Head Trauma in American Football. Medicine and Science in Sports and Exercise, 48(6), 974–982.\n\nPhilpott, J. D., Witard, O. C. & Galloway S. D. R. (2018). Applications of omega-3 polyunsaturated fatty acid supplementation for sport performance. Research in Sports Medicine, , 1–19.\n\nRodacki, C. L., Rodacki, A. L., Pereira, G., Naliwaiko, K., Coelho, I., Pequito, D. & Fernandes, L. C. (2012). Fish-oil supplementation enhances the effects of strength training in elderly women. The American Journal of Clinical Nutrition, 95(2), 428–436.\n\nSchübel, R., Nattenmüller, J., Sookthai, D., Nonnenmacher, T., Graf, M. E., Riedl, L., Schlett, C. L., … Kühn, T. (2018). Effects of intermittent and continuous calorie restriction on body weight and metabolism over 50 wk: a randomized controlled trial. The American Journal of Clinical Nutrition, 108(5), 933–945.\n\nSmith, G. I., Atherton, P., Reeds, D. N., Mohammed, B. S., Rankin, D., Rennie, M. J., & Mittendorfer, B. (2011). Omega-3 polyunsaturated fatty acids augment the muscle protein anabolic response to hyperinsulinaemia-hyperaminoacidaemia in healthy young and middle-aged men and women. Clinical science (London, England : 1979), 121(6), 267–278.\n\nSmith, G. I., Julliand, S., Reeds, D. N., Sinacore, D. R., Klein, S., & Mittendorfer, B. (2015). Fish oil-derived n-3 PUFA therapy increases muscle mass and function in healthy older adults. The American Journal of Clinical Nutrition, 102(1), 115–122.\n\nStaples, A. W., Burd, N. A., West, D. W., Currie, K. D., Atherton, P. J., Moore, D. R., Rennie, M. J.,… Phillips, S. M. (2011). Carbohydrate does not augment exercise-induced protein accretion versus protein alone. Medicine & Science in Sports & Exercise, 43(7), 1154–1161.\n\nVliet, S., Shy, E. L., Sawan, S. A., Beals, J. W., West, D. WD., Skinner, S. K., Ulanov, A. V.,… Burd, N. A. (2017). Consumption of whole eggs promotes greater stimulation of postexercise muscle protein synthesis than consumption of isonitrogenous amounts of egg whites in young men. The American Journal of Clinical Nutrition, 106(6), 1401–1412.\n\nWang, T., Van, K. C., Gavitt, B. J., Grayson, J. K., Lu, Y. C., Lyeth, B. C. & Pichakron, K. O. (2013). Effect of fish oil supplementation in a rat model of multiple mild traumatic brain injuries. Restorative Neurology and Neuroscience, 31(5), 647–659.","title":"Review/Presentation of a Few Nutrition/Fitness Studies","subreddit_name_prefixed":"r/ScientificNutrition","ups":14,"created":1544518673,"link_flair_background_color":"","id":"a51ufm","author":{"name":"MirrorMageZ"},"permalink":"/r/ScientificNutrition/comments/a51ufm/reviewpresentation_of_a_few_nutritionfitness/","url":"https://www.reddit.com/r/ScientificNutrition/comments/a51ufm/reviewpresentation_of_a_few_nutritionfitness/","created_utc":1544489873}