{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Всем привет!\n\nВо-первых, спасибо всем, кто участвует в этом сабе! Наличие людей с различными взглядами и происхождением делает для отличного обмена и отличного опыта обучения для всех.\n\nМы хотим создать нейтральную почву для научного обмена, и, как следует из названия подпункта, мы стремимся стать подпольщиком, где ожидается научная строгость. Уже есть сабвуфер r / nutrition, где каждый может претендовать на что угодно, и это не то, что мы хотим для этого саба.\n\nТаким образом, мы будем довольно строгими в наших правилах удаления комментариев.\n\nВот наши правила:\n\n1. Претензии должны быть подкреплены ссылками в максимально возможной степени. Мы знаем, что для написания хорошо цитируемой публикации требуется гораздо больше времени, но мы бы предпочли иметь только несколько качественных комментариев, чем много комментариев с незначительным содержанием.\n\n2. Претензии, сделанные в комментариях первого уровня (прямые ответы на ФП), должны быть связаны с первоисточниками (исследованиями). Настоятельно рекомендуется, чтобы комментарии более низкого уровня также содержали ссылки, но мы будем менее строги с ними.\n\n3. Комментарии должны иметь отношение к предмету под рукой. Не каждый пост должен превращаться в дискуссию о плотоядном животном или вегане или насыщенном жире и полиненасыщенном жире. Старайтесь как можно больше придерживаться предмета и ссылаться на идею, только если она связана с ОП.\n\n4. Избегайте любых личных атак / культа диеты / трайбализма. Мы все находимся в одном пути, чтобы узнать, поэтому попросите доказательства для иска, обсудите доказательства и предложите встречное доказательство. Помните, что можно не соглашаться, и дело не в том, кто прав, а кто неправ.\n\n5. Мы будем принимать комментарии, основанные на мнении, если пользователь четко заявил, что они высказывают свое мнение и что это не подкреплено наукой. Он должен, как всегда, иметь отношение к обсуждаемой теме и дополнять обсуждение.\n\n6. Помните, что кнопка понижения не предназначена для использования как «Я не согласен», а как «Это не способствует обсуждению». Пожалуйста, воздержитесь от понижения голосов только потому, что вы с этим не согласны.\n\nМы сделали наш журнал модов общедоступным, чтобы мы могли оставаться максимально нейтральными и прозрачными.\n\nКогда комментарий будет удален, вы будете уведомлены о причине.\n\nЕсли вы считаете, что удаление вашего комментария было несправедливым, отправьте нам сообщение, чтобы мы могли рассмотреть проблему.\n\nМы также открыты для любых отзывов относительно этих политик.\n\nОпять же, мы стараемся быть максимально нейтральными в нашей политике удаления комментариев и делаем это в надежде сохранить высокое качество обсуждения на благо всех, кто придет к подписке.","title":"Правила удаления комментариев","subreddit_name_prefixed":"r/ScientificNutrition","ups":28,"created":1545692466,"link_flair_background_color":"#dadada","id":"a95n0h","author":{"name":"oehaut"},"permalink":"/r/ScientificNutrition/comments/a95n0h/comment_removal_policies/","url":"https://www.reddit.com/r/ScientificNutrition/comments/a95n0h/comment_removal_policies/","created_utc":1545663666}