{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://runnersconnect.net/diet-of-kenyan-runners/\n\n* Сахар - обычный сахар - составлял 20 процентов ежедневных калорий\n\n* Угали обеспечивало наибольшее количество калорий, составляя 23 процента ежедневного рациона. Угали - это просто блюдо из кукурузной муки (кукурузной муки), приготовленное с водой.\n\nЗерновые + добавлен сахар.\n\nКак им это сходит с рук и все же доминирует в мире бега на длинные дистанции?\n\nТот факт, что их диета по-прежнему в основном состоит из цельных продуктов, вероятно, является важным фактором.\n\nДругим, конечно, является давление естественного отбора из их эволюционной истории.\n\nВозможно, большой вклад вносят факторы микробиома, такие как кормление грудью и отсутствие антимикробного воздействия. Да, в странах третьего мира есть злоупотребление антибиотиками, но маловероятно, что в нем участвовали лидеры, хотя я не мог найти информацию в любом случае.\n\nХорошим примером может быть [Дэвид Рудиша]  (https://en.wikipedia.org/wiki/David_Rudisha#Personal_life) , который является членом масаи, который является Достаточно уединенное африканское племя и, следовательно, более защищенное от современных возмущений микробиомов. Давид Рудиша также сын олимпийского призера. Так что в семье все работает, как обычно.\n\nВероятно, там также происходит более естественный отбор из-за отсутствия стандартов 1-го мира: [37 младенческих смертей на 1000 рождений против 6]  (https://www.cia.gov/library/publications/ the-world-factbook / rankorder / 2091rank.html)  (США). Таким образом, у вас меньше нездоровых людей, достигших совершеннолетия и использующих свое нездоровое тело для создания более нездоровых людей. Таким образом, меньше из них восприимчивы к вредам, которые могут возникнуть, если они имеют дисбактериоз кишечника и ели эти продукты.\n\nБез сомнения, кето хорошо работает для многих людей, но, по-видимому, оно приносит наибольшую пользу нездоровым людям. Если у вас дисбактериоз кишечника, то пища (углеводы), которая питает микробы, может вызвать проблемы. Смотрите, например:\n\n> Преимущества поста и кетогенной диеты зависят от микробиома кишечника, а преимущества можно перенести с помощью FMT [[1]  (https://old.reddit.com/r/HumanMicrobiome/ комментарии / 8lwzmg / gut_bacteria_play_critical_role_in_antiseizure /) ] [[2]  (https://old.reddit.com/r/HumanMicrobiome/comments/8psmna/intermittent_fasting_confers_protection_in>) ]. И еще [span] <span translate = \"no\"> (/ r / HumanMicrobiome / wiki) .\n\nКороче говоря, я полагаю, что если бы человек, у которого были проблемы со здоровьем из-за этих продуктов, сделал FMT от лучших кенийских бегунов, его здоровье значительно улучшилось бы и, вероятно, больше не пострадало бы от этих продуктов.\n\n---\n\nТараумара - это еще одна группа бегунов на длинные дистанции, на которую можно посмотреть: https://www.ncbi.nlm.nih.gov/pubmed/433816 - опубликовано в 1979 году, и их диета «состоит в основном из бобов и кукурузы».\n\nЭтот источник говорит, что они теряют некоторые из своих способностей, когда они начинают есть обработанную / нежелательную диету: https://www.runnersworld.com/runners-stories/a20787628/the-tarahumara-diet-is-tough-to-swallow /","title":"Диета ведущих кенийских спортсменов сильно противоречит многим общим рекомендациям по питанию, включая комментарии к этой статье.","subreddit_name_prefixed":"r/ScientificNutrition","ups":11,"created":1547073852,"link_flair_background_color":"","id":"ae7gky","author":{"name":"MaximilianKohler"},"permalink":"/r/ScientificNutrition/comments/ae7gky/the_diet_of_top_kenyan_athletes_is_highly/","url":"https://www.reddit.com/r/ScientificNutrition/comments/ae7gky/the_diet_of_top_kenyan_athletes_is_highly/","created_utc":1547045052}