{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"Всем привет,\n\nЯ хотел потратить небольшую минуту, чтобы опубликовать обновленный пост, касающийся [этой недавней дискуссии]  (https://www.reddit.com/r/ScientificNutrition/comments/ai02xh/a_plantbased_meal_increases_gastrointestinal/)  бумаги,\n«Питание на растительной основе увеличивает желудочно-кишечные гормоны и сытость больше, чем пища, обработанная мясом и питательными веществами, согласованными с питательными веществами и макроэлементами, у больных с ожирением и ожирением: рандомизированное перекрестное исследование трех групп [Klementova et al., 2019]».\n\nИзучив комментарии и углубившись в статью, я хотел бы высказать несколько мыслей, которые, как мне кажется, следовало бы изложить в первоначальном посте.\n\n**Дизайн исследования**\n\nХотя большая часть этого плана исследования была выполнена хорошо (рандомизация, n = достаточно, включая ряд здоровых / нездоровых участников), есть два значительных и связанных недостатка, которые значительно уменьшают ценность результатов. Одним из них является тот факт, что потребление сахара не контролировалось, а другим является то, что не было дано разбивки по количеству каждого пищевого ингредиента и сколько каждый ингредиент вносил в каждый макроэлемент. Это означает, что мы не можем сказать, сколько всего сахара было дано каждой группе и сколько (общей массы) каждой другой пищи было дано. Поскольку мы знаем, что сахар очень ненасыщенный, если группе мясной муки давали гораздо большее количество сахара, чем группе растительной муки, это могло бы объяснить значительную часть различий в результатах. Подумав об этом, я понял, что это, по сути, та же тактика, которая использовалась Egg Board и Ассоциацией по контролю за говядиной, когда они разрабатывают свои блюда, чтобы искажать выводы в пользу продуктов, которые они продвигают, за исключением того, что в этом исследовании потенциальный уклон был к растительной муке (если действительно содержание сахара было намного выше для мясной муки).\n\n** Потенциальный конфликт интересов (ИСП) **\n\nВ то время как только 1 из 7 авторов исследования имеет потенциальную ИСП, указанную в списке (работающую для некоммерческой исследовательской группы, занимающейся вопросами растений), существует более высокий уровень беспокойства, чем мы обычно ожидаем, с риском 1/7 ИСП. Это потому, что автор, «H.K.», был одним из авторов исследования, а также одним из составителей рукописи. Это означает, что Х.К. внесла значительный вклад в то, как были определены тестовые блюда и как была написана статья. Это обеспечивает дополнительный потенциал для предвзятости при тестировании и в выводах статьи. Если Х.К. просто выполнял сбор данных или статистический анализ, тогда уровень беспокойства был бы намного ниже.\n\n** О чем этот документ на самом деле сообщил нам **\n\nХотя название этой статьи технически очень точное, я не верю, что исследование на самом деле предоставляет полезную информацию в том виде, в каком оно заявлено. Если мы хотим получить доказательство насыщения клетчатки, мы уже имеем это в гораздо больших испытаниях с лучшим дизайном исследования. Если нам нужны доказательства того, что сахар, жиры и микроэлементы влияют на сытость, мы не можем узнать об этом из этого исследования, поскольку общее количество этих продуктов не было зарегистрировано.\n\nНаконец, я упомяну одно преимущество, которое, как мне кажется, эта статья * дает *, и это касается сравнения между группами гормонов голода и измеренной сытости. Интересно то, что сигналы сытости увеличились больше всего в наименее здоровых группах населения, что указывает на то, что, возможно, тела нездоровых людей увеличивают свои сигнальные гормоны, пытаясь заставить мозг потреблять меньше пищи. Однако измеренная реакция сытости была самой низкой в ​​группе T2D и самой высокой в ​​здоровой группе, что указывает на то, что, возможно, здоровые люди лучше самостоятельно измеряют свою полноту.\n\n** Во всяком случае, для TL; DR. **\n\nЯ думаю, что эта статья может иметь некоторую полезную информацию, касающуюся измерений между группами по гормонам и сытости, но потенциальное смещение в дизайне еды и написании статьи означает, что заявленное название статьи и многие из выводов просто не выдерживай строгого контроля. Я обязательно оставлю оригинальное сообщение, потому что оно способствовало хорошей дискуссии, но я хотел сделать эту ветку, чтобы прояснить, что, в целом, я не думаю, что это хорошая статья, и я постараюсь не публиковать исследования с такими существенными ограничениями. в будущем.","title":"Относительно недавнего поста «Растительная пища .... и сытость» Клементовой и др., 2019","subreddit_name_prefixed":"r/ScientificNutrition","ups":15,"created":1548129569,"link_flair_background_color":"#dadada","id":"aie1pd","author":{"name":"dreiter"},"permalink":"/r/ScientificNutrition/comments/aie1pd/regarding_the_recent_post_of_a_plantbased_mealand/","url":"https://www.reddit.com/r/ScientificNutrition/comments/aie1pd/regarding_the_recent_post_of_a_plantbased_mealand/","created_utc":1548100769}