{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"http://www.ncbi.nlm.nih.gov/pubmed/3921234\n\n> Требование незаменимых жирных кислот для онкогенеза молочных желез у крыс.\n\nhttp://cancerres.aacrjournals.org/content/4/3/153.full.pdf\n\n> Однако, когда кукурузное масло было заменено гидрогенизированным кокосовым маслом, частота опухолей никогда не превышала 8 процентов, тогда как в большинстве групп она была равна нулю.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/6704963\n\n> Эти данные свидетельствуют о том, что пищевые ненасыщенные жиры обладают мощным кокарциногенным действием на канцерогенез толстой кишки.\n\nhttp://www.ncbi.nlm.nih.gov/pubmed/6815624\n\n> Ингибирующее влияние обезжиренной диеты на канцерогенез молочных желез у крыс.\n\nhttps://link.springer.com/article/10.1007/BF02531379\n\n> Эксперименты с 10 различными жирами и маслами, подаваемыми на уровне 20%, показали, что ненасыщенные жиры увеличивают выход аденокарциномы больше, чем насыщенные жиры.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/7285004\n\n> Таким образом, диеты с высоким содержанием ненасыщенных жиров, по-видимому, способствуют канцерогенезу поджелудочной железы у крыс, получавших азазерин, в то время как диета с высоким содержанием насыщенных жиров не показала аналогичной степени усиления канцерогенеза поджелудочной железы.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/817101\n\n> Совокупная частота опухолевых крыс среди крыс, которым вводили ДМБА, была выше, когда кормили полиненасыщенными жирами\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/107358\n\n> Эти результаты показывают, что для стимулирования канцерогенеза молочных желез требуется определенное количество полиненасыщенных жиров, а также высокий уровень пищевых жиров.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/6782319\n\n> Тем не менее, более высокие урожаи опухоли были связаны с повышенной ненасыщенностью фосфолипидов молочной ткани.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/2979798\n\n> Эти результаты свидетельствуют о том, что диета с высоким содержанием ненасыщенных жиров или в сочетании с 4% холестирамина способствует развитию рака молочной железы, вызванного ДМБА, у крыс линии Вистар.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/6583457\n\n> ... действие диетического кукурузного масла (CO), сафлорового масла (SO), оливкового масла (OO), кокосового масла (CC) и триглицеридов со средней длиной цепи (MCT) ... Частота возникновения опухолей толстой кишки увеличилась крысы кормили рационами с высоким содержанием СО и высоким SO ... тогда как рационы с высоким содержанием ОО, СС или МСТ не оказывали стимулирующего влияния на частоту возникновения опухолей толстой кишки.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/6778606\n\n> ... увеличение потребления жиров сопровождалось увеличением частоты опухолей при использовании кукурузного масла в рационах. С другой стороны, рацион с высоким содержанием насыщенных жиров был гораздо менее эффективным в этом отношении.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/9066676\n\nОбнаружено, что защитный противоопухолевый эффект оливковой диеты связан с содержанием в ней мононенасыщенных жирных кислот, а также с концентрацией стеариновой кислоты в сыворотке. Промоторный онкогенный эффект других диет с высоким содержанием жиров был связан с их высоким уровнем некоторых полиненасыщенных жирных кислот ...\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/7214328\n\n> Увеличение частоты опухолей и уменьшение времени до опухоли наблюдались при повышении уровня линолеата (18: 2) ... Увеличение уровня стеарата было связано с уменьшением частоты опухолей и увеличением времени до опухоли.\n\nСравните это со стеариновой кислотой, насыщенной жирной кислотой, которая является антиканцерогенной:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19267249\n\n> Диетический стеарат снижает бремя метастазирования рака молочной железы у бестимусных голых мышей.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19838949\n\n> Стеарат преимущественно вызывает апоптоз в клетках рака молочной железы человека.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/6490204\n\n> Эти результаты свидетельствуют о том, что диетическая стеариновая кислота влияет на наличие определенных ПНЖК, необходимых для производства опухоли.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/21586513\n\n> Профилактика канцерогенеза и ингибирование бремени рака молочной железы стеаратом пищи.","title":"Омега-6 способствует раку; стеарат подавляет его","subreddit_name_prefixed":"r/ScientificNutrition","ups":24,"created":1549166045,"link_flair_background_color":"","id":"amhon0","author":{"name":"AnonymousVertebrate"},"permalink":"/r/ScientificNutrition/comments/amhon0/omega6_promotes_cancer_stearate_inhibits_it/","url":"https://www.reddit.com/r/ScientificNutrition/comments/amhon0/omega6_promotes_cancer_stearate_inhibits_it/","created_utc":1549137245}