{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"Очевидно, что я не обращаюсь к конкретным медицинским советам, но хотел бы услышать некоторые ваши мысли о последних исследованиях АД и возможных механизмах, вызывающих повышенное АД, и т. Д. Я мужчина 34 лет.\n\nПохоже, у меня изолированная систолическая гипертония. Мой нижний номер почти всегда находится в середине 70-х, но мой верхний номер, в зависимости от дня, имеет тенденцию к ползучести, иногда довольно высокий, иногда это только 125/75 (после пробуждения), иногда 135-145 (после обеда) / вечера), и когда я беспокоюсь, например, когда я иду в док, это может быть 160/80. Таким образом, мой доктор хотел, чтобы я отслеживал его в течение 3 недель, что, как правило, слишком высокое. Я еще не занимался наблюдением, но, думаю, она захочет, чтобы я принимал лекарства.\n\nПара вещей, которые стоит упомянуть.\n\n1. Семейная история сильна на проблемах, связанных с сердцем. Мой папа рано начал принимать лекарства ВР, и у его отца случился сердечный приступ в 39 лет (хотя он курил и жил на хрене!) Братья моего папы принимают лекарства ВР. Моей маме 64 года с нормальным АД. У сестры нормальное АД.\n2. Если бы вы посмотрели на меня, вы бы сказали: «Этот парень худой!», Но я действительно ношу висцеральный жир вокруг своей средней части. Не тонна, я все еще худой в целом, но я работаю избавиться от этого.\n3. Моя диета в целом довольно крепкая, в основном вегетарианская, с добавлением оленины / рыбы, но я определенно. съел слишком много пиццы в моей жизни. Я ем много яиц - потенциальная проблема?\n4. В среднем я бегаю 15-20 миль в неделю за 2-3 пробега. Я никогда по-настоящему не занимался силовыми тренировками, но начал несколько недель назад пытаться сбросить жир с живота, начиная с упражнений с весом тела. Я практикую ограниченное по времени питание, как правило, в соотношении 14 - 10 на.\n5. История тревоги, к сожалению.\n6. Должен ли я пойти веганом? диета DASH все еще вещь?\n\nЯ подумываю о том, чтобы сделать PROLON голодным в течение 3 месяцев подряд, из-за преимуществ продолжительности жизни, а также из-за помощи в потере жира в желудке, а также есть некоторые доказательства в их исследованиях пониженного АД после 3 раундов.\n\nЯ также собираюсь добавлять в некоторые продукты с высоким содержанием калия ежедневно, как свекла. Я также проверяю некоторый ген MTHFR, поскольку, как я слышал, если у вас есть мутация, это может повлиять на АД (у моей сестры есть мутация, так что я предполагаю, что да). Я просто не хочу делать инсульт! Я серьезно отношусь к заботе об этом без лекарств, но если мне нужны лекарства, то мне нужны лекарства.\n\nОпять же, я работаю с документом, но также хочу услышать, что другие говорят, и что они узнали.\n\nСпасибо,","title":"Артериальное давление","subreddit_name_prefixed":"r/ScientificNutrition","ups":8,"created":1551083333,"link_flair_background_color":"","id":"aueo5m","author":{"name":"mporter1513"},"permalink":"/r/ScientificNutrition/comments/aueo5m/blood_pressure/","url":"https://www.reddit.com/r/ScientificNutrition/comments/aueo5m/blood_pressure/","created_utc":1551054533}