{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Влияние богатого проантоцианидином экстракта из виноградных косточек на фекальную флору и запах фекалий человека\n\nДжун Ямакоси, Шоичи Токутакэ, Мамору Кикучи, Йоширо Кубота, Хироясу Кониши и Томотари Мицуока\n\nОпубликовано на сайте: 11 июля 2009\n\n  https://doi.org/10.1080/089106001750071672\n\n\nАннотация\n\nЦелью данного исследования было оценить влияние богатых проантоцианидинами экстрактов из виноградных косточек на фекальную флору и запах фекалий человека. Обогащенный проантоцианидином экстракт, содержащий 38,5% проантоцианидина, вводили девяти здоровым взрослым в дозе 0,5 г / день (0,19 г / день в качестве проантоцианидина) в течение 2 недель, а богатый проантоцианидином экстракт, содержащий 89,3% проантоцианидина, вводили восьми престарелым пациентам в стационаре. доза 0,43 г / сут (0,38 г / сут как проантоцианидин) в течение 2 недель. Экстракт зеленого чая и / или экстракт шампиньона, которые, как было установлено, оказывают дезодорирующее действие на запах кала, вводили аналогично контрольным.\n\nУ здоровых взрослых заметное снижение запаха фекалий и концентрации метилмеркаптана и сероводорода в кале наблюдалось во время приема богатого проантоцианидином экстракта, но эффекты экстракта зеленого чая и экстракта шампиньона были слабыми. После 2 недель приема экстракта, богатого проантоцианидином, количество Bifidobacterium значительно увеличилось (p <0,05), тогда как количество Enterobacteriaceae имело тенденцию к снижению (p = 0,121). Уровень гнилостных веществ, включая аммиак, фенол, п-крезол, 4-этилфенол, индол и скатолы, имел тенденцию к снижению после приема богатого проантоцианидином экстракта, а рН фекалий также имел тенденцию к снижению. Медсестры и помощники больницы выполнили органолептическую оценку, которая показала меньший запах кала у пожилых пациентов с потреблением экстракта, богатого проантоцианидином, чем с потреблением экстракта шампиньона.\n\nВ исследовании in vitro богатый проантоцианидином экстракт уменьшал выброс метилмеркаптана и сероводорода из фекалий здоровых взрослых, а также уменьшал выброс метилмеркаптана из раствора метилмеркаптана. Поглощающая способность метилмеркаптана была сильнее у процианидиновых олигомеров, больших, чем декамер, чем процианидиндимер, до тетрамера. Эти результаты позволяют предположить, что богатый проантоцианидином экстракт из семян винограда вызывает снижение уровня гнилостных продуктов в кишечнике, что может быть связано со скромным изменением количества Bifidobacterium и Enterobacteriaceae. Они также предполагают, что сильное дезодорирующее действие проантоцианидинов на запах фекалий обусловлено уменьшением гнилостных продуктов и поглощением неприятных соединений из фекалий более крупными молекулярными процианидиновыми олигомерами в проантоцианидинах.","title":"Экстракт виноградных косточек очень полезен для микробиома. Хорошие кишечные бактерии повышаются, плохие кишечные бактерии - понижаются.","subreddit_name_prefixed":"r/ScientificNutrition","ups":6,"created":1552718976,"link_flair_background_color":"","id":"b1lck0","author":{"name":"Bluest_waters"},"permalink":"/r/ScientificNutrition/comments/b1lck0/grape_seed_extract_appears_to_be_very_good_for/","url":"https://www.reddit.com/r/ScientificNutrition/comments/b1lck0/grape_seed_extract_appears_to_be_very_good_for/","created_utc":1552690176}