{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"Я часто слышу утверждение о том, что цельная растительная диета является единственной диетой, доказанной для уменьшения атеросклероза. Это неверно, поскольку диета, содержащая продукты животного происхождения, или даже просто добавка магния, может иметь такой эффект.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/23548855\n\n> Одной группе перорально вводили 440 мг оксида магния 3 раза в неделю в течение 6 месяцев ... cIMT значительно уменьшился в группе Mg ... Однако в группе плацебо cIMT значительно увеличился ...\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/27798369\n\n> Средиземноморская диета была богата овощами и цельными зернами и низким содержанием красного мяса, которое было заменено домашней птицей и рыбой, с целью не более 50% калорий из углеводов и не менее 30% калорий из жиров, с основной источник добавленного жира 30–50 г оливкового масла ... По сравнению с диетой с низким содержанием жира скорость регрессии в CIMT была выше в группе средиземноморской диеты (51 против 26%), тогда как скорость прогрессирования был ниже (25 против 50%) ...\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/23809150\n\n> Было рекомендовано ежедневное потребление фруктов, волокон и овощей, богатых антиоксидантами и витаминами, и было предложено ежедневное потребление 200 мл молока или йогурта ... нежирное мясо, рыба, богатая омега-3 жирными кислотами, бобы, нежирный сыр, мясное ассорти без жира и яиц (один раз в неделю). Мы предложили использовать оливковое масло экстра-класса ... После 12 месяцев диетического вмешательства было зарегистрировано значительное снижение ... cIMT ...\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/18635428 и https://www.ncbi.nlm.nih.gov/pubmed/20194883\n\n> Средиземноморская диета была богата овощами и низким содержанием красного мяса, при этом птица и рыба заменяли говядину и баранину. Мы ограничили потребление энергии ... с целью не более 35% калорий из жира; Основными источниками добавленного жира были от 30 до 45 г оливкового масла и горсть орехов ...\n\n> Сонная IMT изменилась на -1,1% ... мы обнаружили, что систолическое, но не диастолическое артериальное давление или сывороточный холестерин были связаны с изменениями сонной артерии.\n\nТакже обратите внимание, что щитовидная железа сама по себе может снизить атеросклероз и смертность.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19506325\n\n> Замена гормонов щитовидной железы значительно снизила C-IMT\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/19085705\n\n> значение CIMT значительно уменьшилось у всех, кроме двух пациентов, после достижения эутиреоза с помощью заместительной терапии L-тироксином\n\nhttps://onlinelibrary.wiley.com/doi/abs/10.1111/j.1532-5415.1968.tb01279.x\n\n> В течение двухлетнего периода 12 из группы, получавшей традиционное лечение, умерли, но только 2 из группы, обработанной щитовидной железой.\n\nhttps://onlinelibrary.wiley.com/doi/abs/10.1111/j.1532-5415.1971.tb01550.x\n\n> Все пациенты были пролечены высушенной щитовидной железой ... Уровень смертности составил 58 процентов от ожидаемого показателя для соответствующей популяции, взятого из таблиц жизни Нью-Джерси, и 44 процента от ожидаемого показателя, взятого из таблиц жизни США.\n\nСледовательно, все, что способствует выработке гормонов щитовидной железы, может предотвратить заболевание сердца. Магний способствует щитовидной железе, что, вероятно, объясняет его полезный эффект.\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/17984925\n\n> Было установлено, что добавление Mg предотвращает снижение активности гормонов щитовидной железы ...","title":"Решением для болезни сердца является щитовидная железа","subreddit_name_prefixed":"r/ScientificNutrition","ups":20,"created":1552866286,"link_flair_background_color":"#dadada","id":"b26fxu","author":{"name":"AnonymousVertebrate"},"permalink":"/r/ScientificNutrition/comments/b26fxu/the_solution_to_heart_disease_is_thyroid/","url":"https://www.reddit.com/r/ScientificNutrition/comments/b26fxu/the_solution_to_heart_disease_is_thyroid/","created_utc":1552837486}