{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"* Вопрос\n\nЯ никогда не сталкивался с такой ситуацией, когда мне приходилось умственно нарушать пост, потому что я хотел есть. Тем не менее, у меня всегда появляются мурашки по коже на 4 или 5 день, потому что я боюсь повредить свое тело.\n\nОдин * очевидный * маркер, на который все укажут, - это уровень глюкозы в крови. Однако я сомневаюсь в значимости цифр. Насколько я видел, можно было бы провести 0 исследований (есть некоторые, но очень низкие ns и не во многих популяциях) в отношении нормального уровня глюкозы в крови для индивидуума натощак.\n\nТекущие уровни, по-видимому, в значительной степени моделируются вокруг людей, страдающих диабетом или другими метаболическими заболеваниями, особенно когда вы попадаете в гипо и гипергликемию.\n\nЯ лично видел, что вплоть до 1,8-2,0 ммоль / л (то есть близко к тому, что с медицинской точки зрения будет считаться потерей сознания / захват / территория смерти), я не ослаблен или не чувствую себя больным в любом случае, и у меня все еще есть примерно такая же физическая сила, которая измеряется несколькими стандартными комплексами упражнений, которые я использую, чтобы подтолкнуть мышцы к пределу.\n\nИтак, какие маркеры лучше, чем уровень глюкозы в крови, говорят о том, что пост причиняет вред? Некоторые прокси для возможных причин внезапной смерти (например, аритмия сердца от чрезмерного стресса) или долгосрочного повреждения тела (например, повреждение печени или увеличение глюконеогенеза, повреждающего важные мышцы)?\n\nЖелательно, чтобы это были тесты, которые я могу провести в простой домашней лаборатории, или результаты, которые я смогу получить через ~ 10-20 часов в лаборатории, - вещи, которые я могу запустить позже ночью, и получить результат на следующее утро, чтобы я мог могу решить, следует ли мне быстро прорваться или идти на другой день.\n\n\n* Некоторая справка (не обязательна, но может быть полезна для понимания моего POV)\n\nИтак, я большой \"поклонник\" поста. Я знаю об исследованиях аутофагии во время голодания и о преимуществах кетоза, вызванного голоданием, по сравнению с питательным кетозом (меньше мышечной массы теряется в зависимости от количества жира, пропорционального дефициту калорий).\n\nТем не менее, я постился в основном потому, что мне нравится это чувствовать. Я имел опыт со многими наркотиками, и вы определенно входите в состояние, напоминающее стимулятор, во время поста. Что чертовски круто, это похоже на сульфат амфетамина без бесплатного желудочно-кишечного тракта, повреждения почек и дыхательных путей.\n\nЯ обычно делаю 3-5 дней постов, но мне было интересно делать более длительные посты (5-8 дней, возможно, если бы я чувствовал себя хорошо, возможно, увеличился на 2 недели).","title":"Какой маркер нужно отследить, чтобы определить, когда следует прекратить пост?","subreddit_name_prefixed":"r/ScientificNutrition","ups":7,"created":1554059368,"link_flair_background_color":"#dadada","id":"b7mmxs","author":{"name":"elcric_krej"},"permalink":"/r/ScientificNutrition/comments/b7mmxs/what_are_some_marker_to_track_in_order_to/","url":"https://www.reddit.com/r/ScientificNutrition/comments/b7mmxs/what_are_some_marker_to_track_in_order_to/","created_utc":1554030568}