{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Итак, я понимаю, что калории являются довольно хорошей оценкой «энергии» в случае очень простых продуктов в очень контролируемой метаболической ситуации.\n\nВы можете кормить голодного человека х граммами глюкозы, или фруктозы, или МСТ, и вы можете довольно точно предсказать, что этот человек, каким бы он ни был, в конечном итоге будет генерировать у молекулы АТФ (с, скажем, ошибкой +/- 5% зависит на эффективность различных транспортных механизмов внутри его организма). Это независимо от ДНК человека или ДНК его митохондрий.\n\nОднако, как только вы получаете более сложные продукты питания или даже людей, которые имеют более чем достаточно АТФ в своих клетках в момент поглощения питательных веществ, мне кажется, что калории не имеют никакого значения.\n\nНапример, давайте возьмем пример случайного белка:\n\n* Когда он попадает в организм, в зависимости от того, как мышечные волокна, частью которых он является, находятся в совокупности, нам необходимо увеличить определенное количество энергии, жуя его.\n\n* В зависимости от того, сколько энергии было потрачено на его жевание, объем работы, которую должен выполнить наш желудок, чтобы разрушить его (посредством физического пищеварения), может увеличиваться или уменьшаться. В зависимости от белка и нашей генетики количество пепсина (и других ферментов), которое желудок и поджелудочная железа должны выделять, чтобы расщепить его.\n\n* В зависимости от типа белка, большая или меньшая его часть распадается на аминокислоты, и в зависимости от различных генетических факторов и факторов окружающей среды, большая или меньшая часть этих аминокислот будет всасываться через тонкую кишку.\n\n* Весь этот процесс (при крупномасштабной агрегации) наносит некоторый ущерб печени, поджелудочной железе и двенадцатиперстной кишке. В зависимости от типа белка эти повреждения могут быть весьма значительными, даже в том случае, если иммунный ответ и ресурсы, необходимые для их устранения, перевесят ресурсы, обеспечиваемые этим конкретным классом белков (например, глютеном и различными молочными белками у людей, не переносящих их).\n\n* Как только эти аминокислоты попадают в организм, они могут использоваться печенью для создания белков в зависимости от потребностей клеток, их можно транспортировать непосредственно в клетки, чтобы клетки могли создавать с их помощью белки, их можно использовать для Глюконеогенез, если печень получает гормональные сигналы, указывающие на неоптимальный уровень сахара в крови ... и т. Д.\n\n* Даже когда аминокислоты попадают в ткани, в зависимости от того, какие это аминокислоты, их можно использовать по-разному:\n\n* Определенные аминокислоты могут фактически требоваться определенным вирусом, внедренным в некоторые клетки, таким образом, не обеспечивая никакой энергии, но вместо этого потребляя энергию, повреждая клетку далее, заставляя ее производить больше вирусов и вызывая иммунный ответ\n\n* Определенное потребление аминокислот может привести к благоприятному генерированию определенного типа белка ... который, в свою очередь, в избытке, расщепляется лизосомой, выделяя составляющие его аминокислоты, когда переваривание закончено, но с некоторым расходом энергии\n\n... так далее\n\nПо сути, в зависимости от того, что происходит в организме, мне кажется, что любой данный 300 тыс. Кал кал может в конечном итоге служить многим целям и вызывать большие затраты энергии. И разница между тем, насколько эффективно используется эта скудная доля, и сколько энергии расходуется, чтобы достичь указанной полезности, довольно велика.\n\nИтак ... я ошибаюсь, предполагая это? Существует ли какая-либо теория, лежащая в основе идеи о калориях, кроме мнения 18-го века о том, что биологический организм функционирует как совершенная печь, а не как чрезвычайно неэффективная и сложная биохимическая лаборатория.","title":"Является ли ошибкой говорить о «калориях» вне очень простых питательных веществ.","subreddit_name_prefixed":"r/ScientificNutrition","ups":22,"created":1554582884,"link_flair_background_color":"#dadada","id":"ba3v69","author":{"name":"elcric_krej"},"permalink":"/r/ScientificNutrition/comments/ba3v69/is_it_a_fallacy_to_talk_about_calories_outside_of/","url":"https://www.reddit.com/r/ScientificNutrition/comments/ba3v69/is_it_a_fallacy_to_talk_about_calories_outside_of/","created_utc":1554554084}