{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://academic.oup.com/ajcn/article-abstract/108/2/256/5067919?redirectedFrom=fulltext\n\n Американский журнал клинического питания, том 108, выпуск 2, август 2018 года, страницы 256–265, https://doi.org/10.1093/ajcn/nqy120\n\n\nАННОТАЦИЯ\n\nФон\n\nКомбинированный эффект низкоуглеводной диеты с высоким содержанием белка (LCHP) и добавок омега-3 (n – 3) полиненасыщенных жирных кислот (PUFA) на пациентов с диабетом 2 типа (T2D) не известен.\n\nЗадача\n\nЦелью данного исследования было оценить влияние диеты LCHP в сочетании с ω-3 (LCHP + ω-3) на гликемический контроль у пациентов с СД2.\n\nдизайн\n\nВ этом рандомизированном двойном слепом параллельном контролируемом исследовании 122 вновь диагностированных участника с СД2 были случайным образом распределены на диету с высоким содержанием углеводов и низким содержанием белка с низким ω-3 ПНЖК [контроль (CON)], LCHP, ω -3, или диета LCHP + ω-3 в течение 12 недель. Соотношение углеводов к белку составляло 42:28 в диете LCHP и LCHP + ω-3 и 54:17 в диете CON и ω-3. Участникам давали 6 г рыбьего жира / сутки (содержащие 3,65 г докозагексаеновой кислоты, эйкозапентаеновой кислоты и докозапентаеновой кислоты / сут) в группах диеты ω-3 и LCHP + ω-3 или 6 г кукурузного масла / сутки (плацебо) диетические группы CON и LCHP.\n\nРезультаты\n\nПо сравнению с группой диеты CON, большее снижение гликированного гемоглобина (HbA1c) и уровня глюкозы натощак наблюдалось во всех остальных 3 группах диеты через 12 недель. Следует отметить, что снижение HbA1c в группе диеты LCHP + ω-3 (-0,51%; 95% ДИ: -0,64%, -0,37%) было выше, чем в LCHP (P = 0,03) и ω-3 (P = 0,01) диетические группы в 12 недель. Что касается уровня глюкозы натощак, только в группе, получавшей диету LCHP + ω-3, наблюдалось значительное снижение через 4 недели (P = 0,03 по сравнению с CON). Кроме того, снижение уровня глюкозы натощак в группе диеты LCHP + ω-3 (-1,32 ммоль / л; 95% ДИ: -1,72, -0,93 ммоль / л) было больше, чем в LCHP (P = 0,04) и ω -3 (P = 0,03) диетические группы в 12 недель.\n\nВыводы\n\nДиета LCHP + ω-3 оказывала большее влияние на HbA1c и уровень глюкозы натощак и более быстрое воздействие на уровень глюкозы натощак, чем диеты LCHP и ω-3, что указывает на потенциальную необходимость сочетания диеты LCHP с ω-3 PUFA в контроле T2D. Это испытание было зарегистрировано на chictr.org.cn/ как ChiCTR-TRC-14004704.","title":"Влияние комбинированного использования низкоуглеводной, высокобелковой диеты с добавлением полиненасыщенных жирных кислот омега-3 на гликемический контроль при недавно диагностированном диабете 2 типа: рандомизированное, двойное слепое, параллельно контролируемое исследование","subreddit_name_prefixed":"r/ScientificNutrition","ups":5,"created":1556031904,"link_flair_background_color":"#dadada","id":"bgdbgp","author":{"name":"fhtagnfool"},"permalink":"/r/ScientificNutrition/comments/bgdbgp/effect_of_combined_use_of_a_lowcarbohydrate/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bgdbgp/effect_of_combined_use_of_a_lowcarbohydrate/","created_utc":1556003104}