{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"# Добро пожаловать в r / ScientificNutrition!\n\nЭтот субреддит был создан, чтобы служить нейтральной площадкой для обмена и обсуждения научных данных, касающихся питания человека.\n\nЕсли вы решите комментировать и участвовать в подпрограмме, ** ожидается научная строгость! **\n\nМы оставляем за собой право удалять любые комментарии, которые не соответствуют духу этого подпункта.\n\n## Вот общие правила публикации ** комментариев **:\n\n1. Претензии должны быть подкреплены ссылками в максимально возможной степени. Мы знаем, что гораздо больше времени уходит на написание поста с хорошими ссылками, но мы бы предпочли иметь только несколько качественных комментариев, чем много комментариев с небольшим содержанием.\n\n2. Претензии, сделанные в комментариях высшего уровня (прямые ответы на ФП), должны быть связаны с первоисточниками (исследованиями). Настоятельно рекомендуется, чтобы комментарии более низкого уровня также содержали ссылки, но мы будем менее строги с ними.\n\n3. Комментарии должны иметь отношение к предмету под рукой. Не каждый пост должен превращаться в дискуссию о плотоядном животном или вегане или насыщенном жире и полиненасыщенном жире. Старайтесь как можно больше придерживаться предмета и делитесь ссылками на идею, только если она связана с ОП.\n\n4. Избегайте любых личных атак / культа диеты / трайбализма. Мы все находимся в одном пути, чтобы узнать, поэтому попросите доказательства для иска, обсудите доказательства и предложите встречное доказательство. Помните, что можно не соглашаться, и дело не в том, кто прав, а кто неправ.\n\n5. Мы будем принимать комментарии, основанные на мнении, если пользователь четко заявил, что они высказывают свое мнение и что это не подкреплено наукой. Он должен, как всегда, иметь отношение к обсуждаемой теме и дополнять обсуждение.\n\n6. Помните, что кнопка понижения не предназначена для использования как «я не согласен», а как «это не способствует обсуждению». Пожалуйста, воздержитесь от понижения голосов только потому, что вы с этим не согласны.\n\n## Вот общие правила публикации ** в отношении содержания публикации **:\n\nКаждое сообщение должно иметь резюме в разделе комментариев.\n\nМы очень одобряем первичное исследование как лучший контент для публикации. Резюме первичного исследования может просто опубликовать тезисы. Еще лучше резюме будет также содержать часть результатов или обсуждения, которые вы считаете интересными. Это должно очень стимулировать обсуждение.\n\nБлоги, видео и статьи принимаются, если в разделе комментариев приводится краткая информация о СМИ.\n\nРезюме должно содержать:\n\n1. Выдержка из претензий, сделанных в средствах массовой информации\n2. Ссылка на сопроводительную научную ссылку, используемую в СМИ\n\nМы ожидаем, что по крайней мере один отрывок из СМИ будет опубликован в качестве резюме, но призываем опубликовать как можно больше отрывков.\n\nЛюбые средства массовой информации, опубликованные без сопроводительной публикации **, будут удалены. **\n\nТаким образом, мы гарантируем, что отправитель прочитал / посмотрел то, что он публикует, мы избегаем спам-публикаций в подпрограмме и облегчаем всем участие в научной дискуссии, которая всегда будет оставаться центральной в этой подпункте.\n\nМы сделали наш [mod log public]  (https://moddit.ffff00.news/r/ScientificNutrition) , чтобы мы могли оставаться нейтральными и прозрачными в максимально возможной степени.\n\nКогда комментарий или сообщение будет удалено, вы будете уведомлены о причине.\n\nЕсли вы считаете, что удаление вашего комментария было несправедливым, отправьте нам сообщение, чтобы мы могли рассмотреть проблему.\n\nЭти руководящие принципы будут развиваться по мере роста субмарины, поэтому мы остаемся открытыми для любых отзывов относительно этих политик.\n\nМы стараемся быть максимально нейтральными в наших правилах публикации и делаем это в надежде сохранить высокое качество обсуждения на благо всех, кто придет к подписчику.\n\nСпасибо за ваш вклад!","title":"Правила публикации","subreddit_name_prefixed":"r/ScientificNutrition","ups":26,"created":1558308227,"link_flair_background_color":"","id":"bqi550","author":{"name":"oehaut"},"permalink":"/r/ScientificNutrition/comments/bqi550/posting_guidelines/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bqi550/posting_guidelines/","created_utc":1558279427}