{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Кетогенная диета не улучшала умственную работоспособность, как утверждают многие.\n\n«ЦЕЛЬ: Поскольку существуют опасения относительно связи между диетами с высоким содержанием жиров и снижением когнитивных способностей, это исследование было направлено на определение эффектов КД по сравнению с изокалорической диетой с высоким содержанием углеводов и низким содержанием жиров (HCLF) на когнитивные функции, сон, и настроение у здоровых людей с нормальным весом.\n\nМетоды. Одиннадцать здоровых участников с нормальным весом (средний возраст: 30 ± 9 лет) завершили это рандомизированное контролируемое перекрестное исследование. Участники следовали 2 изокалорийным диетам - диете HCLF (55% углеводов, 20% жиров и 25% белков) и KD (15% углеводов, 60% жиров и 25% белков) - в случайном порядке как минимум для 3 неделя с периодом вымывания 1 неделя между диетами. Измерения β-гидроксибутирата подтвердили, что все участники находились в состоянии пищевого кетоза во время оценок после KD (исходный уровень: 0,2 ± 0,2 ммоль / л; KD: 1,0 ± 0,5 ммоль / л; вымывание: 0,2 ± 0,1 ммоль / л; и HCLF: 0,3 ± 0,2 ммоль / л). Когнитивные функции оценивались с использованием проверенного, психологического компьютерного теста батареи до и после каждой диеты. Субъективные показатели настроения и сна также контролировались на протяжении всего исследования с использованием проверенных шкал.\n\nРЕЗУЛЬТАТЫ: Три недели устойчивого кетоза питания по сравнению с диетой HCLF не влияли на скорость и точность ответов в задачах, разработанных для измерения бдительности (скорость: P = 0,39, Коэн d = 0,26; точность: P = 0,99, Коэн d = 0,04), визуальное обучение и память (скорость: P = 0,99, d Коэн = 0.04; точность: P = 0.99, d Коэн = 0.03), рабочая память (скорость: P = 0,62, d Коэн = 0,26; точность: P = 0,98 , D Коэна = 0.07) и исполнительная функция (скорость: P = 0,60, D Коэна = 0,31; точность: P = 0,90, D Коэна = 0,19). Аналогично, настроение, качество сна и утренняя бдительность не отличались (P> 0,05) между диетическими вмешательствами.\n\nЗАКЛЮЧЕНИЕ: Результаты нашего рандомизированного перекрестного контролируемого исследования показывают, что 3 недели устойчивого кетоза питания не влияли на когнитивные способности, настроение или субъективное качество сна в выборке здоровых людей. »\n\nhttps://academic.oup.com/ajcn/advance-article-abstract/doi/10.1093/ajcn/nqz073/5490686?redirectedFrom=fulltext","title":"Три недели подряд питательного кетоза не влияют на когнитивные функции, сон и настроение по сравнению с диетой с высоким содержанием углеводов и низким содержанием жира у здоровых людей: рандомизированное перекрестное контролируемое исследование","subreddit_name_prefixed":"r/ScientificNutrition","ups":23,"created":1558587581,"link_flair_background_color":"","id":"bru5x1","author":{"name":"Only8livesleft"},"permalink":"/r/ScientificNutrition/comments/bru5x1/three_consecutive_weeks_of_nutritional_ketosis/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bru5x1/three_consecutive_weeks_of_nutritional_ketosis/","created_utc":1558558781}