{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"Increased TMAO is a highly reliable predictor of heart disease;\n\nhttps://jamanetwork.com/journals/jama/fullarticle/2734678\n\nThe way we get TMAO in our bodies is by eating carnitine or choline or substances that are metabolized into them either through our diet or through supplementation. \n\nFoods high in carnitine include most animal products. Red meat is the highest. \nFoods high in choline include most animal products. Red meat and eggs are the highest. \n\nOur bodies need some intake of choline just to function properly. \n\nThat carnitine and/or choline is then converted to TMA in the gut and then converted into TMAO by liver enzymes. \nHaving good renal function increasingly excretes the TMAO from our bodies the more TMAO we produce but only up to a point. \n\nTrimethylglycine (TMG) or betaine, a metabolite of choline, is also converted into TMA in the gut. People sometimes supplement TMG because it’s action as a methyl donor has several benefits. \nHowever you can get the same benefits from supplementing SAMe. It’s just more expensive. \n\nhttps://www.sciencedirect.com/topics/biochemistry-genetics-and-molecular-biology/trimethylglycine\n\nHow can we lower our TMAO besides not supplementing any form of carnitine or choline or TMG and cutting meat and eggs entirely out of our diets?\n\nOf course be sure to avoid proceed foods in general and processed foods in particular that contain added carnitine, choline, or lecithin.  \n\nSeveral different supplements and foods have been shown to reduce TMAO levels.  These include PQQ, resveratrol, garlic and foods that contain DMB like Extra virgin olive oil, red wine, balsamic vinaigrette and grape seed oil.  \n\nHow much DMB does olive leaf extract and grape seed extract contain? I don’t know but someone should find out. \n\nA study showing PQQ lowered TMAO:\n\nhttps://www.sciencedirect.com/science/article/pii/S0955286313001599\n\nA study showing resveratrol lowering TMAO:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/27048804/\n\nThe study showing that food high in DMB lowered TMAO:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4871610/\n\nBrussels sprouts have also been shown to lower TMAO levels by reducing the liver enzyme that converts TMA into TMAO. \nThe researchers theorize, with evidence, that this is due to its indole-3-carbinol (I3C) content. If true then broccoli would be just as effective and I3C supplements would be the most effective. \n\nhttps://www.ncbi.nlm.nih.gov/pubmed/10509757/\n\nOne study shows Vitamin B and D supplements lowering TMAO when taken together:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/27569255/\n\nDo they lower TMAO in everyone or only in people who were previously deficient?  More research needed. \n\nAccording to one study soluble dietary fiber (prebiotic) dropped TMAO levels in mice by 60%.:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/28884952/\n\nA study showing prebiotics lowered TMAO in humans:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/28979240/\n\nIt is important to note that probiotics have not been shown to reduce TMAO in subjects who made no other dietary changes. \n\n Which was not surprising since probiotics are largely ineffective unless combined with significant dietary changes that reduce sugar, meat, and alcohol intake and increase vegetable and soluble dietary fiber intake. \n\nWhat is also important to note is that the same study found that a high fat diet increased TMAO levels regardless of choline and carnitine intake. \nThis could be for a host of reasons. More research is needed. \n\nThis is especially important info for anyone on or thinking of going on a ketogenic diet. \n\nHeres the study:\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC4701608/\n\nAn additional study showing that a high fat diet increased TMAO:\n\nhttps://onlinelibrary.wiley.com/doi/full/10.1002/oby.21212\n\nOne study shows that sleep deprivation increased TMAO:\n\nhttps://www.ncbi.nlm.nih.gov/pubmed/26450397/\n\nSomeone needs to write an article on lowering TMAO through diet and supplementation and explain the methods of action of the chemicals in the suggested foods and supplements thought to be responsible.\n\nHere is an article by Mercola on how to lower TMAO:\n\nhttps://articles.mercola.com/sites/articles/archive/2019/03/25/what-causes-elevated-tmao-levels.aspx\n\nLike many Mercola articles this one is partly good science and part quackery that directly contradicts the science, including some of his own citations. \n\nJust one example is his claim that only those with poor renal function will experience elevated TMAO levels with increased carnitine or choline consumption. \n\nThe truth is that when you increase your TMAO through the diet your renal excretion of TMAO will increase up to a point but then stop, even in healthy people. \n\nhttps://www.ncbi.nlm.nih.gov/m/pubmed/16988205/\n\nWhile the increase of TMAO excretion stops at some point with elevated consumption of carnitine and choline the increase in your blood plasma of TMAO will not. \nIt is a linear relationship once your renal clearance rate can no longer be increased. \n\nThe study  cited above suggest that renal clearance stops increasing at any supplementation of carnitine above a 500mg dose.  \n\nOf course people with poor renal function will experience greater blood levels of TMAO than healthy people when taking in the same amount of choline or carnitine.\n\nThis is the article Mercola is citing to support his theories.  It was written by a friend of his and is not a scientific study itself but a review of other studies:\n\nhttps://openheart.bmj.com/content/6/1/e000890\n\nAgain, the way we get TMAO in our bodies is by eating carnitine or choline, that is then converted to TMA in the gut and then converted into TMAO by liver enzymes. \nHaving good renal function excretes the TMAO from our bodies up to a point. \n\nThe Mercola article doesn’t suggest any methods for improving your renal function but if you have poor renal function then you should obviously look into fixing that for many reasons. \n\nAccording to the Mercola article a poorly functioning liver that has increased insulin resistance also produces more of the enzyme that conveys TMA into TMAO, namely FMO3.  \nThis seems to be good science. \n\nHe goes on to suggest ways you can improve you liver function. \nLosing weight if you are overweight is the first and best suggestion. His suggested methods are ketogetic diet and intermittent fasting. \n\nThe fact that a high fat ketogenic diet could actually increase TMAO has already been mentioned along with cited references. \n\nIf you actually lost weight on a ketogenic diet it might be a worthwhile temporary trade off for the weight reduction. \nBecause of the raised TMAO levels and for other reason ketogenic diets are not healthy to be on indefinitely.  \n\nHe also suggest the use of several supplements.  They are berberine, astaxanthin, fish oil, and krill oil. \n\nThose are all good supplements and may indeed help the liver, berberine in particular works on your liver in ways that few other supplements can. \n\nOf course there are many other supplements not mentioned that are helpful for the liver.  Chief among among them would be TUDCA, NAC, and milk Thistle.\n\nI would caution those who have or had have cancer to avoid NAC. \nIt increased the growth and spear of cancer in a mouse study on skin cancer.  More research is needed.\n\nWe have been focusing on hearth health but it is good to keep in mind that elevated TMAO levels are also associated with an increased cancer risk, especially for colon and prostrate cancers.\n\nThis self hacked article contains references to a lot of the same studies as well as a few others:\n\nhttps://selfhacked.com/blog/tmao/\n\nTLDR:\n\nRaises TMAO-\n\n* Eating red meat.\n\n* Eating lots of eggs. If you want to avoid drastically raising TMAO it is 2 or less a day. If you want to avoid any significantly increased TMAO and it’s associated risk of heart disease and cancer it is less than one a day.  \n\n* Possibly eating lots of dairy. More research is needed. \n\n* Eating some saltwater deep sea fish (to a much lesser extent than red meat or eggs for most fish and fish include heart protective oils as well). \n\n* Eating processed foods with added carnitine, choline, or lecithin. \n\n* Taking supplements that contain carnitine or choline or trimethylglycine (TMG). \nFor carnitine especially any supplement where you are taking more than 500mg. \nSome people, like those with MTHFR gene mutations, may need to take in extra choline through supplementation in order to stay healthy. Other people should aim to get the choline they need through their diet. \n\n* Taking protein supplements derived from animal products. \n\n* Having poor liver function, as in having a fatty liver or a liver with decreased insulin sensitivity. \n \n* Having poor renal function \n\n* Being overweight\n\n* Not getting adequate sleep\n\nLowers TMAO-\n\n* Taking nutritional supplants such as PQQ, resveratrol, and soluble dietary fiber (prebiotic).\n\n* If you need to supplement a methyl donor instead of supplementing TMG supplement SAMe. \n\n* Foods that contain DMB or reduce the level of the gut bacteria that convert TMA into TMAO. These include garlic, olives, extra virgin olive oil, grape seed oil, balsamic vinaigrette, and red wine.  \n\n* Foods that contain indoor-3-carbinol (I3C) like Brussels sprouts and broccoli. Supplemental I3C would be even more effective. \nBe aware that I3C can increase the production of other liver enzymes even while decreeing FMO3 so taking it at the same time as other supplements or drugs you are taking could decrease their effectiveness. \n\n* Possibly by taking extracts based on these foods like garlic extract, olive leaf extract, and grape seed extract. Still looking into it. \n\n* Possibly by taking vitamin D and B supplements together. More research needed. \n\n* Taking supplements that improve liver function for those whose livers are not functioning at an optimal level already. These include berberine, astaxanthin, omega 3 fish oil, krill oil, milk Thistle, TUDCA, and NAC among many others. \nCaution should be used in taking NAC by those who have or have had cancer. \n\n* Improving renal function for those whose renal function is not already at an optimal level. One simple thing to do for everyone is to stay well hydrated. Beyond this I do not have any recommendations but I am sure there are lifestyle practices, drugs, therapies, and supplements that can help.","title":"Increased TMAO levels are associated with increased risk for heart disease and cancers. Here is how to lower your TMAO.","subreddit_name_prefixed":"r/ScientificNutrition","ups":54,"created":1559204582,"link_flair_background_color":"#dadada","id":"bumhhh","author":{"name":"breggen"},"permalink":"/r/ScientificNutrition/comments/bumhhh/increased_tmao_levels_are_associated_with/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bumhhh/increased_tmao_levels_are_associated_with/","created_utc":1559175782}