{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"[Культура свиноводства и устойчивое развитие на островах вдоль течения Куросио: циркуляция ресурсов и экологические сообщества на Окинаве и Чеджу] <span translate = \"no\"> (https://www.islandstudies.ca/sites/default/files/ISJLeeHyunPorkSustainabilityOkinawaJeju. PDF) </ SPAN>\n\nЧто интересно в этой статье, так это то, что никто не пытается доказать, что их диета / способ питания лучше, а кто-то другой не прав. Скорее, статья посвящена экологии островов (как Окинавы, так и близлежащего Чеджу). При этом у него есть беспристрастное понимание того, как и почему «оба острова известны своими« навозными свиньями »и блюдами из свинины». [[Свиньи]] могут жить под уборными, есть кухонные отходы, а затем поставлять белок, жир и кости для бульона.\n\n«Можно оценить время начала разведения свиней на Окинаве и Чеджу по документальным свидетельствам. Записи китайских посланников по инвестициям с 1756 года предоставляют важную информацию о еде в эпоху королевства Рюкю, особенно между 1534 и 1866 годами. Эти документы Отметьте в 1534 году, что «мясо дикого кабана доступно везде, но бедные люди не могут его себе позволить» и что свиньи были подарены китайским инвестиционным посланникам в качестве подарков для их вечеринок. (Мунетака, 2005). \"\n\nа также\n\n«Тем не менее, оказалось, что свинина не была широко доступна, по крайней мере, до 17-го века. С 18-го века, свинина была задокументирована как основной продукт питания, сопровождающий похороны и другие важные церемонии, посещаемые обычными людьми. Этот вывод будет означать, что свиноводство было на подъеме в 18-м веке. С ростом выращивания сладкого картофеля (использовавшегося для кормления свиней в 19-м и начале 20-го столетий), на Окинаве редко можно было найти домохозяйства, которые не разводили свиней (Munetaka, 2005). \"\n\nа также\n\n«Новогоднюю свинью (syouguwachiwa) убивают и делят с родственниками и соседями. Эта свинья была забита в период с ноября по декабрь в лунный год предыдущего года. На новогоднем празднике на Окинаве свинина занимает важное положение, поскольку рисовые лепешки важны на материке \".\n\nЧтобы было ясно, жители Окинавы ели сою, рыбу, водоросли и изобилие овощей. Я конечно не оспариваю это. Однако совершенно ясно, что свинина, бульон и жир были существенными факторами в рационе жителей этих островов, по крайней мере, с 1700-х годов.\n\nМногие люди и большинство свиней были убиты во время Второй мировой войны («Значительная часть населения на обоих островах была также зарезана их соответствующими правительствами во время битвы за Окинаву в 1945 году и бойни Чеджу 4 апреля в 1948 году».) Опрос после этого времени приведет к искаженным результатам по сравнению с давней и богатой историей разведения и употребления в пищу свиней.","title":"Свинина и Окинавская культура (и диета)","subreddit_name_prefixed":"r/ScientificNutrition","ups":19,"created":1559389683,"link_flair_background_color":"#dadada","id":"bvgpx1","author":{"name":"flowersandmtns"},"permalink":"/r/ScientificNutrition/comments/bvgpx1/pork_and_the_okinawan_culture_and_diet/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bvgpx1/pork_and_the_okinawan_culture_and_diet/","created_utc":1559360883}