{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5098805/?fbclid=IwAR3Nn01iDCCpC\\_P9LVzsZkTilCeg1SIyjyEnw6-tHK7DW\\_9qhWhsl. .nih.gov / РМС / статьи / PMC5098805 /? fbclid = IwAR3Nn01iDCCpC_P9LVzsZkTilCeg1SIyjyEnw6-tHK7DW_9qhWhsU2XLzfA) </ SPAN>\n\n\n\n \n\n##> Аннотация\n\n###> Фон\n\n\\> Хотя некоторые исследования показывают благотворное воздействие низкого натрия на сердечно-сосудистых заболеваниях, связь с общей смертностью остается спорной. Некоторые сообщают о J-образной кривой, но это может быть связано с низким качеством измерения натрия или смещением смещения.\n\n###> Цель\n\n\\> Изучить взаимосвязь хорошо охарактеризованных показателей потребления натрия, оцененных по экскреции натрия с мочой, с долгосрочной смертностью.\n\n###> Методы\n\n\\> В двух исследованиях \\ [Фаза I (1987-90) в течение 18 месяцев и Фаза II (1990-5) в течение 36 месяцев в исследованиях по профилактике гипертонии \\] были реализованы меры по снижению уровня натрия. В течение этих испытательных периодов у 24 -54-летних взрослых в возрасте от 30 до 54 лет было взято несколько суточных моч. Смертность после судебного разбирательства определялась в среднем за 24 года до 31 декабря 2013 года с использованием Национального индекса смерти. Была исследована связь смертности с рандомизированным вмешательством и средним потреблением натрия.\n\n###> Результаты\n\n\\> Среди 744 участников Фазы I и 2382 участников Фазы II, рандомизированных на снижение или контроль натрия, произошло 251 смерть, с незначительным снижением риска активного вмешательства на 15% (отношение рисков (ЧСС) = 0,85, ДИ 95% = 0,66-1,09, р = 0,19). Среди 2 974 участников, не назначенных на активную натриевую терапию, произошло 272 смерти. Была прямая линейная связь среднего потребления натрия со смертностью, с ЧСС = 0,75, 0,95, 1,00 (референция) и 1,07 (р-тренд = 0,30) для <2300, 2300- <3600, 3600- <4800 и> = 4800 мг / сутки, соответственно, с ЧСС = 1,12 на 1000 мг / сутки (95% ДИ = 1,00-1,26, р = 0,05) и без признаков J-формы или нелинейной зависимости. ЧСС на единицу увеличения соотношения натрия / калия составляла 1,13 (95% ДИ = 1,01-1,27, р = 0,04).\n\n###> Выводы\n\n\\> В этом исследовании с тщательно охарактеризованными показателями потребления натрия был обнаружен повышенный риск при высоком потреблении натрия и прямая связь с общей смертностью даже при самых низких уровнях потребления натрия. В целом, эти результаты согласуются с преимуществом снижения содержания натрия и натрия / калия в общей смертности в течение более 20 лет.","title":"Потребление натрия и общая смертность в течение 20 лет в испытаниях по профилактике гипертонии","subreddit_name_prefixed":"r/ScientificNutrition","ups":31,"created":1559804594,"link_flair_background_color":"#dadada","id":"bx98wd","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/bx98wd/sodium_intake_and_allcause_mortality_over_20/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bx98wd/sodium_intake_and_allcause_mortality_over_20/","created_utc":1559775794}