{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"При приеме насыщенных жиров или холестерина, не полностью объясняющих связь между красным мясом и смертностью, были исследованы другие объяснения. Самым последним объяснением стало увеличение ТМАО с увеличением потребления красного мяса.\n[Отзыв здесь]  (https://jamanetwork.com/journals/jama/fullarticle/2734678) \n> \"... диетический метаболит, связанный с красным мясом, называемый N-оксидом триметиламина, или ТМАО. Три недавних метаанализа подтвердили, что высокий уровень ТМАО в крови связан с повышенным риском сердечно-сосудистых заболеваний и смертности от всех причин. Один из Исследования, опубликованные в Журнале Американской кардиологической ассоциации в 2017 году, обнаружили более чем на 60% повышенный риск как серьезных неблагоприятных сердечно-сосудистых событий, так и смерти от всех причин у людей с повышенным уровнем ТМАО. Другие исследования связывают более высокие уровни ТМАО с сердечной недостаточностью и хроническое заболевание почек.\"\n\n\nЭто недавнее исследование с использованием рандомизации Манделя обнаружило обратную связь с сердечно-сосудистыми заболеваниями / диабетом, что привело к повышению уровня ТМАО, а не наоборот.\n\n\n[Оценка причинно-следственной связи между кишечными микробиота-зависимыми метаболитами и кардиометаболическим здоровьем: аби-направленный анализ рандомизации по Менделю] <span translate = \"no\"> (http://diabetes.diabetesjournals.org/content/early/2019/06/05 / db19-0153) </ SPAN>\n\n> Абстрактный\n> Мы исследовали причинно-следственную связь между кишечной микробиотазависимой метаболитом триметиламин-N-оксидом (TMAO) или его предшественниками и кардиометаболическими заболеваниями, такими как риск сахарного диабета 2 типа (СД2), ишемической болезнью сердца (ИБС), инфарктом миокарда (ИМ) , инсульт, мерцательная аритмия (ФП) и хроническое заболевание почек (ХБП). Мы использовали генетические варианты в качестве инструментов для проверки причинно-следственных связей. Генетически предсказанные более высокие значения ТМАО и карнитина не были связаны с более высокими шансами СД2, ФП, ИБС, ИМ, инсульта и ХБП после коррекции Бонферрони (P≤0,0005). Тем не менее, мы наблюдали, что генетически повышенный уровень холина демонстрирует внушающую связь с более высоким риском развития СД2 (отношение шансов: 1,84, 95% доверительный интервал: от 1,00 до 3,42 на 10 единиц, р = 0,05). Напротив, генетически предсказанный более высокий бетаин (от 0,68, 0,48 до 0,95 на 10 единиц, P = 0,023) был предположительно связан с более низким риском развития СД2. Мы наблюдали наводящую на размышления связь генетически повышенного уровня холина с более низким уровнем содержания жира в организме (бета: -0,28, SE: 0,11, P = 0,013), но с более высоким уровнем предполагаемой скорости клубочковой фильтрации (0,10 ± 0,05, P = 0,034) , Мы также обнаружили, что СД2 (бета: 0,130, СЭ: 0,036, Р <0,0001) и ХБП (0,483 ± 0,168, Р = 0,004) были причинно связаны с более высокими уровнями ТМАО. Наши результаты МР подтверждают, что СД2 и заболевания почек повышают уровни ТМАО, и данные наблюдений за сердечно-сосудистыми заболеваниями могут быть связаны с путаницей или обратной причинностью.\n\n> Получено 12 февраля 2019 года.\n> Принято 28 мая 2019 года.\n\nМое личное убеждение в том, что связь между красным мясом и смертностью является побочным продуктом предвзятости здорового пользователя. Мне будет интересно, если обратная причинность ТМАО и ССЗ / диабета будет подтверждена тиражированием этого исследования или других подтверждающих данных, и какие другие альтернативы будут представлены для объяснения связи с красным мясом.","title":"Оценка причинно-следственной связи между кишечными микробиота-зависимыми метаболитами и кардиометаболическим здоровьем: аби-направленный анализ рандомизации по Менделю","subreddit_name_prefixed":"r/ScientificNutrition","ups":5,"created":1560032100,"link_flair_background_color":"#dadada","id":"by8dwh","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/by8dwh/assessment_of_causal_direction_between_gut/","url":"https://www.reddit.com/r/ScientificNutrition/comments/by8dwh/assessment_of_causal_direction_between_gut/","created_utc":1560003300}