{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"В последнее время я много изучал резистентность к инсулину и подумал, что было бы интересно обсудить различные аспекты резистентности к инсулину. Я думал о следующих аспектах:\n\n* Как определяется резистентность к инсулину?\n* Что происходит с инсулинорезистентностью?\n* В чем причина такого поведения?\n* Как это лучше всего лечится?\n\nЕсть, вероятно, другие интересные части для обсуждения ...\n\nМой план состоит в том, чтобы сделать короткий пост, который обобщает мое понимание области, и затем другие могут прокомментировать, согласуется ли это с их пониманием.\n\n\\ * \\ * \\ * \\ *\n\n** Как определяется резистентность к инсулину? **\n\nПовышенный уровень глюкозы в крови натощак ** был одним из распространенных способов диагностики инсулинорезистентности; считается, что нормальный уровень глюкозы в крови натощак составляет менее 100 мг / дл. Если после голодания в течение ночи у вас повышенный уровень глюкозы в крови натощак, у вас очень вероятно инсулинорезистентность и диабет II типа.\n\nПоскольку уровень глюкозы в крови натощак после ночного голодания, это не обязательно является достаточно определенным; у кого-то может быть повышенный уровень глюкозы в крови в течение большей части дня, но нормальный уровень глюкозы в крови после ночного голодания. Есть два других измерения, которые считаются лучшими.\n\nПервый - это измерение крови, известное как ** HbA1c **. Проще говоря, гемоглобин в эритроцитах модифицируется молекулами глюкозы («гликированные»), и количество, которое это происходит, зависит от концентрации глюкозы в крови. Таким образом, HbA1c является приблизительным показателем среднего уровня глюкозы в крови в течение жизни эритроцитов, примерно 8-12 недель. В целом HbA1c является довольно хорошим показателем, но в некоторых случаях он может давать ложный отрицательный результат - он может возвращать нормальный результат для пациента, который на самом деле инсулинорезистентен.\n\nВторое измерение - ** тест на толерантность к оральной глюкозе ** (** OGT ** или ** OGTT **). В этом тесте пациенту дают 75 грамм глюкозы после голодания в течение ночи, и его уровни глюкозы в крови измеряют каждые 20 или 30 минут в течение нескольких часов. Вообще говоря, нормальные пациенты видят небольшой всплеск глюкозы, который быстро возвращается к норме, в то время как пациенты с очень инсулинорезистентностью видят высокие уровни глюкозы в крови в течение нескольких часов. Есть хорошее общее руководство [здесь]  (https://laboratoryinfo.com/glucose-tolerance-test-gtt-principle-procedure-indications-interpretation/) , в котором показаны различные ответы, которые видели и объясняют больше о тесте.\n\nOGTT считается золотым стандартом резистентности к инсулину, но, как и глюкоза в крови, он смотрит на реакцию после голодания, когда человек лучше всего приспособлен для того, чтобы справиться с большим количеством глюкозы в рационе. В последнее время были проведены исследования с использованием непрерывного мониторинга уровня глюкозы у «нормальных» пациентов, которые обнаружили большие пики уровня глюкозы в крови - в диабетическом диапазоне - после еды.\n\nСправедливо сказать, что существует широкий спектр резистентности к инсулину; есть люди, которые очень диабетичны и очень устойчивы к инсулину, и те, кто только немного устойчив к инсулину","title":"Обсуждение: Инсулинорезистентность. Часть 1. Как определяется инсулинорезистентность?","subreddit_name_prefixed":"r/ScientificNutrition","ups":22,"created":1560226544,"link_flair_background_color":"#dadada","id":"bz2puc","author":{"name":"Triabolical_"},"permalink":"/r/ScientificNutrition/comments/bz2puc/discussion_insulin_resistance_part_1_how_is/","url":"https://www.reddit.com/r/ScientificNutrition/comments/bz2puc/discussion_insulin_resistance_part_1_how_is/","created_utc":1560197744}