{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"«Вопрос: Модель, учитывающая особенности людей, предсказывает гликемические реакции на пищу лучше, чем модели, основанные на содержании калорий или углеводов?\n\nРезультаты. В этом когортном исследовании с использованием персонифицированной прогностической модели среди 327 участников без диабета гликемические ответы на пищу значительно различались по когорте. Наблюдаемые постпрандиальные гликемические ответы показали более высокую корреляцию со значениями, предсказанными моделью с учетом особенностей людей, чем с содержанием калорий и углеводов в еде.\n\nЗначение Персональная прогностическая модель, которая учитывает уникальные особенности человека в дополнение к характеристикам пищи, может позволить людям лучше управлять своими гликемическими реакциями на потребляемую пищу.\n\nАннотация\nВажность Появляющиеся данные свидетельствуют о том, что постпрандиальные гликемические ответы (PPGR) на пищу могут зависеть и прогнозироваться в соответствии с характеристиками, уникальными для каждого человека, включая антропометрические и микробиомные переменные. Межиндивидуальное разнообразие в PPGRs к пище требует персонализированного подхода для поддержания здорового уровня гликемии.\n\nЦели. Описать и предсказать гликемические реакции отдельных лиц на разнообразные продукты, используя модель, которая учитывает физиологию и микробиом человека в дополнение к характеристикам потребляемых продуктов.\n\nДизайн, обстановка и участники В этом когортном исследовании с использованием персонализированной прогностической модели было зарегистрировано 327 человек без диабета с 11 октября 2016 года по 13 декабря 2017 года в Миннесоте и Флориде для участия в исследовании продолжительностью 6 дней. В исследовании измерялись антропометрические переменные, описывался состав микробов в кишечнике, и оценивались уровни глюкозы в крови каждые 5 минут с использованием непрерывного монитора глюкозы. Участники записали информацию о своей еде и активности на время исследования. Была разработана и применена прогностическая модель индивидуальных PPGR для разнообразных продуктов питания.\n\nОсновные результаты и показатели Гликемическая реакция на еду, потребляемую в течение 6 дней для каждого участника Прогностическая модель персонализированных PPGR учитывала индивидуальные особенности, включая микробиом, в дополнение к особенностям потребляемой пищи.\n\nРезультаты. Постпрандиальная реакция на одну и ту же пищу варьировала у 327 человек (средний возраст [SD], 45 [12] лет; 78,0% женщин). Модель, предсказывающая реакцию каждого человека на пищу, которая учитывает несколько отдельных факторов в дополнение к особенностям пищи, имела лучшие общие показатели (R = 0,62), чем современные подходы к стандарту ухода, использующие только питательную ценность (R = 0,34 для калорий и R = 0,40 для углеводы) для контроля постпрандиального уровня гликемии.\n\nВыводы и значимость. Для когорты взрослых без диабета, которые были обследованы, персонифицированная прогностическая модель, учитывающая уникальные особенности личности, такие как клинические характеристики, физиологические переменные и микробиом, в дополнение к содержанию питательных веществ, была более прогнозирующей, чем современные диетические подходы. которые сосредоточены только на калорийности или содержании углеводов в продуктах. Предоставление людям инструментов для управления их гликемическими реакциями на пищу на основе персонализированных прогнозов их PPGR может позволить им поддерживать уровень глюкозы в крови в пределах, связанных с хорошим здоровьем ».\n\nhttps://jamanetwork.com/journals/jamanetworkopen/fullarticle/2723644?resultClick=3","title":"Оценка персонализированного подхода к прогнозированию постпрандиальной гликемической реакции на пищу среди людей без диабета","subreddit_name_prefixed":"r/ScientificNutrition","ups":16,"created":1560667141,"link_flair_background_color":"#dadada","id":"c13271","author":{"name":"Only8livesleft"},"permalink":"/r/ScientificNutrition/comments/c13271/assessment_of_a_personalized_approach_to/","url":"https://www.reddit.com/r/ScientificNutrition/comments/c13271/assessment_of_a_personalized_approach_to/","created_utc":1560638341}