{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"* Полезность неочищенных углеводов при диабете 2 типа. Комментарий к статье «Обращение вспять диабета 2 типа: обзор доказательств, питательные вещества, 2019, 11, 766» *\n\n«Hallberg et al. предоставить ограниченный обзор литературы по обращению сахарного диабета 2 типа (СД2) [1]. Резистентность к инсулину, а не избыток углеводов, лежит в основе СД2. Действительно, Андерсон и соавт. кормили 20 участников с СД2 рационом с высоким содержанием клетчатки и нерафинированных углеводов (примерно 70% калорий) и продемонстрировали кратковременное изменение через прекращение всего лечения СД2 у 11 пациентов в среднем в течение 16 дней; в частности, это изменение было достигнуто в отсутствие потери веса [2]. Напротив, Rosenbaum et al. недавно было показано, что четыре недели кетогенной диеты приводят к более высоким значениям глюкозы в сыворотке крови после приема пищи и более низкой чувствительности к инсулину в ответ на контрольный прием пищи по сравнению с четырьмя неделями не кетогенной диеты [3].\n\nЕще одна критика Hallberg et al. обзор - это упущение важных ограничений в исследовании Saslow et al. [4]. В 34-недельном исследовании Saslow et al. Исследователи продемонстрировали кратковременную «реверсию» СД2 у 55% ​​пациентов в кетогенной группе по сравнению с 0% в группе с низким содержанием жира. Однако, по сравнению с группой с низким содержанием жира, кетогенная группа получила более чем в два раза больше «уроков» с их диетой, которые также включали «важность физической активности и сна» и «положительное влияние на регуляцию и осознанное питание»; эти смешанные переменные предполагают, что любое улучшение диабетических параметров не может быть приписано исключительно изменению диеты.\n\nДругое исследование, цитируемое Hallberg et al. также обнаружены выраженные различия в поведенческой поддержке между двумя диетическими группами, которые, наряду с самоотбором и нерандомизацией пациентов, могут иметь\nспособствовал эффекту [5].\nЧто касается другого исследования, Hallberg et al. описать впечатляющий показатель «разворота» диабета на 78% при\nодин год с использованием определения, исключающего метформин [6]; однако это кажется нелогичным, учитывая, что метформин - лекарство, воздействие которого на HbA1c при СД2 хорошо известно - является основой лечения СД2. Также важно отметить, что средний базовый уровень HbA1c в группе вмешательства составил 6,6%, чуть выше целевого значения HbA1c, использованного для разворота, и ниже среднего значения в контрольной группе 6,9%. Через год чистая выгода от группы вмешательства по сравнению с контрольной группой составила лишь 0,3% снижения HbA1c, что говорит о том, что краткосрочные выгоды от диет с очень низким содержанием углеводов (VLCD), вероятно, со временем уменьшатся. Фактически, четыре рандомизированных, длительных (≥12 месяцев) испытания VLCD для T2DM не смогли показать преимущества по сравнению с контрольными (обычно с высоким содержанием углеводов) диетами [7–10]. Примечательно, что ни одно из этих четырех исследований не проводилось в сотрудничестве с Virta Health, платной программой VLCD, с которой 75% Hallberg et al. Авторы раскрыли финансовый конфликт интересов.\n\nВ конечном счете, обзор Hallberg et al. представляет чрезмерно восторженный рассказ - а не систематический - обзор VLCD для лечения СД2, который не отражает всю полноту имеющихся имеющихся данных. Авторы опускают обсуждение диет с высоким содержанием углеводов, используемых для лечения и\nобратить вспять СД2 и не упомянуть ключевые ограничения исследований, приведенных на кетогенной диете. Более того, рабочее определение авторов «инверсия» не обязательно отражает улучшения в основной патофизиологии СД2, то есть инсулинорезистентность или непереносимость углеводов ».\n\nhttps://res.mdpi.com/nutrients/nutrients-11-01620/article_deploy/nutrients-11-01620.pdf?filename=&attachment=1","title":"Комментарий к обзору Virta и других испытаний с низким содержанием углеводов","subreddit_name_prefixed":"r/ScientificNutrition","ups":21,"created":1563450774,"link_flair_background_color":"","id":"cenep1","author":{"name":"Only8livesleft"},"permalink":"/r/ScientificNutrition/comments/cenep1/comment_on_review_of_virta_and_other_low_carb/","url":"https://www.reddit.com/r/ScientificNutrition/comments/cenep1/comment_on_review_of_virta_and_other_low_carb/","created_utc":1563421974}