{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://www.mdpi.com/2072-6643/11/3/514/htm\n\nhttps://doi.org/10.3390/nu11030514\n\n> Абстрактный\n> Заживление слизистой оболочки после воспалительной вспышки связано с длительной клинической ремиссией. Целью настоящей работы было оценить влияние количества пищевого белка на восстановление эпителия после острого воспалительного эпизода. C57BL / 6 DSS-обработанные мыши получали изокалорийные диеты с различными уровнями пищевого белка: 14% (P14), 30% (P30) и 53% (P53) в течение 3 (день 10), 6 (день 13) и 21 (день 28) дней после времени максимальной интенсивности колита. В то время как диета P53 ухудшала воспаление, вызванное DSS, как по интенсивности, так и по продолжительности, диета P30, по сравнению с диетой P14, показала благоприятный эффект во время процесса восстановления эпителия, ускоряя разрешение воспаления, уменьшая проницаемость толстой кишки и увеличивая восстановление эпителия вместе с эпителиальная гиперпролиферация. Потребление белка с пищей также влияло на состав микробиоты, прикрепленной к слизистой оболочке, после воспаления, так как мыши, получавшие P30, показали повышенную колонизацию родов, продуцирующих бутират, на протяжении фазы разрешения. Это исследование показало, что в нашей модели колита количество белка в рационе модулировало заживление слизистой оболочки с благотворным эффектом от умеренно богатой белкой диеты, в то время как очень богатая белками диета показала вредное воздействие на этот процесс.\n\n\nИз обсуждения:\n\n> Диета P30 действительно вызывала гиперпролиферацию крипты, связанную с повышенной экспрессией генов репаративных факторов Tgf-β1 и Tff3, причем оба фактора, как известно, вносят вклад в целостность целостности поверхности слизистой оболочки, но независимым образом [22]. Кроме того, Saa, который был сверхэкспрессирован у мышей P30 по сравнению с двумя другими диетами, недавно был описан как защитный фактор против острого повреждения эпителия толстой кишки [23]. В целом, повышенная экспрессия генов, кодирующих эти стимулирующие факторы репарации, а также белков с плотным соединением (Claudin-1 и Zona-Occludens 1), вероятно, способствовала восстановлению целостности барьера толстой кишки, о чем свидетельствует более низкая проницаемость и связанная с бактериальной транслокацией маркер (LBP) в системном потоке. Кроме того, повышенный уровень мРНК Gpx2, повышенная регуляция которого связана с разрешением воспаления [24], свидетельствует о более низком окислительном стрессе, вызванном воспалением, у животных P30. Кроме того, P30-опосредованное положительное влияние на восстановление эпителия может быть связано с модуляцией состава и активности присущих слизистой оболочке микробиоты в течение первых дней разрешения колита. Действительно, более высокая относительная численность бактерий, принадлежащих к семействам Lachnospiraceae, Eubacteriaceae и Bifidobacteriaceae, вместе с более высокими концентрациями SCFA, основных конечных продуктов метаболической активности микробиоты, могут отчасти объяснить положительное влияние диеты P30 на слизистую оболочку толстой кишки. Интересно, что диета P30 также продольно увеличивала долю Faecalibacterium, комменсального продуцента бутирата, обнаруженного у здоровых людей, чье обилие снижено у пациентов с ВЗК и положительно коррелирует с поддержанием клинической ремиссии [25,26]. Хорошо известно, что бутират является основным топливом для эпителиальных клеток толстой кишки, оказывает плюрипотентное воздействие на толстую кишку, такое как регуляция роста и дифференцировки клеток [27], и обладает противовоспалительными свойствами [28]. Дефицит бутирата в его концентрациях и / или в его транспорте и метаболизме действительно наблюдается в воспаленной слизистой оболочке [29].\n\nМне интересно забрать:\n\n- существует четкий верхний предел потребления протиена и здоровья кишечника при колите.\n\n- 30% про диета, которая находится на верхнем уровне рекомендаций для людей и примерно в два раза выше среднего потребления в Америке, имела более приятные улучшения по сравнению с 14%.\n\n- улучшения были опосредованы через экспрессию генов и изменения в микробиоме.\n\n- 30% про диета показала повышенный уровень бактерий, производящих байтерат. IMO protien часто игнорируется до биотики.\n\n[Диссимиляторный метаболизм аминокислот в бактериях толстой кишки человека]  (https://www.sciencedirect.com/science/article/pii/S1075996497901219) \n\nЭто появилось как часть специального выпуска на IBD https://www.mdpi.com/journal/nutrients/special_issues/nutrition_IBD","title":"Уровень потребления белка в пище модулирует заживление слизистой оболочки и микробиоту, прикрепленную к слизистой оболочке у мышей с моделью колита","subreddit_name_prefixed":"r/ScientificNutrition","ups":15,"created":1564260875,"link_flair_background_color":"","id":"cih5wd","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/cih5wd/dietary_protein_intake_level_modulates_mucosal/","url":"https://www.reddit.com/r/ScientificNutrition/comments/cih5wd/dietary_protein_intake_level_modulates_mucosal/","created_utc":1564232075}