{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Питательные вещества 2019, 11 (8), 1742; https://doi.org/10.3390/nu11081742\n\n\n нутриентов логотип\nПитательные вещества 2019, 11 (8), 1742; https://doi.org/10.3390/nu11081742\n\nСтатья\nРандомизированное двойное слепое перекрестное исследование очень низкокалорийной диеты у пациентов с избыточной массой мигрени: возможная роль кетонов?\nЧерубино Ди Лоренцо 1, * OrcID, Алессандро Пинто 2OrcID, Роберта Иэнса 2, Джанлука Коппола 3OrcID, Джулио Сирианни 4, Джорджио Ди Лоренцо 5,6OrcID, Винченцо Паризи 7, Мариано Серрао 2, Алессандра Анн Спитаено 8, Алессандра Ан Спареноли 8 , Лоренцо М Донини 2 и Франческо Пирелли 2,10\n1\nIRCCS - Фонд Дона Карло Ньокки, 20121 Милан, Италия\n2\nКафедра экспериментальной медицины, Университет Сапиенца, 00161 Рим, Италия\n3\nФакультет медико-хирургических наук и биотехнологий, Римский университет Сапиенца Поло Понтино, 04100 Латина, Италия\n4\nАссоциация Евпраксия, диетическая секция, 00171 Рим, Италия\n5\nЛаборатория психофизиологии и когнитивной нейробиологии, кафедра системной медицины, Римский университет Tor Vergata, 00133 Рим, Италия\n6\nIRCCS Фонд Санта Лючия, 00142 Рим, Италия\n7\nIRCCS - Фонд Битти, 00198 Рим, Италия\n8\nДепартамент общественного здравоохранения и инфекционных болезней, Римский университет Сапиенца, 00161 Рим, Италия\n9\nОтдел исследований головной боли, Университетское отделение неврологии, ЧР, Цитадель, Университет Льежа, 4000 Льеж, Бельгия\n10\nIRCCS - Neuromed, 86077 Pozzilli (IS), Италия\n*\nАвтор, к которому следует обращаться по переписке.\nПолучено: 4 июня 2019 г. / Принято: 26 июля 2019 г. / Опубликовано: 28 июля 2019 г.\nРезюме: Здесь мы стремились определить терапевтический эффект очень низкокалорийной диеты у пациентов с эпизодической мигренью с избыточной массой тела во время вмешательства по снижению веса, в котором субъекты случайным образом чередовались между очень низкокалорийной кетогенной диетой (VLCKD) и очень низкокалорийной Некетогенная диета (VLCnKD) каждый на один месяц. В рамках программы питания 35 страдающих ожирением страдающих от мигрени были слепо распределены на 1 месяц после VLCKD или VLCnKD в случайном порядке (VLCKD-VLCnKD или VLCnKD-VLCD). Первичным критерием оценки было сокращение числа дней мигрени каждый месяц по сравнению с 1-месячной базовой диетой. Вторичными показателями исхода были 50% респондеров в день мигрени, снижение ежемесячных приступов мигрени, абортное потребление наркотиков и изменение индекса массы тела (ИМТ). Будут представлены только данные из группы, предназначенной для лечения (n = 35). Пациенты, которые бросили учебу (n = 6), считались неудачниками лечения. Что касается первичного исхода, во время VLCKD пациенты испытывали -3,73 (95% CI: -5,31, -2,15) дней мигрени относительно VLCnKD (p <0,0001). 50% респондеров в дни мигрени составили 74,28% (26/35 пациентов) в течение периода VLCKD, но только 8,57% (3/35 пациентов) в течение VLCnKD. Приступы мигрени уменьшились на -3,02 (95% ДИ: -4,15, -1,88) во время VLCKD относительно VLCnKD (p <0,00001). Не было различий в изменении острого потребления против мигрени (р = 0,112) и ИМТ (р = 0,354) между двумя диетами. VLCKD обладает профилактическим эффектом у пациентов с эпизодической мигренью с избыточной массой тела, которая появляется в течение 1 месяца, предполагая, что кетогенез может быть полезной терапевтической стратегией для мигрени.","title":"Рандомизированное двойное слепое перекрестное исследование очень низкокалорийной диеты у пациентов с избыточной массой мигрени: возможная роль кетонов?","subreddit_name_prefixed":"r/ScientificNutrition","ups":18,"created":1564338713,"link_flair_background_color":"#dadada","id":"ciuce4","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/ciuce4/a_randomized_doubleblind_crossover_trial_of_very/","url":"https://www.reddit.com/r/ScientificNutrition/comments/ciuce4/a_randomized_doubleblind_crossover_trial_of_very/","created_utc":1564309913}