{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Мадс Дж. Скайт, Амирсалар Самкани, Эми Д. Петерсен, Мадс Н. Томсен, Арне Аструп, Елизавета Чабанова, Ян Фристик, Дженс Дж. Холст, Хенрик С. Томсен, Стен Мадсбад, Томас М. Ларсен, Стин Б. Хаугор, Туре Краруп. Диета с высоким содержанием белка и низким содержанием углеводов улучшает содержание HbA1c и жира в печени у стабильных по весу участников с диабетом 2 типа: рандомизированное контролируемое исследование Диабетология, 2019; DOI: 10.1007 / s00125-019-4956-4\n\nhttps://link.springer.com/article/10.1007%2Fs00125-019-4956-4\n\n> Абстрактный\n\n> Цели / гипотеза\n\n> Диетические рекомендации по лечению диабета 2 типа неясны, но тенденция к рекомендации диеты с пониженным содержанием углеводов признается. Мы сравнили диету с высоким содержанием белка (CRHP) с низким содержанием углеводов и диету с обычным изоэнергетическим диабетом (CD), чтобы выяснить влияние гликемического контроля и отдельных маркеров сердечно-сосудистого риска в течение 6 недель полноценного питания каждой диеты.\n\n> Методы\n\n> Первичным результатом исследования было изменение уровня HbA1c. Вторичные результаты, о которых сообщается в настоящей статье, включают гликемические показатели, содержание эктопического жира и 24-часовое кровяное давление. Критериями отбора были: мужчины и женщины с диабетом 2 типа, HbA1c 48–97 ммоль / моль (6,5–11%), возраст> 18 лет, гемоглобин> 6 /> 7 ммоль / л (женщины / мужчины) и СКФ> 30 мл. мин-1 (1,73 м) -2. Участники были рандомизированы путем рисования слепых бюллетеней для 6 + 6 недель изоэнергетической диеты CRHP против CD в открытой этикетке, перекрестный дизайн, направленный на стабильность массы тела. Диеты CRHP / CD содержали углеводы 30/50% энергии (E%), белок 30 / 17E% и жир 40 / 33E% соответственно. Участники проходили тест на питание в конце каждого периода диеты, и в начале и в конце каждого периода диеты оценивали гликемические показатели, липидный профиль, 24-часовое кровяное давление и эктопический жир, включая содержание жира в печени и поджелудочной железе. Данные были собраны в Университетской больнице Копенгагена, Биспебьерг и Университетской больнице Копенгагена, Херлев.\n\n> Результаты\n\n> Двадцать восемь участников завершили исследование. Четырнадцать участников провели 6 недель вмешательства CRHP, а затем 6 недель вмешательства CD, а 14 участников получили диетические вмешательства в обратном порядке. По сравнению с CD-диетой диета CRHP снижала первичный исход HbA1c (среднее ± SEM: -6,2 ± 0,8 ммоль / моль (-0,6 ± 0,1%) по сравнению с -0,75 ± 1,0 ммоль / моль (-0,1 ± 0,1%); р <0,001). В настоящей статье сообщается о девяти (из 37) предварительно определенных вторичных исходах, из которых пять значительно отличались между диетами (р <0,05); по сравнению с CD-диетой, диета CRHP снижала вторичные исходы (среднее ± SEM или медианы [межквартильный диапазон]) глюкозы в плазме натощак (-0,71 ± 0,20 ммоль / л против 0,03 ± 0,23 ммоль / л; р <0,05), после приема пищи глюкоза плазмы AUC (9,58 ± 0,29 ммоль / л × 240 мин против 11,89 ± 0,43 ммоль / л × 240 мин; р <0,001) и чистая AUC (1,25 ± 0,20 ммоль / л × 240 мин против 3,10 ± 0,25 ммоль / л × 240 мин; р <0,001), содержание жира в печени (от -2,4% [-7,8% до -1,0%] против 0,2% [от -2,3% до 0,9%]; р <0,01) и содержание поджелудочной железы (-1,7% [-3,5 % до 0,6%] против 0,5% [от -1,0% до 2,0%]; р <0,05). Изменения в других вторичных исходах, то есть в течение 24 часов кровяное давление и мышечная, висцеральная или подкожная жировая ткань, не отличались между диетами.\n\n> Выводы / интерпретация\n\n> Умеренный сдвиг макронутриентов за счет замены углеводов белком и жиром на 6 недель снижает содержание HbA1c и печеночного жира у лиц со стабильным весом, страдающих диабетом 2 типа.\n\n> Пробная регистрация\n\n> ClinicalTrials.gov NCT02764021.","title":"Диета с высоким содержанием белка и низким содержанием углеводов улучшает содержание HbA1c и жира в печени у стабильных по весу участников с диабетом 2 типа: рандомизированное контролируемое исследование","subreddit_name_prefixed":"r/ScientificNutrition","ups":63,"created":1565478722,"link_flair_background_color":"#dadada","id":"coj7wm","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/coj7wm/a_carbohydratereduced_highprotein_diet_improves/","url":"https://www.reddit.com/r/ScientificNutrition/comments/coj7wm/a_carbohydratereduced_highprotein_diet_improves/","created_utc":1565449922}