{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"","title":"Диеты на растительной основе связаны с более низким риском сердечно-сосудистых заболеваний, смертности от сердечно-сосудистых заболеваний и смертности от всех причин в общей популяции людей среднего возраста","subreddit_name_prefixed":"r/ScientificNutrition","ups":133,"created":1565750864,"link_flair_background_color":"#dadada","id":"cpxhbb","author":{"name":"RunningInfinitely"},"permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/","url":"https://www.ahajournals.org/doi/10.1161/JAHA.119.012865","created_utc":1565722064,"replies":[{"ups":1,"link_id":"t3_cpxhbb","id":"ews801h","author":"AutoModerator","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"Welcome to /r/ScientificNutrition. Please read our [Posting Guidelines](https://www.reddit.com/r/ScientificNutrition/comments/bqi550/posting_guidelines/?st=jvv3gorm&sh=09611887) before you contribute to this submission.\nJust a reminder that every link submission must have a summary in the comment section, and every top level comment must provide sources to back up any claims.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ScientificNutrition) if you have any questions or concerns.*","body_html":"<div class = \"md\"> <p> Добро пожаловать в <a href=\"/r/ScientificNutrition\"> / r / ScientificNutrition </a>. Пожалуйста, прочитайте наши <a href=\"https://www.reddit.com/r/ScientificNutrition/comments/bqi550/posting_guidelines/?st=jvv3gorm&sh=09611887\"> Правила публикации </a>, прежде чем вносить свой вклад в это представление.\nПросто напоминание о том, что каждая отправка ссылки должна иметь сводку в разделе комментариев, а каждый комментарий верхнего уровня должен содержать источники для подтверждения любых утверждений. </P>\n\n<p> <em> Я бот, и это действие было выполнено автоматически. <a href=\"/message/compose/?to=/r/ScientificNutrition\"> Пожалуйста, свяжитесь с модераторами этого subreddit </a>, если у вас есть какие-либо вопросы или проблемы. </Em> </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ews801h/","name":"t1_ews801h","created":1565750864,"created_utc":1565722064,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":43,"link_id":"t3_cpxhbb","replies":[{"ups":26,"link_id":"t3_cpxhbb","id":"ewu1kly","author":"Only8livesleft","parent_id":"t1_ewsjowe","subreddit_id":"t5_qgptn","body":">I find it immensely irritating, because what they have done is tied high vegetable intake with low fish/meat intake because of their pro-vegan agenda, when they could let these things stand on their own.\n*But, if they did that, I think they know they would find that red meat in the context of a whole foods vegetable heavy diet has zero correlation with CVD*.\n\nExcept that’s exactly what they do in food group analyses and red meat is associated with higher risk \n\n“Therefore, the aim of this meta-analysis was to synthesize the knowledge about the relation between intake of 12 major food groups (whole grains, refined grains, vegetables, fruits, nuts, legumes, eggs, dairy, fish, red meat, processed meat, and sugar-sweetened beverages [SSB]) and the risk of coronary heart disease (CHD), stroke and heart failure (HF).\n\nMETHODS: We conducted a systematic search in PubMed and Embase up to March 2017 for prospective studies. Summary risk ratios (RRs) and 95% confidence intervals (95% CI) were estimated using a random effects model for highest versus lowest intake categories, as well as for linear and non-linear relationships.\n\nRESULTS: Overall, 123 reports were included in the meta-analyses. An inverse association was present for whole grains (RRCHD: 0.95 (95% CI: 0.92-0.98), RRHF: 0.96 (0.95-0.97)), vegetables and fruits (RRCHD: 0.97 (0.96-0.99), and 0.94 (0.90-0.97); RRstroke: 0.92 (0.86-0.98), and 0.90 (0.84-0.97)), nuts (RRCHD: 0.67 (0.43-1.05)), and fish consumption (RRCHD: 0.88 (0.79-0.99), RRstroke: 0.86 (0.75-0.99), and RRHF: 0.80 (0.67-0.95)), while a positive association was present for egg (RRHF: 1.16 (1.03-1.31)), red meat (RRCHD: 1.15 (1.08-1.23), RRstroke: 1.12 (1.06-1.17), RRHF: 1.08 (1.02-1.14)), processed meat (RRCHD: 1.27 (1.09-1.49), RRstroke: 1.17 (1.02-1.34), RRHF: 1.12 (1.05-1.19)), and SSB consumption (RRCHD: 1.17 (1.11-1.23), RRstroke: 1.07 (1.02-1.12), RRHF: 1.08 (1.05-1.12)) in the linear dose-response meta-analysis. There were clear indications for non-linear dose-response relationships between whole grains, fruits, nuts, dairy, and red meat and CHD.\n\nCONCLUSION: An optimal intake of whole grains, vegetables, fruits, nuts, legumes, dairy, fish, red and processed meat, eggs and SSB showed an important lower risk of CHD, stroke, and HF.”\n\nhttps://www.ncbi.nlm.nih.gov/m/pubmed/29039970/\n\n“The aim of this systematic review and meta-analysis was to summarize the evidence on the relation of the intakes of 12 major food groups, including whole grains, refined grains, vegetables, fruits, nuts, legumes, eggs, dairy, fish, red meat, processed meat, and sugar-sweetened beverages (SSBs) with the risk of hypertension. PubMed, Scopus, and Web of Science were searched systematically until June 2017 for prospective studies having quantitatively investigated the above-mentioned foods. We conducted meta-analysis on the highest compared with the lowest intake categories and linear and nonlinear dose-response meta-analyses to analyze the association. Summary RRs and 95% CIs were estimated by using a random-effects model. Overall, 28 reports were included in the meta-analysis. An inverse association for the risk of hypertension was observed for 30 g whole grains/d (RR: 0.92; 95% CI: 0.87, 0.98), 100 g fruits/d (RR: 0.97; 95% CI: 0.96, 0.99), 28 g nuts/d (RR: 0.70; 95% CI: 0.45, 1.08), and 200 g dairy/d (RR: 0.95; 95% CI: 0.94, 0.97), whereas a positive association for 100 g red meat/d (RR: 1.14; 95% CI: 1.02, 1.28), 50 g processed meat/d (RR: 1.12; 95% CI: 1.00, 1.26), and 250 mL SSB/d (RR: 1.07; 95% CI: 1.04, 1.10) was seen in the linear dose-response meta-analysis.”\n\nhttps://academic.oup.com/advances/article/8/6/793/4772207","body_html":"<div class = \"md\"> <blockquote>\n<p> Я нахожу это очень раздражающим, потому что они связали высокое потребление овощей с низким потреблением рыбы / мяса из-за их провеганской программы, когда они могли позволить этим вещам стоять самостоятельно.\n<em> Но, если бы они это сделали, я думаю, они знают, что обнаружат, что красное мясо в контексте диеты из цельных овощей и овощей имеет нулевую корреляцию с сердечно-сосудистыми заболеваниями </em>. </p>\n</BLOCKQUOTE>\n\n<p> За исключением того, что именно они делают в анализах пищевых групп, и красное мясо связано с более высоким риском </p>\n\n<p> «Поэтому целью этого мета-анализа было обобщение знаний о связи между потреблением 12 основных пищевых групп (цельное зерно, рафинированное зерно, овощи, фрукты, орехи, бобовые, яйца, молочные продукты, рыба, красный цвет). мясо, переработанное мясо и подслащенные сахаром напитки [SSB]) и риск развития ишемической болезни сердца (ИБС), инсульта и сердечной недостаточности (HF). </p>\n\n<p> МЕТОДЫ: Мы провели систематический поиск в PubMed и Embase до марта 2017 года для будущих исследований. Суммарные коэффициенты риска (RR) и 95% доверительные интервалы (95% CI) были оценены с использованием модели случайных эффектов для самых высоких и самых низких категорий потребления, а также для линейных и нелинейных отношений. </P>\n\n<p> РЕЗУЛЬТАТЫ: Всего в метаанализ было включено 123 отчета. Обратная связь присутствовала для цельного зерна (RRCHD: 0,95 (95% CI: 0,92-0,98), RRHF: 0,96 (0,95-0,97)), овощей и фруктов (RRCHD: 0,97 (0,96-0,99) и 0,94 (0,90- 0,97), ход RR: 0,92 (0,86-0,98) и 0,90 (0,84-0,97)), орехи (RRCHD: 0,67 (0,43-1,05)) и потребление рыбы (RRCHD: 0,88 (0,79-0,99)), ход RR: 0,86 ( 0,75-0,99) и RRHF: 0,80 (0,67-0,95)), в то время как положительная связь присутствовала для яйца (RRHF: 1,16 (1,03-1,31)), красного мяса (RRCHD: 1,15 (1,08-1,23), RRstroke: 1,12 (1,06-1,17), RRHF: 1,08 (1,02-1,14)), обработанное мясо (RRCHD: 1,27 (1,09-1,49), удар RR: 1,17 (1,02-1,34), RRHF: 1,12 (1,05-1,19)) и потребление SSB (RRCHD: 1,17 (1,11-1,23), RRstroke: 1,07 (1,02-1,12), RRHF: 1,08 (1,05-1,12)) в линейном мета-анализе доза-ответ. Существовали четкие указания на нелинейные зависимости доза-реакция между цельным зерном, фруктами, орехами, молочными продуктами и красным мясом и ИБС. </P>\n\n<p> ЗАКЛЮЧЕНИЕ: оптимальное потребление цельного зерна, овощей, фруктов, орехов, бобовых, молочных продуктов, рыбы, красного и обработанного мяса, яиц и SSB показало значительный более низкий риск развития ИБС, инсульта и сердечной недостаточности ». </p>\n\n<p> <a href=\"https://www.ncbi.nlm.nih.gov/m/pubmed/29039970/\"> https://www.ncbi.nlm.nih.gov/m/pubmed/29039970/ </a> </р>\n\n<p> «Целью этого систематического обзора и мета-анализа было обобщение фактических данных о взаимосвязи потребления 12 основных пищевых групп, включая цельное зерно, рафинированное зерно, овощи, фрукты, орехи, бобовые, яйца, молочные продукты, рыба, красное мясо, обработанное мясо и подслащенные напитки (ССБ) с риском гипертонии. До июня 2017 года в PubMed, Scopus и Web of Science проводился систематический поиск проспективных исследований, в которых количественно исследовались вышеупомянутые продукты. Мы провели мета-анализ по самым высоким по сравнению с самыми низкими категориями потребления и линейным и нелинейным мета-анализом доза-эффект для анализа ассоциации. Суммарные ОР и 95% ДИ были оценены с использованием модели случайных эффектов. Всего в метаанализ были включены 28 отчетов. Обратная зависимость риска гипертонии наблюдалась для 30 г цельного зерна / сутки (ОР: 0,92; 95% ДИ: 0,87, 0,98), 100 г фруктов / сутки (ОР: 0,97; 95% ДИ: 0,96, 0,99), 28 г орехов в день (ОР: 0,70; 95% ДИ: 0,45, 1,08) и 200 г молочных продуктов / день (ОР: 0,95; 95% ДИ: 0,94, 0,97), в то время как положительная связь на 100 г красного мяса / сут. (ОР: 1,14; 95% ДИ: 1,02, 1,28), 50 г переработанного мяса / день (ОР: 1,12; 95% ДИ: 1,00, 1,26) и 250 мл SSB / день (ОР: 1,07; 95% ДИ: 1,04 , 1.10) было замечено в линейном мета-анализе доза-эффект ». </P>\n\n<p> <a href=\"https://academic.oup.com/advances/article/8/6/793/4772207\"> https://academic.oup.com/advances/article/8/6/793 / 4772207 </a> </р>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewu1kly/","name":"t1_ewu1kly","created":1565789591,"created_utc":1565760791,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2},{"ups":9,"link_id":"t3_cpxhbb","replies":[{"ups":3,"link_id":"t3_cpxhbb","id":"ewvpl76","author":"FrdrVa","parent_id":"t1_ewvoa4a","subreddit_id":"t5_qgptn","body":"Thank you. Yes, of course I understand that. I was responding to the comment of user “flowersandmtns” who used the term “pro-vegan agenda”, hence my comment started with a quote from them using that term. Maybe I should have used fewer blank lines separating parts of my comment — the quote at the top got separated from my statement at the bottom which you are referring to.","body_html":"<div class = \"md\"> <p> Спасибо. Да, конечно, я понимаю это. Я отвечал на комментарий пользователя «flowersandmtns», который использовал термин «провеганская повестка дня», поэтому мой комментарий начался с цитаты из них, использующей этот термин. Возможно, мне следовало использовать меньше пустых строк, разделяющих части моего комментария - цитата вверху отделена от моего утверждения внизу, на которое вы ссылаетесь. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvpl76/","name":"t1_ewvpl76","created":1565840103,"created_utc":1565811303,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"ewvhggd","author":"FrdrVa","parent_id":"t1_ewsjowe","subreddit_id":"t5_qgptn","body":"Why “because of their pro-vegan agenda” ?  \nIs this implied by the results of the study, or because of where it was published or how it was funded?   \n  \nIt was published in the Journal of the American Heart Association and the funding came from:  \n- National Heart, Lung, and Blood Institute\n- National Institutes of Health.  \n- Department of Health and Human Services\n- Department of International Health Tuition Scholarships\n- Department of International Health at the Johns Hopkins \n- Bloomberg School of Public Health\n- National Institute of Diabetes and Digestive and Kidney Diseases    \n- National Heart, Lung, and Blood Institute    \n\nPersonally, I would be delighted to learn that these institutions had a pro-vegan agenda.","body_html":"<div class = \"md\"> <p> Почему «из-за их провеганской повестки дня»? <br/>\nЭто вытекает из результатов исследования, или из-за того, где оно было опубликовано или как оно финансировалось? </Р>\n\n<p> Он был опубликован в журнале Американской кардиологической ассоциации, и финансирование поступило от: <br/>\n- Национальный институт сердца, легких и крови\n- Национальные институты здоровья. <br/>\n- Департамент здравоохранения и социальных служб\n- Департамент международных стипендий на обучение в области здравоохранения\n- Департамент международного здравоохранения при Джонс Хопкинс\n- Школа общественного здравоохранения Блумберга\n- Национальный институт диабета и болезней органов пищеварения и почек <br/>\n- Национальный институт сердца, легких и крови </p>\n\n<p> Лично я был бы рад узнать, что у этих учреждений была прованская повестка дня. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvhggd/","name":"t1_ewvhggd","created":1565835077,"created_utc":1565806277,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2},{"ups":7,"link_id":"t3_cpxhbb","replies":[{"ups":8,"link_id":"t3_cpxhbb","replies":[{"ups":5,"link_id":"t3_cpxhbb","replies":[{"ups":3,"link_id":"t3_cpxhbb","id":"ewvzwjw","author":"llIlIIlllIIlIlIlllIl","parent_id":"t1_ewvxjuv","subreddit_id":"t5_qgptn","body":"If I understand our conversation correctly:\n1. You ignore red meat is class 2A carcinogen when confronted with it\n2. You acknowledge there is a weak correlation between red meat and cardiovascular disease\n3. When asked to show evidence that supports red meat intake, you do not show any evidence\n4. Then you claim it is natural due to our evolutionary history\n\nWith number 4, you ignore the 50 million years that humans have lived as primarily gatherers and fruitivores, and hyperfocus on the last 10k-50k years. The change in diet the last 2000 years is way too much for the slow changes in genetics to accommodate. \n\nYou’re probably unaware that humans have more traits of herbivorous animals than carnivores, eloquently explained [here](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1312295/) by Dr WF Roberts, a leading cardiovascular pathologist and the current editor of both the American Journal of Cardiology and the Baylor University Medical Center Proceedings:\n\n>   Are human beings herbivores, carnivores, or omnivores?\n\n> Although most of us conduct our lives as omnivores, in that we eat flesh as well as vegetables and fruits, human beings have characteristics of herbivores, not carnivores (2). The appendages of carnivores are claws; those of herbivores are hands or hooves. The teeth of carnivores are sharp; those of herbivores are mainly flat (for grinding). The intestinal tract of carnivores is short (3 times body length); that of herbivores, long (12 times body length). Body cooling of carnivores is done by panting; herbivores, by sweating. Carnivores drink fluids by lapping; herbivores, by sipping. Carnivores produce their own vitamin C, whereas herbivores obtain it from their diet. Thus, humans have characteristics of herbivores, not carnivores.","body_html":"<div class = \"md\"> <p> Если я правильно понимаю наш разговор:\n1. Вы игнорируете красное мясо, являющееся канцерогеном класса 2А, когда сталкиваетесь с ним\n2. Вы признаете, что существует слабая корреляция между красным мясом и сердечно-сосудистыми заболеваниями\n3. Когда вас попросят показать доказательства, подтверждающие потребление красного мяса, вы не предъявите никаких доказательств\n4. Тогда вы утверждаете, что это естественно из-за нашей эволюционной истории </p>\n\n<p> С номером 4 вы игнорируете те 50 миллионов лет, в течение которых люди жили в основном собирателями и плодами, и гиперфокусировкой в ​​последние 10–50 тыс. лет. Изменения в диете за последние 2000 лет слишком велики для медленных изменений в генетике. </Р>\n\n<p> Вы, вероятно, не знаете, что у людей больше черт травоядных животных, чем у плотоядных, красноречиво объяснил <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC1312295/\"> здесь < / a> Доктор В.Ф. Робертс, ведущий сердечно-сосудистый патолог и текущий редактор Американского журнала кардиологии и материалов медицинского университета Бэйлор: </p>\n\n<BLOCKQUOTE>\n<p> Являются ли люди травоядными, плотоядными или всеядными? </p>\n\n<p> Хотя большинство из нас ведет свою жизнь как всеядные, так как мы едим мясо, а также овощи и фрукты, у людей есть характеристики травоядных, а не плотоядных (2). Придатки плотоядных - когти; у травоядных - руки или копыта. Зубы плотоядных животных острые; Травоядные в основном плоские (для размола). Кишечный тракт плотоядных животных короткий (в 3 раза больше длины тела); у травоядных, длинная (в 12 раз длиннее тела). Охлаждение тела плотоядных животных осуществляется путем одышки; травоядные, потливость. Плотоядные пьют жидкости, притирая; травоядные, потягивая. Плотоядные животные производят собственный витамин С, тогда как травоядные получают его из своего рациона. Таким образом, у людей есть характеристики травоядных, а не плотоядных. </P>\n</BLOCKQUOTE>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvzwjw/","name":"t1_ewvzwjw","created":1565846275,"created_utc":1565817475,"subreddit_name_prefixed":"r/ScientificNutrition","depth":8}],"id":"ewvw58i","author":"llIlIIlllIIlIlIlllIl","parent_id":"t1_ewvo3u1","subreddit_id":"t5_qgptn","body":"Let’s say I grant you they are weak associations, after exhaustive correcting for confounders and subanalyses. The fact remains that you are OK with taking that kind of risk, because of what evidence exactly? Show me something that supports the consumption of red meat. The fact that it would be a weak association is only supportive of not consuming it, though it may not be as pressing as avoiding processed meat, but still convincing enough. Why would you smoke 1 cigarette a day, if you could skip it entirely and live healthier without it? Yes 5 cigarettes a day is worse, but does that justify your continuous intake of that 1 cigarette a day? If taste is what you value more, then I guess. \n\nAnd you are entirely ignoring the hard fact that red meat is a class 2A carcinogen. You only responded with “yeah but processed meat is class 1!” That’s true, but why not do yourself a favor and avoid both carcinogens?\n\nAnd we could talk about some relatively minor medical problems (compared to mortality) due to red meat intake, such as gouty arthritis and diabetes. \n\nI could link you some more top tier articles, but it probably won’t make a difference.\n\nCare about your body, you only have one. Dont be another one of those short term keto people that lost weight and regained weight again after failing the diet (luckily, since you’ll increase your mortality and morbidity risk if you’d continue it) - a diet that has 0 longterm cohorts supporting it on the most important endpoints: cardiovascular disease, cancer and mortality. \n\nBest to you.","body_html":"<div class = \"md\"> <p> Допустим, я даю вам уверенность в том, что они являются слабыми ассоциациями после исчерпывающего исправления недоразумений и субанализов. Факт остается фактом, что вы согласны с таким риском, из-за каких именно доказательств? Покажите мне что-нибудь, что поддерживает потребление красного мяса. Тот факт, что это будет слабая ассоциация, лишь способствует тому, что она не потребляется, хотя это может быть не так актуально, как отказ от обработанного мяса, но все же достаточно убедительно. Зачем вам курить 1 сигарету в день, если вы можете пропустить ее полностью и жить без нее здоровее? Да, 5 сигарет в день хуже, но оправдывает ли это постоянное потребление этой 1 сигареты в день? Если вкус - это то, что вы цените больше, тогда я думаю. </Р>\n\n<p> И вы полностью игнорируете тот факт, что красное мясо является канцерогеном класса 2А. Вы только ответили: «Да, но обработанное мясо относится к классу 1!». Это правда, но почему бы не сделать себе одолжение и избежать обоих канцерогенов? </P>\n\n<p> И мы могли бы поговорить о некоторых относительно небольших медицинских проблемах (по сравнению со смертностью) из-за потребления красного мяса, таких как подагрический артрит и диабет. </Р>\n\n<p> Я мог бы связать вас с некоторыми другими статьями высшего уровня, но, вероятно, это ничего не изменит. </p>\n\n<p> Заботьтесь о своем теле, у вас есть только один. Не будьте еще одним из тех краткосрочных кето-людей, которые потеряли вес и снова набрали вес после отказа от диеты (к счастью, так как вы увеличите свой риск смертности и заболеваемости, если будете продолжать его) - диета, в которой поддерживаются 0 долгосрочных когорт. это на самых важных конечных точек: сердечно-сосудистые заболевания, рак и смертность. </Р>\n\n<p> С наилучшими пожеланиями. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvw58i/","name":"t1_ewvw58i","created":1565844018,"created_utc":1565815218,"subreddit_name_prefixed":"r/ScientificNutrition","depth":6}],"id":"ewvkgjy","author":"llIlIIlllIIlIlIlllIl","parent_id":"t1_ewuqnhb","subreddit_id":"t5_qgptn","body":">  They showed yet another association with TMAO.  That's all.\n\nI suggest you take a look at figure 3 in the article, they could not have presented it more straight-forward\n\nAnd I also suggest reading the conclusion from the NEJM researchers:\n\n> “[…] our data suggest that excessive consumption of dietary phosphatidylcholine and choline should be avoided; a vegetarian or high-fiber diet can reduce total choline intake.”\n\n———\n\n> Let's not forget that PROCESSED RED MEAT \n\nYou are defending a strawman. No-one is denying processed foods, especially processed meats, are hazardous for health. \n\nThat does not negate the fact that cohorts that consume more animal products, including red meat, have less favorable outcomes than cohorts that do not consume animal products. \n\nYou can very well draw the conclusion that you think taste is more valuable than being part of the most favorable health cohort (though I would argue taste is not even an argument in today’s society, considering the successful replications of plant-based ‘meats’). Every person needs to do their own risk management they’re comfortable with. \n\nBut don’t talk as if red meat has health benefits or is not associated with adverse health effects, because it does; both cardiovascular and carcinogenic. We call that cognitive dissonance.","body_html":"<div class = \"md\"> <blockquote>\n<p> Они показали еще одну связь с TMAO. Вот и все. </P>\n</BLOCKQUOTE>\n\n<p> Я предлагаю вам взглянуть на рисунок 3 в статье, они не могли бы представить его более простым </p>\n\n<p> И я также предлагаю прочитать заключение исследователей NEJM: </p>\n\n<BLOCKQUOTE>\n<p> «[…] наши данные свидетельствуют о том, что следует избегать чрезмерного потребления фосфатидилхолина и холина с пищей; вегетарианская или богатая клетчаткой диета может снизить общее потребление холина ». </p>\n</BLOCKQUOTE>\n\n<Р> --- </р>\n\n<BLOCKQUOTE>\n<p> Давайте не будем забывать, что обработанное красное мясо </p>\n</BLOCKQUOTE>\n\n<p> Вы защищаете соломенного чучела. Никто не отрицает, что обработанные продукты, особенно переработанное мясо, опасны для здоровья. </Р>\n\n<p> Это не отрицает тот факт, что когорты, которые потребляют больше продуктов животного происхождения, включая красное мясо, имеют менее благоприятные результаты, чем когорты, которые не потребляют продукты животного происхождения. </Р>\n\n<p> Вы можете очень хорошо сделать вывод, что вы думаете, что вкус более ценен, чем быть частью самой благоприятной когорты здоровья (хотя я бы сказал, что вкус не является даже аргументом в современном обществе, учитывая успешную репликацию растений) мясо). Каждый человек должен заниматься своим собственным управлением рисками, с которым ему удобно. </Р>\n\n<p> Но не говорите так, как будто красное мясо приносит пользу для здоровья или не связано с неблагоприятными последствиями для здоровья, потому что это так; как сердечно-сосудистые, так и канцерогенные. Мы называем это когнитивным диссонансом. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvkgjy/","name":"t1_ewvkgjy","created":1565836933,"created_utc":1565808133,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"ewug1ge","author":"llIlIIlllIIlIlIlllIl","parent_id":"t1_ewsjowe","subreddit_id":"t5_qgptn","body":"> But, if they did that, I think they know they would find that red meat in the context of a whole foods vegetable heavy diet has zero correlation with CVD.    \n\nBald claim. Especially without any sources and considering the numerous studies published that disentangled specific foods and their risks based on prospective cohorts. \n\n[Study from the New England Journal of Medicine](https://www.nejm.org/doi/full/10.1056/NEJMoa1109400?cookieSet=1) explaining the mechanism of choline intake from animal products, also red meat, leading to atherosclerosis and cardiovascular disease, via the TMAO pathway. \n\n> “TMAO enhances the accumulation of cholesterol in macrophages, the accumulation of foam cells in artery walls, and atherosclerosis,7 all factors that are associated with an increased risk of heart attack, stroke, and death.”\n\nLarge population-based cohort [published in JAMA Internal Medicine (2017)](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5048552/), showed food analyses and their risk for cardiovascular disease, cause-specific mortality and cancer:\n\n> “Higher animal protein intake was positively, whereas plant protein was inversely, associated with mortality, especially among individuals with at least one lifestyle risk factors. Substitution of plant protein for animal protein, especially from processed red meat, was associated with lower mortality, suggesting the importance of protein source.”\n\n[...]\n\n> “The HRs (95% CI) of all-cause mortality were 0.66 (0.59–0.75) when 3% of energy from plant protein was substituted for an equivalent amount of protein from processed red meat, 0.88 (0.84–0.92) from unprocessed red meat, 0.94 (0.90–0.99) from poultry, 0.94 (0.89–0.99) from fish, 0.81 (0.75–0.88) from eggs, and 0.92 (0.87–0.96) from dairy. The substitution associations were generally stronger for death from CVD and other causes than from cancer, except for eggs, for which substitution for 3%-energy plant protein was associated with 21% lower cancer mortality (95% CI, 7–37%).”\n\nNot related to cardiovascular disease, but definitely related with regard to the adverse health effects of red meat: let’s of course not forget that red meat is a group 2A carcinogen, acknowledged by the WHO and IARC. [IARC Carcinogen classification](https://monographs.iarc.fr/wp-content/uploads/2018/09/ClassificationsAlphaOrder.pdf).","body_html":"<div class = \"md\"> <blockquote>\n<p> Но, если бы они это сделали, я думаю, они знали бы, что красное мясо в контексте цельной растительной диеты с растительными продуктами имеет нулевую корреляцию с ССЗ. </Р>\n</BLOCKQUOTE>\n\n<p> Лысая претензия. Особенно без каких-либо источников и учитывая многочисленные опубликованные исследования, которые распутали определенные продукты и их риски, основанные на предполагаемых когортах. </Р>\n\n<p> <a href=\"https://www.nejm.org/doi/full/10.1056/NEJMoa1109400?cookieSet=1\"> Исследование из Медицинского журнала Новой Англии </a>, объясняющее механизм потребления холина из продукты животного происхождения, а также красное мясо, приводящие к атеросклерозу и сердечно-сосудистым заболеваниям, через путь TMAO. </Р>\n\n<BLOCKQUOTE>\n<p> «ТМАО усиливает накопление холестерина в макрофагах, накопление пенистых клеток в стенках артерий и атеросклероз 7, все факторы, которые связаны с повышенным риском сердечного приступа, инсульта и смерти». </p>\n</BLOCKQUOTE>\n\n<p> Большая популяционная когорта <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5048552/\">, опубликованная в JAMA Internal Medicine (2017) </a>, показала еду анализы и их риск сердечно-сосудистых заболеваний, смертности от конкретных причин и рака: </p>\n\n<BLOCKQUOTE>\n<p> «Более высокое потребление животного белка было положительным, тогда как растительный белок был обратно пропорциональным, связан со смертностью, особенно среди людей, у которых был хотя бы один фактор риска в образе жизни. Замена растительного белка животным белком, особенно из переработанного красного мяса, была связана с более низкой смертностью, что свидетельствует о важности источника белка ». </P>\n</BLOCKQUOTE>\n\n<Р> [...] </p>\n\n<BLOCKQUOTE>\n<p> «ЧСС (95% ДИ) смертности от всех причин составляли 0,66 (0,59–0,75), когда 3% энергии растительного белка заменяли эквивалентным количеством белка из обработанного красного мяса, 0,88 (0,84–0,92) из необработанного красного мяса, 0,94 (0,90–0,99) из домашней птицы, 0,94 (0,89–0,99) из рыбы, 0,81 (0,75–0,88) из яиц и 0,92 (0,87–0,96) из молочных продуктов. Ассоциации замещения были, как правило, сильнее для смерти от ССЗ и других причин, чем от рака, за исключением яиц, для которых замена 3% -энергетического растительного белка была связана с 21% снижением смертности от рака (95% ДИ, 7–37%). «</p>\n</BLOCKQUOTE>\n\n<p> Не связано с сердечно-сосудистыми заболеваниями, но определенно связано с неблагоприятным воздействием красного мяса на здоровье: давайте, конечно, не будем забывать, что красное мясо является канцерогеном группы 2А, признанным ВОЗ и МАИР. <a href=\"https://monographs.iarc.fr/wp-content/uploads/2018/09/ClassificationsAlphaOrder.pdf\"> Классификация IARC канцерогенов </a>. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewug1ge/","name":"t1_ewug1ge","created":1565808425,"created_utc":1565779625,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2},{"ups":3,"link_id":"t3_cpxhbb","id":"ewtz5ix","author":"fhtagnfool","parent_id":"t1_ewsjowe","subreddit_id":"t5_qgptn","body":"Yeah, they didn't look for the optimally healthy diet, they just showed up with a preconceived plant-based score (that includes some things we already know are healthy) and then applied it to the data... to get the totally expected result that it is healthy. You could do that with any other diet too. But they get to plant their subliminal message that meat is bad.","body_html":"<div class = \"md\"> <p> Да, они не искали оптимально здоровую диету, они просто появились с заранее заданным баллом на основе растений (который включает в себя некоторые вещи, которые, как мы уже знаем, полезны для здоровья), а затем применили его к данным ... чтобы получить полностью ожидаемый результат, что это здорово. Вы можете сделать это с любой другой диетой. Но они подбрасывают свое подсознательное сообщение, что мясо плохое. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtz5ix/","name":"t1_ewtz5ix","created":1565787131,"created_utc":1565758331,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2},{"ups":1,"link_id":"t3_cpxhbb","replies":[{"ups":2,"link_id":"t3_cpxhbb","id":"eyv4nu6","author":"Mahadragon","parent_id":"t1_eyv4fyr","subreddit_id":"t5_qgptn","body":"Thanks","body_html":"<div class = \"md\"> <p> Спасибо </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/eyv4nu6/","name":"t1_eyv4nu6","created":1567509344,"created_utc":1567480544,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"eyv3loe","author":"Mahadragon","parent_id":"t1_ewsjowe","subreddit_id":"t5_qgptn","body":"Can someone simplify what this guy just said in plain english?","body_html":"<div class = \"md\"> <p> Может ли кто-нибудь упростить то, что этот парень только что сказал простым языком? </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/eyv3loe/","name":"t1_eyv3loe","created":1567508450,"created_utc":1567479650,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ewsdbtj","author":"jeffyshoo","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"Love that they split between healthy and unhealthy plant-based foods. In studies looking only at the label of “vegetarians” or “vegans”, there’s always the question of how often they’re eating Oreos vs vegetables","body_html":"<div class = \"md\"> <p> Очень нравится, что они делятся между здоровой и нездоровой растительной пищей. В исследованиях, которые рассматривают только ярлык «вегетарианцы» или «веганы», всегда возникает вопрос о том, как часто они едят Oreos против овощей </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewsdbtj/","name":"t1_ewsdbtj","created":1565753979,"created_utc":1565725179,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":14,"link_id":"t3_cpxhbb","replies":[{"ups":9,"link_id":"t3_cpxhbb","replies":[{"ups":12,"link_id":"t3_cpxhbb","id":"ewter96","author":"RunningInfinitely","parent_id":"t1_ewsq3kj","subreddit_id":"t5_qgptn","body":"It's like smoking. We know it's horrible for heart health.","body_html":"<div class = \"md\"> <p> Это похоже на курение. Мы знаем, что это ужасно для здоровья сердца. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewter96/","name":"t1_ewter96","created":1565772305,"created_utc":1565743505,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4},{"ups":-4,"link_id":"t3_cpxhbb","replies":[{"ups":0,"link_id":"t3_cpxhbb","replies":[{"ups":2,"link_id":"t3_cpxhbb","id":"ewu3n3u","author":"flowersandmtns","parent_id":"t1_ewu36s0","subreddit_id":"t5_qgptn","body":"Look at the top rankings in your link --\n\n1 Regular cheese\n\n2 Pizza   \n\n3 Grain-based desserts \n\n4 Dairy desserts \n\nFrom OPs study, dairy had no effect on outcomes.  I certainly see pizza and grain based desserts as less healthy choices but regular cheese is healthy per the followup on DASH that the paper's authors didn't seem to keep up on.\n\n\"The study was designed to test the effects of substituting full-fat for  low-fat dairy foods in the DASH diet, with a corresponding increase in  fat and a reduction in sugar intake, on blood pressure and plasma lipids  and lipoproteins.)\"\n\n\"The HF-DASH diet lowered blood pressure to the same extent as the DASH   diet but also reduced plasma triglyceride and VLDL concentrations   without significantly increasing LDL cholesterol.\"  [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4733264/](https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4733264/)","body_html":"<div class = \"md\"> <p> Посмотрите на рейтинг в вашей ссылке - </p>\n\n<p> 1 обычный сыр </p>\n\n<p> 2 пиццы </p>\n\n<p> 3 зерновых десерта </p>\n\n<p> 4 молочных десерта </p>\n\n<p> Из исследования OP, молочные продукты не влияли на результаты. Я, конечно, считаю, что пицца и зерновые десерты менее полезны для здоровья, но обычный сыр полезен, несмотря на то, что авторы газеты не следили за развитием событий. </P>\n\n<p> \"Исследование было разработано для проверки влияния замены жирной молочной пищи на жирную пищу на жирную молочную пищу с соответствующим увеличением жира и снижением потребления сахара на кровяное давление и липиды и липопротеины плазмы. ) \"</р>\n\n<p> «Диета HF-DASH снижала кровяное давление в той же степени, что и диета DASH, но также снижала концентрации триглицеридов и ЛПОНП в плазме без значительного повышения уровня холестерина ЛПНП». <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4733264/\"> https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4733264/</a > </р>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewu3n3u/","name":"t1_ewu3n3u","created":1565791854,"created_utc":1565763054,"subreddit_name_prefixed":"r/ScientificNutrition","depth":8}],"id":"ewu23rq","author":"flowersandmtns","parent_id":"t1_ewu2057","subreddit_id":"t5_qgptn","body":"I know I'm comparing two types of foods.  Both vegetable seed oil and animal protein meat contain SFA.\n\nAmericans are consuming more SFA even as red meat consumption has dropped.  Some of that is the increase in poultry meat consumption but a \\[edit:  ~~significant~~\\] portion is from the staggering growth of vegetable seed oils.","body_html":"<div class = \"md\"> <p> Я знаю, что сравниваю два типа продуктов. Как растительное масло, так и мясо животного белка содержат SFA. </P>\n\n<p> Американцы потребляют больше SFA, даже когда потребление красного мяса сократилось. Отчасти это связано с увеличением потребления мяса птицы, но часть [править: <del> значительная </del>] связана с ошеломляющим ростом растительных масел. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewu23rq/","name":"t1_ewu23rq","created":1565790156,"created_utc":1565761356,"subreddit_name_prefixed":"r/ScientificNutrition","depth":6}],"id":"ewt2rao","author":"flowersandmtns","parent_id":"t1_ewsq3kj","subreddit_id":"t5_qgptn","body":"So is canola oil, where 1Tb has as much saturated fat as 3 oz chicken breast.","body_html":"<div class = \"md\"> <p> Так же и масло канолы, в котором 1 Тб содержит столько же насыщенных жиров, сколько и 3 унции куриной грудки. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewt2rao/","name":"t1_ewt2rao","created":1565768078,"created_utc":1565739278,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"ews9qyc","author":"RunningInfinitely","parent_id":"t1_ews8dnp","subreddit_id":"t5_qgptn","body":"> The strongest and most consistent significant associations were observed  for PDI and provegetarian diet index, with all 3 outcomes in all 3  models (Figures [S1 and S2](https://www.ahajournals.org/doi/suppl/10.1161/JAHA.119.012865)).  After adjusting for sociodemographic characteristics (age, sex,  race‐center, and education), dietary factors (total energy intake and  margarine consumption), and **health behaviors (smoking, physical  activity, and alcohol consumption)**, those in the highest versus lowest  quintiles of PDI and provegetarian diet index had a 16% and 16% lower  risk of incident cardiovascular disease, a 32% and 31% lower risk of  cardiovascular mortality, and a 25% and 18% lower risk of all‐cause  mortality, respectively (Table 3).  These associations remained significant and similar in magnitude after  adjusting for potential mediating factors (total cholesterol,  lipid‐lowering medication use, estimated glomerular filtration rate,  hypertension, diabetes mellitus, and BMI) (Table [S4](https://www.ahajournals.org/doi/suppl/10.1161/JAHA.119.012865)).","body_html":"<div class = \"md\"> <blockquote>\n<p> Наиболее сильные и наиболее устойчивые значимые ассоциации наблюдались для индекса PDI и индекса вегетарианской диеты со всеми 3 исходами во всех 3 моделях (рисунки <a href = \"https://www.ahajournals.org/doi/suppl/10.1161/ JAHA.119.012865 \"> S1 и S2 </a>). После корректировки на социально-демографические характеристики (возраст, пол, расовый центр и образование), диетические факторы (общее потребление энергии и потребление маргарина) и <strong> поведение в отношении здоровья (курение, физическая активность и потребление алкоголя) </strong>, у тех, кто находился в самых высоких и самых низких квинтилях ИПП и индекса вегетарианской диеты, риск возникновения сердечно-сосудистых заболеваний был на 16% и 16% ниже, а риск сердечно-сосудистой смертности - на 32% и 31%, а на 25% и 18% ниже. - соответственно, смертность (Таблица 3). Эти ассоциации оставались значимыми и сходными по величине после поправки на потенциальные опосредующие факторы (общий холестерин, применение гиполипидемических препаратов, предполагаемая скорость клубочковой фильтрации, гипертония, сахарный диабет и ИМТ) (таблица <a href = \"https: // www. ahajournals.org/doi/suppl/10.1161/JAHA.119.012865\">S4 </a>). </р>\n</BLOCKQUOTE>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ews9qyc/","name":"t1_ews9qyc","created":1565751809,"created_utc":1565723009,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ews82fv","author":"RunningInfinitely","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"# Abstract\n\n### Background\n\nPrevious  studies have documented the cardiometabolic health benefits of  plant‐based diets; however, these studies were conducted in selected  study populations that had narrow generalizability.\n\n### Methods and Results\n\nWe  used data from a community‐based cohort of middle‐aged adults  (n=12 168) in the ARIC (Atherosclerosis Risk in Communities) study who  were followed up from 1987 through 2016. Participants’ diet was  classified using 4 diet indexes. In the overall plant‐based diet index  and provegetarian diet index, higher intakes of all or selected plant  foods received higher scores; in the healthy plant‐based diet index,  higher intakes of only the healthy plant foods received higher scores;  in the less healthy plant‐based diet index, higher intakes of only the  less healthy plant foods received higher scores. In all indexes, higher  intakes of animal foods received lower scores. Results from Cox  proportional hazards models showed that participants in the highest  versus lowest quintile for adherence to overall plant‐based diet index  or provegetarian diet had a 16%, 31% to 32%, and 18% to 25% lower risk  of cardiovascular disease, cardiovascular disease mortality, and  all‐cause mortality, respectively, after adjusting for important  confounders (all *P*<0.05 for trend). Higher adherence to a  healthy plant‐based diet index was associated with a 19% and 11% lower  risk of cardiovascular disease mortality and all‐cause mortality,  respectively, but not incident cardiovascular disease (*P*<0.05 for trend). No associations were observed between the less healthy plant‐based diet index and the outcomes.\n\n### Conclusions\n\nDiets  higher in plant foods and lower in animal foods were associated with a  lower risk of cardiovascular morbidity and mortality in a general  population.","body_html":"<div class = \"md\"> <h1> Abstract </h1>\n\n<H3> Фон </h3>\n\n<p> Предыдущие исследования документально подтвердили пользу кардиометаболического здоровья от растительных диет; однако эти исследования были проведены в отдельных исследуемых группах населения, которые имели узкую обобщаемость. </p>\n\n<h3> Методы и результаты </h3>\n\n<p> В исследовании ARIC (риск атеросклероза в сообществах) мы использовали данные общинной когорты взрослых людей среднего возраста (n = 12 168), которые наблюдались с 1987 по 2016 год. Диета участников была классифицирована с использованием 4 рационов питания. индексов. В общем индексе растительной диеты и индексе вегетарианской диеты более высокие потребления всех или отдельных растительных продуктов получили более высокие оценки; в индексе здоровой растительной диеты более высокие потребления только здоровой растительной пищи получили более высокие оценки; в индексе менее здоровой растительной диеты более высокие потребления получили только менее здоровые растительные продукты. По всем показателям более высокое потребление продуктов животного происхождения получило более низкие оценки. Результаты моделей пропорциональных рисков Кокса показали, что у участников самого высокого и самого низкого квинтиля для соблюдения общего индекса растительной диеты или вегетарианской диеты риск сердечно-сосудистых заболеваний был на 16%, от 31% до 32% и от 18% до 25%, смертность от сердечно-сосудистых заболеваний и от всех причин, соответственно, после поправки на важные факторы (все <em> P </em> <0,05 для тренда). Более высокая приверженность индексу здоровой растительной диеты была связана с понижением риска смертности от сердечно-сосудистых заболеваний на 19% и 11% соответственно, но не с сердечно-сосудистыми заболеваниями (<em> P </em> <0,05 для тенденция). Не было выявлено никаких связей между индексом менее здоровой растительной диеты и результатами. </P>\n\n<H3> Выводы </h3>\n\n<p> Диеты с более высоким содержанием растительной пищи и более низкие с пищей животных были связаны с более низким риском сердечно-сосудистой заболеваемости и смертности среди населения в целом. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ews82fv/","name":"t1_ews82fv","created":1565750902,"created_utc":1565722102,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":5,"link_id":"t3_cpxhbb","id":"eyh6kv7","author":"webDebbie","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"I love how it is an epidemiology study using a food questionnaire. Most worthless type of human study possible. Then a weak association which means nothing. Association doesn’t prove anything. I see this study as showing that carbs play a role that they ignored discussing. The conclusion doesn’t match the actual study which delineated more between processed food (which is primarily grain based) rather than meat.","body_html":"<div class = \"md\"> <p> Мне нравится, как это эпидемиологическое исследование с использованием опросника по продуктам питания. Самый бесполезный тип изучения человека возможен. Тогда слабая ассоциация, которая ничего не значит. Ассоциация ничего не доказывает. Я вижу, что это исследование показывает, что углеводы играют роль, которую они игнорировали, обсуждая. Заключение не соответствует фактическому исследованию, в котором больше разграничены обработанные пищевые продукты (которые в основном основаны на зерне), а не мясо. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/eyh6kv7/","name":"t1_eyh6kv7","created":1567111464,"created_utc":1567082664,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":10,"link_id":"t3_cpxhbb","replies":[{"ups":5,"link_id":"t3_cpxhbb","id":"ewvno8m","author":"otakumuscle","parent_id":"t1_ewvi0qp","subreddit_id":"t5_qgptn","body":"yes, I'm trying to say these broad categories like plant-based and animal-based are utter shit and so are all the studies using those.","body_html":"<div class = \"md\"> <p> да, я пытаюсь сказать, что эти широкие категории, такие как растительные и животные, являются полным дерьмом, как и все исследования, использующие их. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewvno8m/","name":"t1_ewvno8m","created":1565838929,"created_utc":1565810129,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ewsoquj","author":"otakumuscle","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"I'm glad that all plant-based and animal-based foods have exactly the same beneficial and harmful effects on health which persist regardless of their production or preparation, otherwise these studies would be meaningless trash.","body_html":"<div class = \"md\"> <p> Я рад, что все растительные и животные продукты имеют одинаково полезные и вредные воздействия на здоровье, которые сохраняются независимо от их производства или приготовления, в противном случае эти исследования были бы бессмысленными мусор. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewsoquj/","name":"t1_ewsoquj","created":1565760782,"created_utc":1565731982,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":16,"link_id":"t3_cpxhbb","id":"ewsfmjh","author":"flowersandmtns","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"I find it interesting how the really stretch the whole \"plant based\" to not be vegan at all, even though that's how it's most commonly used and understood, and to simply mean has a lot of whole vegetables/fiber.  \n\n\"When we modeled individual food groups, there was no association between dairy or fish or seafood and all 3 outcomes.\"\n\nI wish they had laid out the group with the highest red meat consumption AND the highest \"plant based\" aka veggie consumption.  Call it Q6.  But they didn't want to see anything positive about red meat, I think, so they didn't even look for that group of people.\n\nFinal take away -- \"*However, we are unable to infer if there is an absolute level of plant  food or animal food intake that is associated with health outcomes.*\"","body_html":"<div class = \"md\"> <p> Мне интересно, как на самом деле растягивать весь «растительный базис», чтобы вообще не быть веганом, хотя именно так его чаще всего используют и понимают, а просто значит много из целых овощей / клетчатки. </Р>\n\n<p> «Когда мы моделировали отдельные группы продуктов питания, не было никакой связи между молочными продуктами, рыбой или морепродуктами и всеми тремя результатами». </p>\n\n<p> Хотелось бы, чтобы они составили группу с самым высоким потреблением красного мяса И самым высоким потреблением, основанным на растениях, то есть вегетарианским. Назовите это Q6. Думаю, они не хотели видеть ничего хорошего в красном мясе, поэтому даже не искали эту группу людей. </P>\n\n<p> Окончательный вывод - \"<em> Однако мы не можем сделать вывод, существует ли абсолютный уровень потребления растительной или животной пищи, связанный с результатами для здоровья. </em>\" </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewsfmjh/","name":"t1_ewsfmjh","created":1565755376,"created_utc":1565726576,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":2,"link_id":"t3_cpxhbb","id":"ex2ny1p","author":"Tsaravall","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"> Those in the highest quintiles of PDI, hPDI, and provegetarian diet index were more likely to be women, white, high school graduates, and physically active and were less likely to be obese, to be current smokers, to have diabetes mellitus, and to have hypertension at baseline compared with those in the lowest quintiles (Tables 1 and 2, Table [S1](https://www.ahajournals.org/doi/suppl/10.1161/JAHA.119.012865)). \n\nAnd that is why we must always remember that correlation is not causation.","body_html":"<div class = \"md\"> <blockquote>\n<p> Среди лиц с наивысшим квинтилем ИДП, ВПД и индекса вегетарианской диеты чаще были женщины, белые, выпускники средних школ и физически активные люди, а также менее склонны к ожирению, нынешним курильщикам и сахарному диабету. и иметь гипертонию на исходном уровне по сравнению с таковой в самых низких квинтилях (таблицы 1 и 2, таблица <a href=\"https://www.ahajournals.org/doi/suppl/10.1161/JAHA.119.012865\"> S1 </а>). </Р>\n</BLOCKQUOTE>\n\n<p> И именно поэтому мы всегда должны помнить, что корреляция - это не причинно-следственная связь. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ex2ny1p/","name":"t1_ex2ny1p","created":1566001325,"created_utc":1565972525,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":1,"link_id":"t3_cpxhbb","replies":[{"ups":1,"link_id":"t3_cpxhbb","replies":[{"ups":-6,"link_id":"t3_cpxhbb","replies":[{"ups":5,"link_id":"t3_cpxhbb","replies":[{"ups":4,"link_id":"t3_cpxhbb","id":"ewttbpl","author":"flowersandmtns","parent_id":"t1_ewtpa3e","subreddit_id":"t5_qgptn","body":"If you ask anyone what \"whole food plant based\" means they know it's vegans.  But not the fries, fake cheese and oreos vegans, the ones who eat a healthy diet centered around whole foods.  Which is about the ONLY thing just about everyone agrees is healthy.  Which foods though, that's never going to be settled science.\n\nYou may not want to conflate them but oh, the WFPB people blatently want to and blatently are vegans using a new name.  Mostly ethical too, but not all.\n\nThe r/PlantBasedDiet subreddit explicitly states no animal products (and also is anti-coconut?).  It's vegan with an emphasis on whole foods.  None of which are animal products.   \n\nSince they aren't taking an ethical stance (which is reasonable, honestly, CAFO is horrific), there's this seeming need to prove they are \"right\" with poor studies like this and all the weak associations with SFA.  Ignoring of course that 1Tb canola oil has as much SFA as 3 oz chicken breast, so that whole thing is a bust too.","body_html":"<div class = \"md\"> <p> Если вы спросите кого-либо, что означает «на основе целого пищевого растения», он знает, что это веганы Но не картофель фри, фальшивый сыр и ореос-веганы, которые питаются здоровой пищей, сосредоточенной вокруг цельных продуктов. Что касается ТОЛЬКО того, что все согласны с тем, что это здорово. Какая пища, хотя, это никогда не будет решено наукой. </P>\n\n<p> Возможно, вы не захотите объединять их, но, о-о, люди из ВППБ явно хотят и являются веганами, использующими новое имя. В основном этические тоже, но не все. </P>\n\n<p> В подреддите <a href=\"/r/PlantBasedDiet\"> r / PlantBasedDiet </a> явно не указано никаких продуктов животного происхождения (а также анти-кокосовых орехов?). Это веганский с акцентом на цельные продукты. Ни один из которых не является продуктами животного происхождения. </Р>\n\n<p> Поскольку они не занимают этическую позицию (что разумно, честно, CAFO ужасен), существует очевидная необходимость доказать, что они «правы» в плохих исследованиях, подобных этой, и во всех слабых ассоциациях с SFA. Конечно, не обращая внимания на то, что в масле рапса 1 Тб содержится столько же SFA, сколько в 3 унции куриной грудки, так что все это тоже перебор. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewttbpl/","name":"t1_ewttbpl","created":1565782249,"created_utc":1565753449,"subreddit_name_prefixed":"r/ScientificNutrition","depth":8},{"ups":5,"link_id":"t3_cpxhbb","id":"ewtqmra","author":"fhtagnfool","parent_id":"t1_ewtpa3e","subreddit_id":"t5_qgptn","body":"In my experience \"plant based\" and \"vegan\" are already conflated, and deliberately so, I don't think it's due to me not paying attention.\n\nI think saying veganism is about politics and ethics, not food, is disingenuous. We all know what the common meaning of vegan is in the context of nutrition.\n\n>The former means including plants, not necessarily a 100% plant diet. \n\nBut 100% is the usual meaning, right? Or somewhere close to 99%? Or is my 50/50 paleo diet now a plant based diet?","body_html":"<div class = \"md\"> <p> По моему опыту, «растительный» и «веганский» уже слиты воедино, и я не думаю, что это из-за того, что я не обращаю внимания. </p>\n\n<p> Я думаю, что говорить о веганстве - это политика и этика, а не еда. Мы все знаем, каково общее значение веганского в контексте питания. </P>\n\n<BLOCKQUOTE>\n<p> Первое означает в том числе растения, не обязательно 100% растительный рацион. </Р>\n</BLOCKQUOTE>\n\n<p> Но 100% это обычный смысл, верно? Или где-то близко к 99%? Или моя палео-диета 50/50 теперь растительная? </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtqmra/","name":"t1_ewtqmra","created":1565780547,"created_utc":1565751747,"subreddit_name_prefixed":"r/ScientificNutrition","depth":8}],"id":"ewtomdo","author":"fhtagnfool","parent_id":"t1_ewto8n5","subreddit_id":"t5_qgptn","body":"Your title literally starts with \"Plant-Based Diets\"\n\nHow the hell can you think the comments will have nothing to do with veganism?\n\n>Many people seem to be looking for ways to discredit the study.\n\nShould we not? What else are we supposed to do in here??","body_html":"<div class = \"md\"> <p> Ваше название буквально начинается с \"Диеты на растительной основе\" </p>\n\n<p> Как, черт возьми, вы думаете, что комментарии не имеют ничего общего с веганством? </p>\n\n<BLOCKQUOTE>\n<p> Многие люди, похоже, ищут способы дискредитировать исследование. </p>\n</BLOCKQUOTE>\n\n<p> Разве мы не должны? Что еще мы должны здесь делать? </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtomdo/","name":"t1_ewtomdo","created":1565779027,"created_utc":1565750227,"subreddit_name_prefixed":"r/ScientificNutrition","depth":6}],"id":"ewtmy6z","author":"fhtagnfool","parent_id":"t1_ewtkvoh","subreddit_id":"t5_qgptn","body":"That's pretty snarky. Non-vegans are still allowed to comment here and I resent the implication that I'm part of an aggressive horde. Interpreting studies and considering their place in wider conclusions is a common and perhaps encouraged activity in this forum.","body_html":"<div class = \"md\"> <p> Это довольно странно. Не веганам по-прежнему разрешено комментировать здесь, и я не согласен с тем, что я являюсь частью агрессивной орды. Интерпретация исследований и рассмотрение их места в более широких выводах является обычной и, возможно, поощряемой деятельностью на этом форуме. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtmy6z/","name":"t1_ewtmy6z","created":1565777822,"created_utc":1565749022,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"ewtes2h","author":"fhtagnfool","parent_id":"t1_ewtdt55","subreddit_id":"t5_qgptn","body":"Is that sarcasm?\n\nWhether or not the authors of this study on \"plant-based diets\" are aligned with veganism, I indeed think it's plausible that people might quote it in support of such views.\n\nI was merely noting that this study is about a directional association with a plant-based **index**, and nobody in the study actually followed a ~/true/~ plant-based diet.","body_html":"<div class = \"md\"> <p> Это сарказм? </p>\n\n<p> Независимо от того, согласны ли авторы этого исследования о «растительных диетах» с веганством, я действительно считаю, что люди могут цитировать его в поддержку таких взглядов. </p>\n\n<p> Я просто отметил, что это исследование касается направленной связи с <strong> индексом </strong> на основе растений, и никто в этом исследовании фактически не придерживался ~ / true / ~ диеты на основе растений. </p >\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtes2h/","name":"t1_ewtes2h","created":1565772319,"created_utc":1565743519,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ewt7glf","author":"fhtagnfool","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"12168 people were followed from 1987 to 2016. I wonder if it's fair to use this as evidence for vegan diets, if the number of people there that actually ate 0 animal products in that period is about 0.","body_html":"<div class = \"md\"> <p> За период с 1987 по 2016 год наблюдалось 12168 человек. Интересно, будет ли справедливо использовать это в качестве доказательства веганской диеты, если число людей, которые фактически съели 0 продуктов животного происхождения в этот период, около 0. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewt7glf/","name":"t1_ewt7glf","created":1565769465,"created_utc":1565740665,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":-2,"link_id":"t3_cpxhbb","replies":[{"ups":9,"link_id":"t3_cpxhbb","id":"ewtl8xj","author":"RunningInfinitely","parent_id":"t1_ewsfrvh","subreddit_id":"t5_qgptn","body":"They wanted to test out the effects of plant-based diets (on an index) on heart health. That is a perfectly fine agenda. The researchers wanted to prove/disprove a hypothesis, as all researchers do. As such:\n\n>Future research examining whether the quality of plant foods (healthful  versus less healthful) within the framework of an overall plant‐based  diet is associated with cardiovascular disease and all‐cause mortality  is warranted.","body_html":"<div class = \"md\"> <p> Они хотели проверить влияние растительных диет (на индекс) на здоровье сердца. Это очень хорошая повестка дня. Исследователи хотели доказать / опровергнуть гипотезу, как и все исследователи. Как таковой: </p>\n\n<BLOCKQUOTE>\n<p> Будущие исследования, посвященные изучению того, связано ли качество растительной пищи (полезной и менее полезной) в рамках общей растительной диеты с сердечно-сосудистыми заболеваниями и оправдана ли смертность от всех причин. </p>\n</BLOCKQUOTE>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewtl8xj/","name":"t1_ewtl8xj","created":1565776616,"created_utc":1565747816,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ewsauah","author":"limbodog","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"To me this is a bit too generalized to be truly useful.  I mean, I could have a plant-based diet that includes 300 lbs of sugar a year and I'm pretty sure it'd be super bad for me.  And does this compare the value of a meat based diet that's low in simple carbs?  Does it compare a 'beige food' diet?","body_html":"<div class = \"md\"> <p> Для меня это слишком обобщенно, чтобы быть действительно полезным. Я имею в виду, что у меня может быть растительная диета, которая включает 300 фунтов сахара в год, и я уверен, что это будет очень плохо для меня. И сравнивает ли это ценность мясной диеты с низким содержанием простых углеводов? Сравнивает ли это диету «бежевая еда»? </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/ewsauah/","name":"t1_ewsauah","created":1565752455,"created_utc":1565723655,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":1,"link_id":"t3_cpxhbb","id":"exq908e","author":"MAKAZEN","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"I'm honestly reading this while eating a medium rare ribeye. I've made my choice.","body_html":"<div class = \"md\"> <p> Честно говоря, я читаю это, когда ем средний редкий рибай. Я сделал свой выбор. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/exq908e/","name":"t1_exq908e","created":1566528200,"created_utc":1566499400,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":0,"link_id":"t3_cpxhbb","id":"eydtkwa","author":"Fluxcapacitive","parent_id":"t3_cpxhbb","subreddit_id":"t5_qgptn","body":"Plant based burgers, Plant based hot dogs, plant based cheese, plant based chicken, plant based plants....  it's not what you eat but how much...","body_html":"<div class = \"md\"> <p> Гамбургеры на растительной основе, хот-доги на растительной основе, сыр на растительной основе, курица на растительной основе, растения на растительной основе ... это не то, что вы едите, а сколько ... </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/cpxhbb/plantbased_diets_are_associated_with_a_lower_risk/eydtkwa/","name":"t1_eydtkwa","created":1567053345,"created_utc":1567024545,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0}]}