{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://academic.oup.com/advances/advance-article-abstract/doi/10.1093/advances/nmz076/5544783\n\n\n> АВТОРЕФЕРАТ\n> После опубликования предыдущего мета-анализа влияния потребления цельного зерна на показатели ожирения было опубликовано несколько клинических испытаний. Поэтому мы стремились обновить предыдущий мета-анализ влияния потребления цельного зерна на показатели ожирения, включив недавно опубликованные исследования, а также учитывая основные ограничения в этом анализе. Мы провели поиск в онлайновых базах данных PubMed, Scopus, Clarivate Web of Science, EmBase и Google Scholar на предмет соответствующих исследований, опубликованных до февраля 2019 года, с использованием соответствующих ключевых слов. Были включены рандомизированные клинические испытания, в которых изучалось влияние цельнозерновых продуктов или диет с высоким содержанием цельнозерновой пищи по сравнению с контрольной диетой на антропометрические показатели [включая массу тела, ИМТ, окружность талии и массу жира (FM)]. Всего было рассмотрено 21 исследование с общей выборкой 1798 участников в возрасте ≥18 лет. Основываясь на 22 величинах эффекта от 19 исследований массы тела, с общей выборкой 1698 взрослых, мы не обнаружили существенного влияния потребления цельного зерна на массу тела. Те же самые результаты были получены для ИМТ, так что при использовании 10 величин эффекта от 10 клинических испытаний с общей выборкой из 769 человек мы не обнаружили какого-либо существенного эффекта. Что касается процентного содержания телесного жира [средневзвешенная разница (ОМУ): 0,27; 95% ДИ: от -0,05 до 0,58%; P = 0,09], FM (ОМУ: 0,45; 95% ДИ: от -0,12 до 1,02 кг; Р = 0,12), масса без жира (ОМУ: 0,31; 95% ДИ: от -0,67 до 0,06 кг; Р = 0,10), и окружность талии (ОМП: 0,06; 95% ДИ: от -0,50 до 0,63 см; P = 0,82), нам не удалось обнаружить какого-либо существенного влияния потребления цельного зерна. В заключение, наши результаты не поддержали текущие рекомендации по потреблению цельного зерна в попытках контролировать меры ожирения. Учитывая положительное влияние потребления цельного зерна на другие показатели здоровья человека, необходимы дополнительные хорошо спланированные исследования для дальнейшего изучения влияния на ожирение. Протокол был зарегистрирован в PROSPERO (регистрационный номер CRD42018089176).\n\n\n> Цитирование\nОмид Садеги, Мехди Садегиан, Сепидех Рахмани, Вахид Малеки, Багер Лариджани, Ахмад Эсмаилзаде, Потребление цельного зерна не влияет на показатели ожирения: обновленный систематический обзор и мета-анализ рандомизированных клинических испытаний, Достижения в области питания, nmz076, https: nmz076, https: nmz076, https: //doi.org/10.1093/advances/nmz076","title":"Потребление цельного зерна не влияет на показатели ожирения: обновленный систематический обзор и метаанализ рандомизированных клинических испытаний","subreddit_name_prefixed":"r/ScientificNutrition","ups":7,"created":1566301317,"link_flair_background_color":"#dadada","id":"csscns","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/csscns/wholegrain_consumption_does_not_affect_obesity/","url":"https://www.reddit.com/r/ScientificNutrition/comments/csscns/wholegrain_consumption_does_not_affect_obesity/","created_utc":1566272517}