{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://academic.oup.com/ajcn/article/110/2/410/5512721\n\n> АВТОРЕФЕРАТ\n\n> Справочная информация\n\n> Задержка роста ребенка является серьезной проблемой общественного здравоохранения, от которой страдают 155 миллионов человек во всем мире. Нехватка животного исходного белка была определена как риск, но эффекты добавок животного белка не очень хорошо установлены.\n\n> Цель\n\n> Целью этого исследования было изучение влияния добавок животного белка у матерей, недоношенных и доношенных детей на результаты рождения и роста.\n\n> Методы\n\n> PubMed, EMBASE, Кокрановская библиотека, Web of Science, Кумулятивный индекс литературы по сестринскому делу и смежным областям здравоохранения, а также литература по здравоохранению в Латинской Америке и Карибском бассейне были проведены поиски рандомизированных контролируемых испытаний добавок животного белка у матерей или младенцев и детей (≤age 5 лет ), оценивая меры антропометрии (≤age 18 лет). Основные результаты включали вес при рождении, низкий вес при рождении, малый для гестационного возраста при рождении; рост, рост для возраста, вес, вес для возраста, вес для длины, задержка роста и потеря веса ≤18 лет. Данные были извлечены независимо в двух экземплярах, и результаты были объединены с использованием обратного дисперсионного мета-анализа. Гетерогенность изучалась с использованием I2, стратифицированного анализа и мета-регрессии, а также систематической ошибки публикации с помощью воронкообразных графиков, теста Эггера и методов заполнения / обрезки.\n\n> Результаты\n\n> Из 6808 уникальных тезисов и 357 полнотекстовых статей 62 исследования были включены. В 62 исследованиях приняло участие более 30 000 участников на 5 континентах, включая добавки на основе смесей для детей и добавки на основе пищевых продуктов во время беременности и детства. Материнские добавки увеличивали массу тела при рождении на 0,06 кг, а добавки на молочной и пищевой основе у доношенных и маленьких детей увеличивали массу тела на ≤0,14 кг. Ни формула, ни пищевые добавки для доношенных / маленьких детей не увеличивали рост, в то время как z-показатель роста к возрасту был увеличен на основе пищи (+0,06 z-показателя), но не на основе формулы (-0,11 z-). оценка) испытания, сообщающие об этом результате. У доношенных детей z-показатель массы тела к длине был повышен в испытаниях формулы (+ 0,24 z-показателя) и пищевых добавок (+ 0,06 z-показателя), тогда как пищевые добавки также были связаны с уменьшением шансов задержки роста (- 13%).\n\n> Выводы\n\n> Добавление белка из пищевых продуктов животного происхождения обычно увеличивает вес и массу тела к длине у детей, но оказывает более ограниченное влияние на другие результаты роста, такие как достигнутый рост.","title":"Влияние добавок животного белка у матерей, недоношенных и доношенных детей на результаты роста в детстве: систематический обзор и метаанализ рандомизированных исследований","subreddit_name_prefixed":"r/ScientificNutrition","ups":5,"created":1566515019,"link_flair_background_color":"#dadada","id":"ctynxi","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/ctynxi/effects_of_animal_protein_supplementation_of/","url":"https://www.reddit.com/r/ScientificNutrition/comments/ctynxi/effects_of_animal_protein_supplementation_of/","created_utc":1566486219}