{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"ScientificNutrition","selftext":"","title":"Alternate Day Fasting Improves Physiological and Molecular Markers of Aging in Healthy, Non-obese Humans [Stekovic et al., 2019]","subreddit_name_prefixed":"r/ScientificNutrition","ups":182,"created":1567552044,"link_flair_background_color":"#dadada","id":"cz63uy","author":{"name":"dreiter"},"permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/","url":"https://www.ncbi.nlm.nih.gov/pubmed/31471173","created_utc":1567523244,"replies":[{"ups":1,"link_id":"t3_cz63uy","id":"eyw857o","author":"AutoModerator","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"Welcome to /r/ScientificNutrition. Please read our [Posting Guidelines](https://www.reddit.com/r/ScientificNutrition/comments/bqi550/posting_guidelines/?st=jvv3gorm&sh=09611887) before you contribute to this submission.\nJust a reminder that every link submission must have a summary in the comment section, and every top level comment must provide sources to back up any claims.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ScientificNutrition) if you have any questions or concerns.*","body_html":"<div class=\"md\"><p> Добро пожаловать в <a href=\"/r/ScientificNutrition\">/ r / ScientificNutrition</a> . Пожалуйста, ознакомьтесь с нашими <a href=\"https://www.reddit.com/r/ScientificNutrition/comments/bqi550/posting_guidelines/?st=jvv3gorm&amp;sh=09611887\">Правилами размещения,</a> прежде чем вносить свой вклад в это представление. Просто напоминание о том, что каждая отправка ссылки должна иметь сводку в разделе комментариев, а каждый комментарий верхнего уровня должен содержать источники для подтверждения любых утверждений. </p><p> <em>Я бот, и это действие было выполнено автоматически. Пожалуйста, <a href=\"/message/compose/?to=/r/ScientificNutrition\">свяжитесь с модераторами этого subreddit,</a> если у вас есть какие-либо вопросы или проблемы.</em> </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyw857o/","name":"t1_eyw857o","created":1567552045,"created_utc":1567523245,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":25,"link_id":"t3_cz63uy","id":"eyw8n0e","author":"dreiter","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"[Full paper](https://www.cell.com/cell-metabolism/pdfExtended/S1550-4131%2819%2930429-2)\n\n>Abstract: Caloric restriction and intermittent fasting are known to prolong life- and healthspan in model organisms, while their effects on humans are less well studied. In a randomized controlled trial study (ClinicalTrials.gov identifier: NCT02673515), we show that **4 weeks of strict alternate day fasting (ADF) improved markers of general health in healthy, middle-aged humans while causing a 37% calorie reduction on average.** No adverse effects occurred even after >6 months. **ADF improved cardiovascular markers, reduced fat mass (particularly the trunk fat), improving the fat-to-lean ratio, and increased β-hydroxybutyrate, even on non-fasting days. On fasting days, the pro-aging amino-acid methionine, among others, was periodically depleted, while polyunsaturated fatty acids were elevated. We found reduced levels sICAM-1 (an age-associated inflammatory marker), low-density lipoprotein, and the metabolic regulator triiodothyronine after long-term ADF.** These results shed light on the physiological impact of ADF and supports its safety. ADF could eventually become a clinically relevant intervention.\n\nConflicts:\n\n>H.S. received unrestricted research grants from Astra Zeneca, Merck, Sharp & Dhome, and Sanofi-Aventis\n\nThis study has an added interesting factor in that they compared a control, a 'short-term' ADF group (4 weeks), and a 'long-term' ADF group (6 months).  The other component that I was very happy to see is that this was a 'true' ADF study and not a semi-ADF like those that comes from Varady's group.\n\n>We conducted a prospective cohort study with an embedded\nrandomized controlled trial (Figure 1). For the cohort trial, 42\ninterested people were assessed for eligibility and 12 of them\ndid not meet the inclusion criteria (Figure 1A). We thus investigated 30 subjects that had performed ADF for at least 6 months\n(‘‘>6 months of ADF’’ group) prior to the study start and\ncompared them to 60 healthy control subjects. Subsequently,\nthe control group entered an RCT where subjects were randomized 1:1 to either a group conducting ADF for 4 weeks or to a\ncontrol group (remaining on their usual diet) to study shortterm effects of ADF (Figure 1B). In both the >6 months and\n4 weeks of ADF groups, participants were instructed to eat every\nsecond-day ad libitum, but to completely exclude solid and\nliquid foods and caloric beverages on the fast days.","body_html":"<div class=\"md\"><p> <a href=\"https://www.cell.com/cell-metabolism/pdfExtended/S1550-4131%2819%2930429-2\">Полная статья</a> </p><blockquote><p> Резюме: Известно, что ограничение калорийности и прерывистое голодание продлевают жизненный цикл и продолжительность жизни у модельных организмов, в то время как их влияние на человека изучено не так хорошо. В рандомизированном контролируемом исследовании (ClinicalTrials.gov identifier: NCT02673515) мы показываем, что <strong>4 недели строгого чередования с дневным голоданием (ADF) улучшали показатели общего состояния здоровья у здоровых людей среднего возраста, вызывая в среднем 37% -ное снижение калорийности.</strong> Никаких побочных эффектов не наблюдалось даже после&gt; 6 месяцев. <strong>ADF улучшил сердечно-сосудистые маркеры, уменьшил жировую массу (особенно туловищный жир), улучшил соотношение жира и худой и увеличил β-гидроксибутират, даже в дни без поста. В постные дни аминокислота метионин, способствующая старению, среди прочего, периодически истощалась, а полиненасыщенные жирные кислоты повышались. Мы обнаружили снижение уровня sICAM-1 (возрастной воспалительный маркер), липопротеинов низкой плотности и регулятора метаболизма трийодтиронина после длительного АДФ.</strong> Эти результаты проливают свет на физиологическое воздействие ADF и подтверждают его безопасность. АДФ может в конечном итоге стать клинически значимым вмешательством. </p></blockquote><p> конфликты: </p><blockquote><p> HS получил неограниченные исследовательские гранты от Astra Zeneca, Merck, Sharp &amp; Dhome и Sanofi-Aventis. </p></blockquote><p> Это исследование имеет еще один интересный фактор в том, что они сравнили контрольную, «краткосрочную» группу ADF (4 недели) и «долгосрочную» группу ADF (6 месяцев). Другой компонент, который я был очень рад видеть, состоит в том, что это было «настоящее» исследование ADF, а не полу-ADF, как те, что происходят из группы Варади. </p><blockquote><p> Мы провели проспективное когортное исследование со встроенным рандомизированным контролируемым исследованием (Рисунок 1). В когортном исследовании 42 заинтересованных лица были оценены на соответствие критериям, и 12 из них не соответствовали критериям включения (Рисунок 1А). Таким образом, мы исследовали 30 субъектов, которые выполняли ADF в течение по крайней мере 6 месяцев («&gt; 6 месяцев ADF») до начала исследования, и сравнили их с 60 здоровыми контрольными субъектами. Впоследствии контрольная группа вошла в РКИ, где субъекты были рандомизированы 1: 1 либо в группу, проводящую АДФ в течение 4 недель, либо в контрольную группу (оставшуюся на их обычной диете) для изучения краткосрочных эффектов АДФ (рис. 1В). Как в группах ADF&gt; 6 месяцев, так и в течение 4 недель участникам было предложено есть каждый второй день ad libitum, но полностью исключать твердую и жидкую пищу и калорийные напитки в постные дни. </p></blockquote></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyw8n0e/","name":"t1_eyw8n0e","created":1567552393,"created_utc":1567523593,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":11,"link_id":"t3_cz63uy","id":"eyxy0jv","author":"Bill_Lagakos","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"that rate of lean mass loss was quite high -- 45% of the total weight loss was lean mass?? best would be 0% but usually see at least <35% (especially when combined with exercise)  [https://caloriesproper.com/5-2-adf-and-etrf-place-your-bets/](https://caloriesproper.com/5-2-adf-and-etrf-place-your-bets/)","body_html":"<div class=\"md\"><p> что скорость потери мышечной массы была довольно высокой - 45% от общей потери веса составляли мышечной массы? Лучше всего будет 0%, но обычно видят не менее 35% (особенно в сочетании с физическими упражнениями) <a href=\"https://caloriesproper.com/5-2-adf-and-etrf-place-your-bets/\">https://caloriesproper.com/5-2-adf-and-etrf-place-your-bets/</a> </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyxy0jv/","name":"t1_eyxy0jv","created":1567594317,"created_utc":1567565517,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":11,"link_id":"t3_cz63uy","replies":[{"ups":1,"link_id":"t3_cz63uy","id":"f1g6j0y","author":"Davismism","parent_id":"t1_f1ejfhh","subreddit_id":"t5_qgptn","body":"Why lie","body_html":"<div class=\"md\"><p> Зачем лгать </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/f1g6j0y/","name":"t1_f1g6j0y","created":1569489773,"created_utc":1569460973,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"ez8pbky","author":"Frazzle-bazzle","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"Just commenting to say that I understand about half of this stuff but I am very grateful and enlightened to have been a ‘fly-on-the-wall’ to witness this discussion.  One of the great beautifies of Reddit... The opportunity to walk into any “living room” and eavesdrop on any conversation!","body_html":"<div class=\"md\"><p> Просто комментируя, чтобы сказать, что я понимаю примерно половину этого материала, но я очень благодарен и просвещен, что был «мухомором», чтобы засвидетельствовать это обсуждение. Одно из величайших украшений Reddit ... Возможность зайти в любую «гостиную» и подслушать любой разговор! </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/ez8pbky/","name":"t1_ez8pbky","created":1567781167,"created_utc":1567752367,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":5,"link_id":"t3_cz63uy","id":"ez05k1l","author":"wildrover2","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"The metabolome stuff is intriguing but this seems to be another study that mainly demonstrates that IF/ADF is as effective as calorie restriction (CR) and that it's not harmful. There is very rarely an experimental group that does ADF but eats isocalorically with a control and/or another ADF group, so it's difficult to separate the results of ADF from the results of CR. Each arm only had 30 subjects [which is not a lot](https://www.ncbi.nlm.nih.gov/pubmed/18633328) considering the number of measurements they took.","body_html":"<div class=\"md\"><p> Метаболом является интригующим, но, похоже, это еще одно исследование, которое в основном демонстрирует, что IF / ADF так же эффективен, как ограничение калорий (CR), и что это не вредно. Существует очень редко экспериментальная группа, которая принимает ADF, но ест изокалорически с контрольной и / или другой группой ADF, поэтому трудно отделить результаты ADF от результатов CR. В каждой руке было только 30 предметов, <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/18633328\">что не так много,</a> учитывая количество проведенных измерений. </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/ez05k1l/","name":"t1_ez05k1l","created":1567660036,"created_utc":1567631236,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":4,"link_id":"t3_cz63uy","replies":[{"ups":2,"link_id":"t3_cz63uy","replies":[{"ups":2,"link_id":"t3_cz63uy","id":"f02jv6h","author":"Pennynow","parent_id":"t1_f019jya","subreddit_id":"t5_qgptn","body":"Thanks","body_html":"<div class=\"md\"><p> Благодарность </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/f02jv6h/","name":"t1_f02jv6h","created":1568361226,"created_utc":1568332426,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"ezzk4nz","author":"Pennynow","parent_id":"t1_eyyxvzl","subreddit_id":"t5_qgptn","body":"What’s an endotoxin? I googled it but I don’t understand how it relates to fasting","body_html":"<div class=\"md\"><p> Что такое эндотоксин? Я гуглил это, но я не понимаю, как это связано с постом </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/ezzk4nz/","name":"t1_ezzk4nz","created":1568317001,"created_utc":1568288201,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2},{"ups":1,"link_id":"t3_cz63uy","replies":[{"ups":5,"link_id":"t3_cz63uy","id":"eyz79a6","author":"KingKronx","parent_id":"t1_eyz1r8a","subreddit_id":"t5_qgptn","body":">\nI do not believe that has ever been shown in human trials. However, we have many trials showing benefits of CR on various health outcomes.\n\nMostly because it would be unethical to wipe someone's microbiome out with antibiotics lol. And we don't know enough about the microbiome to precisely know how to alter it :(. Unfortunately we are far. I may agree with you that currently the best method to avoid endotoxin for the general population is CR.\n\n>However, we have many trials showing benefits of CR on various health outcomes.\n\nLike? As I said, in CR you reduce everything you eat, including the bad stuff. When you have a shitty diet and go vegan/keto, whatever, you remove sugar, processed foods, oils, etc so you see benefits.\n\nThe problem is after you take out the big issues, what is left is smaller details (let me just pause and explain that I'm not saying you HAVE to access these issues, Don't take me wrong. You can be perfectly healthy as is, but for those who's life purpose is biohacking, living to 130, etc, these details matter. Again, I say this for those who want to work with what we've got and who's ultimate goal is lifespan)\n\nFirst example that came to mind: antinutrients perhaps wouldn't be an issue for someone following a SAD diet, as they need to access a lot of things first, but for someone on an ultra clean healthy diet, it MAY cause issues. Since you get to a point where you can't stop eating certain things, you have to either reduce calories, fast, etc.\n\n>guess that comes into the distinction of calorie restriction vs. balance vs. excess. If your usual calorie intake results in fat gain, then CR is useful. If you are managing a healthy bodyfat level already, then further CR is unlikely to be very beneficial\n\nAgreed\n\n>If I am understanding you right, you are saying that CR results in A, B, C effects in the body, and if you can achieve A, B, C effects without CR then you will be doing just as well as someone who uses CR to achieve those effects. I think that's a plausible theory, but difficult to achieve free-living subjects. Would make for a very interesting study though.\n\nIndeed. I like mice studies because variables are reduced and genetic impacts can be accessed to 2,3,6 generation ahead. But it's undeniable it has it's limitations. Currently, I think we don't have enough knowledge, technology or funding to produce the evidence needed for certain theories. Not all hope is lost, for those who are interested, like me, in the subject, what is left is self experimentation. (Which has it's flaws aswell).","body_html":"<div class=\"md\"><blockquote><p> Я не верю, что когда-либо было показано на человеческих испытаниях. Тем не менее, у нас есть много испытаний, показывающих преимущества CR на различные результаты в отношении здоровья. </p></blockquote><p> Главным образом потому, что было бы неэтично уничтожать чей-то микробиом антибиотиками. И мы не знаем достаточно о микробиоме, чтобы точно знать, как его изменить :(. К сожалению, мы далеко. Я могу согласиться с вами, что в настоящее время лучшим способом избежать эндотоксина для населения в целом является CR. </p><blockquote><p> Тем не менее, у нас есть много испытаний, показывающих преимущества CR на различные результаты в отношении здоровья. </p></blockquote><p> Подобно? Как я уже сказал, в ЧР вы сокращаете все, что едите, включая плохие вещи. Если у вас дерьмовая диета и вы переходите на веганство / кето, что угодно, вы убираете сахар, обработанные продукты, масла и т. Д., Чтобы увидеть преимущества. </p><p> Проблема в том, что после того, как вы решите большие проблемы, вам останутся мелкие детали (позвольте мне сделать паузу и объяснить, что я не говорю, что у вас есть доступ к этим проблемам, не поймите меня неправильно. Вы можете быть совершенно здоровы, как есть, но для тех, чья жизненная цель - биохакинг, жизнь до 130 и т. д., эти детали имеют значение. Опять же, я говорю это для тех, кто хочет работать с тем, что у нас есть, и чья конечная цель - это продолжительность жизни) </p><p> Первый пример, который пришел в голову: антинутриенты, возможно, не будут проблемой для кого-то, соблюдающего диету SAD, так как им нужно сначала получить доступ ко многим вещам, но для кого-то на ультрачистой здоровой диете это МОЖЕТ вызвать проблемы. Так как вы попадаете в точку, в которой вы не можете перестать есть определенные вещи, вам нужно либо сократить калории, быстро и т. Д. </p><blockquote><p> Угадайте, что входит в различие между ограничением калорий и балансом и избытком. Если ваше обычное потребление калорий приводит к увеличению жира, тогда CR будет полезным. Если вы уже управляете здоровым уровнем жировых отложений, дальнейшее ЧР вряд ли будет очень полезным </p></blockquote><p> Согласовано </p><blockquote><p> Если я вас правильно понимаю, вы говорите, что CR приводит к эффектам A, B, C в организме, и если вы можете достичь эффектов A, B, C без CR, то вы будете действовать так же, как тот, кто использует CR для достижения этих эффектов. Я думаю, что это правдоподобная теория, но трудно достичь свободно живущих предметов. Сделал бы для очень интересного исследования все же. </p></blockquote><p> Верно. Мне нравятся исследования на мышах, потому что переменные уменьшены, и генетическое воздействие может быть достигнуто до 2,3,6 поколения вперед. Но нельзя отрицать, что имеет свои ограничения. В настоящее время, я думаю, у нас недостаточно знаний, технологий или финансирования, чтобы предоставить доказательства, необходимые для определенных теорий. Не вся надежда потеряна для тех, кто интересуется, как и я, этой темой, и остается эксперимент с самим собой. (У которого тоже есть свои недостатки). </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyz79a6/","name":"t1_eyz79a6","created":1567639989,"created_utc":1567611189,"subreddit_name_prefixed":"r/ScientificNutrition","depth":4}],"id":"eyyywu3","author":"KingKronx","parent_id":"t1_eyyxvzl","subreddit_id":"t5_qgptn","body":">The study you quoted shows 'calorie restriction good' and 'endotoxins bad.'\n\nIt didn't necessarily say calorie restrictions is good. The point is the reason calorie restriction is good is because it reduces endotoxin. \nEdit: one of the reason*\n\n>Simply because excess endotoxins can prevent the beneficial effects of calorie restriction does not mean that calorie restriction is not beneficial?\n\nThe point is there is no benefit to caloric restriction itself, as a microbiome devoided of endotoxin has the same effect without CR. My point is CR persay is useless. All the benefits are atributed to other things, which you can achieve while also having the benefits of higher caloric intake (increased Metabolism, higher nutrient consumption, etc)\n\nFor example, another dietary  recommendation that is done either by itself or is a consequence of caloric restrictions is lower protein intake. Which actually just implies in a lower intake of inflammatory aminoacids (you just need to balance them the bigger the intake, rather than exclude them) is one of them. Ingesting glycine, proline, arginine, etc has been shown to have the same benefits (I'll see if I can find the study and edit it in).","body_html":"<div class=\"md\"><blockquote><p> В исследовании, которое вы цитировали, показано «хорошее ограничение калорий» и «плохие эндотоксины». </p></blockquote><p> Это не обязательно говорит, что ограничения калорий это хорошо. Дело в том, что причина ограниченности калорий хороша в том, что она уменьшает эндотоксин. Редактировать: одна из причин * </p><blockquote><p> Просто потому, что избыток эндотоксинов может предотвратить полезные эффекты ограничения калорий, не означает, что ограничение калорий не является полезным? </p></blockquote><p> Дело в том, что само ограничение калорий не приносит пользы, поскольку микробиом, лишенный эндотоксина, имеет тот же эффект без CR. Моя точка зрения в том, что Ч.Р. Все преимущества связаны с другими вещами, которые вы можете достигнуть, в то же время пользуясь преимуществами более высокого потребления калорий (увеличение метаболизма, увеличение потребления питательных веществ и т. Д.) </p><p> Например, другая диетическая рекомендация, которая выполняется либо сама по себе, либо является следствием ограничения калорийности, - это снижение потребления белка. Что на самом деле подразумевает меньшее потребление воспалительных аминокислот (вам просто необходимо сбалансировать их, чем больше потребление, чем исключать их), это одна из них. Было показано, что прием глицина, пролина, аргинина и т. Д. Имеет те же преимущества (я посмотрю, смогу ли я найти исследование и отредактировать его). </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyyywu3/","name":"t1_eyyywu3","created":1567634313,"created_utc":1567605513,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"eyysmsy","author":"KingKronx","parent_id":"t3_cz63uy","subreddit_id":"t5_qgptn","body":"I honestly don't buy this whole caloric restriction/Fasting stuff.\n\nhttps://www.sciencedirect.com/science/article/pii/S1550413118305060?via=ihub\n\nThe study found that reducing calories by about 40% led to changes in the microbiome that resulted in less endotoxin (LPS) synthesis and release in the bloodstream. As a result, the fasted animals had less fat mass while preserved lean mass and at the same time improved insulin sensitivity. Doing a fecal transplant from the fasted mice to naive mice provided the same benefits as CR while keeping their food intake unchanged. Conversely, administering endotoxin (LPS) to the fasted mice quickly reversed the benefits of CR and restored the mice to their previous levels of \"health\". Perhaps even more importantly, the study found that mice with higher levels of endotoxin (LPS) did NOT benefit from caloric restriction","body_html":"<div class=\"md\"><p> Я, честно говоря, не покупаю все это ограничение калорий / поста. </p><p> <a href=\"https://www.sciencedirect.com/science/article/pii/S1550413118305060?via=ihub\">https://www.sciencedirect.com/science/article/pii/S1550413118305060?via=ihub</a> </p><p> Исследование показало, что снижение калорий примерно на 40% привело к изменениям в микробиоме, что привело к уменьшению синтеза и высвобождения эндотоксина (ЛПС) в кровоток. В результате голодные животные имели меньшую жировую массу при сохранении мышечной массы и в то же время улучшали чувствительность к инсулину. Выполнение фекальной трансплантации от голодных мышей к наивным мышам давало те же преимущества, что и CR, сохраняя при этом потребление пищи без изменений. И наоборот, введение эндотоксина (LPS) голодным мышам быстро обратило преимущества CR и вернуло мышкам прежний уровень «здоровья». Возможно, еще более важно то, что исследование показало, что мыши с более высоким уровнем эндотоксина (LPS) НЕ извлекали выгоду из ограничения калорий. </p></div>","permalink":"/r/ScientificNutrition/comments/cz63uy/alternate_day_fasting_improves_physiological_and/eyysmsy/","name":"t1_eyysmsy","created":1567629429,"created_utc":1567600629,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0}]}