{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Краткая статья, в которой освещается часто упускаемое из виду влияние ди / полипептидов в прошлом на их вклад в общее потребление белка и продуктов, в которых они в изобилии. Это, наряду с оценками PDCAAS / DIAAS, еще более усложняет замену белков растительного происхождения на животных.\n\n\n\n [https://www.feedstuffs.com/feedstuffs-foodlink/amino-acids-plant-versus-animal-sourced-foods-examined]]<span translate = \"no\"> (https://www.feedstuffs.com/ корма-Foodlink / амино-кислота-растение-противы-животные-источники-продукты-исследованные) </ SPAN>\n\n\\> Растения являются важными источниками питательных веществ в рационе человека, однако, несмотря на некоторые исследования зерновых культур, бобовых, клубней и орехов, данные о содержании аминокислот в этих растительных источниках являются неполными и весьма противоречивыми, возможно, из-за того, что использовались различные аналитические методы. среди разных лабораторий.\n\n\\> В недавнем исследовании (Hou et al., 13 июня 2019 г. * Аминокислоты *. Doi: 10.1007 / s00726-019-02751-0) исследователи из отдела животных исследований в Техасском университете A & M использовали высокопроизводительные методы жидкостной хроматографии для анализа содержания свободных и пептидно-связанных аминокислот в основных продуктах питания растительного происхождения: кукурузном зерне, арахисе, фисташковых орехах, картофеле, батате, пшеничной муке, соевых бобах и полированном белом рисе. Эта работа последовала за предыдущим сообщением о составе аминокислот и пептидов в говядине (Wu et al., 2016. * Journal of Animal Science *. 94: 2603-2613).\n\n\\> По сравнению с говядиной, пищевые продукты растительного происхождения, как правило, содержат гораздо меньшее содержание глицина, пролина, лизина, метионина плюс цистеина, треонина и триптофана, аминокислот, которые очень важны для питания и здоровья человека.\n\n\\> Следует отметить, что таурин и креатин (метаболит аргинина, глицина и метионина), карнозин (дипептид) и ансерин (дипептид), которые в изобилии содержатся в говядине, были обнаружены в продуктах растительного происхождения. , Исследователи отметили, что таурин, креатин и дипептиды оказывают важное антиоксидантное действие и имеют решающее значение для здоровья и функций органов человека, особенно глаз, сердца и скелетных мышц.\n\n\\> Кроме того, 4-гидроксипролин, который в изобилии содержится в мясе и обладает мощным антиоксидантным действием в кишечнике, был едва детектируемым или незначительным в продуктах растительного происхождения.\n\n\\> Таким образом, исходя из современной концепции аминокислотного питания, результаты, показывающие правильную пропорцию пищевых продуктов растительного и животного происхождения, вероятно, наиболее желательны для оптимизации питания и здоровья человека.\n\n\n\nRef исследования:\n\n [Состав свободных и пептидно-связанных аминокислот в говяжьем киле, пояснице и округлых отрубах] <span translate = \"no\"> (https://academic.oup.com/jas/article/94/6/2603/ 4702294) </ SPAN>\n\n [Состав полиаминов и аминокислот в пищевых продуктах растительного происхождения для потребления человеком] <span translate = \"no\"> (https://link.springer.com/article/10.1007%2Fs00726-019-02751-0) </ span >","title":"Аминокислоты в пищевых продуктах растительного и животного происхождения","subreddit_name_prefixed":"r/ScientificNutrition","ups":28,"created":1567810888,"link_flair_background_color":"#dadada","id":"d0ht47","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/d0ht47/amino_acids_in_plant_versus_animalsourced_foods/","url":"https://www.reddit.com/r/ScientificNutrition/comments/d0ht47/amino_acids_in_plant_versus_animalsourced_foods/","created_utc":1567782088}