{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"https://jamanetwork.com/journals/jamanetworkopen/fullarticle/2734805\n\n> Вопрос Существует ли связь между низким уровнем холестерина в сыворотке крови и степенью повреждения периферических нервов, что было оценено с помощью магнитно-резонансной нейрографии у пациентов с диабетом 2 типа?\n\n> Результаты В этом перекрестном когортном исследовании 100 взрослых с диабетом 2 типа количество поражений нерва было отрицательно связано с уровнем общего холестерина в сыворотке.\n\n> Значение Полученные данные свидетельствуют о том, что снижение уровня холестерина в сыворотке у пациентов с диабетом 2 типа связано с диабетической полинейропатией.\n\n> Абстрактный\nВажность Снижение уровня холестерина в сыворотке является хорошо известным методом лечения дислипидемии у пациентов с диабетом 2 типа (СД2). Однако поражения нерва у пациентов с СД2 увеличиваются при снижении уровня холестерина в сыворотке, что позволяет предположить, что снижение уровня холестерина в сыворотке связано с диабетической полинейропатией (ДПН) у пациентов с СД2.\n\n> Цель Изучить, существует ли связь между уровнями холестерина в сыворотке и поражениями периферических нервов у пациентов с СД2 с ДПН и без него.\n\n> Дизайн, обстановка и участники Это одноцентровое перекрестное проспективное когортное исследование проводилось с 1 июня 2015 года по 31 марта 2018 года. Наблюдатели были слепы к клиническим данным. Всего было подано 256 участников, из которых 156 были исключены. В общей сложности 100 участников согласились пройти магнитно-резонансную нейрографию правой ноги на кафедре нейрорадиологии и клинической, серологической и электрофизиологической оценки на кафедре эндокринологии, Университетская клиника Гейдельберга, Гейдельберг, Германия.\n\n> Экспозиции Количественная оценка диаметра нерва и нагрузки на эквивалент липидного эквивалента (LEL) с последующим анализом всех полученных клинических и серологических данных с использованием 3,0-Т-магнитно-резонансной нейрографии правой ноги с 3-мерной реконструкцией седалищного нерва.\n\n> Основные результаты и меры Первичным результатом была нагрузка и расширение поражения. Вторичными исходами были клинические, серологические и электрофизиологические данные.\n\n> Результаты В исследовании приняли участие 100 участников с СД2 (средний возраст [SD], 64,6 [0,9] года; 68 [68,0%] мужчин). Нагрузка НПВ положительно коррелировала со средней площадью поперечного сечения нерва (r = 0,44; P <0,001) и максимальной длиной поражения (r = 0,71; P <0,001). Нагрузка LEL была отрицательно связана с общим уровнем холестерина в сыворотке (r = -0,41; P <0,001), уровнем холестерина липопротеинов высокой плотности (r = -0,30; P = 0,006), уровнем холестерина липопротеинов низкой плотности (r = -0,33; P = 0,003), скорости нервной проводимости большеберцовой кости (r = -0,33; P = 0,01) и малоберцовой кости (r = -0,51; P <0,001) и амплитуды нервной проводимости большеберцовой кости (r = -0,31; P = 0,02) и малоберцовые (r = -0,28; P = 0,03) нервы.\n\n> Выводы и значимость. Полученные данные свидетельствуют о том, что снижение уровня холестерина в сыворотке крови у пациентов с СД2 и ДПН связано с более высоким количеством поражений нерва и снижением скорости и амплитуды нервной проводимости. Эти данные могут иметь отношение к новым методам лечения, которые способствуют агрессивному снижению уровня холестерина в сыворотке крови у пациентов с СД2.\n\n\nИз обсуждения:\n\n> Вместо этого наши результаты согласуются с результатами предыдущих исследований15,17,21,29,30, которые показали, что прием статинов и снижение уровня холестерина в сыворотке связаны с невропатическими симптомами, повреждением микрососудов и ускоренным ухудшением периферических нервные волокна. Потенциальное объяснение ассоциаций, обнаруженных в нашей когорте, может заключаться в том, что снижение уровня холестерина в сыворотке ухудшает регенерацию периферических нервов, поскольку холестерин не может вырабатываться в аксонах и, следовательно, должен поставляться в кончики нейритов и соседние клетки Шванна из регенерирующих аксонов либо посредством переноса аксонов, либо посредством внешнего поставка через HDL-C и LDL-C.14,18,31,32\n\nОграничения :\nЭто исследование, генерирующее гипотезы, ограничено тем фактом, что были получены только данные поперечного сечения, что исключает продольный анализ. Кроме того, наша когорта не была одинаково сбалансирована с участниками мужского и женского пола, что не позволяет проводить анализ данных по полу. Из-за большого количества измеренных факторов размер выборки из 100 участников исключает многомерный анализ всех полученных факторов. Тем не менее, наши данные соответствуют недавно опубликованным продольным данным англо-датско-голландского исследования интенсивного лечения диабета в первичной медицинской помощи (ADDITION), которое показало, что низкие уровни HDL-C, общего холестерина в сыворотке и LDL- С были связаны с ухудшением DPN.30","title":"Уровни холестерина в сыворотке и повреждение периферических нервов при диабете 2 типа","subreddit_name_prefixed":"r/ScientificNutrition","ups":6,"created":1567977063,"link_flair_background_color":"","id":"d1api0","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/d1api0/serum_cholesterol_levels_and_peripheral_nerve/","url":"https://www.reddit.com/r/ScientificNutrition/comments/d1api0/serum_cholesterol_levels_and_peripheral_nerve/","created_utc":1567948263}