{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Аннотация\n\nСвязь потребления яиц с общей ишемической болезнью сердца (ИБС) и смертностью от инсульта плохо изучена. Мы проспективно оценили связь между общей, ИБС и смертностью от инсульта с потреблением яиц, используя случайно выбранную выборку взрослых в США. Затем мы проверили эти результаты в рамках мета-анализа и систематического обзора всех доступных предполагаемых результатов. Мы оценили среднее значение кардиометаболических факторов риска при приеме яиц. Мы провели анализ на основе данных национальных обследований здоровья и питания (NHANES; 1999-2010). В NHANES был установлен жизненный статус до 31 декабря 2011 года. Модели регрессии пропорционального риска Кокса использовались для связи базового потребления яиц со смертностью от всех причин и от причин. Также проводился поиск в базах данных PubMed, Scopus, Web of Science и Google Scholar (до декабря 2017 года). Для синтеза количественных данных использовались метод Дерзимона-Лайрда и общие методы обратной дисперсии. В целом, 23 524 участника из NHANES были включены (средний возраст 47,7 лет; 48,7% были мужчины). При увеличении потребления яиц усредненные средние уровни кардиометаболических факторов риска ухудшились. Скорректированная логистическая регрессия показала, что участники в самой высокой категории потребления яиц имели больший риск диабета (СД2; 30%) и гипертонии (HTN; 48%). Что касается общей смертности и смертности от ИБС, многовариантная регрессия Кокса в полностью скорректированной модели не показала связи у мужчин и женщин. У мужчин потребление яиц имело обратную (66%) связь со смертностью от инсульта, хотя эта связь была незначительной среди женщин. Результаты объединения данных из опубликованных проспективных исследований также показали отсутствие связи между ИБС и общей смертностью с потреблением яиц, тогда как мы наблюдали обратную (28%) связь между потреблением яиц и смертностью от инсульта. Эти результаты были надежными после анализа чувствительности. Согласно нашим результатам, потребление яиц не было связано с ИБС и общей смертностью, тогда как было связано с более низким риском смертности от инсульта. Потребление яиц было связано с T2DM, HTN, C-реактивным белком и маркерами гомеостаза глюкоза / инсулин. Если эта информация подтверждена в клинических испытаниях (причинно-следственная связь), эта информация может найти применение для общепопуляционных мер здравоохранения. Ключевые моменты обучения Нет связи между общей и смертностью от ИБС с потреблением яиц у мужчин и женщин. У мужчин потребление яиц имело обратную связь со смертностью от инсульта, в то время как эта связь была незначительной среди женщин. Результаты объединения данных из опубликованных проспективных исследований также показали отсутствие связи между ИБС и общей смертностью с потреблением яиц, тогда как мы наблюдали обратную связь между потреблением яиц и смертностью от инсульта.\n\n\n\n[https://sci-hub.tw/https://www.ncbi.nlm.nih.gov/pubmed/31173548]<span translate = \"no\"> (https://sci-hub.se/https: //www.ncbi.nlm.nih.gov/pubmed/31173548) </ SPAN>","title":"Потребление яиц и риск общей и причинно-специфической смертности: индивидуальное когортное исследование и объединение проспективных исследований от имени группы по мета-анализу липидов и артериального давления (LBPMC) (2019)","subreddit_name_prefixed":"r/ScientificNutrition","ups":11,"created":1568332845,"link_flair_background_color":"#dadada","id":"d39zxm","author":{"name":"zonyz"},"permalink":"/r/ScientificNutrition/comments/d39zxm/egg_consumption_and_risk_of_total_and/","url":"https://www.reddit.com/r/ScientificNutrition/comments/d39zxm/egg_consumption_and_risk_of_total_and/","created_utc":1568304045}