{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"* Тенденции в отношении потребления углеводов, белков и жиров и качества рациона среди взрослого населения США, 1999-2016 *\n\n«Вопрос: Каковы были тенденции потребления углеводов, жиров и белков среди взрослого населения США с 1999 по 2016 год?\n\nРезультаты В этом репрезентативном в стране серийном перекрестном исследовании, в котором участвовало 43996 взрослых, было отмечено снижение количества некачественных углеводов (в первую очередь, добавленного сахара) и увеличение количества высококачественных углеводов (главным образом, цельных зерен), растительного белка (главным образом, цельного зерна и орехов) ) и полиненасыщенных жиров. Тем не менее, 42% потребления энергии по-прежнему было получено из углеводов низкого качества, а потребление насыщенных жиров оставалось выше 10% энергии.\n\nЗначение Состав питательных макронутриентов среди взрослого населения США улучшился, но сохраняется высокий уровень потребления некачественных углеводов и насыщенных жиров.\n\nАннотация\nВажность Изменения в экономике, политике в области питания и методах обработки пищевых продуктов могут повлиять на потребление питательных макронутриентов и качество рациона. Важно оценивать тенденции в рационе питания, источниках пищи и качестве диеты для информирования политиков.\n\nЦель. Изучить тенденции потребления питательных макронутриентов, источников питания и качества питания среди взрослого населения США.\n\nДизайн, обстановка и участники Последовательный поперечный анализ репрезентативных в США данных о 24-часовом отзыве диетических данных из 9 национальных циклов обследования здоровья и питания (1999-2016 гг.) Среди взрослых в возрасте 20 лет и старше.\n\nЦикл обследования воздействия.\n\nОсновные результаты и показатели Потребление макроэлементов с пищей и их подтипов, источников питания и индекса здорового питания 2015 (диапазон от 0 до 100; более высокие оценки указывают на лучшее качество диеты; минимальная клинически значимая разница не была определена).\n\nРезультаты Было 43996 респондентов (средневзвешенный возраст, 46,9 года; 51,9% женщин). В период с 1999 по 2016 год предполагаемая энергия от общего количества углеводов снизилась с 52,5% до 50,5% (разница -2,02%; 95% ДИ от -2,41% до -1,63%), тогда как общий белок и общий жир увеличились с 15,5%. до 16,4% (разница 0,82%; 95% ДИ 0,67% -0,97%) и от 32,0% до 33,2% (разница 1,20%; 95% ДИ 0,84% -1,55%) соответственно (все P <0,001). для тренда). Расчетная энергия от некачественных углеводов снизилась на 3,25% (95% ДИ, 2,74% -3,75%; P <0,001 для тренда) с 45,1% до 41,8%. Наблюдалось увеличение в оценке энергии из высококачественных углеводов (на 1,23% [95% ДИ, 0,84% -1,61%] с 7,42% до 8,65%), растительного белка (на 0,38% [95% ДИ, 0,28% -0,49%). ] от 5,38% до 5,76%), насыщенные жирные кислоты (на 0,36% [95% ДИ, 0,20% -0,51%] от 11,5% до 11,9%) и полиненасыщенные жирные кислоты (на 0,65% [95% ДИ, 0,56%) -0,74%] с 7,58% до 8,23%) (все P <0,001 для тренда). Оценочный общий индекс здорового питания в 2015 году увеличился с 55,7 до 57,7 (разница 2,01; 95% ДИ 0,86-3,16; P <0,001 для тренда). Тенденции в отношении углеводов высокого и низкого качества в основном отражают более высокую оценку энергии из цельного зерна (0,65%) и снижение предполагаемой энергии из добавленных сахаров (-2,00%), соответственно. Тенденции в растительном белке были связаны главным образом с более высокой оценкой потребления цельного зерна (0,12%) и орехов (0,09%).\n\nВыводы и значимость. С 1999 по 2016 год взрослые в США значительно сократили процент потребления энергии из некачественных углеводов и значительно увеличили процент потребления энергии из высококачественных углеводов, растительного белка и полиненасыщенных жиров. Несмотря на улучшение состава макронутриентов и качества рациона, продолжалось высокое потребление некачественных углеводов и насыщенных жиров ».\n\nhttps://jamanetwork.com/journals/jama/article-abstract/2751719","title":"Американцы едят здоровее, но не здоровы","subreddit_name_prefixed":"r/ScientificNutrition","ups":81,"created":1569629881,"link_flair_background_color":"#dadada","id":"da2p45","author":{"name":"Only8livesleft"},"permalink":"/r/ScientificNutrition/comments/da2p45/americans_are_eating_healthier_but_not_healthy/","url":"https://www.reddit.com/r/ScientificNutrition/comments/da2p45/americans_are_eating_healthier_but_not_healthy/","created_utc":1569601081}