{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"# [Короткоцепочечные жирные кислоты и кетоны непосредственно регулируют симпатическую нервную систему через рецептор 41, связанный с G-белком (GPR41)] <span translate = \"no\"> (https://www.pnas.org/content/108/19/ 8030) </ SPAN>\n\n\n\n \\> Абстрактный\n\n\\> Поддержание энергетического гомеостаза необходимо для жизни, а его нарушение регуляции приводит к различным нарушениям обмена веществ. В условиях сытости млекопитающие используют глюкозу в качестве основного метаболического топлива, а жирные кислоты с короткой цепью (SCFA), образующиеся при бактериальной ферментации толстой кишки пищевых волокон, также вносят значительный вклад в суточную потребность в энергии. В кетогенных условиях, таких как голодание и диабет, кетоновые тела, вырабатываемые в печени из жирных кислот, используются в качестве основных источников энергии. Чтобы сбалансировать потребление энергии, избыток рациона и голодание вызывают увеличение или уменьшение расхода энергии, соответственно, путем регулирования активности симпатической нервной системы (СНС). Регуляция метаболического гомеостаза глюкозой хорошо известна; однако роль SCFA и кетоновых тел в поддержании энергетического баланса остается неясной. Здесь мы показываем, что SCFA и кетоновые тела непосредственно регулируют активность SNS через GPR41, Gi / o-белок-связанный рецептор для SCFA, на уровне симпатического ганглия. GPR41 наиболее часто экспрессировался в симпатических ганглиях у мышей и людей. Пропионат SCFA стимулировал симпатический отток через GPR41. С другой стороны, кетоновое тело, β-гидроксибутират, продуцируемый во время голодания или диабета, подавляло активность SNS путем противодействия GPR41. Фармакологические и миРНК-эксперименты показали, что GPR41-опосредованная активация симпатических нейронов включает передачу сигналов Gβγ-PLCβ-MAPK. Симпатическая регуляция с помощью SCFA и кетоновых тел хорошо коррелирует с их влиянием на потребление энергии. Эти данные подтверждают, что SCFA и кетоновые тела непосредственно регулируют GPR41-опосредованную активность SNS и, таким образом, контролируют энергетические затраты организма на поддержание метаболического гомеостаза.\n\nИз обсуждения:\n\n \\> Поскольку множество физиологических процессов регулируется SNS, взаимодействия SCFA-GPR41, которые регулируют SNS, могут представлять собой центральный механизм для учета влияния диеты, пребиотиков и пробиотиков на гомеостаз тела и могут представлять пути для понимания и потенциального манипулирования физиологией. и болезнь.\n\nКраткий учебник по [Симпатической нервной системе]  (https://www.sciencedaily.com/terms/sympathetic_nervous_system.htm) ","title":"Короткоцепочечные жирные кислоты и кетоны непосредственно регулируют симпатическую нервную систему через G-белок-связанный рецептор 41 (GPR41)","subreddit_name_prefixed":"r/ScientificNutrition","ups":11,"created":1570144440,"link_flair_background_color":"","id":"dcs9le","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/dcs9le/shortchain_fatty_acids_and_ketones_directly/","url":"https://www.reddit.com/r/ScientificNutrition/comments/dcs9le/shortchain_fatty_acids_and_ketones_directly/","created_utc":1570115640}