{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"[Потребление насыщенных жиров в рационе и риск развития инсульта: систематический обзор и метаанализ доза-ответ в проспективных когортных исследованиях] <span translate = \"no\"> (https://www.clinicalkey.com/#!/content/playContent/ 1-S2.0-S0939475319303801 ReturnUrl = HTTPS:?% 2F% 2Flinkinghub.elsevier.com% 2Fretrieve% 2Fpii% 2FS0939475319303801% 3Fshowall% 3Dtrue & ссылающейся =) </ SPAN>\n\nАннотация\n\nИстория вопроса и цели\n\nИз-за результатов конфликтующего исследования, ассоциация насыщенных жирных кислот (SFA) потреблений и риск инсульта остаются спорными. Мы провели метаанализ, чтобы оценить потенциальные зависимости доза-ответ между потреблением SFA и инсультом.\n\nМетоды и результаты\n\nБыли проведены обыск в PubMed, Embase, Центральном регистре контролируемых испытаний Кокрановской библиотеки и Web of Science. Суммарные относительные риски (ОР) самой высокой по сравнению с самой низкой категорией потребления ОТВС и их 95% доверительные интервалы (ДИ) были объединены с помощью моделей случайных эффектов. Линейные или нелинейные оценки доза-эффект были оценены с данными из категорий потребления SFA в каждом исследовании. Четырнадцать исследований, в которых участвовало в общей сложности 598 435 участников, имели право на высокий и низкий метаанализ, а 12 исследований, в которых участвовало в общей сложности 462 268 участников, имели право на оценку зависимости доза-ответ. Более высокое потребление SFA в рационе было связано со снижением общего риска инсульта (ОР 0,87; 95% ДИ 0,78-0,96; I 2 = 37,8%). Была исследована линейная зависимость между SFA и инсультом (P = 0,01), суммарный RR инсульта на 10 г / день увеличения потребления SFA составил 0,94 (95% ДИ, 0,89 - 0,98; P = 0,01).\n\nВывод\n\nЭтот метаанализ дополнительно продемонстрировал, что более высокое потребление диетических SFA связано с более низким риском развития инсульта, и каждые 10 г / день увеличение потребления SFA связано с 6% -ным относительным снижением риска инсульта. Необходимы дальнейшие исследования для изучения влияния определенных типов SFA и различных моделей замены макронутриентов SFA на риск инсульта.\n\nОсобенности\n\n•\nБолее высокое потребление насыщенных жиров в рационе связано с уменьшением общего риска инсульта.\n\n•\nСуществует линейная зависимость доза-ответ между потреблением насыщенных жиров в рационе и риском развития инсульта.\n\n•\nНеобходимо пересмотреть ограничения на потребление насыщенных жиров для будущих рекомендаций по питанию.","title":"Потребление насыщенных жиров в рационе и риск развития инсульта: систематический обзор и метаанализ доза-ответ в проспективных когортных исследованиях","subreddit_name_prefixed":"r/ScientificNutrition","ups":52,"created":1570227536,"link_flair_background_color":"#dadada","id":"dd7zeh","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/dd7zeh/dietary_saturated_fat_intake_and_risk_of_stroke/","url":"https://www.reddit.com/r/ScientificNutrition/comments/dd7zeh/dietary_saturated_fat_intake_and_risk_of_stroke/","created_utc":1570198736}