{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"[Снижение потребления углеводов и жиров связано с повышенным уровнем гемоглобина A1c: данные Национального исследования диеты и питания Великобритании, 2008–2016 гг.] <Span translate = \"no\"> (https://link.springer.com/article/10.1007/ s00394-019-02122-1) </ SPAN>\n\nЦель\n\nДанные о низкоуглеводных диетах с высоким содержанием жиров (LCHF) для профилактики диабета 2 типа (СД2) недостаточны. Мы исследовали, как потребление углеводов связано с распространенностью HbA1c и T2DM в национальном репрезентативном наборе данных обследования.\n\nметоды\n\nМы проанализировали информацию о рационе питания (4-дневные дневники питания) от 3234 человек в возрасте ≥16 лет в восьми волнах Национального обследования диеты и питания Великобритании (2008–2016 годы). Мы рассчитали баллы LCHF (0–20, более высокий балл, указывающий на более низкую% пищевой энергии из углеводов, с взаимно более высоким вкладом жира) и балльные значения диетической ценности Великобритании (DRV) (0–16, основанные на британских диетических рекомендациях). Ассоциации между макроэлементами и показателями диеты и распространенностью диабета были проанализированы (во всей выборке) с использованием многомерной логистической регрессии. Среди тех, у кого нет диабета, анализ между воздействиями и% HbA1c (непрерывный) был проанализирован с использованием многомерной линейной регрессии. Все анализы были скорректированы с учетом возраста, пола, индекса массы тела, этнической принадлежности, статуса курения, общего потребления энергии, социально-экономического статуса и года обследования.\n\nРезультаты\n\nВ общей выборке исследования у 194 (6,0%) был диабет. Среднее потребление составляло 48,0% Е для углеводов и 34,9% Е для общего жира. Каждое 5-процентное снижение E в углеводах и каждое 5-процентное увеличение E в жире было связано с 12% (95% ДИ 0,78–0,99; P = 0,03) и 17% (95% ДИ 1,02–1,33; P = 0,02) выше. шансы диабета соответственно. Каждое увеличение баллов по шкале LCHF на два пункта связано с повышением шансов диабета на 8% (95% ДИ 1,02–1,14; P = 0,006), в то время как не было доказательств связи между показателем DRV и диабетом. Среди участников без диагностированного диабета (n = 3130) каждые 5% E уменьшение углеводов было связано с более высоким% HbA1c на + 0,016% (95% CI 0,004–0,029; P = 0,012), тогда как каждые 5% E увеличивали жиры был связан с более высоким% HbA1c на + 0,029% (95% ДИ 0,015–0,043; P <0,001). Каждое двухточечное увеличение показателя LCHF связано с более высоким% HbA1c на + 0,010% (0,1 ммоль / моль), в то время как каждое двухточечное увеличение показателя DRV связано с более низким% HbA1c на - 0,023% (0,23 ммоль / моль). ).\n\nВыводы\n\nСнижение потребления углеводов и жиров было связано с повышением уровня HbA1c и повышением вероятности диабета. Эти данные не поддерживают низкоуглеродные диеты для профилактики диабета.","title":"Снижение потребления углеводов и жиров связано с повышением уровня гемоглобина A1c: данные Национального исследования диеты и питания Великобритании, 2008–2016 гг.","subreddit_name_prefixed":"r/ScientificNutrition","ups":35,"created":1573128638,"link_flair_background_color":"#dadada","id":"dss62x","author":{"name":"Grok22"},"permalink":"/r/ScientificNutrition/comments/dss62x/lower_carbohydrate_and_higher_fat_intakes_are/","url":"https://www.reddit.com/r/ScientificNutrition/comments/dss62x/lower_carbohydrate_and_higher_fat_intakes_are/","created_utc":1573099838}