{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Что ж, научному питанию уже год (и несколько дней)!\n\nУже 12к подписчиков!\n\nМы хотели воспользоваться этой возможностью, чтобы поблагодарить сообщество. Подводная лодка росла намного быстрее, чем мы когда-либо ожидали, и все это благодаря всем, кто участвует здесь.\n\nСпасибо всем, кто делится интересными исследованиями / мыслями здесь, и всем, кто уважает одну из основных ценностей подпрограммы, проявляя уважение друг к другу.\n\nМы все выигрываем, подходя к этому как к тому, что * мы делимся и учимся вместе как * менталитет сообщества против * я прав, вы ошибаетесь * менталитетом.\n\nМы также хотели воспользоваться этой возможностью, чтобы запросить отзывы сообщества.\n\nЭтот субмарин был создан как нейтральное место для всех диетических точек зрения, чтобы с уважением делиться и обсуждать научные данные, связанные с питанием.\n\nВы чувствуете, что эта цель достигается прямо сейчас? Есть ли что-то, что вы чувствуете, что мы могли бы стать лучше как команда модов, но и как сообщество?\n\nЕсли у кого-то есть конструктивная критика, пожалуйста, дайте нам знать!\n\nЕще раз спасибо,\n\nМод команда.","title":"Сабу исполнился год! Пожалуйста, дайте нам свой отзыв!","subreddit_name_prefixed":"r/ScientificNutrition","ups":108,"created":1573204154,"link_flair_background_color":"","id":"dt7pfu","author":{"name":"oehaut"},"permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/","url":"https://www.reddit.com/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/","created_utc":1573175354,"replies":[{"ups":1,"link_id":"t3_dt7pfu","id":"f6x34xv","author":"oehaut","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Just want to say that we won't be responding to each individual comment, but we will have a mod talk and we'll get back to all of you with a follow-up post on what we can do to keep improving the sub. \n\nThanks for everyone who's chiming in - already lots of good points. \n\nEvery (respectful and helpful) point of view is welcome! The post will be up for a few days still. So please make yourself heard!","body_html":"<div class = \"md\"> <p> Просто хочу сказать, что мы не будем отвечать на каждый отдельный комментарий, но мы поговорим о моде, и мы ответим вам всем с последующим сообщением о том, что мы можем сделать, чтобы продолжать улучшать саб. </Р>\n\n<p> Спасибо всем, кто принимает участие - уже много хороших моментов. </Р>\n\n<p> Любая (уважительная и полезная) точка зрения приветствуется! Пост будет еще несколько дней. Поэтому, пожалуйста, будьте услышаны! </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6x34xv/","name":"t1_f6x34xv","created":1573269658,"created_utc":1573240858,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":41,"link_id":"t3_dt7pfu","id":"f6v6ygy","author":"Cain_Ixion","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Seems to be working pretty solidly so far; while individual commenters or submitters might have their own biases so far as I've observed, that doesn't stop the rest of the community from debating and fostering a general growth of knowledge through informed discussion; ex.: even when a paper might have some bias, it's openly debated instead of any sort of trying to yell down an opposing opinion. I know people can get pretty passionate, but overall I've seen a much higher quality of discourse here than in some other nutrition subreddits.","body_html":"<div class = \"md\"> <p> Кажется, до сих пор работали довольно хорошо; хотя, по моим наблюдениям, отдельные комментаторы или авторы могут иметь свои предубеждения, это не мешает остальной части сообщества обсуждать и стимулировать общий рост знаний посредством информированного обсуждения; пример: даже когда у бумаги может быть какой-то уклон, это открыто обсуждается вместо любой попытки выкрикнуть противоположное мнение. Я знаю, что люди могут стать довольно страстными, но в целом я видел намного более высокое качество беседы здесь, чем в некоторых других пищевых субредитах. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6v6ygy/","name":"t1_f6v6ygy","created":1573207051,"created_utc":1573178251,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":26,"link_id":"t3_dt7pfu","id":"f6v9030","author":"Grok22","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Best sub on Reddit. The mods do a fantastic job on a daily basis.","body_html":"<div class = \"md\"> <p> Лучший саб на Reddit. Моды делают фантастическую работу каждый день. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6v9030/","name":"t1_f6v9030","created":1573208576,"created_utc":1573179776,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":17,"link_id":"t3_dt7pfu","id":"f6vdiq1","author":"EmDashxx","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"I really like the content here. I feel like I’m learning something with each post. Really good stuff!","body_html":"<div class = \"md\"> <p> Мне действительно нравится содержание здесь. Я чувствую, что я изучаю что-то с каждым постом. Действительно хорошие вещи! </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vdiq1/","name":"t1_f6vdiq1","created":1573211982,"created_utc":1573183182,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":11,"link_id":"t3_dt7pfu","replies":[{"ups":1,"link_id":"t3_dt7pfu","id":"f86bmjw","author":"BboyonReddit","parent_id":"t1_f6vuuhi","subreddit_id":"t5_qgptn","body":"This would be great. Maybe mods could direct the conversation by making weekly sticky post with themed discussions? Or alternatively, a new weekly \"casual discussion\" where we can just talk about broad topics rather than focus on a particular study or article.","body_html":"<div class = \"md\"> <p> Это было бы здорово. Может быть, моды могли бы вести беседу, делая еженедельные заметки с тематическими дискуссиями? Или, альтернативно, новое еженедельное «случайное обсуждение», где мы можем просто говорить на широкие темы, а не фокусироваться на конкретном исследовании или статье. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f86bmjw/","name":"t1_f86bmjw","created":1574323178,"created_utc":1574294378,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"f6vjefv","author":"_throwaway94944","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Other commenters have encapsulated most of my thoughts. Things seem to be going swimmingly, and while some posters seem to have a little bit of an agenda it's otherwise fantastic.\n\nOne thing that could potentially be improved, is fostering an attitude where people can ask scientifically minded questions. For example, I'm really damn curious about the effects of sulforaphane and would prefer to try to discuss that with people who are knowledgable rather than trying to establish all the requisite knowledge needed to parse the extant literature.","body_html":"<div class = \"md\"> <p> Другие комментарии комментировали большинство моих мыслей. Кажется, что дела идут гладко, и хотя некоторые плакаты, кажется, имеют небольшую повестку дня, в остальном это фантастика. </P>\n\n<p> Одна вещь, которая потенциально может быть улучшена, это формирование отношения, при котором люди могут задавать вопросы с научной точки зрения. Например, мне чертовски интересно узнать об эффектах сульфорафана, и я предпочел бы попытаться обсудить это с людьми, обладающими знаниями, а не пытаться собрать все необходимые знания, необходимые для анализа существующей литературы. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vjefv/","name":"t1_f6vjefv","created":1573216795,"created_utc":1573187995,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":11,"link_id":"t3_dt7pfu","replies":[{"ups":2,"link_id":"t3_dt7pfu","id":"f6yia7e","author":"istara","parent_id":"t1_f6xzdpv","subreddit_id":"t5_qgptn","body":"ELI2.5 in my case!","body_html":"<div class = \"md\"> <p> ELI2.5 в моем случае! </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6yia7e/","name":"t1_f6yia7e","created":1573310152,"created_utc":1573281352,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"f6vnjof","author":"istara","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Interesting and useful, from my perspective.\n\nSometimes I'd love a little bit more of a \"layperson's translation\" for some of the studies linked here.","body_html":"<div class = \"md\"> <p> Интересно и полезно, с моей точки зрения. </p>\n\n<p> Иногда я хотел бы немного больше \"перевода непрофессионала\" для некоторых исследований, связанных здесь. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vnjof/","name":"t1_f6vnjof","created":1573221013,"created_utc":1573192213,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":9,"link_id":"t3_dt7pfu","id":"f6wgv9l","author":"Golden__Eagle","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"A bit of a controversial suggestion I guess, but here goes. Most people here are interested in research on reducing the chances of disease and prolonging their healthspan and lifespan. As many users frequently point out, there are other factors apart from nutrition that are very significant in that regard (exercise, smoking, sun exposure, sleep, stress, vaccination, social interactions...). Now, this sub is called Scientific Nutrition so I don't think it would be appropriate to post just anything, but maybe we could implement a system in which on a single day of the week you could post any study regarding health, or maybe as other users have suggested people could post questions... call it Free Post Friday or something. \n\n\nAs for my experiences with the sub so far, I am very much enjoying it. The mods are doing a great job managing things.","body_html":"<div class = \"md\"> <p> Я полагаю, что это немного противоречивое предложение, но оно здесь. Большинство людей здесь заинтересованы в исследованиях по снижению вероятности заболевания и продлению срока их службы и продолжительности жизни. Как часто отмечают многие пользователи, помимо питания очень важны и другие факторы (физические упражнения, курение, пребывание на солнце, сон, стресс, вакцинация, социальные взаимодействия ...). Теперь этот раздел называется «Научное питание», поэтому я не думаю, что было бы уместно публиковать что-либо, но, возможно, мы могли бы внедрить систему, в которой в один день недели вы могли бы опубликовать любое исследование, касающееся здоровья, или, возможно, как другие пользователи предположили, что люди могут оставлять вопросы ... назовите это Free Post Friday или что-то в этом роде. </Р>\n\n<p> Что касается моего опыта работы с субмариной, то мне это очень нравится. Модификации отлично справляются с управлением. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6wgv9l/","name":"t1_f6wgv9l","created":1573255063,"created_utc":1573226263,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":9,"link_id":"t3_dt7pfu","id":"f6vtxdy","author":"MaximilianKohler","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"My only suggestion for improvement would be to expand the wiki to contain an overall summary of the findings shared on this sub.","body_html":"<div class = \"md\"> <p> Единственное, что я могу предложить для улучшения, - это расширить вики, чтобы она содержала общее резюме выводов, представленных в этом разделе. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vtxdy/","name":"t1_f6vtxdy","created":1573229263,"created_utc":1573200463,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":6,"link_id":"t3_dt7pfu","id":"f6x0mse","author":"CommentingOnVoat","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"The best thing is the split in the user base. You get vegans and carnivore people and they post opposite research it's great for learning.","body_html":"<div class = \"md\"> <p> Лучше всего разделить базу пользователей. Вы получаете веганов и плотоядных людей, и они публикуют противоположные исследования, это здорово для обучения. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6x0mse/","name":"t1_f6x0mse","created":1573268016,"created_utc":1573239216,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":13,"link_id":"t3_dt7pfu","replies":[{"ups":3,"link_id":"t3_dt7pfu","id":"f6vvtxr","author":"DrSly","parent_id":"t1_f6vttqk","subreddit_id":"t5_qgptn","body":"I think it’s okay to post interesting articles because as some one previously mentioned it to me that negative result experiments are still important but every time I’ve seen an article that I knew would be false, the OP never actually read the results. They just posted the title. For example title is “vitamin b supplementation improves sleep” and then you click on the article and it says results not significant and not different to placebo. There has to be more checking on results than just posting random articles that people agree with. The problem is that vitamin and probiotic supplements do nothing according to the best evidence. You can check Harvard university. The placebo business is a trillion dollar industry but people don’t accept this. And most of this subreddit focuses on little “quick fixes” that they think will change things","body_html":"<div class = \"md\"> <p> Я думаю, что можно публиковать интересные статьи, потому что, как кто-то ранее упоминал мне, что эксперименты с отрицательным результатом все еще важны, но каждый раз, когда я видел статью, я знал, что она будет ложной ОП никогда не читает результаты. Они только что опубликовали название. Например, заголовок «Добавка витамина В улучшает сон», а затем вы нажимаете на статью, и в ней говорится, что результаты не значительны и не отличаются от плацебо. Должно быть больше проверки результатов, чем просто публикация случайных статей, с которыми люди согласны. Проблема в том, что витаминные и пробиотические добавки ничего не делают в соответствии с лучшими доказательствами. Вы можете проверить Гарвардский университет. Бизнес плацебо - это индустрия на триллион долларов, но люди этого не принимают. И большая часть этого субредита посвящена небольшим «быстрым исправлениям», которые, по их мнению, изменят ситуацию.\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vvtxr/","name":"t1_f6vvtxr","created":1573232194,"created_utc":1573203394,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"f6vbnwd","author":"DrSly","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"I think since day 1 it’s been an interesting idea but from a medical perspective it feels that almost everything I’ve ever read on this sub has been a study that has no statistical significance. The idea behind this sub was that there had to be evidence based information being spread but from my experience it’s been people sharing things that with one click can be disproved.","body_html":"<div class = \"md\"> <p> Я думаю, что с первого дня это была интересная идея, но с медицинской точки зрения кажется, что почти все, что я когда-либо читал на этом субтитре, было исследованием, которое не имеет статистической значимости. Идея этого подпункта заключалась в том, что должна была распространяться информация, основанная на доказательствах, но из моего опыта это были люди, которые делятся вещами, которые можно одним щелчком мыши опровергнуть. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vbnwd/","name":"t1_f6vbnwd","created":1573210536,"created_utc":1573181736,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":3,"link_id":"t3_dt7pfu","id":"f6vkl43","author":"wallyb05","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Just joined. Enjoying and learning","body_html":"<div class = \"md\"> <p> Только что присоединился. Наслаждаться и учиться </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vkl43/","name":"t1_f6vkl43","created":1573217907,"created_utc":1573189107,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":3,"link_id":"t3_dt7pfu","id":"f6vq2qw","author":"greyuniwave","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Think its a great sub and the moderation is great aswell.\n\n\n>We all win by approaching this as a we are sharing and learning together as a community mentality versus a I’m right you’re wrong mentality.\n\ncould not agree more.","body_html":"<div class = \"md\"> <p> Считай, что это отличная субмарина, а также хорошая модерация. </p>\n\n<BLOCKQUOTE>\n<p> Мы все выигрываем, подходя к этому как к тому, что мы делимся и учимся вместе, как к менталитету сообщества, так как я прав, вы ошибаетесь. </p>\n</BLOCKQUOTE>\n\n<p> не могу договориться больше. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vq2qw/","name":"t1_f6vq2qw","created":1573224012,"created_utc":1573195212,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":5,"link_id":"t3_dt7pfu","id":"f6vuzqs","author":"HalfLifeSux","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"I really enjoy this sub but sometimes it doesn't cater to other people than nutritional experts and scientists, I want to learn more but sometimes information isn't accessible for someone like me","body_html":"<div class = \"md\"> <p> Мне действительно нравится этот саб, но иногда он не предназначен для других людей, кроме экспертов по питанию и ученых, я хочу узнать больше, но иногда информация не доступна для таких, как я, </р>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vuzqs/","name":"t1_f6vuzqs","created":1573230886,"created_utc":1573202086,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":2,"link_id":"t3_dt7pfu","id":"f71zu8j","author":"fhtagnfool","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Great sub.\n\nI think there's a healthy population of both vegans and meat-eaters who are largely respectful and scientific. But with more subscribers comes more diet-team voting patterns which I've noticed recently. Not much to do about that except keep the tone respectful.","body_html":"<div class = \"md\"> <p> Отличный саб. </p>\n\n<p> Я думаю, что есть здоровая популяция веганов и мясоедов, которые в основном уважительны и научны. Но с большим количеством подписчиков прибывает больше шаблонов голосования команды диеты, которые я заметил недавно. С этим ничего не поделаешь, кроме как сохранять тональность. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f71zu8j/","name":"t1_f71zu8j","created":1573380071,"created_utc":1573351271,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":1,"link_id":"t3_dt7pfu","id":"f85y9ux","author":"GallantIce","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"Love this sub.\n\nHope you can keep topics limited to credible scientific sources and not the fad diet gurus from YouTube or Instagram.","body_html":"<div class = \"md\"> <p> Обожаю этот саб. </p>\n\n<p> Надеюсь, вы можете ограничить количество тем достоверными научными источниками, а не гуру диеты от YouTube или Instagram. </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f85y9ux/","name":"t1_f85y9ux","created":1574314649,"created_utc":1574285849,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0},{"ups":-1,"link_id":"t3_dt7pfu","replies":[{"ups":7,"link_id":"t3_dt7pfu","id":"f6w82ji","author":"sydbobyd","parent_id":"t1_f6w0oiy","subreddit_id":"t5_qgptn","body":"As a DAV mod, I'm not really sure what they're referring to. I can't even recall a time that this sub was mentioned in that one.","body_html":"<div class = \"md\"> <p> Как мод для DAV, я не совсем уверен, к чему они относятся. Я даже не могу вспомнить время, когда этот саб был упомянут в этом. </P>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6w82ji/","name":"t1_f6w82ji","created":1573248357,"created_utc":1573219557,"subreddit_name_prefixed":"r/ScientificNutrition","depth":2}],"id":"f6vrrem","author":"[deleted]","parent_id":"t3_dt7pfu","subreddit_id":"t5_qgptn","body":"[removed]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/ScientificNutrition/comments/dt7pfu/the_sub_is_one_year_old_please_give_us_your/f6vrrem/","name":"t1_f6vrrem","created":1573226202,"created_utc":1573197402,"subreddit_name_prefixed":"r/ScientificNutrition","depth":0}]}