{"subreddit":{"display_name":"ScientificNutrition"},"subreddit_loc":"Научное питание","selftext":"Это в значительной степени основано на эмпирических наблюдениях, поскольку, очевидно, не существует такого понятия, как «глобальный индекс освещенности телосложения». Однако, как мне кажется из личного опыта и отзывов друзей, диеты большинства людей из того, что, кажется, называют «Западной» Африкой (примерно так считают: https://www.criblemaps.com/api/ maps / images / 450/450 / g6jrL9ZPJD.png]  (https://www.scribeblemaps.com/api/maps/images/450/450/g6jrL9ZPJD.png) ) довольно бедны с точки зрения качества, в основном это вариация на SAD.\n\nОни сильно зависят от обработанного зерна, риса и сои, пьют много подслащенных напитков (в магазинах много газировки, диетическая сода практически отсутствует, кофе, чай и любые другие безалкогольные напитки обычно подают с тонны добавленного сахара), нехватка полезных жиров (например, оливкового масла, рыбьего жира), умеренное или низкое потребление мяса и овощей, и пищевые добавки, очевидно, не являются большой проблемой. В дополнение к этому, потребление большого количества алкоголя, кажется, является довольно распространенным прошлым временем для некоторых мужчин, и общие стандарты обеспечения качества пищи / контроля качества неудовлетворительны (т.е. я предполагаю, что сожженное и грязное масло довольно распространено среди продавцов уличной еды, и никто не собирается проверьте, какие пестициды использовались на фруктах, продаваемых местными жителями).\n\nЭто не обязательно означает, что люди «виноваты» каким-либо образом, ведь эта диета для них является примерно вопросом выживания, в отличие от людей из Европы / Америки, многие не могут легко позволить себе «более здоровую» еду. Это просто более или менее попытка заявить, что я наблюдал /\n\nУровень заболеваемости диабетом и смертностью, по-видимому, достаточно хорошо согласуется с этим наблюдением (при условии, что смертность значительно ухудшается в регионах, где по-прежнему существует проблема голода, и в таких заболеваниях, как малярия, не говоря уже об отсутствии вакцинации в определенных регионах, приводящей к предотвратимым смертям и повышенная мораль детства из-за множества факторов).\n\nНесмотря на это, кажется, что подавляющее большинство мужчин в возрасте от 14 до 30 лет «выглядят» невероятно здоровыми (тонкие, хорошо упругие мышцы, безупречная кожа, хорошая осанка ... и т. Д.). Не обязательно парни, работающие на полях и получающие массу физических упражнений таким образом, но также люди, работающие в отелях, продающие вещи на рынках, работающие в «белых воротничках» ... и т. Д. Ожирение кажется большой проблемой, но только у пожилых люди.\n\nТак что это немного меня смущает:\n\nа) Мои наблюдения не обобщаются, и мне нужно больше читать о фактической статистике - кажется наиболее вероятным\n\nб) западноафриканские диеты на самом деле существенно отличаются от САД, что делает их более здоровыми (а высокий уровень смертности / заболеваемости на более поздних этапах жизни в основном обусловлен такими факторами, как патогены и паразиты, а не заболеваниями, связанными с образом жизни)\n\nc) Факторы, отличные от состава рациона (например, периоды нехватки пищи, состава воды и нехватки воды, высокие температуры, стандартная физическая нагрузка в течение дня) приводят к тому, что люди выглядят здоровыми (возможно, это так, но с учетом того, насколько диета кажется фактор во всех чертах, которые я наблюдал, я несколько сомневаюсь в этом).\n\n\n\nКакие-нибудь мысли ? Кто-нибудь из вас потратил много времени на изучение западноафриканских диет? Чем они отличаются от САД? Чему можно научиться у них? Как вы думаете, какие преимущества они дают и почему?","title":"Почему люди в Западной Африке выглядят такими здоровыми, несмотря на свое питание?","subreddit_name_prefixed":"r/ScientificNutrition","ups":49,"created":1573425486,"link_flair_background_color":"#dadada","id":"duc7bz","author":{"name":"elcric_krej"},"permalink":"/r/ScientificNutrition/comments/duc7bz/why_are_people_in_west_africa_so_healthy_looking/","url":"https://www.reddit.com/r/ScientificNutrition/comments/duc7bz/why_are_people_in_west_africa_so_healthy_looking/","created_utc":1573396686}