{"subreddit":{"display_name":"ScienceNerds"},"subreddit_loc":"ScienceNerds","selftext":"Вот несколько фрагментов из [газеты] (http://www.ncbi.nlm.nih.gov/pubmed/26187720) вместе с моими заметками. Я не выкладываю их всех, потому что это было настолько сильное чтение, что я почти все записал.\n-----------\n\n > Поскольку сложные многоклеточные организмы развились из одноклеточных форм жизни 1,5 миллиарда лет назад, приобретение специализированных структур, позволяющих и облегчающих обмен информацией между клетками и органами, дает механистическое доказательство эволюционного преимущества - или требования - для связи в многоклеточных системах.\n\nЧем лучше, быстрее и точнее обмен информацией между жизнью, тем выше жизнеспособность жизни. Интернет.\n\n > Рассматривая параллель с синаптической функцией, определяющей активность мозга, в этой статье обсуждается возникающее представление о том, что внутри цитоплазмы клетки митохондрии связаны схожими физическими структурами - митохондриями.\nсинапсы - позволяют электрохимический обмен информацией и, таким образом, возможность обрабатывать, интегрировать и преобразовывать информацию об окружающей среде в сигналы, которые регулируют экспрессию и функцию генов [(Figure 1)] (http://i.imgur.com/H7HK4se.jpg).\n\nВнутри клетки, так внутриклеточное общение. Митохондрии регулируют индивидуально-клеточную эпигенетическую активность. Если это так, то это может привести к макроэффектам на организм, которые могут происходить даже через каскады внутриклеточной митохондриальной коммуникации. Важна не только каждая клетка, но и каждая митохондрия в каждой клетке.\n\n > В нейронах для высвобождения нейротрансмиттера пресинаптическим терминалом требуется митохондриальная АТФ [67]. Поскольку митохондрии способствуют высвобождению и рециркуляции синаптических пузырьков [68], присутствие, отсутствие и движение митохондрий в пресинаптическом терминале или из него динамически модулирует высвобождение нейротрансмиттера [69]. \"\n\nМитохондрии обмениваются между нейронными клетками через синапсы? Дальше,\n\n > Митохондрии также регулируют морфогенез позвоночника и синаптическую пластичность, а синаптическая активность влияет на позиционирование митохондрий [70]. В дорсолатеральной префронтальной коре головного мозга стареющих обезьян аномальная митохондриальная форма (пончик) в пресинаптических терминалах связана с меньшим размером активной зоны, меньшим количеством прикрепленных синаптических везикул и нарушением кратковременной памяти [71]. Гетероплазматическая смесь двух разных типов мтДНК у мышей нарушает сохранение памяти и тревожное поведение [72]. У медоносной пчелы митохондриальная дыхательная цепь функционирует в нейронах, но не в астроцитах, модулирует агрессивное поведение [73]. Митохондриальные дисфункции также инициируют и / или способствуют нейродегенерации [74,75]. Коллективно, через их\nпозиционирование, форма и функция, митохондрии являются мощными нейромодуляторами.\n\n > Точно так же, как мозг регулирует основные функции и поведение органов, митохондрии влияют на основные функции и поведение клеток, включая рост и дифференцировку [6,7], миграцию, аутофагию и смерть [8]. Это возможно, потому что митохондрии расположены, как топологически, так и функционально, в непосредственной близости от ядра, где они генерируют\nремоделирование хроматина, эпигенетические метаболиты, влияющие на экспрессию генов (рис. 2).\n\nМожно ли сказать, что митохондрии являются первичными эпигенетическими регуляторами клетки? Метаболизм SCFA посредством аэробного дыхания в митохондриях приводит к метаболитам, которые управляют эпигенетической регуляцией, сами SCFA выполняют ремоделирование хроматина или оба?\n\n> Природа сигналов, с помощью которых митохондрии регулируют пластический (эпи) геном, является предметом интенсивного исследования. Они состоят по крайней мере из активных форм кислорода (АФК) и реакционно-способных метаболических интермедиатов, таких как ацетил-кофермент А (Ac-CoA), сукцинил-КоА, α-кетоглутарат, NAD + (никотинамид-адениндинуклеотид), FAD (флавин-аденин-динуклеотид), SAM (S-аденозилметионин) и др. [12–17]. Эти метаболиты являются необходимыми субстратами и кофакторами для ферментативных реакций, которые модифицируют хроматин, заключенный в ядре клетки [(рисунок 3)] (http://i.imgur.com/8ChmIQa.jpg).\n\nГде находится бутират и другие SCFA в этом списке?\n\n > Примечательно, что уровни экспрессии хроматин-модифицирующего ферментативного механизма, включая ДНК-метилтрансферазы (DNMT) и гистоновые деацетилазы (HDAC), сами находятся под контролем митохондрий [10].\n\nДействует ли бутират в качестве системы резервирования, принимая во внимание возможность возникновения митохондриальной дисфункции?\n\n > Другие канонические митонуклеарные сигнальные пути, включая те, которые отвечают на клеточные энергетические уровни, такие как AMPK (AMP-активированная протеинкиназа) и PGC-1a (гамма-коактиватор пролифератора пероксисомы 1a) [10,11,19], включают активацию и транслокацию транскрипции факторы и коактиваторы внутри ядра [20].\n\nПоэтому, когда мы дополняем прямыми активаторами этих путей, мы пытаемся обойти или усилить эпигенетическую регуляцию митохондрий, чтобы вызвать ремоделирование хроматина в пользу хорошего здоровья.\n\n > Митохондрии даже обмениваются между клетками в процессе, называемом «межклеточным переносом митохондрий» [27,28] по причинам, которые остаются нерешенными [29], но могут представлять собой попытку клеток сообщать о своих внутриклеточных состояниях биоэнергетики. Это возвращает нас к нашему центральному вопросу. Зачем общаться? Как между нейронами головного мозга, обеспечивает ли межмитохондриальная связь обработку сигналов в митохондриальной сети?\n\nВозможно, это так же просто, как «спасение» клеток, «отравленных» мутантной мтДНК, что позволяет создать более крепкий организм в целом. Возможно, есть связь, однако. Чистый результат - самый важный ключ к пониманию того, почему. Есть ли больше обмена мтДНК в организмах, проявляющих более высокую мутацию мтДНК? Это может дать некоторое представление.\n\n > Кроме того, 1,5 миллиарда лет сообщества, живущего в цитоплазме эукариот, и значительный сдвиг в митохондриальном геноме, в результате которого большая часть наследственного митохондриального генома была перенесена и теперь находится в ядре, могли бы дать возможность эволюции новых средств для обмена информация между митохондриями, синхронизировать их поведение и обрабатывать информацию как интегрированную систему, аналогичную пластическому мозгу [36]. Как и в мозге, могут существовать синапсоподобные структуры для функционального соединения митохондрий друг с другом, облегчая быструю связь, интеграцию,\nа формирование памяти?\n\n* В этот момент я сказал «[Хммм] (http://i.imgur.com/3nXBrfr.jpg)» и сделал похожее лицо. Я был полностью готов быть неправым и до сих пор. *\nЯ собираюсь пойти с простой старой ремоделирования гетерохроматина и эпигенетической регуляции с помощью механизмов, уже перечисленных. Может быть, я просто недостаточно изобретателен, но если они передали так много своего транскрипционного потенциала ядру, в то же время демонстрируя прямое регулирование указанных оффшорных генетических данных, почему должны быть какие-либо другие синаптические связи?\n\n > Недавние исследования с использованием покадровой флуоресцентной микроскопии живых клеток с клетками, экспрессирующими pH-чувствительный репортер\nкраситель также продемонстрировал, что электрохимическая информация (вспышки pH) быстро распространяется между физически наложенными\nмитохондрии [25], подразумевающие наличие структур для передачи электрохимической информации.\n\n* [Наука усиливается] (http://i.imgur.com/fNCZg9f.gifv) * Это интересно, но все еще не дает оркестровки эмерджентного уровня для согласованного направления ремоделирования хроматина. И.Е. субстраты, полученные в результате митохондриального использования энергетических субстратов, могут быть просто нижней строкой, а все остальное - просто передача энергии.\n\n > При исследовании контактов митохондрий с митохондриями с помощью электронной томографии, которая обеспечивает более высокое разрешение и трехмерность, недавно были задокументированы синапсоподобные структуры, соединяющие митохондрии друг с другом [22]. Эти межмитохондриальные соединения (IMJ) присутствуют в животном мире от моллюсков до млекопитающих, что указывает на их эволюционное значение [22]. На электронных микрофотографиях IMJ представляют собой электронно-плотные мембранные структуры, аналогичные нейрональным\nсоединения, демонстрирующие линейное наложение наружных митохондриальных мембран из соседних органелл (рис. 4) [22,38].\n\n > Внутри пространства, окруженного внешней митохондриальной мембраной (ОММ), внутренняя митохондриальная мембрана (ИММ) образует инвагинации, называемые кристами, в которые встроена дыхательная цепь. Там кислород соединяется с переносом электронов, чтобы генерировать поддерживающий жизнь мембранный потенциал через IMM.\n\n > Интересно, что количество сростков крист с внешней мембраной, которые составляют важный сайт обмена метаболитов между митохондриальными компартментами, избирательно увеличивается на IMJ [22].\n\n Еще более удивительным является тот факт, что кристы двух митохондрий, связанных IMJ, становятся скоординированными в пространстве, часто демонстрируя значительную кривизну в пределах одной органеллы, чтобы обеспечить их параллельное выравнивание с кристами соседних митохондрий [(Figure 4)] (http: //i.imgur.com/EY2zbWj.jpg).\n\n* Вот где я [восхищался последствиями.] (Https://youtu.be/wFSnLTo7dhk?t=44s) *\n\nМожет быть, мне не следует торопиться с моим прежним скептицизмом, но [Рисунок 4] (http://i.imgur.com/EY2zbWj.jpg) чертовски сумасшедший. Они чертовски выстроились в очередь, как проклятая руническая головоломка. Это просто потенциалы действия и более эффективная передача энергии?\n\n > Информация о пространственной ориентации или митохондриальной ультраструктуре, таким образом, передается через митохондрии.\n\nИтак, пространственная информация передается через эмерджентное свойство интермитохондриальных соединений. Вау.\n\n > У живых животных ткани, которые в большей степени зависят от окислительного метаболизма митохондрий для производства энергии и имеют более высокую митохондриальную плотность, такие как сердце и мышцы, также содержат больше IMJ, даже если нормализовано к общему количеству контактов митохондрий с митохондриями [22]. «.\n\nБольше информации, указывающей на митохондриальные «синапсы» как на полезные для быстрой и эффективной передачи энергии.\n\n > В этой статье предлагается, что межорганная коммуникация обеспечивает митохондрии, так же как и синапсы между нейронами головного мозга, с возможностью коллективной интеграции информации об окружающей среде (Рисунок 1). Неявный аспект этой модели, который подробно здесь не обсуждается, заключается в том, что митохондрии принимают или воспринимают входящие сигналы. Действительно, митохондрии содержат функциональные гормональные рецепторы для глюкокортикоидов [52], каннабиноидов [53], эстрогена [54,55] и других молекулярных сигнальных платформ, включая рецепторы, связанные с G-белком (GPCR) [56,57]. Митохондрии также претерпевают определяющие функции динамические изменения формы в течение нескольких секунд или минут в ответ на обилие энергетических субстратов [21, 58]. Эти развитые признаки, вероятно, гарантируют, что митохондрии могут воспринимать широкий набор биологических, психосоциальных и других сигналов, или стрессоры »[59].\n\n > В контексте обработки сигналов создание «митохондриального коллектива» [36] посредством митохондриальных синапсов может иметь две основные роли: (i) генерировать более согласованные во времени (когерентные) и мощные сигналы для воздействия на экспрессию ядерных генов [35]; и (ii) обрабатывать и хранить информацию - естественное свойство биологических сетей [60]. \"\n\nC'mon (iii) должна быть более эффективной передачи энергии, но это не будет в контексте обработки сигналов.","title":"Митохондриальные синапсы: внутриклеточная коммуникация и интеграция сигналов [2015]","subreddit_name_prefixed":"r/ScienceNerds","ups":10,"created":1441660354,"link_flair_background_color":"","id":"3jywir","author":{"name":"postemporary"},"permalink":"/r/ScienceNerds/comments/3jywir/mitochondrial_synapses_intracellular/","url":"https://www.reddit.com/r/ScienceNerds/comments/3jywir/mitochondrial_synapses_intracellular/","created_utc":1441631554}