{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Эпиктет сказал нам, что ** людей беспокоят не сами вещи **, а ** их взгляд на них **.\n\nНаша индивидуальность и то, как мы постоянно перестраиваем себя, существенно влияют на наше поведение и опыт.\n\nЛюди часто недооценивают то, как слова напрямую влияют на действия.\n\n** вредные привычки отягощают нас на пути к нравственному совершенству **; как якорь, они могут отвести нас назад. Наша работа - развязывать каждый якорь по одному, чтобы ускорить наше согласие.\n\nЭта идентичность описывается в том смысле, что «меня зовут Джон, и я часто пью кофе» или «я курю сигареты каждый день».\n\nИсследование, опубликованное в «Журнале исследований потребителей», проверило, как люди используют слова и как они их используют, помогая противостоять искушению дурной привычки.\n\nВ исследовании участвовали две группы: сначала давай позвоним, затем группе 1 было дано указание использовать фразу «я не могу». Группе 2 было дано указание использовать фразу «Я не хочу» ** в ответ на соблазн нездоровой пищи.\n\nКогда исследование закончилось, группе 1 и 2 были предложены два варианта. Первым был батончик гранолы (действующий как «здоровый» вариант), а второму был предложен шоколадный батончик (действующий как «нездоровый» вариант).\n\nЗатем исследователи измеряли, окажет ли их новая основанная «идентичность» существенное влияние на то, выберут ли они относительно здоровый или нездоровый выбор.\n\n39% людей, которые использовали фразу «я не могу», выбрали вариант «мюсли» (здоровый), в то время как 64% из «я не знаю» (группа 2) предпочли здоровый вариант, а не здоровый.\n\nИдея заключается в том, что ** человек получает больше «психологических возможностей», когда фразы, используемые для того, чтобы противостоять искушению, собираются вместе, чтобы сформировать новую идентичность. **\n\nМы можем видеть это формирование идентичности в действии с диетами. Вегетарианец может чувствовать себя последовательным, дисциплинированным и более здоровым, когда он следует своей диете, так же как и кетогенные диеты, веганские диеты.\n\n# Решение усталости\n\nНам нравится иметь правила, которым мы можем следовать, они служат нам лучше в долгосрочной перспективе, а не «едят здоровее».\n\nВеганство само по себе включает в себя множество этических аргументов и формирует очень сильную идентичность, вы видите много веганов, которые явно встречаются с другими веганами (в этом нет ничего плохого, я просто доказываю точку зрения).\n\nНекоторым людям может быть трудно следовать «здоровой диете», и вегетарианство, Аткинс и т. Д. Приходят, чтобы спасти день.\n\n** Выбор личности приводит к меньшей усталости решения. **\n\nВ исследованиях (как показано ниже) они смотрели на судей и отмечали, что с течением дня судьи, по-видимому, теряют способность принимать последовательные, рационально обоснованные решения и, следовательно, «усталость от решений» (1).\n\nВ момент «я должен есть это» принимается меньшее решение, если ваша деонтология тоже позволяет вам.\n\nЭто означает меньшую усталость от принятия решений и большую силу воли, особенно в случае с веганами, «более экстремальными», которые могут удерживать высокие эмоциональные инвестиции в «дело».\n\n> «Душа, как и тело, на практике принимает любую привычку, с которой хочет с ней связаться».\n- Сократ\n\n# Не считайте дни.\n\nДругая идея, которая может помочь в формировании этой идентичности, состоит в том, чтобы перестать «считать дни». Это та же стратегия, что сказать, что я не могу.\n\n** НИКОГДА не подсчитывать дни. ** Теперь вы можете не соглашаться, но если вы считаете дни, в которых вы сохраняете идентичность, каждый день вы считаете, что вы «курильщик, который провел 40 дней без него», или игрок, который пошел 24 дни без игр »\n\n** Каждая привычка вызывается каким-то событием. ** Для меня я бы курил после стресса, еды, пить кофе, встречи, употребления алкоголя или общения с другими курильщиками.\n\nЯ узнал об этом, неся тетрадь и карандаш и делая отметки в тетради каждый раз, когда курил, в течение пары дней.\n\nЗатем я записал триггеры в тетради на день или два - если бы я курил, я бы посмотрел на то, что произошло незадолго до желания курить.\n\nЭто помогло мне лучше понять триггеры, некоторые из которых вы даже не подозреваете.\n\nДело в том, что мы всегда стремимся устранить их, по одному.\n\nВзято от Филиппа Гезельбаша ©\n\n# [Смотреть это видео]  (https://www.youtube.com/watch?v=MhRkcz6wOGQ&t) \n\n** Источники: **\n\nПосторонние факторы в судебных решениях\n\n(1) http://www.pnas.org/content/108/17/6889.full","title":"«Цепи привычки слишком легки, чтобы их можно было почувствовать, пока они не станут слишком тяжелыми, чтобы их можно было сломать». - Уоррен Баффет","subreddit_name_prefixed":"r/longevity","ups":59,"created":1498534186,"link_flair_background_color":"","id":"6jncuf","author":{"name":"marcustomp"},"permalink":"/r/longevity/comments/6jncuf/chains_of_habit_are_too_light_to_be_felt_until/","url":"https://www.reddit.com/r/longevity/comments/6jncuf/chains_of_habit_are_too_light_to_be_felt_until/","created_utc":1498505386}