{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Мне 71 год.\nЭто обновление моего личного опыта с приемом NR. Причиной принятия NR было увеличение моей энергии и выносливости. Я получил 6-месячный запас 3 августа 2017 года. Начал принимать 500 мг ежедневно (250 мг утром, 250 мг вечером) + 150 мг птеростилбена утром. Также принимаю рапамицин 6 мг. еженедельно + метформин SR 1000 мг в день вместе с 5 мг Crestor, детский аспирин, лизиноприл (гипертонический препарат) в течение 6 месяцев. Я поднимаю это, потому что может быть синергетический эффект с NR.\n \nЯ не заметил большой разницы в моём уровне энергии или во всех ощущениях до 4 дней назад после того, как я принимал его в течение 1 месяца. Затем, внезапно, я почувствовал намного больше энергии и выносливости только в моей повседневной жизни. Я действительно был застигнут врасплох при повышении во всем хорошем чувстве и увеличенной энергии. Для кого-то моего возраста, кто заметил негативные аспекты старения за последние 6-7 лет, это было удивительно. Подумав об этом, я пришел к выводу, что мой NAD + действительно увеличен до максимума. Это NAD, который дает вашим клеткам энергию. Теперь молодой человек, который болен NAD, не так сильно истощен, они, вероятно, не заметят такой большой разницы. Но для пожилого человека, который потерял 50% NAD из-за старения, это божественная посылка. Если это продолжится, я думаю, что я снова начну бегать, что я делал много лет.\n \nЯ сейчас на все 3 процедуры для старения. (Триада, изложенная доктором Синклером в его последнем видео). Снижение передачи сигналов Tor с помощью Rapa, (задерживает рак и все другие болезни старения), контроль уровня глюкозы в крови (чувствительность к инсулину) с метформином и добавление NAD + с NR.\n \nТолько время покажет, но на данный момент в моей жизни я чувствую себя прекрасно.","title":"Задержка старения","subreddit_name_prefixed":"r/longevity","ups":51,"created":1504402558,"link_flair_background_color":"","id":"6xnj9g","author":{"name":"pampaguy"},"permalink":"/r/longevity/comments/6xnj9g/delaying_aging/","url":"https://www.reddit.com/r/longevity/comments/6xnj9g/delaying_aging/","created_utc":1504373758}