{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"По-видимому, два дня назад Обри де Грей опубликовал статью об arXiv, в которой он представляет прогресс, достигнутый им в решении проблемы Хадвигера-Нельсона, которая не изменилась в теории графов с 1950 года.\n\nБумага: https://arxiv.org/pdf/1804.02385.pdf\n\nТеренс Тао - один из самых важных математиков в живых - рассказывает о работе Обри и своем проекте Polymath, чтобы улучшить результат: https://plus.google.com/+TerenceTao27/posts/QBxTFAsDeBp\n\nОбри попросил проверить его результат в Твиттере, а Лэндон Раберн подтвердил: https://twitter.com/aubreydegrey\n\nr / math thread: https://www.reddit.com/r/math/comments/8azc1a/arxiv_the_chromatic_number_of_the_plane_is_at/\n\nСообщение в блоге с дополнительной проверкой результата и загрузкой соответствующего программного обеспечения: https://dustingmixon.wordpress.com/2018/04/10/the-chromatic-number-of-the-plane-is-at-least-5/\n\nНекоторые люди спрашивали меня, имеет ли это отношение к биологии или, по крайней мере, биоинформатике или ИИ. Я думаю, что это не так, поскольку это довольно теоретически, и решения для графиков конечных единичных расстояний (те, которые я ожидаю, могут быть актуальны для приложений в CS), должно быть намного проще получить ... хотя, может быть, если графики станут достаточно большими, сложность проблемы может быть слишком высокой (я не знаю, просто догадываюсь). Я могу ошибаться, так как я нуб, и я впервые сталкиваюсь с этой проблемой. Если кто-то знает больше, пожалуйста, прокомментируйте.\n\nИз того, что я получил, Обри опубликовал это, потому что он математик-любитель (как подтвердил Теренс Тао, он участвовал в некоторых других проектах в прошлом). Проблема, как было сказано, довольно проста, если я правильно ее понял: возьмите бесконечные точки на евклидовой плоскости и соедините все те, которые имеют расстояние ровно одна, друг от друга. Это называется графом единичных расстояний (но охватывающим всю плоскость). Проблема заключается в следующем: сколько цветов вам нужно, чтобы закрасить все вершины, чтобы никакие две соединенные вершины не имели одинаковый цвет? До сих пор (и с 1950 года) было четыре возможных ответа: 4, 5, 6, 7. Обри ограничивал возможные ответы только 5, 6, 7.\n\nЯ надеюсь, что это не содержит ошибок.","title":"Обри де Грей только что продвинулся (вероятно) с 65-летней проблемой математики.","subreddit_name_prefixed":"r/longevity","ups":89,"created":1523409521,"link_flair_background_color":"","id":"8b9eos","author":{"name":"Anle-"},"permalink":"/r/longevity/comments/8b9eos/aubrey_de_grey_just_made_progress_probably_with_a/","url":"https://www.reddit.com/r/longevity/comments/8b9eos/aubrey_de_grey_just_made_progress_probably_with_a/","created_utc":1523380721}