{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Привет. У меня есть несколько проектов, которые помогут продлению жизни. Я расскажу о двух из них здесь и надеюсь получить отзывы о втором.\n\n\n\n## Первый -> Крипто для науки\n\nОткрытый исходный код + URL сайта + описание + документация для разработчиков здесь: https://github.com/For-Science/Crypto-For-Science\n\nЭта платформа позволяет любому потребовать, чтобы их научные исследования финансировались за счет пожертвований, с нулевой комиссией и без посредников. Все деньги идут непосредственно на них. Платформа никогда не будет иметь никаких сборов и никогда не будет монетизирована.\n\nМне бы хотелось иметь долгосрочную политику, предусматривающую проекты, связанные с профилактикой здравоохранения и улучшением когнитивных функций, поэтому просим любого исследователя, которому необходимо финансирование, использовать нашу платформу, и мы сделаем все возможное, чтобы помочь им собрать средства.\n\nСайт уже принимает заявки, но они не будут утверждены в течение еще нескольких дней, пока мы не закодируем дополнительные функции и не протестируем их.\n\nВ качестве второго пути положительного воздействия рассмотрите возможность [стать представителем в своей стране] <span translate = \"no\"> (https://medium.com/forseh/helping-scientific-research-in-algeria-indonesia-macau- перу-бахрейн-филиппины-иран-2a4eb18cbce4) </ SPAN>.\n\n\n\n\n\n## Второй -> все еще не вне концепции, но вот моя идея:\n\nУ вас есть несколько фильтров слева, где вы выбираете вещи, которые определяют физиологию человека: мужской / женский, некоторые показатели биологического возраста, способ выражения определенных генов и т. Д.\n\nВ зависимости от выбора слева, человеку показывают определенные советы, подкрепленные научным консенсусом или дебатами, которым он должен следовать, чтобы улучшить состояние своего здоровья. Очевидный пример: использовать солнцезащитный экран.\n\nТеперь вот классные детали:\n\n- Весь веб-сайт позволяет осуществлять совместное редактирование как для фильтров, так и для рекомендаций, и все изменения должны сопровождаться очень точными ссылками (когда вы не просто называете бумагу, но вы также можете указать на контент с определенной страницы и объяснить почему это поддерживает ваше требование).\n- Любое из добавлений или удалений может быть выбрано кем-то еще в качестве начала дебатов. Затем будет определенный класс пользователей, единственной целью которого является голосование за тех, кто выиграл завершенные дебаты, и - в зависимости от этого - на сайте будет отображаться только «выигрышная» информация.\n\nЧем больше человек склонен к смерти, тем выше будет совет по риску / вознаграждению.\n\nКогда кто-то добавляет или изменяет существующий совет, он также должен установить значения фильтра, для которых он показывается. Это также можно обсудить.\n\nОпять же, сайт будет с открытым исходным кодом, и я не планирую когда-либо монетизировать его. Скажите, пожалуйста, если это хорошая идея, как мы могли бы сделать ее еще лучше, если бы вы внесли свой вклад в качестве редактора и т. Д.","title":"Два проекта, которые помогут продлению жизни","subreddit_name_prefixed":"r/longevity","ups":54,"created":1524524852,"link_flair_background_color":"","id":"8ec570","author":{"name":"laurbyteball"},"permalink":"/r/longevity/comments/8ec570/two_projects_that_will_help_life_extension/","url":"https://www.reddit.com/r/longevity/comments/8ec570/two_projects_that_will_help_life_extension/","created_utc":1524496052}