{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"","title":"Мы должны победить старение. С населением проблем нет. Джефф Безос: «Солнечная система может легко поддерживать триллион людей», - сказал он. «И неограниченные - для всех практических целей - ресурсы от солнечной энергии и так далее».","subreddit_name_prefixed":"r/longevity","ups":290,"created":1524802297,"link_flair_background_color":"","id":"8f5r6f","author":{"name":"MichaelTen"},"permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/","url":"https://www.reddit.com/r/space/comments/8f1wcc/jeff_bezos_says_he_liquidates_a_whopping_1/","created_utc":1524773497,"replies":[{"ups":79,"link_id":"t3_8f5r6f","replies":[{"ups":6,"link_id":"t3_8f5r6f","replies":[{"ups":2,"link_id":"t3_8f5r6f","id":"dy1ouhc","author":"astrange","parent_id":"t1_dy1o3a7","subreddit_id":"t5_2qzmo","body":"UBI kind of is a relocation assistance.","body_html":"<div class = \"md\"> <p> Тип UBI - это помощь в переезде. </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1ouhc/","name":"t1_dy1ouhc","created":1524837154,"created_utc":1524808354,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"dy1k49k","author":"Massdriver58","parent_id":"t1_dy1hilo","subreddit_id":"t5_2qzmo","body":"I partially agree. I think moderate UBI, NIT, or wage subsides have a place in relieving acute suffering in society. I believe in those in the context of a liberal capitalist society with modest regulations and principles  that promote a dynamic market economy, the rule of law, an independent judiciary, strong institutions, antitrust enforcement, and a reasonably safe environment. I also strongly support free trade and global institutions. But I do agree that democratic socialists carry things too far, and even social democrats are further left than I am. There is a middle path that gives people a reasonable standard of living but also promotes innovation and growth. I favor that.     \n\nIt is also worth pointing out that fighting hunger is relatively inexpensive and something that the u.s. and every nation should be working on. This won’t bankrupt us and we do have an ethical duty to humankind. Inequality is only concerning to me in so far as it affects the overall well being of society. In and of itself, I am not too concerned as long as we provide everyone a very modest, basic standard of living. ","body_html":"<div class = \"md\"> <p> Я частично согласен. Я думаю, что умеренные UBI, NIT или снижение заработной платы имеют место для облегчения острых страданий в обществе. Я верю в тех в контексте либерального капиталистического общества со скромными правилами и принципами, которые способствуют динамичной рыночной экономике, верховенству закона, независимой судебной системе, сильным институтам, антимонопольному правоприменению и достаточно безопасной среде. Я также решительно поддерживаю свободную торговлю и глобальные институты. Но я согласен с тем, что демократические социалисты слишком далеко зашли, и даже социал-демократы остались дальше, чем я. Существует средний путь, который дает людям разумный уровень жизни, но также способствует инновациям и росту. Я поддерживаю это. </Р>\n\n<p> Стоит также отметить, что борьба с голодом является относительно недорогой и что-то, что США. и каждая нация должна работать. Это не обанкротит нас, и у нас есть этический долг перед человечеством. Неравенство касается меня лишь постольку, поскольку оно влияет на общее благосостояние общества. Сам по себе я не слишком обеспокоен, пока мы обеспечиваем всем очень скромный, базовый уровень жизни. </Р>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1k49k/","name":"t1_dy1k49k","created":1524830491,"created_utc":1524801691,"subreddit_name_prefixed":"r/longevity","depth":2},{"ups":4,"link_id":"t3_8f5r6f","id":"dy245vy","author":"[deleted]","parent_id":"t1_dy1hilo","subreddit_id":"t5_2qzmo","body":"Dude I'm all for longevity but the criticism from the left is not \"defeatism\", it's the rightful criticism that people look towards the stars, which is an extremely far away solution, to very urgent issues in the present. If your response to global warming is to just dream of going to Mars instead of _stopping it_, then you're rightfully being attacked—you're busy dreaming about a solution far away for a problem that is left to unfold unhindered in the present, potentially forever, in case your solution never becomes possible reality.","body_html":"<div class = \"md\"> <p> Чувак, я за долголетие, но критика слева - это не \"пораженчество\", это справедливая критика, которую люди смотрят на звезды, что является чрезвычайно далеким решением, очень актуальные вопросы в настоящем. Если ваш ответ на глобальное потепление состоит в том, чтобы просто мечтать о том, чтобы отправиться на Марс, а не <em> остановить его </em>, то вы по праву подвергаетесь нападению - вы заняты, мечтая о решении проблемы, которая осталась далеко. разворачиваться беспрепятственно в настоящем, потенциально навсегда, если ваше решение никогда не станет возможной реальностью. </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy245vy/","name":"t1_dy245vy","created":1524864591,"created_utc":1524835791,"subreddit_name_prefixed":"r/longevity","depth":2},{"ups":2,"link_id":"t3_8f5r6f","replies":[{"ups":7,"link_id":"t3_8f5r6f","id":"dy1zakv","author":"vardarac","parent_id":"t1_dy1z04x","subreddit_id":"t5_2qzmo","body":"Among who? Which leftists? Is it leftists that hamstrung the EPA and NOAA?","body_html":"<div class = \"md\"> <p> Среди кого? Какие левые? Это левые, которые зажали EPA и NOAA? </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1zakv/","name":"t1_dy1zakv","created":1524858355,"created_utc":1524829555,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"dy1yk72","author":"vardarac","parent_id":"t1_dy1hilo","subreddit_id":"t5_2qzmo","body":"> No we will not stop spending money on space. On science. On extending lifespans.\n\nI am not aware of any mainstream left-wing or center-left politicians advocating cutting funding for any of this. Quite the opposite.","body_html":"<div class = \"md\"> <blockquote>\n<p> Нет, мы не перестанем тратить деньги на космос. По науке. Об увеличении продолжительности жизни. </P>\n</BLOCKQUOTE>\n\n<p> Мне неизвестны какие-либо основные левые или левоцентристские политики, выступающие за сокращение финансирования для всего этого. Совсем наоборот. </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1yk72/","name":"t1_dy1yk72","created":1524857172,"created_utc":1524828372,"subreddit_name_prefixed":"r/longevity","depth":2},{"ups":0,"link_id":"t3_8f5r6f","id":"dy1oui0","author":"myopicmaid","parent_id":"t1_dy1hilo","subreddit_id":"t5_2qzmo","body":"Sacrifice what, exactly? Low income people?","body_html":"<div class = \"md\"> <p> Жертвовать чем именно? Люди с низким доходом? </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1oui0/","name":"t1_dy1oui0","created":1524837155,"created_utc":1524808355,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"dy140ux","author":"Massdriver58","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Humanity needs to decide to dream big and make it a reality. We can colonize the solar system, defeat aging and disease, and build a paradise while looking towards the stars. It sounds a lot better than fighting over the scraps here when this isn’t a zero sum game. ","body_html":"<div class = \"md\"> <p> Человечество должно решить мечтать о большем и воплотить его в жизнь. Мы можем колонизировать солнечную систему, победить старение и болезни и построить рай, глядя на звезды. Это звучит намного лучше, чем сражаться за металлолом, когда это не игра с нулевой суммой. </Р>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy140ux/","name":"t1_dy140ux","created":1524814767,"created_utc":1524785967,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":15,"link_id":"t3_8f5r6f","replies":[{"ups":4,"link_id":"t3_8f5r6f","replies":[{"ups":-2,"link_id":"t3_8f5r6f","replies":[{"ups":2,"link_id":"t3_8f5r6f","id":"dy338zp","author":"DiggSucksNow","parent_id":"t1_dy2v69c","subreddit_id":"t5_2qzmo","body":"HODL","body_html":"<div class = \"md\"> <p> HODL </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy338zp/","name":"t1_dy338zp","created":1524896448,"created_utc":1524867648,"subreddit_name_prefixed":"r/longevity","depth":6}],"id":"dy272rp","author":"DiggSucksNow","parent_id":"t1_dy23o8c","subreddit_id":"t5_2qzmo","body":"Maybe you're from the future, and your guide is just a warning to sell before the Ponzi scheme collapses.","body_html":"<div class = \"md\"> <p> Возможно, вы из будущего, и ваш гид - это всего лишь предупреждение о продаже до того, как схема Ponzi рухнет. </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy272rp/","name":"t1_dy272rp","created":1524867470,"created_utc":1524838670,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"dy1yy0j","author":"DiggSucksNow","parent_id":"t1_dy1s2mn","subreddit_id":"t5_2qzmo","body":"What's your guide, just HODL over and over again?","body_html":"<div class = \"md\"> <p> Какой у вас гид, просто HODL снова и снова? </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1yy0j/","name":"t1_dy1yy0j","created":1524857810,"created_utc":1524829010,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"dy1ixq6","author":"RedditUser6789","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Damn I thought Bezos said “we must defeat aging.” We need someone like that beyond Thiel. And a shit ton more money going into it. ","body_html":"<div class = \"md\"> <p> Черт, я думал, что Безос сказал: «Мы должны победить старение». Нам нужен такой человек, кроме Тиля. И дерьмо тонна больше денег идет на это. </Р>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1ixq6/","name":"t1_dy1ixq6","created":1524829136,"created_utc":1524800336,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":19,"link_id":"t3_8f5r6f","id":"dy1ejsc","author":"theytoldmeineedaname","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"One surprising positive externality of having mega wealthy billionaires is they are both highly incentivized and well-positioned to tackle this problem. In the first place to save themselves and in the second to commercialize the technology for profit.\n\nYou see many of them attempting some variant of seeking immortality: Page and Brin have Calico, Musk is exploring brain augmentation (his end goal is almost certainly to preserve the brain, and therefore consciousness, indefinitely), and Venter has been at related problems more directly for most of his life.\n\nThough he hasn’t stated his intention outright yet, Musk is on the best track by far. We can theoretically swap every other part of the body except the brain. The complementary problem is reversing brain aging specifically, which hopefully someone is working on.\n\nThe immortality project is in my opinion well under way. The question is whether we get there in time.","body_html":"<div class = \"md\"> <p> Одна удивительная положительная внешность наличия мега-богатых миллиардеров состоит в том, что они оба высоко мотивированы и имеют хорошие возможности для решения этой проблемы. Во-первых, чтобы сохранить себя, а во-вторых, чтобы коммерциализировать технологию для получения прибыли. </P>\n\n<p> Вы видите, что многие из них пытаются использовать какой-то вариант поиска бессмертия: у Пейджа и Брин есть Калико, Маск исследует увеличение мозга (его конечная цель почти наверняка - сохранить мозг и, следовательно, сознание на неопределенный срок), и Вентер был в связанные проблемы более непосредственно для большей части его жизни. </p>\n\n<p> Хотя он еще не заявил о своем намерении, Маск на данный момент находится на лучшем треке. Теоретически мы можем поменять любую другую часть тела, кроме мозга. Дополнительной проблемой является именно изменение старения мозга, над чем, надеюсь, кто-то работает. </P>\n\n<p> Проект бессмертия, на мой взгляд, идет полным ходом. Вопрос в том, доберемся ли мы вовремя. </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1ejsc/","name":"t1_dy1ejsc","created":1524824696,"created_utc":1524795896,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":7,"link_id":"t3_8f5r6f","id":"dy203q0","author":"YukonCornelius7","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Heck the earth could support trillions of humans ","body_html":"<div class = \"md\"> <p> Черт возьми, земля может поддерживать триллионы людей </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy203q0/","name":"t1_dy203q0","created":1524859563,"created_utc":1524830763,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":4,"link_id":"t3_8f5r6f","id":"dy1jkc8","author":"kontekisuto","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"I have been saying this for years .. but im not featured in a news article smh.","body_html":"<div class = \"md\"> <p> Я говорил это годами ... но я не фигурировал в новостной статье smh. </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1jkc8/","name":"t1_dy1jkc8","created":1524829836,"created_utc":1524801036,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":6,"link_id":"t3_8f5r6f","replies":[{"ups":0,"link_id":"t3_8f5r6f","id":"dy11axa","author":"accountno543210","parent_id":"t1_dy10po1","subreddit_id":"t5_2qzmo","body":"Which first?","body_html":"<div class = \"md\"> <p> Что первым? </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy11axa/","name":"t1_dy11axa","created":1524811880,"created_utc":1524783080,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"dy10dk1","author":"accountno543210","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Yes, but how do we keep the few who have taken our economies hostage, who profit off us staying sick and fighting each \"other\"? ","body_html":"<div class = \"md\"> <p> Да, но как нам удержать тех немногих, которые взяли в заложники нашу экономику, которые получают прибыль от нас, оставаясь больными и сражаясь друг с другом? </Р>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy10dk1/","name":"t1_dy10dk1","created":1524810898,"created_utc":1524782098,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":2,"link_id":"t3_8f5r6f","id":"dy1roq0","author":"bunnanah123","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Maybe we actually could if he donated some of the hoards of money he is keeping to himself ","body_html":"<div class = \"md\"> <p> Может быть, мы могли бы на самом деле, если бы он пожертвовал часть денег, которые он держит при себе </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1roq0/","name":"t1_dy1roq0","created":1524842306,"created_utc":1524813506,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":3,"link_id":"t3_8f5r6f","replies":[{"ups":1,"link_id":"t3_8f5r6f","id":"dy5jb93","author":"Warrior666","parent_id":"t1_dy4jxdb","subreddit_id":"t5_2qzmo","body":"I agree. I was not arguing against what Bezos said, I was arguing against OP's apparent notion that overpopulation(*) today is not realistically a problem \"because space\". This is mere handwaving and will not convince anyone of anything. Real numbers and actionable plans are required instead:\n\n1. Do you want to ship people to space? How many? In which way? Provide numbers on launches, infrastructure, timeframes. How is it going to impact today's overpopulation? Think of counter-arguments and failure-modes. Provide a concrete plan.\n2. Or do you want to ship resources from space to Earth? Which? From where? How? Numbers, time-frames, impact. Failure-modes. Show concrete plan.\n\n(*) I am not convinced that overpopulation will become a real problem on Earth, so I use the word in the subjunctive. However, I realize that almost everyone else does believe it, so we should take it seriously.\n","body_html":"<div class = \"md\"> <p> Я согласен. Я не спорил с тем, что сказал Безос, я спорил с очевидным представлением ОП о том, что перенаселение (*) сегодня реально не является проблемой «потому что пространство». Это просто махнув рукой и никого ни в чем не убедит. Вместо этого требуются реальные цифры и планы действий: </p>\n\n<Ол>\n<li> Хотите отправить людей в космос? Сколько? Каким путем? Укажите цифры по запускам, инфраструктуре, срокам. Как это повлияет на сегодняшнее перенаселение? Подумайте о контраргументах и ​​режимах отказа. Предоставьте конкретный план. </Li>\n<li> Или вы хотите отправить ресурсы из космоса на Землю? Который? Откуда? Как? Числа, временные рамки, влияние. Failure-режимы. Показать конкретный план. </Li>\n</Ол>\n\n<p> (*) Я не уверен, что перенаселение станет реальной проблемой на Земле, поэтому я использую слово в сослагательном наклонении. Тем не менее, я понимаю, что почти все остальные верят в это, поэтому мы должны относиться к этому серьезно. </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy5jb93/","name":"t1_dy5jb93","created":1525016448,"created_utc":1524987648,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"dy1xr5o","author":"Warrior666","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Nope. Overpopulation (if it is a problem at all, which it may turn out not to be) cannot be solved this way.\n\nIf you think you can relocate billions of people from Earth elsewhere in the solar system, you're mistaken. While it's not impossible physically, it's impracticable in reality.\n\nHow so? Divide the number of people you want to offload from Earth by how many passengers go with one launch. Now you have the number of total launches. Divide that by how many launches you think are feasible each year. Now you've got the number of years until you're done.\n\nNext, make a reasonable estimate of how much heat those continuous launches (and returns) will impart on Earth. Now ask yourself if the planet can sustain that for the number of years you calculated earlier.\n\nRemember, we have not yet discussed whether billions of people even want to relocate to space, and what kind of infrastructure Earth would need to support this endeavor.\n\nPlease do yourself the favor and run the numbers. Let us know what you got.\n","body_html":"<div class = \"md\"> <p> Нет. Перенаселение (если это вообще проблема, которой может и не быть) не может быть решено таким образом. </P>\n\n<p> Если вы думаете, что можете переместить миллиарды людей с Земли в другие места Солнечной системы, вы ошибаетесь. Хотя физически это не невозможно, на практике это невозможно. </P>\n\n<p> Как так? Разделите количество людей, которых вы хотите снять с Земли, на количество пассажиров, совершающих один запуск. Теперь у вас есть общее количество запусков. Разделите это на количество запусков, которые вы считаете целесообразными каждый год. Теперь у вас есть количество лет, пока вы не закончили. </P>\n\n<p> Затем сделайте разумную оценку того, сколько тепла эти непрерывные запуски (и возвраты) передадут на Землю. Теперь спросите себя, может ли планета выдержать это за количество лет, которое вы рассчитали ранее. </P>\n\n<p> Помните, мы еще не обсуждали, хотят ли миллиарды людей даже переместиться в космос, и какую инфраструктуру Земля должна была бы поддержать для этого. </p>\n\n<p> Пожалуйста, сделайте себе одолжение и запустите номера. Дайте нам знать, что вы получили. </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1xr5o/","name":"t1_dy1xr5o","created":1524855736,"created_utc":1524826936,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":0,"link_id":"t3_8f5r6f","id":"dy2g8rb","author":"comelykid","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Humanity's carrying capacity comes at the cost of other species' carrying capacity.\n\nSure, we could colonize the entire solar system and sure, humans have a theoretically infinite population. However, that interstellar shit takes time to develop and while we are spending that time here on Earth, our population is still increasing and lowering the carrying capacity for a number of other species who need our planet's space to survive. \n\n**That** is the problem which occupies our attention, among the dozens upon hundred of other problems with Bezos' kind of thinking.","body_html":"<div class = \"md\"> <p> Пропускная способность человечества определяется ценой несущей способности других видов. </p>\n\n<p> Конечно, мы могли бы колонизировать всю солнечную систему, и, конечно же, люди имеют теоретически бесконечное население. Тем не менее, это межзвездное дерьмо требует времени для развития, и в то время как мы проводим это время здесь, на Земле, наша популяция все еще увеличивается и снижает пропускную способность для ряда других видов, которым необходимо пространство нашей планеты, чтобы выжить. </Р>\n\n<p> <strong> Это </strong> - это проблема, которая занимает наше внимание среди десятков и сотен других проблем, связанных с мышлением Безоса. </p>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy2g8rb/","name":"t1_dy2g8rb","created":1524875410,"created_utc":1524846610,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":-2,"link_id":"t3_8f5r6f","id":"dy1zpux","author":"den31","parent_id":"t3_8f5r6f","subreddit_id":"t5_2qzmo","body":"Overpopulation is always a problem if people procreate exponentially as the combined volume of the ball of human bodies cannot grow at a rate faster than that limited by the speed of light (and this is not exponential). That being said, overpopulation is easy to solve, just don't procreate or at least don't procreate more than is needed to replace the dead (for accidental reasons if not for old age or disease).","body_html":"<div class = \"md\"> <p> Перенаселение всегда является проблемой, если люди размножаются экспоненциально, поскольку совокупный объем шара человеческих тел не может расти со скоростью, превышающей скорость, ограниченную скоростью света (и это не экспоненциально ). Это, как говорится, перенаселение легко решить, просто не рожать или, по крайней мере, не рожать больше, чем необходимо, чтобы заменить мертвых (по случайным причинам, если не по старости или болезни). </P>\n</DIV>","permalink":"/r/longevity/comments/8f5r6f/we_must_defeat_aging_over_population_is_not/dy1zpux/","name":"t1_dy1zpux","created":1524859002,"created_utc":1524830202,"subreddit_name_prefixed":"r/longevity","depth":0}]}