{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Многие смелые люди в настоящее время занимаются всевозможными омолаживающими самоэкспериментами. Проблема, я думаю, состоит в том, что большинство из этих экспериментов лечат симптомы старения. Например, сенолитики удаляют стареющие клетки, которые вызывают воспаление, которое препятствует репликации клеток. Вы можете представить, что наносите удары по корню, но организм обычно способен самостоятельно удалять стареющие клетки.\n\nПричина, по которой организм в конечном итоге становится неспособным удалить стареющие клетки, та же самая причина, по которой он в конечном итоге становится восприимчивым к инфекционным болезням и раку: снижение иммунной системы. Иммунная система снижается, потому что тело заполнено стареющими Т-клетками, которые научились бороться с различными инфекционными заболеваниями, которым подвергался организм.\n\nСо временем мы заражаемся некоторыми вирусами, которые мы не можем устранить, такими как цитомегаловирус. Затем популяция Т-клеток растет, включая различные клетки, нацеленные на цитомегаловирус, не оставляя места для молодых Т-клеток, которые могли бы выполнять более полезные функции.\n\nПравильный ответ будет состоять в том, чтобы избавиться от этих стареющих T-клеток, которые не выполняют очень полезную работу, оставляя место для новых T-клеток, которые могут работать над удалением стареющих клеток, раковых клеток, вирусных частиц и других вещей, которые мы делаем не хочу в нашем теле.\n\nЭто уже было [успешно выполнено на мышах]  (https://www.ncbi.nlm.nih.gov/pubmed/20426617) . Должна быть возможность повторить этот метод на людях. Я ожидаю, что люди, которые подвергаются такой терапии, увидят резкое увеличение продолжительности их жизни.","title":"Я хочу увидеть эксперимент с самоэкспериментом: удаление сенотентных цитотоксических Т-клеток","subreddit_name_prefixed":"r/longevity","ups":49,"created":1525573354,"link_flair_background_color":"","id":"8h9cau","author":{"name":"thesanpedrocactus"},"permalink":"/r/longevity/comments/8h9cau/the_selfexperiment_experiment_i_want_to_see/","url":"https://www.reddit.com/r/longevity/comments/8h9cau/the_selfexperiment_experiment_i_want_to_see/","created_utc":1525544554}