{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Хотя 90% смертей в США и, по крайней мере, 80% расходов на медицинское обслуживание в США вызваны старением:\n\n> Бюджет Национального института здравоохранения (млн. Долл. США): ~ 30 000\n \n> Бюджет Национального института старения: ~ 1000\n \n> Бюджет отдела биологии старения: ~ 150\n \n> Потрачено на трансляционные исследования (макс.): ~ 10\n\n> Бюджет исследовательского фонда SENS: ~ 5\n \n\nЭти цифры говорят сами за себя, они все, что вам нужно ответить, когда все удивительные методы лечения будут доступны в клиниках.\n\nЕсли вы внимательно посмотрите на работу, финансируемую NIH или NIA… ну… вы найдете сотни публикаций об ожирении, образе жизни, загрязнении воздуха и их влиянии на продолжительность жизни. Разве вы не знаете, что ожирение, курение и употребление алкоголя вредны для вас? Как эта информация может помочь нам создать новое лекарство от рака, болезни Альцгеймера или атеросклероза? Нам действительно нужна еще одна работа над этим?\n\nТакже вы можете найти много публикаций об ограничении калорий и различных генетических манипуляциях с червями и другими модельными организмами, которые имитируют это. Ограничение калорий везде! Хотя мы уже двадцать лет знаем, что ЧР не работает на людей. В 2015 году было выделено 500 000 долларов на такие проекты, как * «Большое рандомизированное исследование витамина D, жирных кислот омега-3 и снижение когнитивных функций» *. Это не шутка, это настоящая исследовательская работа! Вы можете найти больше [здесь]  (https://report.nih.gov/categorical_spending_project_listing.aspx?ARRA=N&DCat=Aging&FY=2015) . Все это бесполезно, потому что вы не можете использовать его для создания рабочих методов омоложения. Лишь небольшая часть этой работы полезна в смысле победы над старением. Вы знаете, что самое интересное? Это все ваши налоги, все ваши деньги! Теперь ты это знаешь.\n\nВ то же время действительно важные исследовательские проекты, такие как работа над препаратом, разрушающим глюкозу, (который положит конец многим патологиям старения, таким как артериальная ригидность, хроническое воспаление, гипертония, инсульты и спасет много жизней) в [Spiegel Lab] <span translate = \"no\" > (https://spiegellab.yale.edu) </ span> в Йельском университете недостаточно финансируется и будет закрыт в прошлом году без финансовой поддержки SENS Research Foundation и немецкого предпринимателя Михаила Греве. Наконец, затраты на проведение работ по лечению омоложения у старых мышей, по современным оценкам, составят всего 1-2% от программы Apollo. И ту же сумму денег и времени уже было потрачено на [Sirtuins]  (https://en.wikipedia.org/wiki/Sirtuin) , которые, очевидно, ничего не дали.","title":"Основной проблемой в достижении реального прогресса в омоложении является нехватка денег для правильного исследования","subreddit_name_prefixed":"r/longevity","ups":53,"created":1526200694,"link_flair_background_color":"","id":"8j09h4","author":{"name":"arielfeinerman"},"permalink":"/r/longevity/comments/8j09h4/the_main_issue_in_achieving_real_progress_in/","url":"https://www.reddit.com/r/longevity/comments/8j09h4/the_main_issue_in_achieving_real_progress_in/","created_utc":1526171894}