{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Прошло уже пару дней, когда в голову пришла мысль: чтобы достичь почти всего желаемого бюджета SENS, нам понадобится примерно 3000 человек, чтобы пожертвовать 1000 долларов в месяц. Это привело бы к 3000 \\ * 1000 $ \\ * 12 месяцев = 36 миллионов долларов в год, что почти в три раза превышает текущий бюджет SENS. Обри много раз говорил, что бюджет, необходимый для организации работы с оптимальной скоростью, находится на таком уровне.\n\nЛюди, которые могли бы пожертвовать эту сумму относительно удобно, но с некоторыми жертвами, - это люди с высокой зарплатой, например инженеры (но не только они). Молодой инженер-программист может зарабатывать более 60 тыс. Долларов в год, а старший инженер-программист в соответствующей компании - до 250 тыс. Долларов в год. Таким образом, 1000 долларов в месяц будут от 4% до 20% от дохода. Не так далеко от [обязательства, взятого среди эффективных альтруистов]  (https://www.givingwhatwecan.org/pledge/)  пожертвовать 10% своего дохода. Разработчики программного обеспечения пришли мне в голову, естественно, так как они, кажется, особенно восприимчивы к миссии SENS.\n\nСейчас же. Может ли быть так, что * уже * достаточно * людей, убежденных в SENS, которые также находятся в этой зоне заработной платы, но у которых недостаточно мотивации для пожертвований, потому что они чувствуют, что не окажут достаточно высокого воздействия, оправдывающего жертву? Насколько сложно было бы привлечь на борт 3000 инженеров / высокооплачиваемых специалистов с целенаправленной инициативой по достижению этого числа? Что-то вроде похода со счетчиком? Я не уверен.\n\nНа первый взгляд необходимое количество людей кажется низким, но я не уверен в текущем положении вещей. сколько людей в движении могут пожертвовать такие деньги? Я также не уверен, сколько времени потребуется, чтобы убедить новых людей пойти на этот относительно небольшой, но значительный жертвоприношение.\n\nНекоторые идеи, чтобы сделать эту работу:\n\n1. Поговорите с людьми, которые уже убеждены в SENS по этому поводу. Возможно, у нас уже есть правильные номера.\n2. Действуй параллельно. Гораздо быстрее убедить 3000 человек, если в убедительной части работают 3000 человек, а если над этим работает только один человек.\n3. Высококвалифицированные профессионалы, которые уже убеждены, могут работать, чтобы убедить своих сверстников в своей компании.\n4. Соедините это с [обещанием]  (https://www.reddit.com/r/longevity/comments/8xnm13/recursive_advocacy_an_idea_for_exponential_growth/)  [/ recursive advocacy]  (https://www.reddit.com/r/longevity/comments/8xnm13/recursive_advocacy_an_idea_for_exponential_growth/) , чтобы высокооплачиваемые профессионалы, которые уже жертвуют работой, убеждать других высокооплачиваемых профессионалов, вплоть до мы достигаем окончательного желаемого числа.\n\nКакие-нибудь мысли?","title":"Нам «всего» нужно 3000 инженеров.","subreddit_name_prefixed":"r/longevity","ups":65,"created":1533148476,"link_flair_background_color":"","id":"93ntm3","author":{"name":"Anle-"},"permalink":"/r/longevity/comments/93ntm3/we_only_need_3000_engineers/","url":"https://www.reddit.com/r/longevity/comments/93ntm3/we_only_need_3000_engineers/","created_utc":1533119676}