{"subreddit":{"display_name":"longevity"},"subreddit_loc":"longevity","selftext":"I have been studying Genomics for the last year, with a focus on longevity.  I have come to the conclusion that there will be 4 distinct (although somewhat overlapping) epochs in the goal of living longer and healthier lives.  I'd like to lay them out for you.\n\nThis is a long article, and the last epoch has the most to read because it's about research that hasn't even started yet, and I have to talk about the science we know today that will lead to that research.  let me also be clear, that while this is based on letitimate research I have read, some of this is SPECULATION.  Although in a conversation with the guy that runs the lab I am in the other day, he endorsed my speculation has having solid logical roots.\n\n-------\n\nEpoch 1:  Health Consciousness.   This is the era that began as far back as we can imagine, and we are deeply into this today.  This is the notion that (using the best current knowledge that) avoiding sugar, not smoking, eating well (more greens, more rawish foods, less processed stuff, less preservatives), not getting fat, and exercizing can all lead to longer healthier lives.  This is undoubtably true.  My local PBS station has shows that basically advertize programs (books, videos, you name it) detailing all the things you should do.  This is at the rate of about one of these shows a week.  I guess, as a species, we got serious about this when the surgeon general banned advertizing of cigarettes in 1970, and as time has passed, we have gotten more serious about it.  Lets note, no matter how far forward we go with this process, these fundamental understandings of how NOT to abuse our bodies will always be good advice.  \n\n-------\n\nNow, an argument can be made that Mary-Claire King is singularly personally responsible for raising the average lifespan age by about 2 years worldwide based on her discovery of the BRCA1 gene - the breast cancer gene - allowing women to get screened and being able to largely avoid dying from breast cancer by knowing that they should get screened more often if they are at risk, and then getting treated early if something is detected.   I believe this is true, and I mention it as a proxy for a whole host of life saving interventions (Seatbelts and airbags are two other technologies that are examples), but I don't see those as being DIRECTLY aimed at the issue of longevity, so...  Even though that sort of thing is going on in the background, and they are all working in concert to increase the average lifespan, I am going to choose to not count them here.   What DO I count then?  Well...\n\n-------\n\nEpoch 2.  Longevity drugs.  Starting as far back as 1999 (the earliest paper >I< have seen, though there are certainly earlier ones that I don't know about), specific drugs are mentioned as increasing healthspan, and that implies not dying from age related diseases, and that implies living longer.\n\nA few people realize that we are in this epoch right now, and the awareness that we are in it is slowly dawning on the general public.    I have 5 treatments that are the hallmarks of this age.   2 are diets and three are drugs.  Buckle up, if you haven't heard about these they are becomming mainstream fairly quickly.\n\nLets start with the diets.  It's long been known that Dietary Restriction leads to an increase in lifespan.  If you knock off about %15 of the calories that you \"need\" on a daily basis, you tend to live about %20 longer.  This, to a person living in the west, means living like a supermodel, and avoiding all those yummy calories - forever.   And it turns out that very very very few people are willing to do that.   So, a guy named Valter Longo said something genius:  What is the minimum thing we can do to get the same effect as Dietary Restriction?  He found that for a large number of reasons, fasting sporadically could accomplish that.  There are some rules, During the fast, you can eat some things every day for minimum nutrition, but intake of calories is limited to 700 calories per day.   Secondly, the fast has to be 5 days long, as you need your body to go into ketogenesis (where weak cells die and break apart and get flushed out of your body).  Thirdly, you need to do this at least 7 times in a year for the longer term effects to show up. (These effects also include weight loss, and if you have pre-diabetic readings on some levels, those go back into the normal range).  In fact, he was able to get FDA approval for this diet based on these pre-diabetic symptoms disapearing.  An FDA approved diet.  In this world of fad diets, this is a rarity.\n\nBased on Valters work, I was told by a nutrition researcher at the Fred Hutch Cancer Research Center that someone said: Oh, this diet also has anti cancer benefits...  What can we do thats the minimum possible that gives >those< benefits....  and based on that the 8/16 diet was born.  Basically you eat normally for 8 hours a day, then you don't eat the rest of the time.  Think about it... whats the job of a cancer cell?  To grab nurients and replicate.  But you have antibodies that go find cancer cells and tear them apart allowing those bits to get flushed from your body.  (In fact it has been said that everyone has had cancer multiple times, it's just that the antibodies got rid of those cells before they could replicate.   So? In that kind of war, if you don't eat for 16 hours a day, thats time for the antibodies to wipe these cells out when they aren't gathering nutrients and making more of themselves.  It's about leveling the playing field.   Seems legit to me.  and if you don't die of cancer?  That will certainly lead to a longer lifespan... right?\n\n\nMoving on to the drugs:\nRapamycin: This trug targets a gene called mTOR (want to know something funny?  the TOR stands for Target Of Rapamycin).  Now mTOr regulates a pretty well known metabolic pathway, so it turns out that rapamycin provides benefits in sort of the same way as Dietary Restriction.  Lets note that there is a healthspan study in dogs at the University of Washington right now run by Dr. Matt Kaeberlein, but it's not in any clinical FDA trials for longevity even though it's FDA approved for transplant patients, but a number of scientists swear by it.\n\nMetformin: This is an FDA approved drug used by diabetics.  It works to lower the amount of sugar in the blood.   It's milder in terms of effect than rapamycin, and it IS in human trials for healthspan improvement by the FDA at present.  These trials are called TAME - Targeting Aging with Metformin.  Again, a number of people swear by it.\n\nNMN or NR.  If you look at a cells energy cycle, cells burn ATP.  The make ATP by breaking up sugar that enters the cell, and using some of the parts to make ATP.  But they also make NAD+ out of other parts of the sugar - and later on the NAD+ also gets turned into ATP.  Now, NMN and NR are chemicals that are along the pathway that cells use to make NAD+ so it's very easy for cells to use this same pathway to make extra NAD+ from a supplement that you take and that NAD+ is then later used to make more ATP.   It's well known that NAD+ levels go down as people age...  so it makes sense to try to boost those levels right?  There have been a few human trials although none were FDA sponsored.  There is really solid laboratory evidence in mice these two molecules work AMAZINGLY well, there are ongoing human trials right now, and there is loads of anecdotal evidence.   There are also shenanigans about how it's made (enzymatically is FAR preferred to the solvent based manufaturing process), and there are a few lawsuits between some of the companies that sell one or the other as a supplement.  But it's the big stick of the current crop of Epoch 2, and it looks like keeping energy levels in cells up helps them function well for a LOT longer.\n\n-------\n\nThats where we are today.  There are a few drugs being tested, and in use by early adopters, and it looks very very promising.  Where are we headed?\n\nEpoch 3: Stem cells and senescent cell removal.\n\nThere are two breakthrus that will dramatically increase lifespan that are in the \"actively being researched\" but farther out than the drugs above which are already on the market.\n\nLets tackle stem cells first.   These are basically skin cells turned into stem cells that get injected into problem areas, but since they can multiply and become any kind of cell, they can be used to repair damage from any number of age related maladies.   Also stem cells tend to decrease with age, so this forced replacement of them can be a good thing if done right.   There are stem cell therapies today (things like repairing severed neurons, restoring heart muscle after a stroke, and maybe helping to repair joint function, and on and on and on), none of them were specifically engineered with aging in mind, adn so like above, I won't dwell on them.  But... you ask... why did I mention stem cells?  Well, there are folks working on aging specific stem cell therapies.   These longevity related stem cell therapies tend to be in the realm that uses genetically engineered stem cells.  Repairing macular degeneration, and tissue regeneration are two that are on the radar.  Lets talk about the first: It turns out that in the eye, there is a specific protein that builds up, that our bodies can't get rid of, but with a 1 base pair change to our dna, there is a protein that CAN get rid of it.   So, we take a sample, make a few stem cells, then edit the dna of those stem cells so that they can clear this protein out of the eye, and grow a large number of them, and inject THOSE stem cells back into the eye.   This is the macular degeneration fix.  It is NOT here today, but there are labs that have done this in mice.   This is the exact same approach that is being talked about for arterial plaque buildup.  This first use is really indicative of a larger \"category\" of age related diseases where the body has built up some gunk outside of the cells over time, and it needs to get removed, but it never gets built up too much until after we have kids, so evolution doesn't see it as a problem.  (Since evolution only cares about the genes we pass on, adn thats already done by the time this issue crops up.)  We who want to live longer, clearly DO think that this is an issue.  Since I mentioned them, for muscle regenation or nerve regeration, it's basically a genetically edited stem cell where the appropriate growth factor is somewhat overexpressed, injected into the correct tissue to stimulate faster or more growth thats wanted.   \n\nThe first one of these stem cell therapies, if I have to guess is 5 to 7 years out since it is a new approach that the FDA has to approve.  Thankfully they have approved stem cell therapies in the past, and they have approved genetic editing of single cells that get grown to a large number of cells in the past (the car-t lukemia treatment that got approved as of december 2017), so with the fundamental approaches being known it probably won't take them a full decade for us to start to see these uses for stem cells.\n\nSenescent cells.   Also on the \"getting rid of what we don't want vein\".  It turns out that all cells start as a stem cell then divide into a stem cell and a differentiated cell - one that has a specific function.  Senescent cells are those that are doing their differntiated job but getting old (and probably starting to be bad at their job), and refusing to die.. They are just a hangin around.   Now, the body knows how to handle small scale damage (As a single example - there is a signal called PDGF Platelet Derived Growth Factor) that some cells excrete as they die telling stem cells in the area that someone is gone, and maybe another cell is needed...)  So, IF we can get weak differentiated senescent cells to die we can force nearby stem cells to divide and get a fresh cell thats new and NOT bad at it's job to take the place of the senescent cell.   Turns out that Hydrogen sulfide (present in garlic) is a good chemical to trigger weak sensecent cells to die.  But there are issues getting it to the right cells, not having it be toxic, and any number of other issues.   There are folks that have done work in mice that shows DRAMATIC improvement of healthspan, and restoration of many weakened body functions due to \"age\" when senescent cells are removed.  There are no human trials yet, but be sure that once there is a senescent cell removal therapy, you will want to go get it.\n\nI espect this to come about (given the state of research and published papers) within the next decade.  These two technologies will make for a HUGE leap forward in both quality of life and longevity.\n\n-------\n\nAnd if this is going to make things so much better, what could possible be epoch 4?\n\n\nEpoch 4, Epigentic resetting.\n\nThis is where I extrapolate the future.  If I am going to tell you what treatments are coming next, I think it's important to start with the ROOT CAUSE of aging - all the treatments above are treatments for first order effects - symptoms if you will - how do you better fix things after something has gone wrong.  I want to talk about how we will be able to prevent things from going wrong in the first place inside your cells.  It turns out that there might be a few things that cause aging, but far and away the most important of them is cellular disregulation.   Think about this...  We have a system that regulates what genes are on, and which ones are off, and how much of each gene is expressed.  It's called the epigenetic system.   I'll describe how it works in slightly more detail a bit later.  For now, imagine that over time, the epigenetic system \"degrades\".  And we have about 20,000 genes that do different things, and the DNA for each of those is in every cell in the body.  Think about what might happen if a cell that makes light receiver in your eye gets turned on in a cell in your heart.  Having to make those extra proteins will take some of the ATP that it takes to beat that heart cell - and having that protein present in the cell might interfere with other things in the cell - and this is one singular example.   At the point that enough cells in your skin degrade, it will get saggy, at the point that enough muscle cells stop working right your muscles degrade, etc, etc, etc.  In short aging.   Now, I am not the first person to say that cellular disregulation is the most important thing, a number of people think that this is THE biggest problem we need to solve, and the entire field is slowly shifting to this point of view.\n\nOk, if thats the biggest problem... what causes the epigenome to \"degrade\"?  Again, there are a number of causes, but right now the evidence points to \"double stranded DNA breaks\" being far and away the most important cause.  Thats right double stranded DNA breaks.  What?  We have proteins that repair those right?  Yes. But... There are side effects.  It turns out that Dr. David Sinclair did an experiment with mice that doubled the double standed DNA break rate in very specific places on the genome of a mouse.  He performed this experiment over the span of a year, and at the end, compared it to a litter mate, and yes, the DNA break mouse looked very elderly compared to it's one year old bretherin that was in the prime of it's life (mice live about 2 years, so testing aging in mice this way is fair game.)  The takeaway of that experiment is that double stranded DNA breaks mess with the epigenome and that... causes aging.\n\nOK, I've mentioned the epigenome a few times now, I'd better give a little bit more depth on it. Let me start with a statistic: We think we maybe understand the function of %90 of the DNA we have (I can justify this if needed) - but we maybe only understand %50 of what there is to be learned from the DNA we have.  Compared to this, we understand only about %5 of the big picture of what there is to be learned about the epigenome.  Let me give you a big picture overview of the basics: What we do know is that there are two main mechanisms at play.   The way that genes are turned on or off (or regulated up and down like a volume control knob) is by that DNA being accessable to the proteins that make RNA copies of it.  The first mechanism: On the outside of your DNA, almost as an annotation system we get \"methylation\", and in most cases, if you methylate something that gene turns off - think about it, the protein that wants to make a copy comes along and oops, it's blocked from getting to the DNA it wants by a methyl group, so... no copy is made. This is kind of the on off switch.   The second mechanism is way way way more complicated (it's more the volume control knob).  We have 2 meters of dna if you stretch it out.  Thats a lot.  Imagine it being a ball of yarn stuffed into the neucleus of a cell, how do you find anything?  Well... in that scenario, you can't... but we have evolved \"histones\", and the dna wraps around them, and gets all coiled up.  Lots of histones which allow everything to be wrapped up neatly and predictably.  Now, histones have certain tails of amino acids hanging off the side that things can bind to.   DNA has a very slight positive charge.   And methyl groups have a very slight positive charge...  and acetyl groups have a very slight negative charge.  So... imagine adding a methyl group, and the two positives charges push each other away, meaning the dna wraps less tightly around the histone, meaning it's slightly MORE available to be transcribed, and acetyl groups help to wrap the DNA more tightly and turn down transcription.    And now, let me blow your mind...  there are about 200 different epigenetic markers that have been discovered, and people are working feverishly to decipher and understand and map them all.  It's my understanding that DNA methylation has the largest \"control authority\" over gene expression so lets talk only about that.\n\nIt's clear that if the epigenome gets messed up by double standed DNA breaks that the implication is that the proteins that go to the break and repair it also knock some methyl groups off, or add some extra ones as they do their job - it appears that in certain areas of the genome it's more \"add\" and in other areas it's more \"remove\", but with age, gene expression TENDS to drop (meaning more methylation).  Now the damage (extra methylation) appears to be somewhat random.  Today noone knows the exact mechanism that causes this damage - so if you are looking for a PHD project?  This is a really solid one to take on.  \n\nBut what we DO know, is that there is a specific profile of DNA methylation that seems to be present at varying ages - certain important points on the genome either have it or don't.  And as you age, other IMPORTANT points get methylated.  This work was done by Horvath and Hanuum in about 2013 when they published separate papers on the \"DNA methylation clock\".  There are 400ish sites that get methylated, and which of those sites is currently methylated can be used to determine your age (barring radiation, obesity, or smoking exposure) to within a few years.  In fact, this clock is accurate enough that one european government is using it to determine the age of refugees who have no documentation (to determine if they are over or under 18 years old as the law has different rules for the two groups.)  The method gives you an answer at the age of 18 thats within 2 years, and previously they called in dentists to look at wisdom teeth and got answers that were within 5 years.  Even though this is a new technology, and it has so much room for improvement, it is already better than the old methods of determining age. (scary right?)\n\nSo, now you know what causes aging!  Double stranded DNA breaks cause DNA methylation to increase messing up gene regulation.   it's SO SIMPLE, RIGHT?  Here is a paper with a bit more depth to it that explains what I just did again with diagrams and definitions, and way more detail: http://www.longlonglife.org/en/transhumanism-longevity/aging/epigenetic-aging-longevity/epigenetic-alterations-as-a-cause-of-aging/\n\nSo whats coming?  Here is where I make my specualtive prediction: We will take every cell in your body and RESET the epigenome.\n\nWHAT?  How the hell is that possible?!?  Well...  if we look to biology for answers, how does the methylation on your DNA get there in the first place?  We have an enzyme called DNA methyltransferase (actually there are alot of them that do this kind of thing), and there are other mechanisms that remove methylation. \n\nYou have all heard of CRISPR right?  CRISPR is a combination of two things.  First is the Cas9 gene that likes to cut DNA, and second is a peice of RNA that guides the Cas9 gene to the place it's needed to do that cutting.     WAIT!!! Cutting DNA?  Thats bad, right?  Yes, but...\n\nAs of 2016 some scientists in China (Shawn Liu and Xuebing Wu, and others) developed a version of CRISPR where they took off the part that cuts DNA, and added on a part that demethylates DNA, and you can buy this off the shelf now.\n\nSo, all you need to do (hahaha, as if this really is easy, right?)  All you need to do is to identify all the places that need to be demethylated, build the correct guide RNA, and deliver a cas9-dna-demethyltransferase along with the guide RNA into every cell in your body, and voila!  No more cellular disregulation.  And at that point the cell will behave normally, and it won't become senescent, or die, or misbehave in any way.\n\nAs part of identifying those genes that need to be reset? Lets talk for a moment about how we might do that.  Remember the Hanuum clock?  %10 of the methylation marks are in a gene called KLF14 which is a master regulator of metabolism and obesity. (I'll also note that one of the stem cell creation factors - Klf4 - is a brother protein to this).  It strikes me that a lot of the drugs mentioned earlier focus on metabolism related things, so pointing at this gene seems to pass the smell test. \n\nMy bet is thats it's not a bad gene to start with, and resetting it might show some mild improvement in lifespan.  But more likely, doing this will backfire as the gene regulation system is ridiculously complicated, and so I think that to get ANY effect we may need to reset a dozen or so genes, and to get the DESIRED true longevity effect, we may need to reset somewhere between 200 and 500 genes.  and all I've talked about is the methylation.  Remember there are 200 or more epigenetic marks to take into account and decipher.\n\nAnd then there is the issue of delivering this drug to every cell in the body.  We use viral vectors to do this today in gene therapy, and so some of this delivery part is available, but... it's expensive today, and as a technology, it too is in it's infancy.  \n\nAnd now, just to make sure that you understand the hieghts of the smooth granite mountain peaks you are about to free climb...  there are 240 or so tissue types that are tracked today, thats clearly not all of them, and each tissue type is likely to have it's own set of genes that need specific \"settings\", and since the viruses used to deliver gene therapy products are usually attracted to very specific tissue types, we will need at least that many viral variants to deliver these specialized cocktails to those cells...   Trivial, right?\n\nSo, I think we CAN fix our gene regulation, and our first attempt, with limited understanding and maybe a dozen genes, we can make some headway, and herald it as a major breakthru, but 10 or 20 years later when we REALLY understand what we are doing?  These postulated first efforts will seem like the dark ages where we drilled holes in the skull to \"let the demons out\". \n\nWhen will this happen?  All the tools are there, heck, I've even identified an initial gene as a possible target.  All it takes is someone to fund the study in a lab.  Are we at the point where most funders see this as the next logical step?  From what I know today? No they do not.  This means we will need at least 5 more years of epigenetic mapping and research and refinements to the clock and understanding gene regulation pathways, and more importantly progress into the second and third epohs listed above to show that logevity is actually achievable, and and and... and then we can see some early results for a version 1 that mitigates aging in elderly folks who have gene disregulation, and once reset they get healthier.  (the fact that they will live longer, thats not what the FDA will focus on - they will want to see folks with a better metabolism, with more muscle tone, etc, etc, etc, things they can measure NOW.)\n\nSo, when will this happen?  I think we may see the first scientific paper that addresses this root cause of aging within the next 10 years (unless you count THIS as the first paper, in which case... I'd be honored), and that... that will be the beginning of the 4th epoch of longevity.\n\n\n-------\n\nSo, this is my take on the treatments, pills, therapies, processes, procedures, research and so on that will lead to a revolution in longevity.  \n\nThe short version to wrap this all up is: Given the roadmap I've laid out here and the progress we have already made - I THINK that we can get there.","title":"The 4 epochs of longevity.","subreddit_name_prefixed":"r/longevity","ups":107,"created":1537509434,"link_flair_background_color":"","id":"9hjevj","author":{"name":"John_Schlick"},"permalink":"/r/longevity/comments/9hjevj/the_4_epochs_of_longevity/","url":"https://www.reddit.com/r/longevity/comments/9hjevj/the_4_epochs_of_longevity/","created_utc":1537480634}