{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Мы живем в такие захватывающие времена, на пороге величайших достижений в истории, едва ли способны увидеть проблески будущего, такого непостижимого, такого великолепного и такого неизвестного. Наше воображение не может постичь это, никакие чувства не могут его воспринять, ни одна песня не может захватить ее славу, ни один поэт не может описать это. Будущее покоится на горизонте, медленно просачиваясь в настоящее, чтобы проявить себя.\n\nВот почему я хочу жить. Наслаждаться компанией друзей и людей, которых я люблю, гулять по лунам Юпитера и строить новые ветви цивилизации за пределами Земли, путешествовать к другим звездам и исследовать новые миры. Есть ли во Вселенной другие живые существа? Я хочу проникнуть в глубины науки, чтобы раскрыть тайны нашего существования. Какое искусство еще предстоит создать или симфонии еще предстоит написать? Какие игры еще предстоит сделать и кто победит? С какими существами я буду сталкиваться в будущем и в кого влюблюсь? Как выглядят уравнения единой теории и что они говорят? Как мы будем развиваться? Какие секреты еще предстоит открыть? Какие вопросы еще предстоит задать?\n\nРешение этой проблемы очень важно для меня. Может быть, они не осознают этого, но я думаю, что это важно для всех. Хотя счастье имеет разные параметры для каждого человека, я считаю, что наше неизбежное снижение и возможная смерть являются основной причиной депрессии и отчаяния, которую многие могут не заметить. Вообразите будущее, где у вас было все время до тепловой смерти, чтобы испытать эту вселенную? Что бы вы сделали? Куда бы ты сходил? Когда эта идея начинает проникать в мейнстрим и люди действительно начинают понимать, о чем идет речь, я не сомневаюсь, что возникнет голодная жажда бессмертия. Будущие поколения, среди которых, как мы надеемся, будут среди них, оглянутся назад в этот период времени и с большим удивлением спросят «где была срочность?». В нашей природе желание расширять наше сознание во времени, и мы стремимся к тому, чтобы оно продлевалось. Быть человеком - значит исследовать и продвигаться дальше нашего нынешнего состояния существования.\n\nTL; DR: я хочу жить триллион лет и смотреть, как сгорают звезды.","title":"Основная причина, почему я хочу продолжать жить, заключается в том, что я хочу испытать будущее","subreddit_name_prefixed":"r/longevity","ups":126,"created":1537987160,"link_flair_background_color":"","id":"9j1ce4","author":{"name":"[deleted]"},"permalink":"/r/longevity/comments/9j1ce4/the_major_reason_why_i_want_to_continue_living_is/","url":"https://www.reddit.com/r/longevity/comments/9j1ce4/the_major_reason_why_i_want_to_continue_living_is/","created_utc":1537958360}