{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"1. [http://www.projectforawesome.com/watch?v=Gj7Xif4s8vk] (http://www.projectforawesome.com/watch?v=Gj7Xif4s8vk)  Это очень хорошо сделано стилистически и с точки зрения редактирования. Сделанная точка зрения очень оригинальна, отходя от дихотомии сообщений, которые фокусируются либо на улучшении, либо на болезнях старения. В видео нет ни одного из них в фокусе, но учитывает оба, концентрируясь на очень важном аспекте нашей психологии, то есть \"фатальном недостатке\", который делает многих людей слепыми к важности нашей миссии. Я думаю, тебе понравится так же, как и мне. Еще один интересный аспект заключается в том, что он открыто бьет зрителя по лицу. Интересно, если это окупается как стратегия.\n2. [http://www.projectforawesome.com/watch?v=zLbM18puTlM] (http://www.projectforawesome.com/watch?v=zLbM18puTlM)  Эта вторая заставит тебя плакать. Это самая искренняя и искренняя статья о старении и SENS, которую я когда-либо видел. Это бьет тебя, но не так, как первый.\n\nЭти двое мои любимые, и я вас уверяю, они действительно хороши.\n\nВы можете найти и проголосовать за всех остальных, сделанных в поддержку SENS, здесь: [http://www.projectforawesome.com/?charity=NwPJ0O1f] (http://www.projectforawesome.com) /? charity = NwPJ0O1f) , а для LEAF здесь: [http://www.projectforawesome.com/?charity=7RGRgIDG]<span translate = \"no\"> (http://www.projectforawesome.com) /? благотворительность = 7RGRgIDG) </ SPAN>. Есть и такие, которые тоже довольно хороши. Время от времени проверяйте две страницы, чтобы узнать, не было ли что-то опубликовано, в том числе потому, что они пока не завершены (некоторые видео уже отправлены на веб-сайт, но по-прежнему не появляются среди других, возможно, из-за ошибка).","title":"Смотрите эти два маленьких шедевра, сделанные в поддержку SENS для P4A 2018","subreddit_name_prefixed":"r/longevity","ups":34,"created":1544237668,"link_flair_background_color":"","id":"a42urq","author":{"name":"Anle-"},"permalink":"/r/longevity/comments/a42urq/watch_these_two_little_masterpieces_made_in/","url":"https://www.reddit.com/r/longevity/comments/a42urq/watch_these_two_little_masterpieces_made_in/","created_utc":1544208868}