{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"После изучения основ биологии и прочтения о долголетии в течение нескольких лет и недавнего оптимизма в области активного омоложения мыши и сенолитики, я чувствую, что сейчас подходящее время для исследования и обдумывания инвестиций. Я думаю, что еще рано вкладывать средства в акции (сейчас ваши деньги лучше в криптовалютах с небольшими заглавными буквами), но когда в новостях появятся подробные исследования по омоложению мыши, и здесь произойдут несколько прорывов, они, скорее всего, взлетят до небес , Вот почему мы должны быть готовы как можно раньше.\n\n\n\nУ вас есть тысячи людей, которые делали большие или маленькие состояния с запасами сорняков или крипто, которые будут вводить деньги в космическую ИМО. Несмотря на то, что сегодня в криптографии все еще очень много прибыли, многие уже ищут альтернативы, такие как грибы. Я согласен с идеей «мании», которую имеет Джим Меллон [https://medium.com/neodotlife/juvenescence-jim-mellon-longevity-e9a415dd0569] (https://medium.com/ neodotlife / juvenescence-jim-mellon-longevity-e9a415dd0569) , который на самом деле его начальное финансирование запускает влево и вправо через ювенесценцию (и Тила, и даже Безоса).\n\nРазум сделал хорошую статью об этом [https://www.fightaging.org/investing/] (https://www.fightaging.org/investing/) \n\nВся прибыль, которая будет получена за счет прироста запасов долговечности, активов (возможно, даже в будущем активов против старения на основе крипто / STO), может быть повторно введена в космос и т. Д., Экспоненциально ускоряя финансирование в промышленности, исследованиях и прогрессе , Я вижу много перспектив, делающих x100, возможно даже x1000.\n\n\n\nКонечно, это не заменит пожертвования SENS и тому подобное, я вижу, что это работает в долгосрочной перспективе. Представьте себе прибыль, которая может быть получена, скорее всего, самой важной технологической революцией в истории человечества.\n\nКак побочный эффект, некоторые из нас, кто хочет посвятить значительную часть своего времени исследованиям по продлению жизни, смогут сделать это, будучи финансово независимыми (как Гарретт сделал с акциями Apple в теоретической физике [https: //en.wikipedia) .org / wiki / Antony \\ _Garrett \\ _Lisi]  (https://en.wikipedia.org/wiki/Antony_Garrett_Lisi) ). У вас также будет достаточно денег, чтобы заняться крионикой, если, к сожалению, этого не произойдет (тем не менее, имейте в виду, что начальное финансирование будет блокировать средства на годы).\n\n\n\nС умом сообщества / улья у нас будет очень хороший взгляд на отрасль, и у нас даже будет возможность инвестировать вместе (объединение для начального финансирования или что-то еще), когда придет время.\n\n\n\n[https://www.reddit.com/r/LongevityInvesting] (https://www.reddit.com/r/LongevityInvesting) ","title":"Сделал саб для инвестирования","subreddit_name_prefixed":"r/longevity","ups":44,"created":1550958989,"link_flair_background_color":"","id":"atvqsb","author":{"name":"Tosma00"},"permalink":"/r/longevity/comments/atvqsb/made_a_sub_for_investing/","url":"https://www.reddit.com/r/longevity/comments/atvqsb/made_a_sub_for_investing/","created_utc":1550930189}