{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"https://www.thelongevityforum.com/\n\n> Мы считаем, что увеличение продолжительности жизни представляет собой величайшую возможность 21-го века, но потребует вдумчивого и быстрого реагирования, чтобы обеспечить получение его выгод.\n\n> Поскольку в каждой стране мира наблюдается старение населения, отдельные лица, компании и страны, которые лучше всего адаптируются, получат существенное конкурентное преимущество.\n\nДля краткого изложения события Reason на fightaging.org написал свои мысли здесь: https://www.fightaging.org/archives/2018/11/notes-on-the-2018-longevity-forum-in-london/\n\nВидео в произвольном порядке:\n\n** [Группа по вопросам молодости. 38 минут]  (https://vimeo.com/306306041)  ** - https://vimeo.com/306306041\n\n* Дэвид Коллинсон: пенсионная страховая корпорация\n* Джон Маттик: Геномика Англия\n* Эрик Вердин: Институт Бака\n* Майк Уэст: AgeX Therapeutics\n\n\n\n** [Марк Фридман, Encore.org]  (https://vimeo.com/306306034)  ** - https://vimeo.com/306306034\n\n* https://encore.org/\n\n> К 2035 году 140 миллионов американцев, более 1 в 3, будут старше 50 лет.\n\n> В течение десятилетий продуктивности взрослые старше 50 лет являются растущим и возобновляемым ресурсом, который мы не можем позволить себе тратить впустую.\n\n\n\n** [Майк Уэст: AgeX Therapeutics \"Единая теория старения: биотехнология и будущее здравоохранение] <span translate =\" no \"> (https://vimeo.com/304400992) </ span> ** - https: // vimeo.com/304400992\n\n\n\n** [Лора Карстенсен: Стэнфордский университет \"Новая карта жизни\"]  (https://vimeo.com/304400776)  ** - https://vimeo.com/ 304400776\n\n> Лаура Л. Карстенсен, доктор философии, директор-основатель Стэнфордского центра по долголетию, профессор психологии и профессор по общественным вопросам Фэрли С. Дикинсон-младший в Стэнфордском университете, где она также является директором-основателем Стэнфордского центра по долголетию , который исследует инновационные способы решения проблем людей старше 50 лет при одновременном улучшении благосостояния людей всех возрастов. Она наиболее известна в научных кругах по теории социально-эмоциональной избирательности, теории мотивации на всю жизнь, и вместе со своими учениками и коллегами опубликовала более 150 статей о развитии продолжительности жизни. Ее исследования поддерживаются Национальным институтом старения уже более 20 лет, и в настоящее время она получает награду МЕРИТ. В 2011 году она написала «Долгое светлое будущее: счастье, здоровье и финансовая безопасность в эпоху увеличения продолжительности жизни». Она является членом Исследовательской сети Фонда Макартуров по проблемам общества старения и в настоящее время является членом Национального консультативного совета по проблемам старения в NIA.\n\nhttp://longevity3.stanford.edu/people/laura-carstensen/\n\n\n\n** [Джим Меллон: молодость]  (https://vimeo.com/303497437)  ** - https://vimeo.com/303497437\n\n(Juvenescence - британская биотехнологическая компания, специализирующаяся на разработке антивозрастной терапии)\n\n\n\n** [Эрик Вердин: Институт Бака «Эпоха старения сейчас»]  (https://vimeo.com/303497402)  ** - https: // vimeo. ком / 303497402\n\n\n\n** [Эндрю Скотт \"100 лет жизни\"]  (https://vimeo.com/303497390)  ** - https://vimeo.com/303497390\n\nhttp://www.100yearlife.com/\n\n> В 100-летней жизни - жить и работать в эпоху долголетия, опубликованной 2 июня 2016 года издательством Bloomsbury, Линда Граттон и Эндрю Скотт рассказывают о трудностях и разумных решениях, которые все мы, любого возраста, должны сделать для того, чтобы превратить большую продолжительность жизни в подарок, а не в проклятие. Это не проблема, когда мы стареем, а срочная и неизбежная.","title":"Записи с Форума долголетия в Лондоне, ноябрь 2018 года.","subreddit_name_prefixed":"r/longevity","ups":36,"created":1551171180,"link_flair_background_color":"","id":"ausunr","author":{"name":"ontodynamics"},"permalink":"/r/longevity/comments/ausunr/recordings_from_the_longevity_forum_in_london/","url":"https://www.reddit.com/r/longevity/comments/ausunr/recordings_from_the_longevity_forum_in_london/","created_utc":1551142380}