{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Каждая нишевая идея сначала будет опозорена, пока люди в массе не начнут ее понимать. Я говорю, что нам нужно начать жесткую рекламу во всех социальных сетях. Один из лучших способов привлечь внимание общественности - заставить людей, которые больше всего боготворят в Интернете, говорить о долголетии, будь то положительном или отрицательном, мы должны сделать так, чтобы он был в центре внимания каждого. Это будет похоже на ИИ в начале 2000-х, мало кто это понимал, но он стал довольно популярным после того, как его стали широко использовать люди и шоу. Посмотрите сегодня, почти любой техник может иметь свой ИИ. Всегда лучше начинать такую ​​кампанию раньше, чем позже, у нас есть медицинское подтверждение, объяснение его социальных последствий и огромное обещание для тех, кто присоединяется к нам. Если все сделано правильно, это будет гораздо эффективнее, чем пожертвовать нескольким компаниям, работающим над этим прямо сейчас. Давайте возьмем на себя инициативу и сохраним график экспоненциального роста наших абонентов. Посмотрите на r / writing Prompts, половина всех опубликованных историй практически посвящена бессмертным, то есть существует глубокий интерес к теме, которую мы просто еще не использовали. Мы обещаем им, что они не стареют, что является практически лучшим вариантом. Я говорю, что у нас есть организованная стратегия, в которой каждую неделю мы выбираем одну известную звезду в социальных сетях (YouTube, Twitter, Instagram) и рассылаем им спам с помощью сообщений или идей о долголетии. Кроме того, одним из наших самых больших активов являются мем-страницы. Если мы сможем создать один мем, основанный на вирусной долголетии, эта линия роста подписчиков будет прямой вертикалью. Я хочу увидеть эту вертикальную линию, а вы?","title":"Нам нужно начать радикальную кампанию","subreddit_name_prefixed":"r/longevity","ups":72,"created":1552256904,"link_flair_background_color":"","id":"azg5bb","author":{"name":"GreaterGodness"},"permalink":"/r/longevity/comments/azg5bb/we_need_to_start_a_radical_campaign/","url":"https://www.reddit.com/r/longevity/comments/azg5bb/we_need_to_start_a_radical_campaign/","created_utc":1552228104}