{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Полный текст статьи: [SIRT1 активирует MAO-A в мозге для преодоления тревоги и исследовательского влечения]  (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3443638/)  (2011)\n\n****\n\nВ этой статье было показано, что мыши, подвергшиеся ограничению калорийности (CR), демонстрировали поведение, связанное с тревогой и депрессией. [Демонстрация механизма + гипотеза]  (https://i.imgur.com/kynd2dc.jpg) \n\nБыло обнаружено, что механизм основан на индукции MAO-A SIRT1. Фермент МАО-А расщепляет моноаминовые нейротрансмиттеры / нейромодуляторы (дофамин, норэпинефрин, серотонин, триптамин). Высокие уровни активности МАО-А, следовательно, могут значительно снизить уровень моноаминов, и такое истощение связано с тревогой и депрессией как у грызунов, так и у людей. Установлено, что у пациентов с серьезным депрессивным расстройством (MDD) [на 34% выше] <span translate = \" no \"> (https://www.ncbi.nlm.nih.gov/pubmed/17088501) </ span> Экспрессия MAO-A в среднем в мозге по сравнению с контролем.\n\nОбнаружено, что поведение, похожее на тревожность и депрессию у мышей CR, устраняется с помощью неселективного MAOI Phenelzine (Nardil) или SSRI Fluoxetine (Prozac).\n\nИсследование также показало, что некоторые SNP SIRT1 (генетические мутации / полиморфизмы) связаны с повышением частоты сообщений о тревожных расстройствах у людей. Было обнаружено, что мыши со сверхэкспрессией SIRT1 были более тревожными, чем контрольные, в то время как у крыс с специфической для мозга делецией SIRT1 было обнаружено меньшее беспокойство, чем у контрольных.\n\nАвторы предполагают, что это эволюционно консервативное поведение, используемое для максимизации выживания видов в состоянии хищничества. Тревога способствует бдительному поведению, в то время как депрессия снижает исследовательский драйв - оба результата повышают вероятность выживания хищников. Похоже, что SIRT1, индуцированный CR, сигнализирует о состоянии преддиации у мышей.","title":"Ограничение калорий (CR) вызывает у мышей поведение, подобное тревожности и депрессии [CR -> ↑ SIRT1 -> ↑ MAO-A -> ↓ Моноамины] (статья 2011 г.)","subreddit_name_prefixed":"r/longevity","ups":81,"created":1555189387,"link_flair_background_color":"","id":"bcq9cg","author":{"name":"CytoGuardian"},"permalink":"/r/longevity/comments/bcq9cg/calorie_restriction_cr_induces_anxiety_and/","url":"https://www.reddit.com/r/longevity/comments/bcq9cg/calorie_restriction_cr_induces_anxiety_and/","created_utc":1555160587}