{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Заранее извиняюсь за дерьмовый титул, позвольте мне попытаться объяснить здесь: на данном этапе справедливо принято, что * физические упражнения очень важны для долголетия *, однако не все физические упражнения имеют такой же длительный срок, что и ** минусы ** , В качестве нескольких примеров:\n\n* ** Силовые тренировки ** и силовая атлетика, в зависимости от генетики, веса, повторений и техники, могут привести к травмам и долговременным повреждениям, которые ухудшают качество жизни с возрастом. Грыжа межпозвоночных дисков, замены тазобедренного сустава, постоянные слезы, я уже накопил некоторые из них после двух десятилетий подъема.\n* Некоторые люди клянутся ** по художественной гимнастике **, но некоторые утверждают, что они стали грубыми для ваших суставов на протяжении многих лет, так что рано или поздно вы выбьете себе плечи и локти.\n* ** Бег ** может предположительно разрушить ваши колени и бедра, если сделано неправильно, с неправильной генетикой, или сделано достаточно долго.\n\nИ т.д. и т. Д. Я уверен, что мы можем думать о множестве других видов спорта, которые, кажется, не приводят к отличным долгосрочным результатам, даже если в данный момент они могут дать вам как эстетические, так и оздоровительные результаты.\n\nМожем ли мы подумать о некоторых видах спорта или видах деятельности, которые ** не ** имеют почти такой же недостаток, как другие, и все же дают вам много преимуществ? Йога приходит на ум, кажется, в целом, гибкость, очень желательно с возрастом. Плавание кажется вам довольно легким. Не уверен насчет езды на велосипеде.\n\nМысли? Статьи или исследования, которые могли бы быть опубликованы на эту тему?\n\nЗаранее спасибо!","title":"Какие виды физической активности лучше всего подходят для долгосрочной окупаемости инвестиций?","subreddit_name_prefixed":"r/longevity","ups":33,"created":1555299503,"link_flair_background_color":"","id":"bd6mqq","author":{"name":"alexwolf_"},"permalink":"/r/longevity/comments/bd6mqq/which_types_of_physical_activity_are_best_long/","url":"https://www.reddit.com/r/longevity/comments/bd6mqq/which_types_of_physical_activity_are_best_long/","created_utc":1555270703}