{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Я продолжаю думать о том, как мои родители (51 и 60 лет), вероятно, оба умрут и не смогут добиться «скорости спасения долголетия». Зная, что их смерть не будет нужна никоим образом, только трагедия. Мысль ужасна, и я знаю, что это будет в 1000 раз хуже, когда это действительно произойдет. Я только подверг сомнению старение 1,5 года назад, и с тех пор я хотел заняться исследованиями старения (у меня второй год обучения по физике).\n\nНекоторые люди утешаются верой в то, что жизнь после смерти существует или что их родители все еще с ними в духе. Но я не верю этому - я верю, что переживание смерти точно такое же, как и до рождения; то есть не существует, без чувства времени и без мыслей, потому что больше нет «вас», потому что ваш мозг не функционирует. Поэтому, когда мои родители умрут, они исчезнут, и я останусь один; они не будут знать, как я себя чувствую, потому что они перестанут существовать.\n\nЖить еще 1000 лет было бы намного печальнее без них.\n\nЯ просто печатаю свои мысли, когда они приходят. Я надеюсь, что люди с такими же мыслями находят утешение в знании, что они не одиноки в этом опыте.\n\nЯ полагаю, что у меня есть два способа взглянуть на долголетие: трагедия, которая запоздала, и трепет от того, что возможно в будущем, если оно наступит вовремя.\n\n\nРедактировать: я не думаю, что стоит беспокоиться о том, «насколько вероятно», что мы добьемся успеха - особенно если я фактор, который может повлиять на результат. Я согласен с тем, что важно наслаждаться своей жизнью, и достижение такой глубокой цели, как эта, дает мне большое чувство цели и волнения.\n\nЕсли я достигну 80 и осознаю, что мы не успели вовремя, я буду разочарован, но думаю, что почувствую, что наслаждался путешествием.\n\nКроме того, я согласен, что важно иметь социальную жизнь и проводить время с друзьями и семьей. Но я думаю, что каждый должен иметь какую-то работу, чтобы поддерживать себя. Я стремлюсь сделать лечение старением своей работой, а не всю мою жизнь.","title":"Родители...","subreddit_name_prefixed":"r/longevity","ups":62,"created":1555755033,"link_flair_background_color":"","id":"bf7blb","author":{"name":"tomhuts"},"permalink":"/r/longevity/comments/bf7blb/parents/","url":"https://www.reddit.com/r/longevity/comments/bf7blb/parents/","created_utc":1555726233}