{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Лечение старения - это биологическая и технологическая проблема, которая может быть решена оптимально раньше, чем позже, поэтому мы подходим к большому вопросу: следует ли лечить старение?\n\nЯ отвечу на это, обращаясь к некоторым из самых распространенных мифов о продлении жизни.\n\n1) «Лечить старение морально неправильно»\n\nВ соответствии с принципами биоэтики, такими как принцип благотворительности, поскольку лечение старения принесет пользу людям, а не навредит им, это не является этически неправильным. Если лекарство доступно, люди должны иметь возможность выбирать, хотят ли они продолжать лечение или нет, в соответствии с принципом уважения автономии. Принуждение их к обратному варианту равнозначно их смерти против их воли.\n\n2) «Это было бы доступно только самым богатым элитам»\n\nВопрос справедливости и справедливости обычно поднимается, когда речь идет о продлении жизни. Конечно, невозможно предсказать цену, которую могло бы принести фиктивное лекарство от старения. Из опыта мы знаем, что ряд медицинских достижений не сразу доступны для всех. Ранние антибиотики изначально были доступны только для небольшой элиты (сейчас они представлены на полках практически всех аптек), а ряд современных технологий, таких как сканирование КТ и пересадка сердца, доступны не каждому. Это, однако, не является причиной для нас, чтобы запретить кардиостимуляторы или регенеративную медицину. Мы не отрицаем пересадки сердца только потому, что они не доступны для всех, так же как мы не можем отрицать здоровье и жизнь только потому, что некоторым людям не хватает медицинской помощи. Кроме того, даже если лечение старения действительно изначально дорого, можно предположить, что оно в конечном итоге будет доступно каждому по доступным ценам, следуя тенденции, наблюдаемой во всех медицинских прорывах широкого распространения. Нравится вам это или нет, но антивозрастная медицина может стать крупнейшим фармацевтическим рынком в истории, и эта возможность наверняка не останется без внимания всех предприятий. Также важно помнить, что лечение старения, скорее всего, будет постепенным, а не окружением одного прорыва.\n\n3) «Старение естественно, и мы не должны бороться с ним»\n\nСтарение отнюдь не является обязательным условием жизни, и биологическое бессмертие на самом деле довольно распространено в природе. Кроме того, есть тот факт, что мы уже косвенно боремся со старением, борясь с возрастными заболеваниями. Помните, что старение влечет за собой целый ряд патологий, таких как рак, болезни сердца, инсульт и нейродегенеративные заболевания, и для большинства из них лечение часто считается желательным. В то время как борьба с отдельными компонентами старения вызывает незначительную оппозицию, борьба со старением в целом (даже если это, следовательно, излечит почти все описанные патологии) рассматривается как неестественная и морально сомнительная, чего не должно быть. Человечество находится в постоянной борьбе с Природой. Мы разработали вакцины и антибиотики для предотвращения ряда нежелательных «естественных последствий» (таких как болезнь и смерть), и сегодня мы настойчиво пытаемся достичь того же в наших борьбе против рака, Зика, СПИДа, Эболы и многих других заболеваний. Оспа, например, была одним из величайших убийц в истории человечества и была устранена с помощью современных технологий - с ее помощью мы вернули то, что считалось естественным результатом, и многие из нас существуют исключительно из-за этого. Борьба с природой и смертью является фундаментальной частью человеческого бытия.","title":"Мы должны уделять приоритетное внимание лечению старения","subreddit_name_prefixed":"r/longevity","ups":153,"created":1556797111,"link_flair_background_color":"","id":"bjqf81","author":{"name":"swiet"},"permalink":"/r/longevity/comments/bjqf81/we_should_prioritize_curing_aging/","url":"https://www.reddit.com/r/longevity/comments/bjqf81/we_should_prioritize_curing_aging/","created_utc":1556768311}