{"subreddit":{"display_name":"longevity"},"subreddit_loc":"longevity","selftext":"I am 23 year old 4th year med student (2 years more to go before starting residency) and I am planning to start a science blog around longevity, gerontology, preventive medicine etc. Btw sorry if my english isn't that great (not my native language). \n\nTo make the blog fun (and also hopefully as an anedoctal evidence) I am making myself a test animal as I will be trying different interventions (drugs, supplements, other therapies etc.) that I find having a very thorough scientific backing in the longevity and anti-aging field. Before I dig deeper to my current interventions I've recently started, I would like to ask you people to tell me about what type of stuff you would like to read from my blog? I am also open for ideas you think I should consider doing, testing or writing on my blog. Of course it would be nice if you'd read my first post and then ask some questions or throw your ideas at me.\n\n\n**My Background**: I am pretty healthy and fit guy, I have a decent sports background and I do a lot of scientific reading on health, nutrition etc. I've studied medicine for 4 years now and in my country it means I can legally work as a physician in certain environments (in hospitals for example), but i'm still 2 years away being fully licensed physician. \n\nI don't have any obsessions for \"living beyond 100\" or anything, I'm just curious on what we can do with modern medicine for humans now and in the future and I am also pretty optimistic that we have pretty good anti-aging interventions already, after studying and reading so much research on the subject.\n\n\nI've done a decent amount of research so far and here's what interventions I've already started, and in the end of this post, what I'm planning to start during the next 5-7 years.\n\n**Just recently I put myself on following drugs/supplements**\n\n• Statin (also thinking using fibrate here, but more on this on my next post)\n\n• Telmisartane\n\n• Metformin\n\n• Resveratrol\n\n\n\n\n**And my scientific basis for these decisions**\n\n\n\n\n **20mg/day Rosuvastatin** --> Thinking long-term CVD risk here, see evidence:\t\n\n* https://www.ncbi.nlm.nih.gov/pubmed/16214597\n\n* https://www.ncbi.nlm.nih.gov/pubmed/22607822\n\n\nWhat comes to statins, my LDL is only 2.3 mmol/l, but there is just too much evidence telling me that every single reduction in LDL lowers your risk for CVD-mortality and that the process of atherosclerosis starts at very early age, in childhood or in early adulthood. See this review paper: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2812791/ \n\nFor me, the plaque formation has probably already started, so it makes sense to start fighting against it right away while the plaque formation process is still reversible. Statins are also fairly well tolerated drugs in RCTs. Of course my 10-year or even 20 year CVD event risk is 0 and the goal with starting statins or any other LDL lowering drug in your 20's with \"normal\" LDL levels isn't lowering short-term CVD risk. However, I expect the statin to give long term benefit since it should delay/reverse plaque formation due to its LDL lowering properties and it should also benefit health/longevity many other ways due to its pleiotropic effects. For pleiotropic effects of statins, the evidence is much more mixed and the quality of papers isn't that good, so any clear conclusion should not be done. These effects are just a possible bonus and these could be proven wrong when better research is being done. See evidence here:\n\nPossible telomere effects: \n\n•\thttps://www.ncbi.nlm.nih.gov/pubmed/23748973\n\n•\thttps://www.ncbi.nlm.nih.gov/pubmed/22022767\n\nAnd good review on overall possible pleiotropic effects: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5633715/\n\nOf course there are always risks with drugs and for the most serious ones statins can induce myopathy in apporx. 3-4/100 000 people, autoimmune based rhabdomyolysis (extremely rare) and it can raise liver enzymes. This is why I am monitoring my blood for example taking blood count, CK, ALAT, ASAT etc. 4 times a year and of course following my symptoms and discontinuing/changing the drug if I get some suspectible symptoms as I would do with any other patient (even though I am a med student, in my country I'm allowed to work as a physician during the end stage of my studies).\n\n**40 mg/day Telmisartane** --> improves cognition and lowers risk for dementia regardless of the effect on blood pressure. Also lower bp is always beneficial for health if your bp isn't already below 120/80. Mine is on average about 123/83, which is classified as pre-hypertension (JNC-7 classification, https://www.jwatch.org/jw200305300000001/2003/05/30/new-hypertension-guidelines-jnc-7) and there is evidence that suboptimal bp (systolic >115 mmHg) is associated with increased incidence of CVD, MI and stroke and increased mortality caused by MI or stroke: https://www.ahajournals.org/doi/full/10.1161/01.HYP.0000173433.67426.9b\n\nSee evidence here for the reduced dementia risk with ARB -use (sartans):\n\n* https://www.bmj.com/content/340/bmj.b5465.long\n\n* https://www.ncbi.nlm.nih.gov/pubmed/24406780\n\n* https://www.ncbi.nlm.nih.gov/pubmed/27475317\n\nThe biological basis on ARB (angiotensin receptor blocker, eg. telmisartane) pleiotropic effects is interestin and still under reasearch. Here are some good papers:\n\n•\tBeneficial effects of Angiotensin II receptor blockers in brain disorders: https://www.ncbi.nlm.nih.gov/pubmed/28711402\n\n•\tThe Renin-Angiotensin System and the Neurodegenerative Diseases: A Brief Review: https://www.ncbi.nlm.nih.gov/pubmed/28828974\n\n•\tEvidence to Consider Angiotensin II Receptor Blockers for the Treatment of Early Alzheimer's Disease: https://link.springer.com/article/10.1007%2Fs10571-015-0327-y\n\n•\tAngiotensin-Receptor Blockers, Hypertension and Alzheimer Disease: https://www.ncbi.nlm.nih.gov/pubmed/23268954\n\n•\tNeuroprotective effects of angiotensin receptor blockers: https://www.ncbi.nlm.nih.gov/pubmed/25362113\n\n•\tDo angiotensin receptor blockers prevent Alzheimer's disease? https://www.ncbi.nlm.nih.gov/pubmed/23703253\n\nTelmisartan is also probably anti-atherosclerotic drug, it lowers CVD risk and it helps CKD -patiens with proteinuria (proxy for kidney function): \n\n*http://care.diabetesjournals.org/content/28/3/757\n\n* https://www.ncbi.nlm.nih.gov/pubmed/22041554\n\n* https://www.ncbi.nlm.nih.gov/pubmed/18633177\n\n* https://www.ncbi.nlm.nih.gov/pubmed/23378528\n\nTelmisartane is also very well tolerated drug so I see no reason to not to use it when looking at the evidence presented here.\n\n\n**500mg/day Metformin** --> I'm actually pretty sceptical that Metformin has any substantial anti-aging properties or anti-cancer properties. However I think there are reasonable enough odds that it has **some** of this potential, also the drug is well tolerated and I also happen to have some family history of diabetes so I want to minimize my risk here, since the benefits will always outweigh the risks on metformin. Sure there are meta-analyses and systematic reviews that show Metformin use is associated with lower cancer mortality:\n \n• https://www.ncbi.nlm.nih.gov/pubmed/22448244\n\n• https://www.ncbi.nlm.nih.gov/pubmed/23936520\n\nHowever, there are many potential confounding factors in these studies that can't be 100% controlled so I want to see well designed RCTs showing reduced cancer incidence and cancer mortality before I am willing to believe in this statement 100%. I know there is biological basis on why metformin could lower cancer risk and that's why I think it's quite likely that metformin will benefit also healthy people. For example, see these papers:\n\n* https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3800579/\n\n* https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6213406/\n\nAlso I find the papers on anti-aging effects of metformin interesting: \n\n• https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5943638/\n\n• https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3906334/\n\n\nI'm highly sceptical on Resveratrol but I'm taking it daily for now since I think it's fairly safe and there some potential. I need to do more research on this for sure before making any further conclusions. However I find the research David Sinclair has done on resveratrol pretty interesting and high quality.\n\n\nI'm doing **daily intermittent fasting**, I eat all my food between 8-14 and go to bed without eating. Of course this is not 100% days if I go out eating with friends etc. but let say I follow this 90% of the days. Good paper on the subject here: https://science.sciencemag.org/content/362/6416/770\n\n\nI follow mostly **mediterranean diet** with moderate-to-low daily amount of high quality carbs (whole wheat e.g) and lots of good unsaturated fats, vegetables, fruits, nuts, legumes, low consumption on meat, moderate-to-high consumption of fish, low consumption of dairy products (with the exception of yogurt and the long-preservable cheeses) etc. Interesting and good quality paper here supporting the longevity effect of mediterranean diet: \n\n* https://www.bmj.com/content/349/bmj.g6674\n\n* Also see: https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5902736/\n\n\nI'm also trying to exercise at least 30 minutes everyday. Mostly high intensity workouts in the gym, swimming or running. I think this is just common sense...\n\n\n**Drugs/supplements I am interested in taking some day in the future include and what I am doing research on my next post includes**:\n\n* Small doses of direct mTOR -inhibitors (weekly rapamycin for example)\n* NAD-boosters (NMN, NR)\n* Pharmacological activators of sirtuins\n* expirementing with short-term piracetam use\n* Fibrates\n* SGLT2-inhibitors\n* PCSK9-inhibitors\n* ANGPTL3 antibodies\n* Daily Sauna use (I already do this almost daily for about 15-20 minutes in 79-85 celsius)\n* High‐purity eicosapentaenoic acid (EPA)\n* You tell me?\n\nThis was quite a long post and I am happy to answer any of your questions and I am open to any suggestions. I also want to remind you that I don't recommend anyone taking any drug without doctors consultation and proper prescription. I consider myself being fairly well educated on the subject and as a health professional I understand the ratio of possible risks and benefits here and I am also able to monitor the risks and adverse events myself to make this exiperiment more safe.","title":"My Journey For Living Healthy 100 years","subreddit_name_prefixed":"r/longevity","ups":28,"created":1557465995,"link_flair_background_color":"","id":"bmpjfc","author":{"name":"DeepUrKo"},"permalink":"/r/longevity/comments/bmpjfc/my_journey_for_living_healthy_100_years/","url":"https://www.reddit.com/r/longevity/comments/bmpjfc/my_journey_for_living_healthy_100_years/","created_utc":1557437195}