{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Когда я заметил, что ОП этого поста ([Где делать мою докторскую степень по старению?] <Span translate = \"no\"> (https://www.reddit.com/r/longevity/comments/ag4v2q/where_to_do_my_phd_on_aging/? utm_source = share & utm_medium = web2x) </ span>) удалили свою учетную запись здесь и (насколько я могу судить) прекратили обновление таблицы, я отправил запрос на редактирование доступа. Когда я так и не получил ответ, я пошел дальше и сделал новую копию:\n\n[** Лаборатории старения (обновлено) **]  (https://docs.google.com/spreadsheets/d/1mnR3uA2pBoT0aUegmoo5yVcLDad0ESlWrXl9_pXvDsg/edit?usp=sharing) \n\nЯ фанат хорошо организованных таблиц, поэтому я начал обновлять и расширять этот. Я добавил столбцы для ** Учреждения **, ** Цитирования **, ** h-index ** и ** i10-index **. Я заполнил эту информацию для всех исследователей из США и пересортировал список на основе Института. Сортировка таким образом, легче определить учреждения, которые проводят большинство исследований в области старения.\n\nЯ также добавил новую вкладку под названием ** Показатели университетов **, где в электронной таблице суммируются и усредняются оценки ** цитирования ** и ** h-index ** для учреждений, перечисленных в основной таблице. Это позволяет легче сравнивать учреждения. Я собрал эти данные с помощью Google Scholar и Scopus Preview, поэтому вы должны рассматривать их как недостаточно информативные.\n\nЧтобы добавить информацию, я создал обновленную форму: [https://forms.gle/8qcdRHDE3bWKDRjT9] (https://forms.gle/8qcdRHDE3bWKDRjT9) .\n\nЕсли кто-то из этого подпредприятия хотел бы внести свой вклад в электронную таблицу, особенно заполнив детали для исследователей за пределами США, просто дайте мне знать. Я рад поделиться доступом, если вы помните о формулах и форматировании.","title":"Где сделать докторскую степень по старению? (Обновлено)","subreddit_name_prefixed":"r/longevity","ups":94,"created":1558933651,"link_flair_background_color":"","id":"btd9g0","author":{"name":"PocketMatt"},"permalink":"/r/longevity/comments/btd9g0/where_to_do_my_phd_on_aging_updated/","url":"https://www.reddit.com/r/longevity/comments/btd9g0/where_to_do_my_phd_on_aging_updated/","created_utc":1558904851}