{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Конфликт между Chromadex и Elysium за контроль над NAD и жизнь навсегда просто принял странный оборот. По всей видимости, Elsyium только что подала в суд на Chromadex за ложную рекламу о том, что Tru Niagen повышает уровень NAD, и говорит, что клинические испытания Chromadex на самом деле говорят, что Tru Niagen не влияет на уровень NAD. Я бы отклонил это как еще одну драму Chromadex / Elysium, но оказалось, что другая компания подала в суд на Chromadex за то же самое несколько месяцев назад.\n\nОсновные положения юридического документа заключаются в том, что существует только одна бумага, в которой тестировался Niagen NR в дозе 300 мг (AKA Tru Niagen), и что при анализе данных, использованных для бумаги, не наблюдается увеличения NAD в дозе 300 мг, только при 1000 мг. , Есть некоторые неприятные вещи о том, что Chromadex заставляет авторов бумаги скрывать это, объединяя данные / информацию вместе (?) И упоминая повышение метаболизма NAD, чтобы заставить людей думать, что сам NAD был создан.\n\nЭто чушь, если правда. Платите в три раза больше, чтобы получить NAD? Нах братан Fisetin. Но возникает вопрос: правда ли это? Это довольно подробно (и есть второй судебный процесс, говорящий то же самое), но с другой стороны, это может быть одна из тех «разумных мыслей, которые могут отличаться». Любой, кто знает свой путь к p-значению, хочет сделать нас всех надежными и проверить данные ??\n\nЮридический документ: https://docs.wixstatic.com/ugd/7fb8ed_c222b490689d41f586ddfab11c5bd5d6.pdf\n\nБольшие взлеты с блоггером, который нашел это.","title":"Ниаген как змеиное масло (может быть)? В двух судебных процессах говорится, что клинические испытания Chromadex показали, что Tru Niagen не оказывает влияния на НАД. Кто хочет стать героем и проанализировать некоторые p-значения?","subreddit_name_prefixed":"r/longevity","ups":69,"created":1560494531,"link_flair_background_color":"","id":"c0cihu","author":{"name":"Methuselahbones"},"permalink":"/r/longevity/comments/c0cihu/niagen_as_snake_oil_maybe_two_lawsuits_say/","url":"https://www.reddit.com/r/longevity/comments/c0cihu/niagen_as_snake_oil_maybe_two_lawsuits_say/","created_utc":1560465731}