{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Сначала введение в контекст:\n\n\n\nКогда происходит разлив загрязняющих веществ, многие бактерии и другие генетически эволюционируют, чтобы поглотить часть загрязняющих веществ. Это может быть использовано для уменьшения загрязнения окружающей среды и называется биоремедиацией.\n\n\n\nМедицинская биоремедиация - это идея, что вы можете сделать то же самое с химическим мусором, который накапливается с возрастом или вследствие болезни, например, при сердечном амилоидозе.\n\n\n\nОбри де Грей принял липофусцин, забрал бактерии из почвы кладбища и, в конце концов, сумел уничтожить липофусцин.\n\n\n\nПозднее обычный подход заключается в изучении метаболизма эволюционирующих бактерий, выделении ключевых ферментов и белков, участвующих в деградации загрязняющего вещества, в попытке разработать метод лечения, который можно назначать людям. Эта концепция называется Xenocatabolism ([https://en.wikipedia.org/wiki/Xenocatabolism] (https://en.wikipedia.org/wiki/Xenocatabolism) )\n\n\n\n Теперь мой вопрос:\n\n\n\nПочему бы не попытаться избежать последнего шага? Я имею в виду, что вы можете начать с безвредных для организма бактерий, но они легко заражают людей и заставляют их эволюционировать, чтобы съесть какой-то молекулярный мусор (ВОЗРАСТ, липофусцин, глюкозопан, транстиретин, амилоиды, что угодно ...). Предположим, вам удастся сделать этот шаг, почему бы просто не заразить его своим пациентом.\n\n\n\nЯ понимаю, что это не очень контролируемый процесс\n\n* В какой-то момент организм может выработать иммунитет, например\n* Не каждая часть тела может быть заражена бактериями\n* Бактерии не могут разъедать мусор, если у него есть обычная еда\n* Инфекция может распространяться от вашего пациента к другим людям за пределами больницы (однако, новые слабо развитые штаммы бактерий постоянно появляются и исчезают естественным путем, и до сих пор не было пандемии)\n* Конечно, есть еще много недостатков ...\n\n\n\nИтак, вы знаете, если кто-то работает в чем-то вроде этого? или это очень безумная идея? Я думаю, что, по крайней мере, стоит подумать ...\n\n\n\nНапример, если вы не хотите тестировать это на людях, вы все равно можете делать это с вашими животными, и это может помочь ускорить исследования в лаборатории. Вы можете получить практические результаты (по крайней мере, для крыс) гораздо быстрее, так как вам не нужно восстанавливать метаболизм бактерий.","title":"Идея для ускорения исследований в области медицинской биоремедиации","subreddit_name_prefixed":"r/longevity","ups":33,"created":1562441964,"link_flair_background_color":"","id":"c9snzf","author":{"name":"mareram"},"permalink":"/r/longevity/comments/c9snzf/an_idea_for_speeding_research_in_medical/","url":"https://www.reddit.com/r/longevity/comments/c9snzf/an_idea_for_speeding_research_in_medical/","created_utc":1562413164}