{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Что мы можем сделать в будущем?\n\n· Сажать тропические леса и возвращаться к нашим эволюционным корням, сохраняя при этом все преимущества современных технологий.\n\n· ИИ делает для нас много вещей.\n\n· Искоренить земледелие живых существ и иметь любую этическую альтернативу (то есть нечто такое же, как мясо, но произведенное этически)\n\n· Имейте захватывающие игры виртуальной реальности.\n\n· Иметь сильнодействующие психоделические препараты, которые не имеют никаких последствий для здоровья / долгосрочных последствий.\n\n· Изобретать много интересных видов спорта и играть в командах.\n\n· Построить цивилизацию вокруг человеческой связи и этики.\n\n· Получить всю необходимую нам энергию из возобновляемых / устойчивых источников.\n\n· Иметь как можно больше разнообразных вкусных и полезных продуктов.\n\n· Быть настолько психологически спокойным, что мы любим все и всех вокруг.\n\n· Наблюдать, как дикая природа снова процветает в возрожденной пустыне.\n\n· Иметь прикольные гаджеты и транспортные средства, которые позволяют нам летать (персональный VTOL) / невидимы / плавать в одиночестве глубоко в океанах / выходить в космическое соло на прихоти / взбираться без риска смерти.\n\n· Генетически модифицировать потомство (и, может быть, живых взрослых?), Чтобы быть более умными / приспособленными / счастливыми / устойчивыми к болезням / адаптированными (или адаптируемыми) к различным средам, таким как на других планетах.\n\n· Колонизировать Луну / Марс\n\n· Терраформные планеты Венера / Меркурий / Карлики / Луны других планет и живут на них.\n\n· Избавиться от дорог и иметь быстрый подземный транспорт (без движения из-за движения 3D, и, возможно, без сбоев из-за AI)\n\n· Генетически модифицировать растения / деревья / животных, чтобы сделать их более \\ [вставить сюда признак, который благоприятен для субъекта и для всех остальных \\].\n\n· Положить конец всем болезням и нарушениям передовой медицины.\n\n· Вылечить старение и жить в этой среде в течение миллиардов лет.\n\n· Загрузить наше сознание на компьютеры и установить временную шкалу на компьютере таким образом, чтобы 1 секунда вне компьютера равнялась миллиардам / бесконечному числу лет внутри компьютера (и, следовательно, эффективно жить вечно).\n\n· Писать книги, используя новое воображение, и читать их нашим детям / друзьям, когда они засыпают в нашем обществе, основанном на связях.\n\n· Гулять с нашими собаками… через одну часть национального парка размером с планету Земля.\n\n· Генетически модифицировать деревья, чтобы они были намного сильнее (и росли быстрее?) И создавали из них огромные дома. Рыть норы размером с особняки. Проводите вечеринки в этих норах / домах на деревьях с большими группами дружбы и играйте в игры / разговаривайте / употребляйте здоровые наркотики.\n\n· Вернуть к жизни криогенно-замороженных людей.\n\n· Узнать больше обо всем (физика, химия, биология, литература, математика, языки, философия, этика, психология, история, география, юриспруденция, экономика, музыка, искусство, драма, политика, физическое воспитание, электроника, инженерия, информатика, бизнес, медицина, любые новые темы, которые возникают с развитием общества), и создают вещи, которые помогают нам в обучении, такие как ИИ / генетические модификации / наноботы, которые могут быть введены в наш организм.\n\nОдна вещь, которую мы определенно должны будем сделать, чтобы испытать все это, это вылечить старение.","title":"Вот некоторая мотивация","subreddit_name_prefixed":"r/longevity","ups":29,"created":1563836619,"link_flair_background_color":"","id":"cgebop","author":{"name":"tomhuts"},"permalink":"/r/longevity/comments/cgebop/heres_some_motivation/","url":"https://www.reddit.com/r/longevity/comments/cgebop/heres_some_motivation/","created_utc":1563807819}