{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Вы можете внести разнообразие! ::: Активизм в Интернете\n\nПривет всем! Может быть, только вы или я могли бы быть одинокими людьми, живущими по всему земному шару ... но это не значит, что \"сила одного\" не существует! Подумайте о капле воды или эффекте бабочки. Даже если вы затронули от 1 до 5 человек, они сами могут повлиять на 1-5!\n\nПомните: субреддит Longevity не является конечным пунктом назначения! Это не очень хорошая идея для этого reddit быть вашей единственной активностью, иначе говоря, жить в пузыре. Этот subreddit растет, но все еще является своего рода нишевым сообществом, если сравнивать его с другими гораздо большими Reddits или более крупными онлайн-сообществами.\n\nСубреддит Longevity должен быть точкой ралли! Место, где мы можем обсудить и мотивировать, а затем разветвляться, а затем возвращаться снова, чтобы подвести итог, как все прошло!\n\nОтличное место, где вы можете помочь педали газа, чтобы сохранить движение, где-то, например, Youtube. Если кто-то из вас делает видео или вдохновлен, я всегда буду поддерживать ваши видео! Кроме того, если вы слишком застенчивы или не чувствуете, что хотите снимать видео, есть несколько огромных видео, которые вы можете поддержать. Эти видео на удивление стали полувирусом большого публичного приема, имеют достойные результаты поиска на Youtube и осведомленность.\n\nВы можете помочь увеличить результаты поиска / количество просмотров / участие / обсуждения! Существует более широкое сообщество сообщества Youtube, из которых вы сможете завести новых друзей и контакты и, возможно, пригласить их в этот субреддит. У людей из Youtube на сайте Longevity + Healthspan есть вопросы и комментарии, и они нуждаются в дополнительном разъяснении по темам. Выведите на улицы встречи широкой публики в какой-то онлайн-активизм!\n\nKurzgesagt - \"Как вылечить старение - при жизни?\" / 4,7 млн. Просмотров\n\n[https://www.youtube.com/watch?v=MjdpR-TY6QU] (https://www.youtube.com/watch?v=MjdpR-TY6QU) \n\n\\ ------\n\nKurzgesagt - «Почему возраст? Должны ли мы закончить старение навсегда?» / 5.1 миллионов просмотров\n\n[https://www.youtube.com/watch?v=GoJsr4IwCm4] (https://www.youtube.com/watch?v=GoJsr4IwCm4) \n\n\\ ------\n\nAging Reversed Channel - отличный издатель с огромным количеством потрясающих видео\n\n[https://www.youtube.com/user/ArthasMenethilPure/videos] (https://www.youtube.com/user/ArthasMenethilPure/videos) \n\n\\ ------\n\nДжо Роган Опыт № 1234 - Дэвид Синклер / 1,52 миллиона просмотров\n\n[https://www.youtube.com/watch?v=HOTS0HS7aq4] (https://www.youtube.com/watch?v=HOTS0HS7aq4) \n\n\\ ------\n\n«Майкл Д. Уэст: будущее человеческого старения» / 1,2 миллиона просмотров\n\n[https://www.youtube.com/watch?v=9px1GwHQc34] (https://www.youtube.com/watch?v=9px1GwHQc34) \n\n\\ ------\n\nУвидимся в комментариях! :)\n\n#","title":"Вы можете внести разнообразие! ::: Активизм в Интернете","subreddit_name_prefixed":"r/longevity","ups":45,"created":1564995034,"link_flair_background_color":"","id":"cm43bi","author":{"name":"Griffin90"},"permalink":"/r/longevity/comments/cm43bi/you_can_make_a_difference_online_activism/","url":"https://www.reddit.com/r/longevity/comments/cm43bi/you_can_make_a_difference_online_activism/","created_utc":1564966234}