{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"** ОБНОВЛЕНИЕ: из-за «сбоя» в системе представления данных ВОЗ, большинство наших ответов не дошли до них. Нам сообщили, что некоторые ответы, которые были получены, были интерпретированы как представляющие только ILA. Если вы все еще хотите принять участие, в эту субботу, 31 августа 2019 года, с 19:00 до 20:00 UTC + 02 состоится вебинар, организованный ILA. Ссылка для присоединения: ** [** https: //zoom.us/j/257687034**]  (https://zoom.us/j/257687034) \n\n** Электронная почта ВОЗ, с которой мы можем связаться вместо проведения опроса, является ** [Decade \\ _Ageing@who.int]  (mailto: Decade_Ageing@who.int)  **. Вебинар поможет ответить на любые вопросы или проблемы, которые могут у вас возникнуть относительно того, как по-прежнему помогать, но если вы не сможете это сделать, мы опубликуем здесь обновления. Спасибо всем, кто помог до сих пор. ** ♥\n\n\n\n> «Десятилетие здорового старения Всемирной организации здравоохранения (ВОЗ) (2020–2030 годы) - это возможность объединить усилия правительств, гражданского общества, международных организаций, специалистов, научных кругов, средств массовой информации и частного сектора в течение десяти лет согласованной, каталитической и совместные действия для улучшения жизни пожилых людей, их семей и сообществ, в которых они живут ».\n\nНекоторые из вас могут вспомнить опрос ВОЗ, который проводился в прошлом году, вот еще один. К сожалению, в инициативе ВОЗ «Здоровое старение» недостаточно внимания уделяется биомедицинским и клиническим решениям борьбы со старением. Но они открыты для обратной связи. В ответ на это Международный альянс долголетия (ILA) подготовил предложения по улучшению их ориентации, чтобы воплотить наше видение более здоровой жизни для всех возрастов. Срок продлен до 8 сентября, пожалуйста, отправьте до этого! Спасибо :)\n\n** Опрос -> ** [https://www.who.int/ageing/decade-of-healthy-ageing/a-proposal-for-'a-decade-of-healthy-ageing-2020-2030 ' ] <span translate = \"no\"> (https://www.who.int/ageing/decade-of-healthy-ageing/a-proposal-for-'a-decade-of-healthy-ageing-2020-2030 «) </ SPAN>\n\nЧлены ILA подготовили эти ответы, которые вы можете использовать напрямую / обратиться за помощью:\n\n[https://docs.google.com/document/d/17toK7n46j\\_lmELrF2eW62iz7nhX1KB0RkEO9aNmBILc/edit]<span = \"no\"> (https://docs.google.com/document/d/17toK7n46jB0KEJRKF) SPAN>\n\nчитать далее:\n\n[http://longevityalliance.org/?q=decade] (http://longevityalliance.org/?q=decade) \n\n[https://www.who.int/ageing/decade-of-healthy-ageing]<span translate = \"no\"> (https://www.who.int/ageing/decade-of-healthy-ageing) </ SPAN>\n\n[https://www.who.int/docs/default-source/documents/decade-of-health-ageing/decade-ageing-proposal-en.pdf]<span translate = \"no\"> (https: // www.who.int/docs/default-source/documents/decade-of-health-ageing/decade-ageing-proposal-en.pdf) </ SPAN>","title":"Исследование в поддержку предложения Международного союза долголетия Всемирной организации здравоохранения","subreddit_name_prefixed":"r/longevity","ups":71,"created":1565972919,"link_flair_background_color":"","id":"cr3hu2","author":{"name":"nekomajin"},"permalink":"/r/longevity/comments/cr3hu2/survey_to_support_the_international_longevity/","url":"https://www.reddit.com/r/longevity/comments/cr3hu2/survey_to_support_the_international_longevity/","created_utc":1565944119}