{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Хороший обзор против старения.\n\n \n\n> «Сингапур получил представление о том, что грядет, и чиновникам там не нравится то, что они видят. Островная нация находится на переднем крае серого всплеска. К 2030 году, если нынешние тенденции сохранятся, будет только два люди, работающие там на каждого пенсионера (для сравнения, в США на каждого жителя старше 65 лет будет работать по три человека). Поэтому страна пытается изменить сценарий, чтобы найти более счастливое и здоровое окончание.\n>\n> С помощью добровольцев Кеннеди из сингапурского Центра Здорового Старения готовит первые широкомасштабные тесты на старение на людях. Кеннеди говорит, что он намерен опробовать от 10 до 15 возможных вмешательств - он пока не скажет, какие именно - в небольших группах людей старше 50 лет: «Я думаю, может быть, три или четыре препарата и несколько добавок, а затем сравнить их к изменениям образа жизни ».\n>\n> Правительство Сингапура определило приоритетные стратегии борьбы со стареющим населением, и Кеннеди хочет создать «испытательный стенд» для таких человеческих экспериментов. «Мы достигли значительных успехов на животных», - добавляет он, - «но мы должны начать проводить эти испытания на людях».\n\n [https://www.technologyreview.com/s/614080/what-if-aging-werent-inevitable-but-a-curable-disease/]<span translate = \"no\"> (https: //www.technologyreview .com / с / 614080 / что-если-старения неизбежно-недостаточно активно использовали статистические но-а-отверждаемые-болезнь /) </ SPAN>","title":"Что, если старение не было неизбежным, но излечимым заболеванием? Если эта противоречивая идея получит признание, она может радикально изменить наше отношение к старости. Обзор технологий","subreddit_name_prefixed":"r/longevity","ups":123,"created":1566269507,"link_flair_background_color":"","id":"cslhty","author":{"name":"vp2013"},"permalink":"/r/longevity/comments/cslhty/what_if_aging_werent_inevitable_but_a_curable/","url":"https://www.reddit.com/r/longevity/comments/cslhty/what_if_aging_werent_inevitable_but_a_curable/","created_utc":1566240707}