{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"","title":"Forbes: «экстраординарные» прорывы в исследованиях по борьбе со старением «произойдут быстрее, чем думают люди»","subreddit_name_prefixed":"r/longevity","ups":266,"created":1566930313,"link_flair_background_color":"","id":"cw2i0b","author":{"name":"shrillthrill"},"permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/","url":"https://www.forbes.com/sites/robinseatonjefferson/2019/08/26/how-extraordinary-breakthroughs-in-anti-aging-research-will-happen-faster-than-people-think/","created_utc":1566901513,"replies":[{"ups":76,"link_id":"t3_cw2i0b","replies":[{"ups":8,"link_id":"t3_cw2i0b","replies":[{"ups":6,"link_id":"t3_cw2i0b","replies":[{"ups":3,"link_id":"t3_cw2i0b","replies":[{"ups":2,"link_id":"t3_cw2i0b","id":"ey9dytm","author":"Puzzleheaded_Animal","parent_id":"t1_ey9bvo0","subreddit_id":"t5_2qzmo","body":"As far as I remember, Sinclair said in a recent interview that he's hoping to start human trials of epigenetic reprogramming in a couple of years. But I don't think he mentioned how, and I don't think I'd volunteer for the first trials :).","body_html":"<div class = \"md\"> <p> Насколько я помню, Синклер сказал в недавнем интервью, что он надеется начать испытания эпигенетического перепрограммирования на людях через пару лет. Но я не думаю, что он упомянул, как, и я не думаю, что я добровольно вызвался бы на первые испытания :). </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey9dytm/","name":"t1_ey9dytm","created":1566969948,"created_utc":1566941148,"subreddit_name_prefixed":"r/longevity","depth":8}],"id":"ey9bj1h","author":"Matthew_Lake","parent_id":"t1_ey9b1vl","subreddit_id":"t5_2qzmo","body":"Once we have proper rejuvenation therapies, ones that actually reverse the damage and put the animal at a younger biological age by every measure, it'll be easier to detect an effect in a much shorter time period than interventions which merely slow aging. So whether it's tried in a mouse or a dog, the effect will be obvious and can be applied at a late age.\n\nDogs do have their own issues wrt being a model for aging. Hip dysplasia and other diseases can cause the dog to be 'put down' once the disease progresses too much. Otherwise, the animal might be quite healthy and able to live a few more months or years. In fact, in the CR study in dogs (which did have a big effect), one of the main reasons for euthanasia was hip dysplasia.","body_html":"<div class = \"md\"> <p> Как только мы получим надлежащую терапию омоложения, которая на самом деле меняет нанесенный ущерб и на каждую меру ставит животное в более молодой биологический возраст, будет легче обнаружить эффект в гораздо более короткой форме. период времени, чем вмешательства, которые просто замедляют старение. Так что будь то на мышах или на собаках, эффект будет очевиден и может быть применен в более позднем возрасте. </P>\n\n<p> Собаки имеют свои собственные проблемы, будучи моделью для старения. Дисплазия тазобедренного сустава и другие заболевания могут вызвать уныние собаки, когда болезнь прогрессирует слишком сильно. В противном случае животное может быть вполне здоровым и сможет прожить еще несколько месяцев или лет. Фактически, в исследовании CR на собаках (которое имело большой эффект), одной из основных причин эвтаназии была дисплазия тазобедренного сустава. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey9bj1h/","name":"t1_ey9bj1h","created":1566968349,"created_utc":1566939549,"subreddit_name_prefixed":"r/longevity","depth":6}],"id":"ey8prvx","author":"Puzzleheaded_Animal","parent_id":"t1_ey8ojxp","subreddit_id":"t5_2qzmo","body":"Dogs are much more interesting because of the longer lifespan. They're close enough to humans that any treatments are likely to benefit us too, and far enough away that there aren't big issues with testing those treatments on them.\n\nPlus there's a much larger market for treatments to extend Rover's lifespan than treatments to extend Micky's lifespan.","body_html":"<div class = \"md\"> <p> Собаки намного интереснее из-за большей продолжительности жизни. Они настолько близки к людям, что любые способы лечения могут принести нам пользу, и достаточно далеко, чтобы не было больших проблем с тестированием этих обработок на них. </P>\n\n<p> Кроме того, существует гораздо больший рынок для лечения, чтобы продлить срок службы Ровера, чем лечения для продления жизни Мики.\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey8prvx/","name":"t1_ey8prvx","created":1566954348,"created_utc":1566925548,"subreddit_name_prefixed":"r/longevity","depth":4},{"ups":3,"link_id":"t3_cw2i0b","replies":[{"ups":3,"link_id":"t3_cw2i0b","id":"ey987wm","author":"InfinityArch","parent_id":"t1_ey8v2md","subreddit_id":"t5_2qzmo","body":"The point is to establish what \"robust mouse rejuvenation\" actually is; it's not making a mouse immortal, and neither is \"robust human rejuvenation\".","body_html":"<div class = \"md\"> <p> Суть в том, чтобы установить, что такое \"надежное омоложение мыши\"; это не делает мышь бессмертной, и при этом не является \"сильным человеческим омоложением\". </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey987wm/","name":"t1_ey987wm","created":1566966224,"created_utc":1566937424,"subreddit_name_prefixed":"r/longevity","depth":6}],"id":"ey8rn01","author":"InfinityArch","parent_id":"t1_ey8ojxp","subreddit_id":"t5_2qzmo","body":"\"Robust mouse rejuvenation\" means reliably doubling murine lifespan (so four years) without any germline interventions.\n\n&#x200B;\n\nAnd yes, mice are reasonably similar to humans in many important respects, biologically speaking, but not all of them, and those differences are important.","body_html":"<div class = \"md\"> <p> «Надежное омоложение мыши» означает надежное удвоение продолжительности жизни мышей (т.е. четыре года) без каких-либо вмешательств зародышевой линии. </p>\n\n<Р> </р>\n\n<p> И да, мыши достаточно похожи на людей во многих важных отношениях, биологически, но не на всех, и эти различия важны. </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey8rn01/","name":"t1_ey8rn01","created":1566955564,"created_utc":1566926764,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"ey8es5h","author":"InfinityArch","parent_id":"t1_ey819p0","subreddit_id":"t5_2qzmo","body":"They already have in mice, albeit more often than not via gene editing. The problem is that mice aren't tiny humans, and lab mice specifically are better described as \"mice like objects which have some resemblance to naturally occurring mice.\"","body_html":"<div class = \"md\"> <p> Они уже есть у мышей, хотя чаще всего через редактирование генов. Проблема заключается в том, что мыши не являются крошечными людьми, а лабораторных мышей лучше описать как «мышей, подобных объектам, которые имеют некоторое сходство с природными мышами». </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey8es5h/","name":"t1_ey8es5h","created":1566947228,"created_utc":1566918428,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"ey7y3td","author":"Warrior666","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"\"I WANT TO BELIEVE\"\n\nBecause at 52, I would gladly set my biological clock back some 10 or 15 years. But alas, I remain skeptical until irrefutable and reproducible results -- on humans -- are in.","body_html":"<div class = \"md\"> <p> \"ХОЧУ ВЕРИТЬ\" </p>\n\n<p> Потому что в 52 года я бы с радостью перевел свои биологические часы на 10 или 15 лет назад. Но, увы, я остаюсь скептиком до тех пор, пока не будут получены неопровержимые и воспроизводимые результаты - для людей. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey7y3td/","name":"t1_ey7y3td","created":1566934173,"created_utc":1566905373,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":21,"link_id":"t3_cw2i0b","id":"ey86lkr","author":"NeedNerdGlasses","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"Raises \"$165 million in just 18 months\" and says, \"investors are not as quick to step up as he would like\". I'm glad money is being invested in this research though.","body_html":"<div class = \"md\"> <p> Собирает «165 миллионов долларов всего за 18 месяцев» и говорит, что «инвесторы не так быстры, как хотелось бы». Я рад, что деньги вкладываются в это исследование. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey86lkr/","name":"t1_ey86lkr","created":1566941474,"created_utc":1566912674,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":14,"link_id":"t3_cw2i0b","id":"ey7us5i","author":"shrillthrill","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"outline mirror: https://outline.com/Yn2bsq","body_html":"<div class = \"md\"> <p> контурное зеркало: <a href=\"https://outline.com/Yn2bsq\"> https://outline.com/Yn2bsq </a> </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey7us5i/","name":"t1_ey7us5i","created":1566930360,"created_utc":1566901560,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":7,"link_id":"t3_cw2i0b","id":"ey87rcj","author":"HuricaneFighterPlane","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"Just hype, but rich people read Forbes and that is good.","body_html":"<div class = \"md\"> <p> Просто шумиха, но богатые люди читают Forbes, и это хорошо. </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey87rcj/","name":"t1_ey87rcj","created":1566942339,"created_utc":1566913539,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":5,"link_id":"t3_cw2i0b","id":"ey88xms","author":"ShengjiYay","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"Injecting young cells is nice, but oftimes old bodies have local conditions which cause young cells to age.  Conversely, young bodies often have local conditions which cause old cells to rejuvenate.  We need to master those processes and create conditions which renew cells.","body_html":"<div class = \"md\"> <p> Впрыскивать молодые клетки - это хорошо, но старые тела имеют местные условия, которые вызывают старение молодых клеток. Наоборот, молодые тела часто имеют местные условия, которые вызывают омоложение старых клеток. Нам нужно освоить эти процессы и создать условия, которые обновляют клетки. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey88xms/","name":"t1_ey88xms","created":1566943184,"created_utc":1566914384,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":3,"link_id":"t3_cw2i0b","id":"eydre5n","author":"WhyYouAreVeryWrong","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"I have a weird question- how would you *invest* in longevity?\n\nI generally believe it's very hard to get in to growing companies on the stock market right now.  With cheap leverage today, companies don't really go public until they've generated enough hype that they can get insane valuations.  Even amazing companies like Tesla came in to the market with crazy price-to-potential-earnings ratio, because they only came into the market after they'd *already* convinced investors that they were going to give them an enormous return, so the stock price started with that expectation built in.  Tesla's stock price today isn't much higher than it was in 2014 because that growth was expected.\n\nI feel like every IPO today is basically 2014 Tesla.  Uber, Lyft, WeWork; they're all trading at prices like they were successful, profitable companies.  They need to make amazing returns *just to justify their current prices*, not to grow.\n\nI think longevity might be a legitimate tech that is currently undervalued by the market.  The problem is, all of the big research outlets are either part of a megacorp (Calico and Alphabet) or private.  \n\n\nHow would you invest in it long term?","body_html":"<div class = \"md\"> <p> У меня странный вопрос: как бы вы <em> инвестировали </em> в долголетие? </p>\n\n<p> Я вообще-то считаю, что сейчас очень трудно попасть в растущие компании на фондовом рынке. Сегодня, имея дешевые рычаги воздействия, компании не становятся публичными, пока не наберут достаточно обмана, чтобы получить безумные оценки. Даже такие удивительные компании, как Tesla, пришли на рынок с сумасшедшим соотношением цены и потенциальной прибыли, потому что они вышли на рынок только после того, как <em> уже </em> убедили инвесторов, что они собираются дать им Огромная прибыль, поэтому цена на акции началась с того, что ожидалось. Цена акций Tesla сегодня не намного выше, чем в 2014 году, потому что ожидался такой рост. </p>\n\n<p> Я чувствую, что каждое IPO сегодня - это в основном Тесла 2014 года. Uber, Lyft, WeWork; они все торгуют по ценам, как будто они были успешными, прибыльными компаниями. Они должны получать удивительные результаты <em>, чтобы оправдать свои текущие цены </em>, а не расти. </P>\n\n<p> Я думаю, что долговечность может быть законной технологией, которая в настоящее время недооценена рынком. Проблема в том, что все крупные исследовательские центры являются частью мегакорпа (Calico and Alphabet) или частными. </Р>\n\n<p> Как бы вы инвестировали в него в долгосрочной перспективе? </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eydre5n/","name":"t1_eydre5n","created":1567052438,"created_utc":1567023638,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":8,"link_id":"t3_cw2i0b","replies":[{"ups":3,"link_id":"t3_cw2i0b","replies":[{"ups":2,"link_id":"t3_cw2i0b","id":"eybo5un","author":"WickedStupido","parent_id":"t1_eyaazmo","subreddit_id":"t5_2qzmo","body":"> The sun gives many health benefits you can't get by taking a vitamin D.\n\nMay I sheepishly ask what and a source?","body_html":"<div class = \"md\"> <blockquote>\n<p> Солнце дает много пользы для здоровья, которую вы не можете получить, принимая витамин D. </p>\n</BLOCKQUOTE>\n\n<p> Могу ли я смущенно спросить, что и источник? </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eybo5un/","name":"t1_eybo5un","created":1567017541,"created_utc":1566988741,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"ey9mscp","author":"E_Chihuahuensis","parent_id":"t1_ey88uwl","subreddit_id":"t5_2qzmo","body":"Everyone should use retinol but it’s no miracle serum. Daily sunscreen is more important.","body_html":"<div class = \"md\"> <p> Каждый должен использовать ретинол, но это не чудодейственная сыворотка. Ежедневный солнцезащитный крем важнее. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey9mscp/","name":"t1_ey9mscp","created":1566975962,"created_utc":1566947162,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"ey7ynqe","author":"lustyperson","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":">“It’s happening now. It’s not in the future, and it will happen faster  than people think. The potential to regrow a lung or a limb is  extraordinary.”\n\nWould do people think? 50 years from now? 100 years from now?\n\nAnyway, I hope for good progress like other transhumanists.\n\nBut the first section (thankfully the first) is quite indicative:\n\n>People 50 and older have a lot to look forward to, according to  Juvenescence’s Greg Bailey—mainly that we won’t be aging as fast or  poorly as our parents. “Science fiction has become science,” said the  UK-based anti-aging biotech’s CEO about the company’s completing its  $100 million Series B round of financing last week. “I think the world  is going to be shocked,” he said in an interview. In total, Juvenescence  has now raised $165 million in just 18 months to fund longevity  projects with the lofty goal of extending human lifespans to 150 years.\n\nOptimism, good intentions and need for money. But no anti-aging solution. As always.\n\nI wish them (and us) great success. But I do not believe in a single product to end aging. We do not need a biological body but we need biological brain parts to remain human.\n\nAlso:\n\n>“Walk into your local drugstore, you’re going to see about 50 products  that claim to be anti-aging, and I can assure you that none of them  are.”\n\nMost likely true. Unless it is sun cream to protect against radiation. Or vegan food and vitamins (notably B12) instead of animal products.\n\n[From Table to Able: Combating Disabling Diseases With Food](https://www.youtube.com/watch?v=_d1Ca6SsKfE) (2015-05-17).","body_html":"<div class = \"md\"> <blockquote>\n<p> «Это происходит сейчас. Это не в будущем, и это произойдет быстрее, чем думают люди. Потенциал для отрастания легкого или конечности необычайен ». </P>\n</BLOCKQUOTE>\n\n<p> Думают ли люди? 50 лет спустя? 100 лет спустя? </P>\n\n<p> В любом случае, я надеюсь на хороший прогресс, как и другие трансгуманисты. </p>\n\n<p> Но первый раздел (к счастью, первый) весьма показателен: </p>\n\n<BLOCKQUOTE>\n<p> Людям 50 лет и старше есть что ожидать, по словам Грега Бэйли из Juvenescence, главным образом из-за того, что мы не будем стареть так же быстро или плохо, как наши родители. «Научная фантастика стала наукой», - заявил генеральный директор британской компании по борьбе со старением, рассказывающий о том, что на прошлой неделе компания завершила финансирование серии B стоимостью 100 млн долларов. «Я думаю, что мир будет шокирован», - сказал он в интервью. В общей сложности Juvenescence собрала 165 миллионов долларов всего за 18 месяцев для финансирования проектов долголетия с высокой целью продления человеческой жизни до 150 лет. </P>\n</BLOCKQUOTE>\n\n<p> Оптимизм, благие намерения и потребность в деньгах. Но нет антивозрастного решения. Как всегда. </P>\n\n<p> Я желаю им (и нам) больших успехов. Но я не верю в один продукт, чтобы положить конец старению. Нам не нужно биологическое тело, но нам нужны биологические части мозга, чтобы оставаться человеком. </P>\n\n<Р> также: </p>\n\n<BLOCKQUOTE>\n<p> «Зайдите в местную аптеку, вы увидите около 50 продуктов, которые утверждают, что они являются антивозрастными, и я могу заверить вас, что ни один из них не является». </p>\n</BLOCKQUOTE>\n\n<p> Скорее всего, правда. Если это не солнцезащитный крем для защиты от радиации. Или веганская пища и витамины (особенно B12) вместо продуктов животного происхождения. </P>\n\n<p> <a href=\"https://www.youtube.com/watch?v=_d1Ca6SsKfE\"> Из таблицы в способ: борьба с болезнями с помощью продуктов питания </a> (2015-05-17). </p >\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey7ynqe/","name":"t1_ey7ynqe","created":1566934734,"created_utc":1566905934,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":5,"link_id":"t3_cw2i0b","id":"ey82lpc","author":"jimofoz","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"Financial markets are ruled by greed and fear. And the switch between the two often leads to bifurcations in the attention an investment area gets. One of these is coming at some point for the longevity sector.","body_html":"<div class = \"md\"> <p> Финансовые рынки управляются жадностью и страхом. И переключение между ними часто приводит к раздвоению внимания, уделяемого инвестиционной сфере. Один из них придет в какой-то момент для сектора долголетия. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey82lpc/","name":"t1_ey82lpc","created":1566938315,"created_utc":1566909515,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":-2,"link_id":"t3_cw2i0b","replies":[{"ups":2,"link_id":"t3_cw2i0b","replies":[{"ups":1,"link_id":"t3_cw2i0b","id":"eyemiw2","author":"phx-au","parent_id":"t1_eydbpd4","subreddit_id":"t5_2qzmo","body":"From an output perspective, not the technique. Not like we're doing chip fab at home. Although give it a few years I guess and we'll be making 80s chips...","body_html":"<div class = \"md\"> <p> С точки зрения вывода, а не техники. Не так, как мы делаем чип-потрясающий дома. Хотя, думаю, подождем несколько лет, и мы будем делать чипсы 80-х ... </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eyemiw2/","name":"t1_eyemiw2","created":1567064679,"created_utc":1567035879,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"eyaa46h","author":"phx-au","parent_id":"t1_ey8rloo","subreddit_id":"t5_2qzmo","body":"> when you can just download things off the Internet and print them out at home\n\nIf anything, manufacturing is requiring more capital-intensive equipment to create more complex parts.\n\nSure you can replicate 1960s manufacturing tech at home, and there's certainly a bunch of times where I've printed things out over sourcing them - but if anything the gap between home production capability and generic consumer goods from China is increasing.","body_html":"<div class = \"md\"> <blockquote>\n<p> когда вы можете просто скачать вещи из Интернета и распечатать их дома </p>\n</BLOCKQUOTE>\n\n<p> Во всяком случае, производство требует более капиталоемкого оборудования для создания более сложных деталей. </p>\n\n<p> Конечно, вы можете копировать производственные технологии 1960-х годов дома, и, конечно же, во многих случаях я распечатывал вещи, связанные с их поиском - но, во всяком случае, разрыв между возможностями домашнего производства и обычными потребительскими товарами из Китая увеличивается. < / р>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eyaa46h/","name":"t1_eyaa46h","created":1566989191,"created_utc":1566960391,"subreddit_name_prefixed":"r/longevity","depth":2},{"ups":1,"link_id":"t3_cw2i0b","replies":[{"ups":1,"link_id":"t3_cw2i0b","id":"eywress","author":"WhyYouAreVeryWrong","parent_id":"t1_eylcmcm","subreddit_id":"t5_2qzmo","body":"> Everywhere in the universe is hospitable when you live in a self-contained habitat.\n\n\nSo you're thinking we'll all be in space in ships with Star Trek replicators?  You're way, way accelerating this in your head, then.  Most of the United States still lives in 80+ year old houses *made of wood*.  Half the world population doesn't have running water/sewer.  \n\nWe still haven't solved aging, we still don't understand a lot of basics of human biology, we haven't solved artificial gravity and don't know the long term *health* effects of not having gravity are.  We don't even know exactly how to measure the negative health effects of not getting enough sunlight or the mental health aspects.\n\n> Planets are old-fashioned places that people use to live in the old days. \n\nYeah, dude, you're lost in your imagination and way, way ahead of the hear and now.  We don't have enough resources (yet) to start putting even just millions of people into space in twenty years,  and we have absolutely no idea what the psychological impact is going to be of people being locked in boxes, and it's going to be far, far worse quality of life with access to much less foods and services.\n\n\n\nI'll give you that printers are going to be a lot more prevalent but it's still going to be a lot more cost effective to pick up premanufactured goods, especially when there's a lot of specialization.  Now, I can see *local manufacturing facilities* popping up- you make your order and it gets printed and delivered same-day.  But most people aren't going to want to devote the real estate in their house for something everyone in the neighborhood could share.\n\n\nAnd, this is really only going to apply to basic manufactured goods.  A lot of things simply can't be done on this scale.  You're not going to have a silicon wafer manufacturing plant in every city anytime soon.  Nor will you be able to print foodstuffs.  Want an aged Parmesan to pair with your Red Zinfandel (whose flavor is influenced by the soil; Red Zinfandel is California, Primitivo is the same grape in Puglia, Italy) and some cured meats?  You're going to have to import these.\n\nQuality of life in space is going to be far worse than on earth for quite a long time, and fully self-sufficient communities are a nice ideal and we'll get a lot closer but we'll always have integration and shipping.","body_html":"<div class = \"md\"> <blockquote>\n<p> Везде во вселенной гостеприимно, когда вы живете в автономной среде обитания. </p>\n</BLOCKQUOTE>\n\n<p> То есть вы думаете, что мы все будем в космосе на кораблях с репликаторами Star Trek? Значит, ты просто так ускоряешь это в своей голове. Большая часть Соединенных Штатов все еще живет в домах старше 80 лет, изготовленных из дерева </em>. У половины населения мира нет водопровода / канализации. </Р>\n\n<p> Мы до сих пор не решили проблему старения, мы все еще не понимаем многих основ человеческой биологии, мы не решили искусственную гравитацию и не знаем долгосрочного <em> здоровья </em> эффектов не имея гравитации. Мы даже не знаем точно, как измерить негативные последствия для здоровья от недостатка солнечного света или психического здоровья. </P>\n\n<BLOCKQUOTE>\n<p> Планеты - это старомодные места, которые люди используют, чтобы жить в старые времена. </Р>\n</BLOCKQUOTE>\n\n<p> Да, чувак, ты заблудился в своем воображении и пути, намного впереди слышать и сейчас. У нас недостаточно ресурсов (пока), чтобы начать отправлять в космос даже миллионы людей за двадцать лет, и мы абсолютно не знаем, какое психологическое влияние окажут люди, запертые в ящиках, и это будет намного, намного хуже качество жизни с доступом к гораздо меньшему количеству продуктов питания и услуг. </p>\n\n<p> Я скажу вам, что принтеры будут гораздо более распространенными, но все же будет гораздо более экономически выгодно приобретать готовые товары, особенно когда есть большая специализация. Теперь я вижу, как <em> местные производственные мощности </em> выскакивают - вы делаете заказ, и он распечатывается и доставляется в тот же день. Но большинству людей не захочется посвящать недвижимость в своем доме чему-то, что каждый из соседей может разделить. </P>\n\n<p> И это действительно будет применяться только к основным промышленным товарам. Многие вещи просто не могут быть сделаны в этом масштабе. В ближайшее время у вас не будет завода по производству кремниевых пластин в каждом городе. Вы также не сможете печатать продукты питания. Хотите, чтобы выдержанный пармезан сочетался с вашим красным зинфанделем (на вкус которого влияет почва; красный зинфандель - это Калифорния, Примитиво - такой же виноград в Апулии, Италия) и с некоторыми колбасами? Вам придется импортировать их. </P>\n\n<p> Качество жизни в космосе будет намного хуже, чем на Земле, в течение достаточно долгого времени, и полностью самодостаточные сообщества - хороший идеал, и мы станем намного ближе, но у нас всегда будут интеграция и доставка. . </р>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eywress/","name":"t1_eywress","created":1567564965,"created_utc":1567536165,"subreddit_name_prefixed":"r/longevity","depth":4}],"id":"eydu5f6","author":"WhyYouAreVeryWrong","parent_id":"t1_ey8rloo","subreddit_id":"t5_2qzmo","body":"> If we survive the next twenty years, we'll rapidly be moving off this planet.\n\nYeah, that's nonsense.\n\nThere's simply nowhere else in the universe more hospitable.  Everything within reach is a hellscape.  Even a perfectly terraformed Mars would be much worse than a horribly polluted Earth.  Mars lacks the strong magnetic field, has a significantly cooled core, and will always have issues with the ozone layer being stripped off even if you terraformed it and got the atmosphere converted to oxygen.  Plus, after removing carbon from the atmosphere it will have a real \"being too cold most of the time\" issue, and you can't use solar effectively due to the distance.\n\n\n> Fossil fuel usage is about to collapse due to telepresense and local manufacturing. No need for jets when you can rent a drone at your destination, and little need for shipping when you can just download things off the Internet and print them out at home. I used to be flying around the world several times a year for work, but I haven't needed to travel at all for a couple of years because we can do most things over the Internet. Give me a drone hooked up to the Internet and I wouldn't need to travel at all.\n\n\n\nYes and no.  I think the developing world's growth is going to be an issue.  You need gas vehicles to build the infrastructure to get off of gas, and huge swaths of Africa and Asia are still in \"no water/sewer/electricity/literacy\" territory and will need to come out of it.\n\n\nAlso, you're definitely exaggerating local manufacturing.  Most 3D printers use fossil fuel based materials, and also, are limited in the materials they can use.  You're not going to be able to print a lot of items at home reasonably.","body_html":"<div class = \"md\"> <blockquote>\n<p> Если мы выживем в ближайшие двадцать лет, мы быстро покинем эту планету. </p>\n</BLOCKQUOTE>\n\n<p> Да, это чепуха. </p>\n\n<p> Просто во вселенной больше нигде нет гостеприимства. Все в пределах досягаемости - адский пейзаж. Даже идеально терраформированный Марс будет намного хуже, чем ужасно загрязненная Земля. Марс испытывает недостаток в сильном магнитном поле, имеет значительно охлажденное ядро ​​и всегда будет иметь проблемы с удалением озонового слоя, даже если вы терраформируете его и превратите атмосферу в кислород. Кроме того, после удаления углерода из атмосферы у него возникнет реальная проблема «быть слишком холодным большую часть времени», и вы не сможете эффективно использовать солнечную энергию из-за расстояния. </P>\n\n<BLOCKQUOTE>\n<p> Использование ископаемого топлива скоро сократится из-за телепрезентации и местного производства. Нет необходимости в самолетах, когда вы можете арендовать беспилотник в пункте назначения, и нет необходимости в доставке, когда вы можете просто загрузить вещи из Интернета и распечатать их дома. Я имел обыкновение летать по миру несколько раз в год на работу, но мне не нужно было путешествовать вообще пару лет, потому что мы можем делать большинство вещей через Интернет. Дайте мне беспилотник, подключенный к Интернету, и мне вообще не нужно будет путешествовать. </P>\n</BLOCKQUOTE>\n\n<p> Да и нет. Я думаю, что рост развивающегося мира будет проблемой. Вам нужны газовые транспортные средства, чтобы построить инфраструктуру для выхода из газа, а огромные участки Африки и Азии по-прежнему находятся на территории, где нет воды, канализации, электричества и грамотности, и должны будут покинуть ее. </P>\n\n<p> Кроме того, вы определенно преувеличиваете местное производство. Большинство 3D-принтеров используют материалы на основе ископаемого топлива, а также ограничены в материалах, которые они могут использовать. Вы не сможете разумно напечатать много документов дома. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/eydu5f6/","name":"t1_eydu5f6","created":1567053564,"created_utc":1567024764,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"ey8bndc","author":"agumonkey","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"there needs to be a energy saving breakthrough too because eternal fossil fuel burners won't last long anyway :)","body_html":"<div class = \"md\"> <p> должен быть прорыв в области энергосбережения, потому что вечные горелки, работающие на ископаемом топливе, в любом случае не будут работать долго:) </p>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey8bndc/","name":"t1_ey8bndc","created":1566945093,"created_utc":1566916293,"subreddit_name_prefixed":"r/longevity","depth":0},{"ups":-24,"link_id":"t3_cw2i0b","replies":[{"ups":3,"link_id":"t3_cw2i0b","id":"ey98n54","author":"Puzzleheaded_Animal","parent_id":"t1_ey8j5xb","subreddit_id":"t5_2qzmo","body":"> I'm mildly exited about senolytics and skeptical about the so called geroprotectors (NAD boosters, metformin, etc) - I doubt that they will benefit health conscious persons.\n\nI look at NMN and the like as 'may keep you healthy longer until the good stuff comes along'. Long-term, we'll have much better solutions.","body_html":"<div class = \"md\"> <blockquote>\n<p> Я слегка взволнован по поводу сенолитиков и скептически отношусь к так называемым геропротекторам (бустеры NAD, метформин и т. д.) - я сомневаюсь, что они принесут пользу людям, которые заботятся о своем здоровье. </p>\n</BLOCKQUOTE>\n\n<p> Я смотрю на NMN и тому подобное, поскольку «может держать вас здоровыми дольше, пока не появятся хорошие вещи». В долгосрочной перспективе у нас будут намного лучшие решения. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey98n54/","name":"t1_ey98n54","created":1566966492,"created_utc":1566937692,"subreddit_name_prefixed":"r/longevity","depth":2}],"id":"ey8a5kh","author":"Pimpus","parent_id":"t3_cw2i0b","subreddit_id":"t5_2qzmo","body":"lol, people have been claiming this since at least the 80's (e.g. Robert Anton Wilson, a proponent of life extension). But at least he had more than a purely mechanistic view of the human body. We have actually gone backwards since then, and we are more spiritually sick than ever. Unfortunately, most people reading this will lead short and/or unhealthy lives.","body_html":"<div class = \"md\"> <p> lol, люди утверждают, что по крайней мере с 80-х годов (например, Роберт Антон Уилсон, сторонник продления жизни). Но, по крайней мере, у него было нечто большее, чем чисто механистический взгляд на человеческое тело. С тех пор мы на самом деле пошли вспять, и мы более духовно больны, чем когда-либо. К сожалению, большинство людей, читающих это, будут вести короткую и / или нездоровую жизнь. </P>\n</DIV>","permalink":"/r/longevity/comments/cw2i0b/forbes_extraordinary_breakthroughs_in_antiaging/ey8a5kh/","name":"t1_ey8a5kh","created":1566944049,"created_utc":1566915249,"subreddit_name_prefixed":"r/longevity","depth":0}]}