{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Вот один пример, когда авторы без необходимости вводят в заблуждение цитируемую ими цитату в поддержку своих утверждений: [https://imgur.com/a/6uVsbjc]<span translate = \"no\"> (https://imgur.com/a/ 6uVsbjc) </ SPAN>\n\nРечь идет о ресвератроле и о том, как он с прерывистым голоданием (IF) может «значительно увеличить как среднюю, так и максимальную продолжительность жизни» у мышей.\n\nОн упоминает выброс, который «прожил более 3 лет». Отлично. Давайте проверим статью (без платного доступа): [https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2538685/]<span translate = \"no\"> (https: //www.ncbi.nlm. nih.gov/pmc/articles/PMC2538685 /) </ SPAN>\n\nПросто посмотрите на [рисунок 4] <span translate = \"no\"> (https://www.ncbi.nlm.nih.gov/core/lw/2.0/html/tileshop_pmc/tileshop_pmc_inline.html?title=Click%20on% 20image% 20to% 20zoom & р = PMC3 & ID = 2538685_nihms57083f4.jpg) </ SPAN>.\n\nРисунок 4e: Хотя технически верно, что средняя продолжительность жизни мышей EODLR значительно выше, чем у мышей EODR и EOD, не упоминается, что EODLR - это мыши, которые едят каждый день (EOD) и получают низкую дозу Ресвератрол (ЛР). Таким образом, они на самом деле живут * дольше *, чем мыши EODR, которые получают \"нормальную\" дозу ресвератрола. И нет никакой разницы в средней продолжительности жизни мышей EODR и мышей EOD, которые просто ели через день, как следует из их названия. Поэтому нельзя сказать «ресвератрол и EOD увеличивают среднюю продолжительность жизни», потому что он, очевидно, зависит от дозы. Вы ** можете ** сказать, однако, «НИЗКАЯ ДОЗА ресвератрола и EOD увеличивает среднюю продолжительность жизни».\n\nЕсли мы посмотрим на рисунок 4с, то увидим долю выживших мышей. Похоже, в группе EODLR есть одна мышь, которая сделала это за 156 недель. Но коричневая линия контрольных мышей EOD, похоже, следует этой синей линии, и также кажется, что одна мышь выжила после этой точки. Но ни одна мышь из группы EODR не сделала. Что это говорит нам? Вам не нужно ресвератрол, чтобы нажать мышь в течение 3 лет. В нем также говорится - если вы дадите «нормальную» дозу ресвератрола, она не достигнет 3 лет вообще.\n\nПосле просмотра оригинальной статьи и данных: вы все еще верите, что ресвератрол и ЕСЛИ могут \"** значительно ** продлить как среднюю, так и максимальную продолжительность жизни\"?\n\nЯ не уверен. Это нюанс. Может быть доза ресвератрола, которая может оказывать вредное воздействие на организм. И «идеальная» доза могла бы увеличить ** среднюю ** продолжительность жизни при кормлении EOD (что ** НЕ ** прерывистое голодание в обычном смысле этого слова!). Что касается значительного продления максимальной продолжительности жизни? Ничто в статье не указывает на этот вывод. *\n\nЯ понимаю, что они не пишут научную статью, рецензию или главу книги, а давай. Это не единственное, между прочим, только первый пример, которым я хотел поделиться. Всегда читайте первичную литературу.\n\n* ** РЕДАКТИРОВАТЬ **: в статье упоминается увеличение максимальной продолжительности жизни на 15% по сравнению со стандартной диетой, но только при приеме ресвератрола в низких дозах. Высокие дозы ресвератрола не давали такого же преимущества, поэтому нельзя сказать, что «IF + Ресвератрол» (как общее утверждение) значительно увеличивает продолжительность жизни. Это зависит от дозы ( «нормальная» доза ресвератрола не распространяется продолжительность жизни в комбо с IF), и это спорно, если 15% можно охарактеризовать как «сильно».","title":"Книга Дэвида Синклера \"Продолжительность жизни ...\" интересна, но может вводить в заблуждение","subreddit_name_prefixed":"r/longevity","ups":84,"created":1568605279,"link_flair_background_color":"","id":"d4pdrz","author":{"name":"watevzzzzzzz"},"permalink":"/r/longevity/comments/d4pdrz/david_sinclairs_book_lifespan_is_interesting_but/","url":"https://www.reddit.com/r/longevity/comments/d4pdrz/david_sinclairs_book_lifespan_is_interesting_but/","created_utc":1568576479}