{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"> Молодое антивозрастное поле делает большой шаг вперед с демонстрацией Senolytics Clinic Mayo Clinic\n>\n> Идея о том, что очищение стареющих клеток - тех старых, утомленных клеток, которые перестают делиться - от тела может избавить организм от вредных белков, была одним из выдающихся предложений в сфере борьбы со старением. Сформировав поток данных о животных, подтверждающих эту гипотезу, в клинике Мейо появились результаты ранних исследований на людях, предполагающие, что они нашли лекарства, которые могут сделать именно это.\n>\n> ** Это важно, потому что, несмотря на публикацию первых данных о людях в январе, «до сих пор не было прямой демонстрации очищения сенесцентных клеток с помощью сенолитических препаратов в опубликованных рецензируемых опубликованных клинических исследованиях на людях», - пишут авторы в EBioMedicine. **\n>\n>\n>\n> Для небольшого испытания исследователи развернули дазатиниб и кверцетин; первый - препарат от рака, также известный как Sprycel, в то время как последний - производное растения. Девять пациентов с диабетом, связанным с хроническим заболеванием почек, были набраны и получили лечение в течение трех дней. Хотя лекарства были выведены из системы в течение нескольких дней, эффект, казалось, сохранялся, команда - с ЛаТоней Хиксон и Ларисой Ланги Прата в качестве соавторы - сообщили:\n>\n>\n>\n> Ключевые маркеры старения клеточных нагрузок были снижены в биопсии жировой ткани и кожи у субъектов через 11 дней после завершения 3-дневного курса D + Q, как и ключевые циркулирующие факторы SASP, по сравнению с до введения этих сенолитических препаратов.\n>\n>\n>\n> Такое доказательство о механизме действия подкрепляет их предыдущую работу, предполагая, что краткий курс дазатиниба плюс кверцетин улучшил физические функции пациентов с идиопатическим легочным фиброзом - тяжелым для лечения заболеванием.\n>\n>\n>\n> По словам Рональда Кохански, заместителя директора отделения биологии старения в Национальном институте старения, Рональд Кохански, будучи небольшим по масштабу, является значительным шагом вперед для перевода сенолитических методов лечения.\n\n\n\n[https://endpts.com/mayo-clinic-showcases-drugs-that-flush-senescent-cells-from-human-body-a-big-step-for-anti-aging-field/]<span translate = \"нет\"> (https://endpts.com/mayo-clinic-showcases-drugs-that-flush-senescent-cells-from-human-body-a-big-step-for-anti-aging-field/) </ SPAN>\n\nПолный текст статьи: [https://www.ebiomedicine.com/article/S2352-3964(19)30591-2/fulltext]<span translate = \"no\"> (https://www.ebiomedicine.com/article/S2352 -3964 (19) </ SPAN> 30591-2 / полный текст)","title":"Сенолитики уменьшают количество стареющих клеток у людей","subreddit_name_prefixed":"r/longevity","ups":35,"created":1568862460,"link_flair_background_color":"","id":"d62j84","author":{"name":"vp2013"},"permalink":"/r/longevity/comments/d62j84/senolytics_decrease_senescent_cells_in_humans/","url":"https://www.reddit.com/r/longevity/comments/d62j84/senolytics_decrease_senescent_cells_in_humans/","created_utc":1568833660}