{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Последние новости от Джоша Миттлдорфа:\n\n \n\n> * Хорошая новость заключается в том, что проект * [* DataBETA *]  (http://data-beta.net/)  * нашел дом. После нескольких месяцев поиска партнера по университету я очень рад работать в лаборатории Моше Шиф в Медицинской школе Макгилла. DataBETA - это широкий обзор того, что люди делают, чтобы увеличить продолжительность жизни, в сочетании с оценкой этих стратегий (и их взаимодействий!) С использованием новейших эпигенетических часов. Шиф был настоящим пионером эпигенетической науки еще в эпоху, когда эпигенетики еще не было на экранах наших радаров. Никто не имеет опыта извлечения информации из данных метилирования. *\n>\n> DataBETA - это новое исследование, которое теперь возможно, когда часы метилирования достигли совершеннолетия. Исследования антивозрастных вмешательств в прошлом были непрактичными, потому что, пока исследование зависит от людей, умирающих от старости, оно займет десятилетия и обойдется в десятки миллионов долларов. Использование часов метилирования для оценки ярлыков биологического возраста, которые обрабатываются, потенциально сокращая [время в 10 раз и стоимость в 100 раз] <span translate = \"no\"> (http://043c484.netsolhost.com/databeta /Mitteldorf_REJ_2018-2083.pdf) </ SPAN>. Но это критически зависит от предположения, что часы метилирования остаются истинными предикторами болезней и смерти, когда вводятся неестественные вмешательства. Является ли метилирование индикатором, пассивным маркером возраста? Или изменение структуры метилирования вызывает старение?\n\n\n\n [https://joshmitteldorf.scienceblog.com/2019/10/15/methylation-clocks-and-true-biological-age/]<span translate = \"no\"> (https://joshmitteldorf.scienceblog.com/2019 / 10/15 / метилирования-часы и верно-биологического возраста /) </ SPAN>","title":"Часы метилирования и истинный биологический возраст. Как вы можете внести данные для базы данных против старения.","subreddit_name_prefixed":"r/longevity","ups":30,"created":1571281025,"link_flair_background_color":"","id":"ditwaf","author":{"name":"vp2013"},"permalink":"/r/longevity/comments/ditwaf/methylation_clocks_and_true_biological_age_how/","url":"https://www.reddit.com/r/longevity/comments/ditwaf/methylation_clocks_and_true_biological_age_how/","created_utc":1571252225}