{"subreddit":{"display_name":"longevity"},"subreddit_loc":"долговечность","selftext":"Из статьи Genomeweb. Содержание ниже:\n\n\n\n> НЬЮ-ЙОРК. У людей, особенно долгоживущих, в крови циркулирует цитотоксические CD4-Т-клетки, обнаружен новый одноклеточный транскриптомный анализ.\n>\n> Исследователи изучали суперцентенариев - людей, которые достигли 110-летнего возраста и более - чтобы лучше понять здоровое старение. Многие суперцентенарии достигают этих старых возрастов с хорошим здоровьем, предполагая, что их иммунная система может лучше защитить их от болезней.\n>\n> Исследователи в Японии, возглавляемые Пьеро Карнинчи из Центра интегративной медицины Рикена, в настоящее время проводят одноклеточный транскриптомный анализ мононуклеарных клеток периферической крови суперцентенариев и контролей. Как они [сообщили в * Слушаниях Национальной академии наук * на этой неделе]  (https://www.pnas.org/content/early/2019/11/11/1907883116) , они обнаружили, что суперцентенары имели повышенное количество цитотоксических CD4 T-клеток, тип клеток, который обычно не цитотоксичен, но является вспомогательной клеткой.\n>\n> «Превращение вспомогательных CD4 Т-клеток в цитотоксическое разнообразие может быть адаптацией к поздней стадии старения», - пишут исследователи в своей статье.\n>\n> Используя метод секвенирования одноклеточной РНК на основе капелек, они профилировали мононуклеарные клетки периферической крови от семи суперцентенариев и пяти контролей в возрасте от 50 до 80 лет. В этих образцах они обнаружили 10 различных кластеров, представляющих разные типы клеток, включая В-клетки и Т-клетки.\n>\nОни обнаружили, что суперцентенаристы, как правило, имеют меньшую долю В-клеток по сравнению с контрольной группой. B-клетки составляли около 2 процентов иммунных клеток в суперцентенарных образцах, в то время как они составляли 11 процентов иммунных клеток от контролей, что было подтверждено анализом сортировки клеток, активируемым флуоресценцией.\n>\n> Хотя доля Т-клеток в иммунных клетках была в значительной степени схожа между суперцентенариями и контролями - около 40 процентов - типы Т-клеток в этой фракции различались между группами.\n>\nВклад Т-клеток суперцентрианцев содержал гораздо больше цитотоксических Т-клеток, чем контрольных. Цитотоксические Т-клетки составляли около 80 процентов фракции Т-клеток у некоторых суперцентенарных особей, в то время как в контроле они составляли от 10 до 20 процентов фракции Т-клеток.\n>\n> В частности, исследователи сообщили, что цитотоксические Т-клетки в суперцентенариях содержали более высокий уровень цитотоксических Т-клеток CD4 (ЦТЛ) - даже несмотря на то, что Т-клетки CD4 + обычно являются нецитотоксическими хелперными Т-клетками - и более высокий уровень цитотоксических Т-клеток CD8 по сравнению с контролем. Уровень γδ Т-клеток у суперцентрианов, однако, был аналогичен контролю. Они также подтвердили эти результаты с помощью анализа FACS.\n>\n> CD4 CTL имели транскриптомные профили, которые напоминали таковые CD8 CTL, отмечают исследователи. В частности, CD4-CTL обладали повышенной экспрессией GZMA, GZMB, GZMH, PRF1 и NKG7 и снижали экспрессию CCR7, CD27, CD28 и IL7R. Это указывало на то, что CD4 CTL используют транскрипционную программу цитотоксических CD8 CTL, сохраняя при этом их экспрессию CD4.\n>\n> Как клетки-помощники, CD4 + T-клетки, как правило, регулируют иммунные ответы через цитокины, и исследователи обнаружили, что CD4 CTL из суперцентрианцев могут продуцировать IFN-γ и TNF-α при стимуляции ex vivo. Это, по их словам, позволяет предположить, что CD4 CTL могут усилить иммунологический надзор и идентификацию возникающих опухолевых клеток или вирусных инфекций и сохранить здоровье суперцентенариев надолго.\n>\n> «Наше исследование показало, что суперцентенарии имеют уникальные характеристики в своих циркулирующих лимфоцитах, которые могут представлять собой важную адаптацию для достижения исключительной долговечности путем поддержания иммунного ответа на инфекции и заболевания», - пишут исследователи в своей статье.","title":"У суперцентенариев повышен уровень цитотоксических T-клеток CD4","subreddit_name_prefixed":"r/longevity","ups":57,"created":1573622048,"link_flair_background_color":"","id":"dvgi0e","author":{"name":"Humes-Bread"},"permalink":"/r/longevity/comments/dvgi0e/supercentenarians_have_increased_levels_of/","url":"https://www.reddit.com/r/longevity/comments/dvgi0e/supercentenarians_have_increased_levels_of/","created_utc":1573593248}