{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"Эфириума","selftext":"Всем привет,\n\nВ течение последних 6 месяцев мы использовали Google Ads, чтобы помочь нам лучше понять наши умные службы аудита контрактов, и мы заметили странное изменение в последние несколько дней. Похоже, что Google полностью занес в черный список Ethereum в качестве ключевого слова.\n\nНи одно из ключевых слов, которые содержат \"ethereum\" в наших кампаниях, больше не показывает рекламу по состоянию на 9 января и теперь сообщает об ошибке:\n\n> Объявление не показывается сейчас\n>\n> Этот кандидат не имеет права показывать рекламу в вашем целевом местоположении.\n\nВот [скриншот] (https://imgur.com/a/FWyPZEx) упомянутой ошибки. Мы также пытались [связаться с Google] (https://twitter.com/DecenterTeam/status/1083392362544594944), но безрезультатно. Несмотря на то, что команда Google Ads утверждает, что в их правилах не было никаких изменений, вы можете попробовать выполнить поиск, такой как «аудит смарт-контрактов ethereum» и «аудит смарт-контрактов eos» - только последние будут показывать рекламу в результатах.\n\nМы не смогли найти никаких новостей о последних обновлениях политики нигде. Ключевые фразы, такие как «аудит безопасности ethereum», просто получали впечатления до 8 января, а затем внезапно прекращались, показывая в качестве объяснения только эту очень неоднозначную ошибку.\n\nЧто интересно, черный список не относится к таким ключевым словам, как «ico», «биткойн», «eos» и т. Д. Мы также пробовали использовать VPN для нескольких разных стран, и кажется, что в поисковом запросе нет рекламы с «Ethereum». появляются где угодно.\n\nКто-нибудь еще видит то же самое, и у них есть идея, почему?\n\nМы обеспокоены тем, что Google по какой-то причине нацелен на Ethereum, и хотели узнать, можем ли мы, как сообщество, оказать некоторое давление на команду Google Ads, чтобы изменить политику в отношении ключевых слов или, по крайней мере, дать разумное объяснение таким дискриминационным правилам.","title":"Google занесен в черный список Ethereum в Google Ads","subreddit_name_prefixed":"r/ethereum","ups":578,"created":1547248274,"link_flair_background_color":"","id":"aewa0e","author":{"name":"eli0tz"},"permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/","url":"https://www.reddit.com/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/","created_utc":1547219474,"replies":[{"ups":206,"link_id":"t3_aewa0e","replies":[{"ups":-1,"link_id":"t3_aewa0e","id":"educkph","author":"ThePlague","parent_id":"t1_edtavdu","subreddit_id":"t5_2zf9m","body":"Putting on my tinfoil hat for a moment, I don't think Google would see ethereum, or crypto as a whole, as threat to their business.  After all, ethereum's focus isn't advertisements.  The only exception to this would be things like Brave, but I doubt this is seen as much of a threat:  ad-blocking isn't anything new, after all.\n\nNo, IF Google is actually threatened by crypto to the point of blacklisting certain terms in their ad-sense, I would think it would be more due to the payment methods crypto offers that circumvent demonetizing strategies employed by them (and Patreon, and other like-minded corporations with a similar political agenda).  Thus, by de-legitimizing crypto by de-monetizing it, they slow adoption and increase the wariness of crypto by the general public.  Basically, it makes it more likely that the only time a typical person would hear about crypto is when the price bubbles or crashes, which certainly doesn't inspire any sort of confidence or desire to actually use it.  It also removes revenue from people they politically oppose, thus decreasing their ability to spread their messages.\n\nSo, to flip the old Godfather maxim: this isn't business, it's political.","body_html":"<div class = \"md\"> <p> На мгновение надев шляпу из фольги, я не думаю, что Google будет рассматривать эфириум или криптографию в целом как угрозу для их бизнеса. В конце концов, фокус эфириума не реклама. Единственным исключением из этого могут быть такие вещи, как «Храбрый», но я сомневаюсь, что это воспринимается как большая угроза: в конце концов, блокировка рекламы не является чем-то новым. </P>\n\n<p> Нет, если Google на самом деле угрожает криптографией до черных списков определенных терминов в их рекламном смысле, я думаю, что это будет связано с методами оплаты, которые крипто предлагает, чтобы обойти применяемые ими стратегии демонетизации (и Патреон, и другие корпорации-единомышленники с аналогичной политической программой). Таким образом, де-легитимизируя криптографию путем ее монетизации, они замедляют принятие и повышают настороженность криптозащиты широкой публикой. По сути, это повышает вероятность того, что типичный человек услышит о криптографическом единственном случае, когда цена пузырится или падает, что, безусловно, не внушает никакой уверенности или желания использовать ее. Это также устраняет доход от людей, которым они политически противостоят, тем самым уменьшая их способность распространять свои сообщения. </P>\n\n<p> Итак, чтобы перевернуть старое изречение крёстного отца: это не бизнес, а политика. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/educkph/","name":"t1_educkph","created":1547272149,"created_utc":1547243349,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"edt9i2v","author":"ThePlague","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Google has various political and economic agendas, and they are quite willing to use their various services to promote their preferences.  AdSense and Youtube are notorious for this, but there have been some incidents regarding the play store as well.\n\nDespite their supposed corporate \"do no evil\" motto, they are more than willing to use their considerable power to choose winners and losers in social, political, and economic matters.","body_html":"<div class = \"md\"> <p> У Google есть различные политические и экономические планы, и они вполне готовы использовать свои различные службы для продвижения своих предпочтений. AdSense и Youtube печально известны этим, но были и некоторые инциденты с игровым магазином. </P>\n\n<p> Несмотря на их предполагаемый корпоративный девиз «не делай зла», они более чем готовы использовать свою значительную власть для выбора победителей и проигравших в социальных, политических и экономических вопросах. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edt9i2v/","name":"t1_edt9i2v","created":1547249186,"created_utc":1547220386,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":62,"link_id":"t3_aewa0e","id":"edtcm17","author":"Gigablah","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Sorry, it was me. I reported so many ETH scams and phishing sites that the big evil G probably decided to just ban the entire keyword.","body_html":"<div class = \"md\"> <p> Извините, это был я. Я сообщил о таком количестве мошеннических и фишинговых сайтов ETH, что большое зло G, вероятно, решило просто запретить все ключевое слово. </P>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtcm17/","name":"t1_edtcm17","created":1547251069,"created_utc":1547222269,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":38,"link_id":"t3_aewa0e","replies":[{"ups":4,"link_id":"t3_aewa0e","id":"edtocw9","author":"clelwell","parent_id":"t1_edthi1q","subreddit_id":"t5_2zf9m","body":"Ico can mean other things, might be too short to ban outright ","body_html":"<div class = \"md\"> <p> Ico может означать и другие вещи, может быть слишком коротким, чтобы его можно было запретить напрямую </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtocw9/","name":"t1_edtocw9","created":1547257947,"created_utc":1547229147,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"edtdn5g","author":"[deleted]","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtdn5g/","name":"t1_edtdn5g","created":1547251710,"created_utc":1547222910,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":11,"link_id":"t3_aewa0e","id":"edtghp3","author":"gasfjhagskd","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Here is your problem most likely. It depends on what regions you're targeting as well. Some won't allow crypto related ads at all. You likely received impressions until it was finally review and now no longer do. It's pretty common.\n\nIt's nothing nefarious. There are tons of crypto scams and they don't want the majority of shady crypto ads.\n\nhttps://support.google.com/adspolicy/answer/7648803?hl=en","body_html":"<div class = \"md\"> <p> Скорее всего, это ваша проблема. Это зависит от того, на какие регионы вы ориентируетесь. Некоторые вообще не разрешают рекламу, связанную с криптографией. Скорее всего, вы получили впечатления, пока он не был окончательно рассмотрен, а теперь больше не делаете. Это довольно часто. </P>\n\n<p> В этом нет ничего гнусного. Существует множество крипто-мошенников, и им не нужна большая часть крипто-рекламы. </P>\n\n<p> <a href=\"https://support.google.com/adspolicy/answer/7648803?hl=en\"> https://support.google.com/adspolicy/answer/7648803?hl=ru</а> </р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtghp3/","name":"t1_edtghp3","created":1547253519,"created_utc":1547224719,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":7,"link_id":"t3_aewa0e","replies":[{"ups":2,"link_id":"t3_aewa0e","replies":[{"ups":2,"link_id":"t3_aewa0e","replies":[{"ups":0,"link_id":"t3_aewa0e","replies":[{"ups":1,"link_id":"t3_aewa0e","id":"edxazoh","author":"gasfjhagskd","parent_id":"t1_edxa6i2","subreddit_id":"t5_2zf9m","body":"I don't follow. How are you going to serve me targeted ads on Reddit.com with blockchain and how is this better than serving ads from a huge, centralized, high-speed system?","body_html":"<div class = \"md\"> <p> Я не подписан. Как вы собираетесь показывать мне целевую рекламу на Reddit.com с помощью блокчейна и как это лучше, чем показ объявлений из огромной, централизованной, высокоскоростной системы? </P>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edxazoh/","name":"t1_edxazoh","created":1547358702,"created_utc":1547329902,"subreddit_name_prefixed":"r/ethereum","depth":8}],"id":"edx9e38","author":"gasfjhagskd","parent_id":"t1_edx8ibg","subreddit_id":"t5_2zf9m","body":"Same question then for ad tech. Or any IP.\n\nThe reality is that the vast majority of technology can't transition to blockchain and wouldn't benefit from it either way. ","body_html":"<div class = \"md\"> <p> Тот же вопрос, что и для рекламных технологий. Или любой IP. </P>\n\n<p> Реальность такова, что подавляющее большинство технологий не может перейти на блокчейн и не получит от этого никакой выгоды. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edx9e38/","name":"t1_edx9e38","created":1547357656,"created_utc":1547328856,"subreddit_name_prefixed":"r/ethereum","depth":6}],"id":"edx5nyf","author":"gasfjhagskd","parent_id":"t1_edx5jh7","subreddit_id":"t5_2zf9m","body":"Can you show me how to run their search algorithm on a distributed network and high speed and without revealing their IP?","body_html":"<div class = \"md\"> <p> Можете ли вы показать мне, как запустить их алгоритм поиска в распределенной сети и на высокой скорости и без раскрытия их IP?\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edx5nyf/","name":"t1_edx5nyf","created":1547355234,"created_utc":1547326434,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"edx4vxf","author":"gasfjhagskd","parent_id":"t1_edtxsa5","subreddit_id":"t5_2zf9m","body":"Care to explain?","body_html":"<div class = \"md\"> <p> Не хочешь объяснить? </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edx4vxf/","name":"t1_edx4vxf","created":1547354733,"created_utc":1547325933,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"edtv78m","author":"nikoschalk","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"As far as I am aware of, the Ethereum network can be used to build distributed applications. Now imagine the potential financial losses in Google as it offers various distributed/cloud solution ","body_html":"<div class = \"md\"> <p> Насколько мне известно, сеть Ethereum может использоваться для создания распределенных приложений. Теперь представьте потенциальные финансовые потери в Google, поскольку он предлагает различные распределенные / облачные решения </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtv78m/","name":"t1_edtv78m","created":1547261876,"created_utc":1547233076,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_aewa0e","id":"edu1q4g","author":"3esmit","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Everyone should be aware of Google superpower. If you use Google (probably does, even without an account), watch this analysis  from their CEO in congress: [https://www.youtube.com/watch?v=Flf2xqqZhsQ](https://www.youtube.com/watch?v=Flf2xqqZhsQ)   \n\n\nEthereum brings a new solution that undermines Google power, because everything is open-source and all data is public.  \nSelf-sovereign Identity (ERC725,ERC735, Claim Signers) will totally replace SSO services such as Google Account, this is the worst for them, because will make Google's data collection harder. Web3 is built from ground with privacy as principle.   \nThe web3 provider I use have though principles  [https://our.status.im/our-principles/](https://our.status.im/our-principles/) and is following for ERCs that strengthen user privacy.   \n\n\nBTW, the person who did that video accept donations in ETH chain, his address in the comment of the video, I already donated: [https://etherscan.io/tx/0xfba8333ba79bde1b7d7d23b2931eaa688cfb738ff7e4674a86484973509d96c1](https://etherscan.io/tx/0xfba8333ba79bde1b7d7d23b2931eaa688cfb738ff7e4674a86484973509d96c1) \n\nI am curious to see how long that YouTube account will survive after getting banned with no reason.","body_html":"<div class = \"md\"> <p> Каждый должен знать о сверхдержаве Google. Если вы пользуетесь Google (возможно, даже без учетной записи), посмотрите этот анализ от своего генерального директора в конгрессе: <a href=\"https://www.youtube.com/watch?v=Flf2xqqZhsQ\"> https: // www .youtube.com / watch? v = Flf2xqqZhsQ </a> </p>\n\n<p> Ethereum предлагает новое решение, которое подрывает мощь Google, потому что все с открытым исходным кодом, а все данные общедоступны. <br/>\nСамостоятельная идентификация (ERC725, ERC735, заявители) полностью заменит службы единого входа, такие как учетная запись Google, для них это является наихудшим, потому что усложнит сбор данных Google. Web3 построен с нуля с принципом конфиденциальности. <br/>\nУ провайдера web3, которым я пользуюсь, есть принципы <a href=\"https://our.status.im/our-principles/\"> https://our.status.im/our-principles/ </a>, и он следует для ERC, которые усиливают конфиденциальность пользователей. </Р>\n\n<p> Кстати, человек, сделавший это видео, принимает пожертвования в цепочке ETH, его адрес в комментарии к видео я уже пожертвовал: //etherscan.io/tx/0xfba8333ba79bde1b7d7d23b2931eaa688cfb738ff7e4674a86484973509d96c1 </a> </p>\n\n<p> Мне любопытно узнать, как долго этот аккаунт YouTube просуществует после того, как его забанят без причины. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu1q4g/","name":"t1_edu1q4g","created":1547265423,"created_utc":1547236623,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_aewa0e","id":"edu7va5","author":"MR_CHNYD","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Google is fucking evil.","body_html":"<div class = \"md\"> <p> Google чертовски злой. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu7va5/","name":"t1_edu7va5","created":1547269196,"created_utc":1547240396,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_aewa0e","replies":[{"ups":2,"link_id":"t3_aewa0e","id":"edvywki","author":"monstarjams","parent_id":"t1_edvmh3n","subreddit_id":"t5_2zf9m","body":"Yes, I understand that it’s not particularly a copy issue, but trying to give you at least a work around. It seems like you’re running exact match keywords exclusively. If you run broad match modified or phrase match keywords, you’ll have the potential to show up for those searches even though your keyword itself won’t have “ethereum” in it. Regardless, your best bet is to reach out to them on the phone. Not sure why Twitter was your first attempt at a resolution. ","body_html":"<div class = \"md\"> <p> Да, я понимаю, что проблема не в копировании, а в попытках обойти вас. Похоже, вы используете исключительно ключевые слова с точным соответствием. Если вы используете ключевые слова с модифицированным соответствием или ключевые слова с широким соответствием, у вас будет возможность появиться в этих поисках, даже если само ваше ключевое слово не будет содержать «ethereum». В любом случае, вам лучше всего связаться с ними по телефону. Не уверен, почему Твиттер был вашей первой попыткой разрешения. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edvywki/","name":"t1_edvywki","created":1547322931,"created_utc":1547294131,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"edu3ia6","author":"monstarjams","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"I’m seeing a lot of smart contract audit ads, some with ethereum in the ad copy. I’d recommend running “smart contract audit” or +smart +contract +audit and see if that pulls in any of what you’re looking for. \n\nDo you have a dedicated Google account rep? They may be able to help further. \n\nAlso, stop going through twitter. Get on the phone with Google and speak to a human. They’re not always, but a lot of times, US based and can be much more helpful. ","body_html":"<div class = \"md\"> <p> Я вижу много умных рекламных объявлений по аудиту контрактов, некоторые из которых содержат ethereum в рекламном тексте. Я бы порекомендовал провести «умный аудит контракта» или «умный + контракт + аудит» и посмотреть, влечет ли это что-то из того, что вы ищете. </Р>\n\n<p> У вас есть специальный представитель Google? Они могут быть в состоянии помочь в дальнейшем. </Р>\n\n<p> Кроме того, прекратите просматривать твиттер. Позвоните по телефону с Google и поговорите с человеком. Они не всегда, но часто в США, и могут быть намного полезнее. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu3ia6/","name":"t1_edu3ia6","created":1547266487,"created_utc":1547237687,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edubg41","author":"Storm5had0w","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Fuck Google ","body_html":"<div class = \"md\"> <p> Трахни Google </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edubg41/","name":"t1_edubg41","created":1547271429,"created_utc":1547242629,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_aewa0e","id":"educ1av","author":"mshthn","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"I don't care, I blacklisted Google ads lol","body_html":"<div class = \"md\"> <p> Мне все равно, я в черном списке объявлений Google LOL </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/educ1av/","name":"t1_educ1av","created":1547271805,"created_utc":1547243005,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_aewa0e","id":"edwryz9","author":"simeonsoden","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"So has Facebook! ","body_html":"<div class = \"md\"> <p> Как и Facebook! </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edwryz9/","name":"t1_edwryz9","created":1547346421,"created_utc":1547317621,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edtf3sb","author":"DoUHearThePeopleSing","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Well, they aren't good at automatically filtering out scam/phishing ads. \n\nBecause of that it's probably better if they ban the whole category. I prefer some crypto sites not being able to advertise to more people getting scammed through Google Ad clicks.","body_html":"<div class = \"md\"> <p> Ну, они не умеют автоматически отфильтровывать мошенническую и фишинговую рекламу. </Р>\n\n<p> Из-за этого, вероятно, лучше, если они запретят всю категорию. Я предпочитаю, чтобы некоторые криптосайты не могли рекламировать большее количество людей, мошеннических из-за кликов по Google Ad. </P>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtf3sb/","name":"t1_edtf3sb","created":1547252634,"created_utc":1547223834,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edtp09n","author":"ethereumcpw","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Perhaps it's related to the Ethereum Classic 51% attack--among some of the other reasons stated in the thread.","body_html":"<div class = \"md\"> <p> Возможно, это связано с атакой Ethereum Classic 51% - среди других причин, указанных в теме. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtp09n/","name":"t1_edtp09n","created":1547258299,"created_utc":1547229499,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edtxl32","author":"ScionoicS","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"I defended this action last I saw them doing this during the ICO scam craziness, when Bitconnect was at full steam and everyday had a new ICO looking to steal.. i mean accept money from people for having an idea and nothing much more.  It made sense that google would ban crypto advertisements then because the bulk sum of them were  people trying to con people.  \n\nThis doesn't seem to be the case this time.  I will keep in mind hanlon's razor, but I won't defend them here.  ","body_html":"<div class = \"md\"> <p> Я защищал это действие в последний раз, когда я видел, как они это делали во время сумасшедшего мошенничества в ICO, когда Bitconnect был в самом разгаре, а каждый день у нового ICO было желание украсть ... я имею в виду принимать деньги от людей за идею и ничего больше. Это имело смысл, что Google запретит крипто-рекламу тогда, потому что большая часть их была людьми, пытающимися обмануть людей. </Р>\n\n<p> На этот раз это не так. Я буду помнить бритву Ханлона, но я не буду защищать их здесь. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edtxl32/","name":"t1_edtxl32","created":1547263195,"created_utc":1547234395,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edu22ho","author":"garlicmyballs","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"It has to do with legal compliance.  You need to check the countries you are targeting against the policy list.  You might be targeting countries that don’t allow advertising of securities and google takes the view of crypto may be labeled securities in various jurisdictions.","body_html":"<div class = \"md\"> <p> Это связано с соблюдением законодательства. Вам необходимо проверить страны, на которые вы ориентируетесь, в соответствии с политическим списком. Возможно, вы нацеливаетесь на страны, которые не разрешают рекламу ценных бумаг, и Google считает, что крипто может быть помечен ценными бумагами в различных юрисдикциях. </P>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu22ho/","name":"t1_edu22ho","created":1547265616,"created_utc":1547236816,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edu3fyc","author":"mainstmarketingcoach","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Google really doesn't like crypto. Lots of restrictions on crypto related projects","body_html":"<div class = \"md\"> <p> Google действительно не любит криптографию. Множество ограничений в крипто-связанных проектах </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu3fyc/","name":"t1_edu3fyc","created":1547266445,"created_utc":1547237645,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edu9f8d","author":"Richie_Exus","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Where was this bias when deeponion and shitcoins (a-z) were promoting bullshit.  \n\n\nThe saying shouldn't say \"Bad guys win because good guys don't do anything\"   \n\n\nIt should say \"Bad guys win because facebook and google took their money\" \n\n  \nI hope this is a mistake or someone is gaming the google analytics to to blacklist Ethereum.","body_html":"<div class = \"md\"> <p> Где был этот уклон, когда Deeponion и shitcoins (a-z) продвигали чушь собачью. </Р>\n\n<p> Поговорка не должна говорить: «Плохие парни выигрывают, потому что хорошие парни ничего не делают» </p>\n\n<p> Должно быть сказано: «Плохие парни выигрывают, потому что Facebook и Google забрали свои деньги». </p>\n\n<p> Я надеюсь, что это ошибка, или кто-то использует Google Analytics, чтобы добавить в черный список Ethereum. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edu9f8d/","name":"t1_edu9f8d","created":1547270162,"created_utc":1547241362,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edue4bq","author":"PyRhofex","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"You'd need to look at a few things before specifically determining the issue. Can you share the following?\n\n&#x200B;\n\nAd Copy:\n\n&#x200B;\n\nLanding Page:\n\n&#x200B;\n\nIs this happening on search and display, or just search?","body_html":"<div class = \"md\"> <p> Вам нужно взглянуть на несколько вещей, прежде чем конкретно определить проблему. Можете ли вы поделиться следующим? </P>\n\n<Р> </р>\n\n<p> Копия объявления: </p>\n\n<Р> </р>\n\n<p> Целевая страница: </p>\n\n<Р> </р>\n\n<p> Это происходит при поиске и отображении или просто при поиске? </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edue4bq/","name":"t1_edue4bq","created":1547273176,"created_utc":1547244376,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edvjf8b","author":"EvilPhd666","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"I'm Dennis Prager. Have you tried this one Obama refi trick to SUPPORT TRUMP'S BORDER WALL CLICK NOW! ","body_html":"<div class = \"md\"> <p> Я Деннис Прагер. Пробовали ли вы этот рефрик-трюк Обамы, чтобы ПОДДЕРЖАТЬ ТРАНСПОРТНУЮ ГРАНИЦУ СТЕНЫ НАЖМИТЕ СЕЙЧАС! </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edvjf8b/","name":"t1_edvjf8b","created":1547307444,"created_utc":1547278644,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edvougf","author":"Randomees","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"If I'm not mistaken, didn't Google ban crypto ads altogether? ","body_html":"<div class = \"md\"> <p> Если я не ошибаюсь, разве Google вообще не запретил крипто-рекламу? </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edvougf/","name":"t1_edvougf","created":1547312658,"created_utc":1547283858,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edvr81l","author":"kratlister","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"I bet it's due to the new ethereum fork scams, \"Nowa\" and \"classic vision\".","body_html":"<div class = \"md\"> <p> Могу поспорить, что это связано с новыми жульничествами в Ethereum, \"Nowa\" и \"classic vision\". </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edvr81l/","name":"t1_edvr81l","created":1547315027,"created_utc":1547286227,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edvxir9","author":"CryptoRamble","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"It's not just Google. Major ad companies are deciding that don't want to allow ads on cryptocurrency in general. It's almost impossible to actually promote your work. And it seems to be hit and miss, with no real guidelines beyond what an unknown person thinks. It's just the cancer of regulation that is overtaking crypto. And any profitable idea that humans undertake, of course under the guise of protection. ","body_html":"<div class = \"md\"> <p> Это не просто Google. Крупные рекламные компании решают, что не хотят разрешать рекламу криптовалюты в целом. Практически невозможно продвинуть вашу работу. И это кажется удачным, без реальных указаний, кроме того, что думает неизвестный человек. Это просто рак регулирования, который настигает крипто. И любая прибыльная идея, которую люди предпринимают, конечно, под видом защиты. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edvxir9/","name":"t1_edvxir9","created":1547321543,"created_utc":1547292743,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edw1zud","author":"EducationalLadder","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Damn. Its time to boycott google all together.","body_html":"<div class = \"md\"> <p> Черт. Пришло время бойкотировать Google все вместе. </P>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edw1zud/","name":"t1_edw1zud","created":1547326566,"created_utc":1547297766,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"edwkyky","author":"netstrong","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"unbelievable ","body_html":"<div class = \"md\"> <p> невероятно </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edwkyky/","name":"t1_edwkyky","created":1547342679,"created_utc":1547313879,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"ee207ez","author":"Firefighter899","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Because ether should have been labeled a\n security ","body_html":"<div class = \"md\"> <p> Поскольку эфир должен был быть помечен как\n безопасность </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/ee207ez/","name":"t1_ee207ez","created":1547512566,"created_utc":1547483766,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"ee3hcg8","author":"JeerFear","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Those F***ing dinosaurs. They’ll be gone soon. ","body_html":"<div class = \"md\"> <p> Эти чертовы динозавры. Они скоро уйдут. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/ee3hcg8/","name":"t1_ee3hcg8","created":1547551911,"created_utc":1547523111,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_aewa0e","id":"eezcxun","author":"lvto2000","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"Competition. Nothing more, nothing less.  Its time to reinvent the internet.  Collusion and Internet company cartels are real kids.  A look into the future------------> 2020   GOOGLE just announced a new Blockchain Technology inegrated into all phones and Internet content.   Not real but highly possible and likely.   Hedge your bets by investing in your favorite block chain and google's stocks.  No other way to stop it. ","body_html":"<div class = \"md\"> <p> Конкурс. Ни больше ни меньше. Пришло время изобрести Интернет. Сговоры и интернет-картели компании - это настоящие дети. Взгляд в будущее ------------> 2020 GOOGLE только что объявил о новой технологии Blockchain, интегрированной во все телефоны и интернет-контент. Не реально, но очень возможно и вероятно. Хеджируйте свои ставки, инвестируя в свою любимую цепочку блоков и акции Google. Нет другого способа остановить это. </Р>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/eezcxun/","name":"t1_eezcxun","created":1548497842,"created_utc":1548469042,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":-34,"link_id":"t3_aewa0e","replies":[{"ups":2,"link_id":"t3_aewa0e","id":"edv6kis","author":"senzheng","parent_id":"t1_edtxw4j","subreddit_id":"t5_2zf9m","body":"nobody understands decentralized technology less than people so unintelligent and so clueless they would waste even a second on pointless centralized networks like ethereum and why ethereum developers are considered the absolute worst by technical literacy on top of having absolutely no ethics and known as chain of liars and thieves.\n\nno project is more centralized, more error prone, less secure than ethereum in crypto space\n\nthere is nothing more embarrassing than being associated with ethereum, onecoin or bitconnectX for exact same reasons. there is not 1 thing that's positive about ethereum - simple fact.\n\n* https://medium.com/@nextlevelcrypto/ethereum-is-not-a-decentralized-trust-minimized-blockchain-ccff48c08b8b\n\n* https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb\n\ncountless fact based examples against ethereum, 0 fact based examples pro ethereum/onecoin/bitconnect\n\nmost of scammers that make up the ethereum community don't even understand basic words like how a centralized premine is not decentralized. ethereum community isn't capable of forming coherent logical thoughts like normal people.","body_html":"<div class = \"md\"> <p> никто не понимает децентрализованную технологию меньше, чем люди, настолько неразумные и столь невежественные, что потратят хотя бы секунду на бессмысленные централизованные сети, такие как ethereum, и почему разработчики ethereum считаются абсолютными худшими из-за технической грамотности не имеет абсолютно никакой этики и известен как цепь лжецов и воров. </p>\n\n<p> ни один проект не является более централизованным, более подверженным ошибкам, менее безопасным, чем ethereum в крипто-пространстве </p>\n\n<p> нет ничего более неловкого, чем быть связанным с ethereum, onecoin или bitconnectX по точно таким же причинам. В эфире нет ничего положительного - простой факт. </p>\n\n<UL>\n<li> <p> <a href=\"https://medium.com/@nextlevelcrypto/ethereum-is-not-a-decentralized-trust-minimized-blockchain-ccff48c08b8b\"> https://medium.com/@ nextlevelcrypto / Эфириум-это-не-а-децентрализована-доверительным минимизировано-blockchain-ccff48c08b8b </a> </р> </LI>\n<li> <p> <a href=\"https://medium.com/@WhalePanda/ethereum-chain-of-liars-thieves-b04aaa0762cb\"> https://medium.com/@WhalePanda/ethereum-chain- из-лжецов-воров-b04aaa0762cb </a> </p> </li>\n</UL>\n\n<p> бесчисленные примеры на основе фактов против ethereum, 0 примеров на основе фактов pro ethereum / onecoin / bitconnect </p>\n\n<p> большинство мошенников, составляющих сообщество ethereum, даже не понимают основных слов, например, как централизованная премина не децентрализована. Сообщество ethereum не способно формировать логически последовательные мысли, как нормальные люди. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edv6kis/","name":"t1_edv6kis","created":1547293964,"created_utc":1547265164,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"edt8ais","author":"senzheng","parent_id":"t3_aewa0e","subreddit_id":"t5_2zf9m","body":"good since centrally printed ethereum whose security depends on just 1 trusted party has nothing to do with decentralized technology. there are no legitimate usecases for centralized ethereum and bitconnect and there are no intelligent people that would ever work on either for exact same reasons. just use a server, it's a cheaper version of ethereum.","body_html":"<div class = \"md\"> <p> хорошо, поскольку централизованный печатный эфир, безопасность которого зависит только от одной доверенной стороны, не имеет ничего общего с децентрализованной технологией. не существует законных сценариев использования для централизованного эфириума и битконнекта, и нет интеллектуальных людей, которые когда-либо работали бы по тем же причинам. просто используйте сервер, это более дешевая версия ethereum. </p>\n</DIV>","permalink":"/r/ethereum/comments/aewa0e/google_blacklisted_ethereum_in_google_ads/edt8ais/","name":"t1_edt8ais","created":1547248439,"created_utc":1547219639,"subreddit_name_prefixed":"r/ethereum","depth":0}]}