{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"ethereum","selftext":"Hi there,\n\n\nI wanted to explain an idea I have been stewing on for over a year now and hope to present a compelling business case for what is and why I feel this is urgent. Let me preface this by giving you a bit about me: I have been involved in cryptocurrency (investing/using & playing in the ecosystem) since 2013. I joined the Ethereum community in 2016 and have for the most part silently observed the traction over the years. My long-term plans involve becoming a validator, with a timeframe measured in decades. My mindset is I’m in this for the long haul and don’t care for parlour tricks or anything that doesn’t actually drive true growth. I told myself for the longest time my voice wouldn’t matter, because other people are making decisions. However my call-to-action is seeing what, and most importantly, why, things need to change for the longevity and growth of this network and by seeing others beginning to speak up about the issues we face today I am encouraged to do the same instead of continually lurking in the background. I now understand tackling these decisions today will only make us stronger in the long-run. So yes, let’s figure that out as a community — but let’s not get ahead of ourselves and let me begin by explaining the **what and why**.\n\n\n**What** I want as a future Validator:\n\n\nI want to give up a % of my block reward as a validator to a DAO/community led fund that’s sole purpose is to sustain/implement core protocol research/audits & development. Honestly, I am absolutely begging for this to happen and for us to get our heads out of the sand and to realize how important this is. Simply: Let me give up a slice of my reward, so that my remaining slice is in turn even more valuable long term.\n\n\n**Why** do I want to give up a % of my reward as a future Validator:\n\n\nLet me be blunt and transparent: Because when I put on my investor hat you’re right *I DO* want my actual ether to be worth something more than what it would be than if I didn’t do this as a validator. I’m not doing this out of pure altruism, I am doing this because I can see this will be better both for the health and growth of our network long run and thus in turn my bottom line. Let’s not split hairs here: Yes, I do genuinely believe in decentralization & the spirit of this community and that’s what brought me here a few years ago. But let’s also not pretend investment and opportunity cost do not matter. The money I have in Ethereum today (which I’ve held through thick and thin: the DAO hack and from $1400->$82, and will continue to do so) matters to me and I’d like to see it worth more tomorrow and in 3,5,12 years than it is today. So let me break down how this reward cut accomplishes it. **Here is my thesis point-by-point:**\n\n\n\n**1.)**  There are public services on Ethereum that would benefit from being built as a greater good, yet right now there are no *‘true’* incentives for them to be built and/or are underfunded by grants. Instead we see mostly ICO’s trying to build on top of the protocol to capture that value or teams switching last minute and adding immense friction by doing an ICO/token model (ie: Raiden) to do so. Let me be clear here: I don’t blame developers for this — they’re just reacting to the reality of the market. It’s on us to provide the proper incentives for them to actually build the tooling and infrastructure we all need for tomorrow. \n\n\n**2.)**  The stronger the protocol, the more likely people will in turn build more on top of it. For 2016-2018 it was clear Ethereum had the best developer mindshare. Well now there is competition and we need to get our act together. By doing so, there will be more platform *“confidence”* as developers/users know this protocol has a sustainable path towards research, innovation. As an investor, we care about this too. This is what keeps me up at night when I think about how to allocate my capital in this space. Who or what platform actually gets this? \n\n\n**3.)**  The true driver of the price of Ether is largely a derivative of the mindshare/talent working on the base layer. Like Microsoft in the 90s said: It’s all about the developers. Let’s not only keep the best talent working in our ecosystem and stop slippage to competitors, but also grow our development velocity at a faster rate. We need to give them more support. Based on the velocity and pushbacks I would say they’re likely underappreciated, underpaid and overworked for the most part. It’s a high pressure job and mostly thankless; we need to correct this and ensure they’re here with us for the long run, while ideally adding even more to the core team so we can ensure deadlines get hit in the future.\n\n\n**4.)**  More useful things being built on L1/protocol = drawing in even more L2 architecture/talent building in our ecosystem = more developers building better things with better tooling/security and infrastructure = more transactions & usage of the network = this drives growth in all key stakeholders in our ecosystem = more validator rewards for people like myself. **This is simply a positive feedback loop, but we need the catalyst to start it.**\n\n\n**More Information:**\n\n\nI can hear some skeptics say right now: *Well why don’t you just send your own ether in as a contribution to any of these underfunded teams?* Because I alone can’t do this and that isn’t a 5+ year solution. I alone can’t plug all these holes. What are these holes? Underfunded teams, developers choosing to do useless ICO’s (not all, but most IMO) instead of developing public protocol infrastructure we so desperately need, or worse yet they’re leaving to go work on competitors who can promise them better terms. In fact, why would you stick around? My research shows me you’re likely being paid below market rate (sorry this is also an uncomfortable truth, and it bothers me because I want these developers to be paid their market rate at the very minimum), and you can go join a new rock star team and try to develop/capture value from the ground floor through genesis tokens on Blockchain 5.0 project or whatever.  In fact, when Vitalik graciously sent out grants a few months ago, I didn’t get a warm fuzzy feeling, but was filled with dread. This issue was clearly bubbling to the surface, I was very happy for those teams who received it, but I was thinking **how inefficient this is that we have to rely on altruism from whales or early winners** to make this happen. That, in my books is not sustainable to continue to be the clear leader for innovation in this increasingly crowded space. That’s not a recipe for meeting project deadlines, it’s simply unsorted chaos and a tragedy of the commons on our part.\n\n\n**How would this work?**\n\n\nI envision this happening during Eth 2.0 switch to the Beacon Chain when PoS comes online. I doubt we can implement an EIP for this to happen with PoW, but let’s remember here: miners, while providing a service, are only a stop-gap for the real long term solution — which is PoS. PoS is people like me, who want to bet on the future of this network and here I am saying yes let me take less because in the end, honestly, I want more -- both in the value of my rewards for staking and for the actual value I believe the Ethereum platform can deliver in the future. It’s the validators of tomorrow, not the miners of today we have to convince. So how does this *actually* work? I don’t have all the details and this posts scratches more on the what & why. For how: **ideally we can create an EIP with the details/mechanics on how to divert some portion of the staking reward that can be implemented right at the start of when we switch to PoS**. We get community support and this happens.\n\n\n**Brief closing thoughts**\n\n\nWhat drew me to Ethereum community in the first place was the excitement & energy along with the ethos of experimentation and knowing this would be a bold risk. It drew in so much talent, energy, and developers even from the Bitcoin community who some way understood why this might be meaningful. I feel like Ethereum has almost kind of “frozen up” in a scared of your own shadow this last year or so. To me the spirit of Ethereum is innovation, forging forward and the ability to adapt and react. Well reality has come: We are experiencing some major talent slippage (to icos and various other projects) and other 3.0 projects are coming online, & honestly some of them looking quite promising. I don’t want Ethereum to compete on “brand” or anything like that, I want Ethereum to continue to be the go-to if a developer wants a true decentralized sandbox to develop, nurture and incubate applications and ideas that will shape the world. We’ll need more tooling for eWasm. We’ll need more developers to audit code & build 1.X Eth & tooling to help switch 1.0 Dapps to 2.0 when that time comes. We’ll need more base layer infrastructure to help onboard and integrate software engineers from outside the blockchain world seamlessly. We need to pay them what they’re worth, and let them know that when they’re building the scaffolding for Eth 2.0 that they actually have a runway of funds & we have their back. We’ll need better UX, L2 scaling, formalized standards, wallets and general applications to run on top of the chain and so much more. What we really need is to show we can reach consensus here and do the sensible thing.\n\nThank you for listening and I appreciate any comments/insights any of you may have.\n","title":"A call to action from a future Validator","subreddit_name_prefixed":"r/ethereum","ups":124,"created":1549443874,"link_flair_background_color":"","id":"anl49j","author":{"name":"kazuya1987"},"permalink":"/r/ethereum/comments/anl49j/a_call_to_action_from_a_future_validator/","url":"https://www.reddit.com/r/ethereum/comments/anl49j/a_call_to_action_from_a_future_validator/","created_utc":1549415074}