{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"ethereum","selftext":"# Note this is an old post. Please see the re-launch post [here](https://www.reddit.com/r/ethereum/comments/chl924/relaunching_the_borderless_unkillable_cryptofiat/), which went much more smoothly :)\n\n# EDIT: A critical bug has been revealed to us, so we've disabled the interface while we re-organize.\n\nFor the Solidity devs, the bug has to do with the `open` function, which can be called by anyone to become the initiator and `recall` the funds as if they created the trade.\n\nThe interface is disabled on mainnet, but still works on Kovan for anyone who wants to poke around.\n\nIt seems that only one user, aside from our seed trades, was vulnerable. u/adamaid_321, who found and exploited the flaw, has said he will return the funds to their original owners in a few hours.\n\n(u/adamaid_321 was professional to work with, and kind, given the situation.)\n\nTomorrow we'll write a post-mortem, which is ironic for something that was supposed to be unkillable. Hoo boy.\n\nORIGINAL POST:\n\n# DAIhard: the unkillable crypto/fiat gateway. Any country, any fiat. Proudly announcing the open beta on mainnet.\n\nHere is a legitimate concern most of us are familiar with:\n\n>To enter or exit the crypto economy, we rely on exchanges, which track their users, impose limits, and are coupled to their jurisdiction. And for all we know, any day now governments could start shutting down the exchanges altogether. In light of this, can we honestly say that crypto is anonymous, limtiless, borderless, immune to regulation, and unstoppable?\n\nTo really address this concern, we need a completely decentralized fiat-to-crypto on-ramp platform: something that extends the benefits of crypto to the very act of moving between the fiat and crypto economies. But the design of such a platform is far from obvious. (Bisq comes close, but contains some crucial centralized compoments.)\n\n**We believe we've found the solution. We are proud to present DAIHard, currently in open beta on mainnet (and Kovan).**\n\nIf you want to jump right in, we reccomend first watching [Using DAIHard to buy and sell DAI](https://www.youtube.com/watch?v=TaI1fCzhSt4) (12 min), then [diving in and giving it a shot](https://burnable-tech.github.io/DAIHard/) with a small amount of DAI. (Feel free to try it on Kovan if mainnet is too scary at first.)\n\n# Okay, but What Is It?\n\nDAIHard extends many of the promises of crypto (borderless, anonymous, limitless, unstoppable) into the exchange mechanism itself, allowing anyone anywhere to bypass centralized exchanges and the control they impose.\n\nMore concretely, DAIHard is a platform, run on smart contracts, for forming one-off crypto/fiat exchanges with other users, in which:\n\n* The method of fiat transfer is open-ended, but agreed upon up-front (for example: bank transfer, cash handoff, transfer of online credit, or really anything the offer creator thinks up).\n* You and the counterparty can communicate via end-to-end encrypted chat to coordinate the fiat transfer (i.e. communicate bank account number, or describe a cash drop location).\n* In the last phase, the Seller can choose to **burn the DAI** instead of releasing it to the Buyer (but he can't get it back). This *credible threat* is what makes the platform reliable in the absence of centralized control or moderation. For more on this see the [DAIHard Game Theory](https://medium.com/@coinop.logan/daihard-game-theory-21a456ef224e) medium article (10 min read).\n\n[Using DAIHard to buy and sell DAI](https://www.youtube.com/watch?v=TaI1fCzhSt4) (12 min) shows this process in action.\n\n# Drawbacks\n\n## You Need DAI (and ETH, for gas) to Use The Tool (At Least For Now).\n\nThis is the biggest drawback of the platform in its current state: if you want to buy DAI, you need 1/3 of the purchase amount to put into the contract as a **burnable deposit**. Put another way, if you only have 10 DAI now, you can only open a buy offer for 30 DAI, and must wait for it to complete before using the newly bought DAI to open up a bigger offer.\n\n(The 1/3 ratio will be customizeable in a future version, but even if it's set to 0 (which comes with its own problems), the Buyer still needs ETH to pay gas.)\n\nMost tragically of course, this means that if you don't already have some crypto, you can't use this tool to get crypto. This comes from the fact that both parties must have \"skin in the game\" for the game theory to work, and a smart contract can't hold fiat--only crypto.\n\nWe have solid ideas on how to address this drawback in the not-too-distant future, but for now it's time to launch this thing. We'll write more about these ideas soon.\n\n## Dangerous and Scary To Use\n\nIn rare cases, a user may have to burn DAI. In all cases, the user must risk the *credible threat of burning DAI*. [DAIHard Game Theory](https://medium.com/@coinop.logan/daihard-game-theory-21a456ef224e) explains why this is necessary.\n\nA cautious, rational user can gather information (probably via our subreddit!) about how people have used the tool, successfully and unsuccessfully. They can then create a buy or sell offer with wisely chosen settings based on what has worked for others. Other cautious, rational users can find this offer and commit to the trade if they dare. We expect the vast majority of committed trades should involve rational, cautious users, and should therefore resolve happily.\n\n**But each trade must contain a credible risk of burning DAI**, and inevitably there will be sloppy trades that result in burns. It will be interesting to see how long it takes for the first burn to occur.\n\nUnlike the previous issue, this drawback will stick around: credible risk is absolutely necessary for the platform to function without centralized control.\n\n# Strengths\n\n## Unkillable\n\nThe core of the whole system is the Factory contract. It has no owner, as well as no suicide or pause code. Barring some unknown bug, it cannot be stopped, and will happily open new offers for anyone who has the DAI and can pay the gas cost in ETH, and will also list all created trades for anyone with access to Ethereum. This will remain so for as long as Ethereum remains functional.\n\nThe HTML/JS front-end (built in Elm, by the way, with the lovely [elm-ethereum](https://github.com/cmditch/elm-ethereum)!) is currently hosted on Github pages, which is centralized--but even if Github takes down the page and deletes the code, it's a minor step to get the page hosted on IPFS (which is on our near-term roadmap in any case).\n\nLike [Toastycoin](http://www.toastycoin.com), this thing was immortal the moment it was deployed (even more immortal than RadarRelay, for example, which does rely on an ownership role). Both DAIHard and Toastycoin (and probably whatever we build next) will last for as long as a single Ethereum node continues mining, and it will remain easy to use as long as someone can find the HTML/JS front-end and the Metamask plugin.\n\n## No Sign Up, No Limits: All you Need is Love Metamask\n\nIt's smart contracts all the way down, so DAIHard never asks any nosy questions--if you have Metamask installed and set up, with some ETH and DAI, you can immediately open or commit to a trade.\n\n(In fact, we're so inclusive, even machines are allowed--no CAPTCHA here!)\n\nYou're limited only by the collateral you put up, so if you have 10,000 DAI you could open up a buy offer for 30,000 DAI (or a sell offer for 10,000 DAI) right now.\n\nWe do *reccommend* trying the tool out first with a small amount of DAI... But we're not your mom! Do what you want!\n\n## Borderless\n\nIt simply doesn't matter where you are, because DAIHard doesn't need to interface with any particular jurisdiction or payment system to work. DIAHard works by incentivizing *people* (or robots?) to navigate the particular real-world hurdles of bank transfers, cash drops, or other fiat transfer methods. These incentives work whether you're in America, Zimbabwe, or the Atlantic; and they would work whether the \"fiat\" is USD, seashells, or Rai Stones.\n\n## Any Fiat Type, and Highly Customizeable\n\nHere are some examples of the types of trades you could open on DAIHard.\n\n* Sell 200 DAI for $220 USD, granted they bring the cash to you by tomorrow afternoon in Central Park, NYC.\n* Buy 20 DAI with a $30 gift card for Amazon AWS that you were never going to use.\n* Sell 20 DAI in exchange for a $20 Steam game.\n* While in Vietnam, sell 200 DAI to someone for €180 anytime in the next two weeks, provided they deposit it into your German bank account.\n* Buy 30 DAI for 8,000 ZWD, delivered anonymously by cash drop, sometime within the next month.\n* Buy 500 DAI for $550 via PayPal, but wait 3 weeks for before the DAI is released, (so the paypal transaction can't be reversed).\n\nAs the DAIHard community grows, users will doubtless find much more creative ways to use the system, and we will discover together which types of trades are reliable and which are more risky. Because users can set their own margins and phase timeout settings, we expect even the riskiest trades remain available on the marketplace, with higher margins or longer phase periods.\n\nIn a future version, we will open up more options to the user creating the offer--for example, allow modifying the default 1/3 buyer's deposit to some other ratio.\n\n## Extensible by Third Parties\n\nDo you have some nifty idea for how to display and organize user reputation? Or maybe some idea for how trades could be chained togeher? Maybe you'd like to design a notification system for DAIHard? Maybe you just want a different color scheme!\n\nWell, you won't need our permission to do any of this. Any tool that watches the same Factory contract will share the pool of trades, regardless of which tool actually creates the trade.\n\n# This Is a Big Fucking Deal\n\nDAIHard is a turning point in crypto and a breakthrough in decentralized markets, and is an irreversible augmentation of the Ethereum platform.\n\nWhat we now have is a gateway to crypto completely devoid of centralized components--rendering entry and exit unkillable, flexible, borderless, and private. Centralized exchanges, and the control they impose, can now be bypassed by anyone with ETH and DAI.\n\n# Tips on Usage\n\n* You can find the tool via [https://daihard.exchange](https://daihard.exchange) and [https://daihard.io](https://daihard.io), but both will redirect to the more secure [https://burnable-tech.github.io/DAIHard](https://burnable-tech.github.io/DAIHard).\n* **Don't forget about the chat tool! We forgot to cover it in the video >.>**\n* Try it on Kovan, or on mainnet with a small amount of DAI, first.\n* If you're creating on offer, be extremely clear in describing your accepted payment methods (if you're using a bank, include the routing/ABA/IBAN/etc number).\n* If you're considering committing to an offer, make sure you completely understand the offer's payment methods, and be wary of short payment windows.\n* **After opening or committing to a trade, use etherscan's address watch tool to get notified of any action (including messages) via email.**","title":"DAIhard: the unkillable crypto/fiat gateway. Any country, any fiat. Proudly announcing the open beta on mainnet.","subreddit_name_prefixed":"r/ethereum","ups":223,"created":1555356261,"link_flair_background_color":"","id":"bdetr2","author":{"name":"coinop-logan"},"permalink":"/r/ethereum/comments/bdetr2/daihard_the_unkillable_cryptofiat_gateway_any/","url":"https://www.reddit.com/r/ethereum/comments/bdetr2/daihard_the_unkillable_cryptofiat_gateway_any/","created_utc":1555327461}