{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"ethereum","selftext":"# Purpose\n\nThe primary purpose of this document is to provide transparency into the role of /r/ethereum moderators and define what is expected of those moderators. As a side effect, this document provides guidance when evaluating the addition of a new moderator or the re-evaluation of an existing moderator.\n\nThis document also covers the role of /r/ethereum as a public forum, as well as the roles, responsibilities, and expectations of /r/ethereum participants.\n\n# Perception & Expectations of Moderators\n\nRegardless of how moderators view themselves, many people who visit or contribute to /r/ethereum view being a moderator as a privilege, not a right, burden, nor chore. Many see the moderators as being in a trusted position which lends credibility to their statements and gives them influence. Thus, many expect moderators to reflect and represent this community, the larger Ethereum ecosystem, and the values of Ethereum. Furthermore, many expect the moderators to be dedicated to Ethereum, and to keep Ethereum’s long-term growth and goals top-of-mind.\n\nModerators should be mindful that their public words have the ability and power to shape, control, and influence the discussions. Their statements have the potential to be extremely valuable and impactful.\n\nFor these reasons, moderators should be mindful about how their commentary *could be perceived* by the diverse set of people who make up the Ethereum community. While moderating, participating in discussions on /r/ethereum, and even while participating in external discussion (e.g. on Twitter, on other forums, at conferences, etc.), they should aim to be transparent, communicate clearly, be explicit about their intentions, provide necessary context, and act in good faith.\n\nWhile some existing moderators or potential moderators may see this as unnecessarily limiting or burdensome, they should understand that many in the community strongly desire and encourage moderators to be active in discussions, to engage with the community, to share their viewpoints, to participate in open debate, to promote and help shape the goals and culture of the subreddit, and, most of all, to lead by example. Being mindful does not mean one must censor themselves or avoid disagreements. It simply means that one should ensure the tone and content of their commentary is ultimately constructive, not destructive.\n\nIf, after reading the above, a moderator cannot agree to be responsible and mindful in both their /r/ethereum participation and external discussion, they should be willing to excuse themselves from that role.\n\n# Expectations of Participants\n\nIn turn, participants on /r/ethereum and people around the Ethereum ecosystem should be mindful that no one is perfect, not even /r/ethereum moderators 😉. Living up to the aforementioned expectations is no small undertaking. While moderators try to do their best to meet the defined expectations, contributors are asked to practice patience and civility if and when they feel a moderator is not upholding their duties to the best of their ability.\n\nAs a first approach, people are encouraged to assume good-faith and respectfully open a dialog with the moderator, preferably in a public reply to the post or comment that is particularly concerning. A good way to start this dialog is by asking for clarification to ensure the participant clearly understands what the moderator *meant*. This ensures both parties are on the same page and provides an opportunity for clarification.\n\nIf the dialog is not fruitful and a person still strongly believes a moderator is not upholding their duties. Please avoid personal insults, brigading, ad hominems, inciting a mob-like mentality, overly emotional commentary, or sharing private conversations or information without the other party’s consent. By being objective and setting a tone that encourages open-minded discussion, the conversation can be productive rather than polarizing, and, thus, is more likely to lead to a positive result for the community as a whole. If there is clear identification of a breach of mod roles and responsibilities, we would invite a message to the mod group to evaluate the situation and moderator in question. If there is no response on the matter from the moderators within 10 days, than a post on the topic would be appropriate.\n\nThe action that is taken after this discussion, if any, is reliant on the amount and type of input from the community and fellow moderators and handled on a case-by-case basis. This ensures each case is approached in proper context and not prior to the presently-unknown future circumstances. Ideally, if there is a large calling for a moderator to be removed, the moderator in question will voluntarily step down. Doing so should not be interpreted as the moderator agreeing with or admitting fault to the claims presented, but simply that the moderator is willing to sacrifice their position in order to avoid further conflict and distraction.\n\nAdditional details can be found in the “Evaluating a Moderator” section below. Lastly, please limit discussions to a single thread so the commentary can be more easily followed.\n\n# Role of /r/ethereum in the ecosystem\n\nThis subreddit is a trusted source of information, news, announcements, and discussions regarding (almost) everything Ethereum. It is often the go-to place for the latest information and a place newcomers arrive at looking for information and help as they get started. Posts and discussions and answers to questions often show up at the top of search results. It is also currently the most widely-used forum dedicated to longer-form discussion regarding Ethereum, though some argue it is not necessarily “the best” forum.\n\nSome people who were previously active participants on /r/ethereum that are no longer active participants have cited lower quality content, lower quality discussions, unproductive arguments, trollish behavior, or personal attacks as the reason for becoming inactive. Regardless of the truthfulness of those reasons, they are the feelings and perceptions of some of those who left and should not be invalidated.\n\nFurthermore, many people cite the inclusiveness and welcoming nature of the community as their reason for focusing their time and efforts on Ethereum. Some note how turned off by the maximalism they experienced in other online communities, and didn’t dive deeply into the blockchain space until they found Ethereum.\n\nFor the above reasons it is vital that this community is preserved in order to onboard the next generation of Ethereum builders and contributors *and* keep the existing builders and contributors. This subreddit and the larger community should encourage newcomers and existing members alike to participate.\n\nThis **does not** mean that everyone should always be in agreement. Diversity of ideas is more valuable than agreement. As Ethereum grows, the attitudes, goals, and views of community members become more diverse. This is a positive, even with the accompanying growing pains. Debate, competition, and disagreements are necessary to push things forward and evolve. It is incredibly valuable, so long as the disagreements do not devolve and have a negative effect on the ecosystem.\n\n## /r/ethereum aims to be a place...\n\n* ...for the open and good-faith discussion about the Ethereum blockchain, decentralized applications, governance, and related technologies.\n* ...that is not in perfect agreement all the time.\n* ...that values transparency, respect, decentralization, inclusivity, diversity.\n* ...made up of unique people with different backgrounds and worldviews.\n* ...filled with healthy, critical thinking.\n* ...to help advance the goals of Ethereum.\n* ...that consistently practices respect and empathy.\n* ...that is inclusive and encouraging of all types of people with all types of experiences.\n* ...that is welcoming, helpful, and patient with newcomers.\n* ...that aids in increasing the adoption of Ethereum.\n* ...to engage in civil discourse, controversial debates, and open discussions about problems.\n* ...void of hate, vitriol, insults, slurs, threats of violence, witch hunts. ...that encourages healthy debate and critical discussions surrounding Ethereum.\n\nEach day, we should strive to create and grow a welcoming, collaborative, productive environment that contributes and grows Ethereum as a whole—one that helps progress Ethereum as a technology, as a set of loosely-shared values, a better version of the web, and as a community.\n\n# Roles & Responsibilities of Moderators\n\nFirst and foremost, the role of the moderators is to serve the Ethereum community. They should act in good faith and with Ethereum’s best interest at heart as they make decisions and participate in discussions.\n\nIdeally, a moderator’s decisions should be objective: remove posts that clearly violate the subreddit’s listed rules and approve posts that do not violate the subreddits listed rules. Realistically, posts and rules require some amount of subjectivity.\n\nModerators should be thoughtful regarding the subjective decisions they make and strive for fairness, honesty, and transparency with themselves, their fellow moderators, and with the entire community.\n\nWhen removing a post or comment that is not obviously spam or a scam, the moderator should leave a note citing the rule that was violated. When removing posts, especially those with discussion, moderators should additionally ‘distinguish & sticky’ their comment. In most cases, a reply of, “We have removed your post for violating rule #2: Price discussion. Please keep price discussion to subreddits such as /r/ethtrader.” is sufficient. For removals that may be controversial, more insight should be provided.\n\n## On a day-to-day basis, a moderators tasks include...\n\n* Approving posts that were incorrectly removed by the automoderator.\n* Removing posts that break the subreddit’s stated rules.\n* Bringing any posts that require subjective decision-making or fall into a “gray area” in the rules to the attention of the moderation team for discussion.\n* Participating in discussions, especially those regarding moderation (both public posts on /r/ethereum or discussions in the internal moderator chat).\n* When necessary, starting and leading discussions regarding updating or adjusting the subreddit rules.\n* When necessary, attempting to improve the efficiency and success-rate of the automoderator. The automoderator is a very fickle beast.\n\n## Moderators should...\n\n* ...ensure discussions stay on-topic, civil, and productive.\n* ...lead by example.\n* ...be an active participant in the subreddit by promoting civil discourse, asking thoughtful questions, and encouraging people and projects.\n* ...be calm and polite, even when other participants are not.\n* ...offer helpful rule explanations, tips, and links to new or confused users.\n* ...keep a unified front when addressing users officially.\n* ...be open to the viewpoints of other moderators and participants and try to reach consensus on difficult items.\n\n## Moderators should not...\n\n* ...moderate posts based on personal ideologies.\n* ...distinguish comments or submissions when not speaking officially on behalf of /r/ethereum.\n* ...act unilaterally when making major revisions to rules, sidebars, or stylesheets.\n* ...take moderation positions in communities where their profession, employment, or biases could pose a direct conflict of interest to the neutral and user driven nature of reddit.\n* ...encourage or \"feed\" trolls.\n* ...ban users when they have not broken any rules.\n\n## Moderators should never...\n\nModerators should never moderate posts in which the moderator has a clear conflict of interest. This includes, but is not limited to, posts regarding: the moderator in question, the moderator’s own company/product/project, or companies/products/projects in which the moderator is heavily emotionally or financially invested in.\n\n## Moderators should take extra care when...\n\nModerators should take extra care when moderating posts in which the moderator has a potential conflict of interest, and consider bringing the post to the attention of fellow moderators rather than moderating it themselves. This includes, but is not limited to, posts regarding a potential or perceived conflict of interest, posts by a contributor the moderator has had negative interactions with in the past, posts regarding a competitor to the moderator’s company/product/project.\n\n## Moderators are not expected to….\n\nWhile moderators should endeavour to comply with the above roles and responsibilities, there are some items that are not expected of moderators.\n\n* Moderators do not need to be working full-time for Ethereum or Ethereum-related projects. Moderators are encouraged to have a life outside of /r/ethereum.\n* Moderators are not expected to disclose their financial investments or general financial state with anyone. Furthermore, moderators can invest in the assets they choose and even support non-Ethereum projects, provided the moderator does not act nor moderate against Ethereum or it’s long-term interests.\n* Moderators do not need to hold viewpoints that are widely accepted by the community. Moderators may themselves promote civil debate on controversial items or hold contradictory ideas, so long as those are expressed within the rules of the /r/ethereum subreddit and are not clearly against Ethereum’s long-term interests.\n* Moderators are not expected to produce a certain number of posts or comments. Moderators should be performing their duties and engaging with the community with at least a weekly cadence.\n\n## Evaluating a Mod\n\nIn response to the feedback received from members of the community and the reasons outlined in the “Perception & Expectations of Moderators” section above, the following items attempt to provide some guidelines for evaluating a moderator or calling for the removal of a moderator.\n\nEach case will be unique and this is not a comprehensive list. For example, a moderator may provide value in other ways not included in this list and that value should not be discredited or ignored when evaluating.\n\n* Do they support the Ethereum community?\n* Do they act in good faith and with Ethereum’s best interests at heart?\n* Do they aim to ensure discussions stay on-topic, civil, productive?\n* Do they lead by example? (Some examples could include: promoting civil discourse, engaging in discussion, asking thoughtful questions, encouraging people and projects.)\n* Have they ever moderated a post in which there is a potential or perceived conflict of interest without first consulting other mods?\n* Have they ever moderated something based on personal ideologies?\n* Do they approve posts incorrectly removed by the automoderator?\n* Do they remove posts that break the subreddit rules?\n* Do they participate in discussions with other mods or the community? How often do they perform the aforementioned moderator duties? Daily? Weekly? Not for some time?\n* Have they ever started a discussion on the subreddit rules? Should they have?\n* Have they ever attempted to tame the wild beast that is the automoderator? Do they have the skills to do that? Should they have?\n* Are they transparent about their reasons for removing a post when asked?\n* Have they ever moderated posts in which they have a clear conflict of interest? Is their primary focus on Ethereum, or something else? (Day job, traditional world, banks, other blockchains, etc.) Does this have a real effect on their role in Ethereum’s ecosystem or their responsibilities as a moderator of /r/ethereum?\n\n# Roles & Responsibilities of Participants\n\nEach person who contributes to /r/ethereum should aim to add value to the discussion and to the larger Ethereum community, in good faith, and as described above under “Role of /r/ethereum in the ecosystem”.\n\nEach person is responsible for what /r/ethereum is today and what it becomes tomorrow. Some tangible “do’s” and “do not’s” for participants are outlined below. However, the scope of these is quite limited compared to what is described in the “Role of /r/ethereum in the ecosystem” section above. Therefore, it is the responsibility of each participant to take their own life experiences, perceptions, skills, knowledge, opinions, and understanding to add value to /r/ethereum to the best of their ability.\n\n## Making the Best of /r/ethereum\n\n**Aim for positivity.** Discuss in good-faith and assume others are discussing in good-faith as well. Be welcoming, inclusive, and encouraging. Practice patience, respect, and empathy. Engage in healthy debate, civil discourse, and critical discussions. Focus on the post, not the poster, during disagreements.\n\n**Upvote and downvote things.** This built-in moderation tool is exceptionally powerful. Keep in mind, upvotes/downvotes are not for voicing agreement/disagreement. When a post or comment contributes or adds value, even if one personally disagrees, it should be upvoted. When a post or comment does not contribute, nor add value, or the post or comment is off-topic, downvote it.\n\n**Use the report button.** Posts or comments that violate the subreddit rules can, and should, be reported. This brings it to the moderator’s attention more quickly. When reporting, please provide as much detail as possible to help moderators more quickly evaluate each item in the moderation queue. Lastly, please don’t report posts or comments out of disagreement, only about things that actually break the rules.\n\n**Stay on topic.** Discussions about other cryptocurrencies and related technologies are welcome, but if the topic is already being extensively covered by other threads, it is kindly recommended to post it to a more specific subreddit. There is an extensive (but not comprehensive) list of Ethereum-related Subreddits on the [\"All Ethereum\" Multireddit](https://www.reddit.com/user/all_ethereum/m/all_ethereum/).\n\n## Follow the Subreddit Rules\n\n**No inappropriate behavior.** This includes, but is not limited to: personal insults, threats of violence, slurs of any kind, posting people's private information.\n\n**Avoid speculation, price, market, and mining discussions.** Discussion related to the price of ether, buying, trading, market speculation, or any other price/market talk should be posted on /r/ethtrader, a third-party Subreddit not moderated by us. In addition, keep mining discussion to subreddits such as /r/EtherMining.\n\n**No spamming, scamming, drive-by posting, duplicate posts, misleading titles, or blogspam.**\n\n* Don’t spam a single blog, project, company, or ICO. Posts should come from a variety of sources, cover different topics, and the poster should engage in discussions on their posts.\n* Don’t attempt to scam people, link to phishing websites, or promote malicious applications.\n* Don’t be that person who runs into the community, dumps a link to something, and then disappears immediately.\n* Check [https://www.reddit.com/r/ethereum/new/](https://www.reddit.com/r/ethereum/new/) to avoid posting something that is already being discussed. Instead, add to the ongoing conversation.\n* Avoid titles that do not accurately reflect the content of the post or are written to stimulate clicks.\n* Avoid linking to sites that lightly rewrite content in order to drive traffic to their site and generate ad revenue.\n\n**No using multiple accounts. No posting from brand new accounts.** Creating multiple accounts to get around rules is not allowed and will likely result in a permanent ban. Additionally, posts should be made from accounts at least 10 days old with a minimum of 20 comment karma. This is to keep trolls and spam-bots to a minimum. Exceptions may be made on a discretionary basis and one can [message the mods](https://www.reddit.com/message/compose?to=/r/ethereum) if one feels their post adds value but they don’t have the necessary account age/karma.\n\n# Conclusion\n\nWe invite feedback from the community on the above guideline and encourage discussion on the topics herein. r/ethereum is a place for discussing Ethereum as a technology and a movement. Our focus is on maintaining the discourse in a productive and respectful direction.\n\nAll the best,\n\nr/ethereum mods","title":"Towards a better /r/ethereum...","subreddit_name_prefixed":"r/ethereum","ups":153,"created":1555387500,"link_flair_background_color":"","id":"bdkqy3","author":{"name":"insomniasexx"},"permalink":"/r/ethereum/comments/bdkqy3/towards_a_better_rethereum/","url":"https://www.reddit.com/r/ethereum/comments/bdkqy3/towards_a_better_rethereum/","created_utc":1555358700}