{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"Эфириума","selftext":"Я хочу знать его состояние. Кто-нибудь еще разрабатывает это? У нас есть рабочее приложение?\n\nРедактировать: упс, похоже, что это на самом деле $ 100 млрд. (И я должен был подозревать, что 10 миллиардов долларов были слишком низкими.)","title":"Сегодня водители Uber бастуют из-за 25-процентного сокращения заработной платы и предстоящего IPO на 10 млрд долларов (половина mcap от Ethereum). Где наш функционирующий, децентрализованный Uber?","subreddit_name_prefixed":"r/ethereum","ups":542,"created":1557348406,"link_flair_background_color":"","id":"bm4ufi","author":{"name":"SrPeixinho"},"permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/","url":"https://www.reddit.com/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/","created_utc":1557319606,"replies":[{"ups":123,"link_id":"t3_bm4ufi","replies":[{"ups":1,"link_id":"t3_bm4ufi","id":"emwhghm","author":"runvnc","parent_id":"t1_emvjnkc","subreddit_id":"t5_2zf9m","body":"Generally speaking I think 95% of taxi companies would say that the government did not hold Uber accountable to the existing laws.","body_html":"<div class = \"md\"> <p> В целом, я думаю, 95% компаний такси сказали бы, что правительство не считает Uber подотчетным действующим законам. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emwhghm/","name":"t1_emwhghm","created":1557418454,"created_utc":1557389654,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emtvkji","author":"svantetobias","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"While it's theoretically and technically possible to build a more optimal decentralized system than Uber, there's a lot of reasons why we don't have it yet.\n\n1. The requirements for a sleek UI is extremely high - people are used to this and it costs money and requires a lot of expertise to develop it.\n2. A lot of the underlying required decentralized systems are not developed yet, even though they are theoretically possible - a non-exhaustive list:\n   1. Decentralized ID and reputation system, to discourage fraud and abuse.\n   2. A dispute resolution system - driver or passenger did not get what they expected and want it resolved by a third party.\n   3. An effective decentralized auction/driver-passenger matching system. This has to predict both local and global spikes/slumps in demand, from both sides of the market (driver + passenger) and quickly match a driver with a passenger at a satisfactory price point, which also needs to be geographically close to each other. A simple order book like on decentralized exchanges is wildly inadequate for this.","body_html":"<div class = \"md\"> <p> Хотя теоретически и технически возможно построить более оптимальную децентрализованную систему, чем Uber, есть много причин, по которым у нас ее пока нет. </p>\n\n<Ол>\n<li> Требования к гладкому пользовательскому интерфейсу чрезвычайно высоки - люди привыкли к этому, и это стоит денег и требует большого опыта для его разработки. </li>\n<li> Многие базовые требуемые децентрализованные системы еще не разработаны, хотя они теоретически возможны - неполный список:\n\n<Ол>\n<li> Децентрализованная система идентификации и репутации, предотвращающая мошенничество и злоупотребления. </li>\n<li> Система разрешения споров - водитель или пассажир не получили того, что ожидали, и хотят, чтобы это было разрешено третьей стороной. </li>\n<li> Эффективная децентрализованная система согласования аукциона / водителя-пассажира. Это должно предсказать как локальные, так и глобальные всплески / спады спроса с обеих сторон рынка (водитель + пассажир) и быстро сопоставить водителя с пассажиром по приемлемой цене, которая также должна быть географически близка друг к другу. Простая книга заказов, как на децентрализованных биржах, совершенно не подходит для этого. </Li>\n</Ол> </LI>\n</Ол>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtvkji/","name":"t1_emtvkji","created":1557352696,"created_utc":1557323896,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":84,"link_id":"t3_bm4ufi","replies":[{"ups":1,"link_id":"t3_bm4ufi","id":"emvqkti","author":"Fuzzman99","parent_id":"t1_emvfoje","subreddit_id":"t5_2zf9m","body":"Correct Swarm City. Their token is coded SWT","body_html":"<div class = \"md\"> <p> Правильный город роя. Их токен закодирован SWT </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvqkti/","name":"t1_emvqkti","created":1557392286,"created_utc":1557363486,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emtsnw4","author":"[deleted]","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"[deleted]","body_html":"<div class = \"md\"> <p> [удалено] </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtsnw4/","name":"t1_emtsnw4","created":1557350846,"created_utc":1557322046,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":28,"link_id":"t3_bm4ufi","replies":[{"ups":19,"link_id":"t3_bm4ufi","id":"emu6vdc","author":"BobWalsch","parent_id":"t1_emu303b","subreddit_id":"t5_2zf9m","body":"No. Driver's identity, scam, spam, complaints, ratings, etc. A lot of stuff can be gamed or exploited and need some human intervention. See other posts [there](https://old.reddit.com/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu0ihx/) for example. Same thing apply for anything decentralized that allow user input like decentralized Twitter, Facebook, etc. These would be buried under spam in no time in the decentralized world.","body_html":"<div class = \"md\"> <p> Нет. Идентификационные данные водителя, мошенничество, спам, жалобы, рейтинги и т. Д. Множество вещей может быть разобрано или использовано и требует вмешательства человека. См., Например, другие сообщения <a href=\"https://old.reddit.com/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu0ihx/\"> там </a>. То же самое относится и ко всему децентрализованному, что позволяет вводить данные пользователем, например, децентрализованный Twitter, Facebook и т. Д. В децентрализованном мире они будут спрятаны под спамом. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu6vdc/","name":"t1_emu6vdc","created":1557358786,"created_utc":1557329986,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":5,"link_id":"t3_bm4ufi","id":"emucnx7","author":"noone111111","parent_id":"t1_emu303b","subreddit_id":"t5_2zf9m","body":"Verifying drivers is one of the most important things. Without it, the system doesn't work. No one is going to get into random, unverified cars, especially women.","body_html":"<div class = \"md\"> <p> Проверка драйверов - одна из самых важных вещей. Без этого система не работает. Никто не собирается садиться в случайные, непроверенные автомобили, особенно женщины. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emucnx7/","name":"t1_emucnx7","created":1557361914,"created_utc":1557333114,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":6,"link_id":"t3_bm4ufi","id":"emu3xks","author":"tlalexander","parent_id":"t1_emu303b","subreddit_id":"t5_2zf9m","body":"You can automate things without etherium.","body_html":"<div class = \"md\"> <p> Вы можете автоматизировать вещи без Etherium. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu3xks/","name":"t1_emu3xks","created":1557357226,"created_utc":1557328426,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emtuq58","author":"noone111111","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Ethereum does not improve anything about this business model. It's not applicable.","body_html":"<div class = \"md\"> <p> Ethereum ничего не улучшает в этой бизнес-модели. Это не применимо. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtuq58/","name":"t1_emtuq58","created":1557352172,"created_utc":1557323372,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":21,"link_id":"t3_bm4ufi","replies":[{"ups":1,"link_id":"t3_bm4ufi","id":"emu8n0n","author":"c-digs","parent_id":"t1_emu6tkv","subreddit_id":"t5_2zf9m","body":"I use Uber as an example; Lyft also has massive financial losses.\n\nThere are no peers that can make a profit without autonomous vehicles; every such model will operate at a loss until autonomy.","body_html":"<div class = \"md\"> <p> Я использую Uber в качестве примера; Lyft также несет огромные финансовые потери. </P>\n\n<p> Нет аналогов, которые могли бы получать прибыль без автономных транспортных средств; каждая такая модель будет работать в убыток до автономии. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu8n0n/","name":"t1_emu8n0n","created":1557359687,"created_utc":1557330887,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emtr1d8","author":"c-digs","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"> Where is our functioning, decentralized Uber?\n\nSuch a thing cannot exist because there is no financial model under which it would work.\n\n[Uber loses money each quarter](https://news.crunchbase.com/news/inside-the-uber-s-1-revenue-growth-and-losses/).\n\n> What does that revenue growth look like within the context of operating losses? Uber’s losses have increased steadily from Q1 2018 to Q4 2018, with the company posting losses of $478 million, $739 million, $763 million and $1.1 billion, respectively. \n\nUber subsidizes every ride taken with capital investments with two goals in mind:\n\n1. Short term: market share, crush traditional taxis, crush other startups by attrition\n2. Long term: removal of human labor through autonomy; this is how they actually turn a profit\n\nI don't even understand why one would think such a model would make any sense in a decentralized model and what it has to do with ethereum.\n\nUse your brain; stop drinking Kool-Aid.","body_html":"<div class = \"md\"> <blockquote>\n<p> Где наш функционирующий децентрализованный Uber? </p>\n</BLOCKQUOTE>\n\n<p> Такая вещь не может существовать, потому что нет финансовой модели, в которой она будет работать. </p>\n\n<p> <a href=\"https://news.crunchbase.com/news/inside-the-uber-s-1-revenue-growth-and-losses/\"> Uber теряет деньги каждый квартал </a>. </р>\n\n<BLOCKQUOTE>\n<p> Как выглядит рост выручки в контексте операционных убытков? Убытки Uber неуклонно росли с 1 квартала 2018 года до 4 квартала 2018 года, а убытки компании составили 478 миллионов долларов США, 739 миллионов долларов США, 763 миллионов долларов США и 1,1 миллиарда долларов США соответственно. </Р>\n</BLOCKQUOTE>\n\n<p> Uber субсидирует каждую поездку с капиталовложениями с двумя целями: </p>\n\n<Ол>\n<li> В краткосрочной перспективе: доля рынка, сокрушить традиционные такси, сокрушить другие стартапы путем истощения </li>\n<li> Долгосрочный: устранение человеческого труда посредством автономии; вот как они на самом деле получают прибыль </li>\n</Ол>\n\n<p> Я даже не понимаю, почему можно подумать, что такая модель имеет какой-то смысл в децентрализованной модели и как она связана с ethereum. </p>\n\n<p> Используй свой мозг; бросить пить Kool-Aid. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtr1d8/","name":"t1_emtr1d8","created":1557349767,"created_utc":1557320967,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":14,"link_id":"t3_bm4ufi","id":"emu2ivi","author":"mcmuncaster","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"so who wants to spend 300k hours giving this to the world and not paid\n\nthen when there is zero adoption - who wants to pony up 100M in marketing dollars (with no ROI i might add)?\n\nanyone? anyone?","body_html":"<div class = \"md\"> <p> так что кто хочет потратить 300 тыс. часов, отдавая это миру и не заплатив </p>\n\n<p> тогда, когда усыновление будет нулевым - кто хочет заработать 100 миллионов в маркетинговых долларах (без рентабельности инвестиций я мог бы добавить)? </p>\n\n<Р> кто-нибудь? кто-нибудь? </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu2ivi/","name":"t1_emu2ivi","created":1557356488,"created_utc":1557327688,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":11,"link_id":"t3_bm4ufi","replies":[{"ups":2,"link_id":"t3_bm4ufi","id":"emx6guf","author":"thats_not_montana","parent_id":"t1_emuah14","subreddit_id":"t5_2zf9m","body":"Yeah, it's funny to me how people think blockchain is somehow a cost-saving technology.  It adds so much complexity!  At the very best your business costs for a dapp will be equivalent to an app, but even that is a thin assertion.  \n\nAnd this is not the first time this sentiment has been posted on r/ethereum.  I think someone needs to do a deep dive into DLT value props to get people to stop looking at blockchain as some kind of miracle drug for software.","body_html":"<div class = \"md\"> <p> Да, мне смешно, как люди думают, что блокчейн - это технология, позволяющая сэкономить средства. Это добавляет столько сложности! В лучшем случае ваши бизнес-затраты на приложение будут эквивалентны приложению, но даже это тонкое утверждение. </Р>\n\n<p> И это не первый раз, когда это мнение публикуется на <a href=\"/r/ethereum\"> r / ethereum </a>. Я думаю, что кому-то нужно глубоко погрузиться в ценности DLT, чтобы заставить людей перестать смотреть на блокчейн как на какое-то чудо-лекарство для программного обеспечения. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emx6guf/","name":"t1_emx6guf","created":1557439635,"created_utc":1557410835,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emu0pn4","author":"thats_not_montana","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"As someone who spends all day, every day working with blockchain use cases, I agree with most of the posters who say the value prop for a dapp Uber doesn't improve with DLTs (although with a lot less hostility).  I understand why it is a good practice to point to big applications and ask why they aren't decentralized, but for a lot of the reasons mentioned, Uber is one we are not ready for yet.\n\nThe only thing I would like to add to the convo is that building an application on a dlt doesn't reduce the cost of business.  You still have to find a way to pay programmers, project managers, support, marketing, c-suite, and every other job that exists in a tech company.  The location and redundancy of data doesn't change the efficacy of modern software development practices.","body_html":"<div class = \"md\"> <p> Как человек, который проводит весь день, каждый день работая с вариантами использования блокчейна, я согласен с большинством постеров, которые говорят, что значение prop для dapp Uber не улучшается с помощью DLT (хотя с гораздо меньшей враждебностью). Я понимаю, почему стоит указывать на большие приложения и спрашивать, почему они не децентрализованы, но по многим причинам, упомянутым выше, Uber - это та, к которой мы еще не готовы. </P>\n\n<p> Единственное, что я хотел бы добавить к convo, - это то, что создание приложения на dlt не снижает стоимость бизнеса. Вам все еще нужно найти способ платить программистам, менеджерам проектов, поддержке, маркетингу, c-suite и любой другой работе, которая существует в технологической компании. Расположение и избыточность данных не изменяют эффективность современных методов разработки программного обеспечения. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu0pn4/","name":"t1_emu0pn4","created":1557355544,"created_utc":1557326744,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_bm4ufi","id":"emtvs94","author":"_ecz","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"If Tesla robotaxis are as imminent as the company claims, \"traditional\" ride sharing may be a thing of the past. Fun to think about them implementing Ethereum into their robotaxi platform though o.O","body_html":"<div class = \"md\"> <p> Если robotaxis Tesla так же неизбежны, как утверждает компания, «традиционное» совместное использование может быть делом прошлого. Забавно думать, что они внедряют Ethereum в свою платформу robotaxi, хотя o.O </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtvs94/","name":"t1_emtvs94","created":1557352830,"created_utc":1557324030,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":3,"link_id":"t3_bm4ufi","id":"emtvxew","author":"rrdev","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Pundi X showcased this. Look at https://medium.com/pundix/the-sharing-economy-on-the-blockchain-the-next-step-for-function-xs-decentralized-web-560647b74eeb","body_html":"<div class = \"md\"> <p> Pundi X продемонстрировала это. Посмотрите на <a href=\"https://medium.com/pundix/the-sharing-economy-on-the-blockchain-the-next-step-for-function-xs-decentralized-web-560647b74eeb\"> https: //medium.com/pundix/the-sharing-economy-on-the-blockchain-the-next-step-for-function-xs-decentralized-web-560647b74eeb </a> </р>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtvxew/","name":"t1_emtvxew","created":1557352914,"created_utc":1557324114,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":3,"link_id":"t3_bm4ufi","id":"emucf1i","author":"[deleted]","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I am working on a project, [Bountium](http://bountium.org), that creates marketplaces for any task. The marketplace's creator establishes some assessor mechanism to observe jobs on that market and ensure quality. Uber would be a FANTASTIC use case - someone please DM me and work with me on it. Or post around in /r/Bountium it feels like i'm talking to myself there most days lol","body_html":"<div class = \"md\"> <p> Я работаю над проектом, <a href=\"http://bountium.org\"> Bountium </a>, который создает торговые площадки для любой задачи. Создатель рынка устанавливает механизм оценки для наблюдения за работой на этом рынке и обеспечения качества. Uber был бы ФАНТАСТИЧЕСКИМ случаем использования - кто-то, пожалуйста, DM мне и работа со мной над этим. Или опубликовать в <a href=\"/r/Bountium\"> / r / Bountium </a> такое ощущение, что я разговариваю там сам с собой в большинстве дней, смеется </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emucf1i/","name":"t1_emucf1i","created":1557361774,"created_utc":1557332974,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_bm4ufi","replies":[{"ups":1,"link_id":"t3_bm4ufi","id":"emus9cu","author":"hipaces","parent_id":"t1_emur5cv","subreddit_id":"t5_2zf9m","body":"Same here most times.  Plus, when I do order, about 50% of the time something is missing.","body_html":"<div class = \"md\"> <p> То же самое и здесь. Кроме того, когда я делаю заказ, в 50% случаев чего-то не хватает. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emus9cu/","name":"t1_emus9cu","created":1557370874,"created_utc":1557342074,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emu3q6u","author":"hipaces","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"This point is being driven home more and more as I have started using apps like Grub Hub & Door Dash:\n\n&#x200B;\n\n**The price people are willing to pay for food delivery (or taxi service) is never going to be as high as the price (human) providers demand.**  \n\n&#x200B;\n\nI just don't believe the economics will ever work out.  \n\n&#x200B;\n\nPeople who own a car (and basically must own a car) have a sunk cost that makes Uber a luxury instead of a necessity.  \n\nPeople who have no car, by essence of having no car, live in places where they can walk from place to place.  Uber is a luxury for them.  \n\nTourists are a great target market but when the numbers are crunched, renting a car is often close to as cheap, or cheaper, than repeatedly Ubering.","body_html":"<div class = \"md\"> <p> Этот момент все больше и больше возвращается домой, так как я начал использовать такие приложения, как Grub Hub & Door Dash: </p>\n\n<Р> </р>\n\n<p> <strong> Цена, которую люди готовы платить за доставку еды (или услуги такси), никогда не будет такой высокой, как цена (человеческая), которую требуют поставщики. </strong> </p>\n\n<Р> </р>\n\n<p> Я просто не верю, что экономика когда-нибудь сработает. </Р>\n\n<Р> </р>\n\n<p> Люди, которые владеют автомобилем (и, в основном, должны владеть автомобилем), несут непомерную стоимость, что делает Uber роскошью, а не необходимостью. </Р>\n\n<p> Люди, у которых нет машины, в силу отсутствия машины, живут в местах, где они могут ходить с места на место. Убер это роскошь для них. </Р>\n\n<p> Туристы являются отличным целевым рынком, но, когда цифры сокращаются, аренда автомобиля часто оказывается почти такой же дешевой или дешевой, как неоднократный Ubering. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu3q6u/","name":"t1_emu3q6u","created":1557357115,"created_utc":1557328315,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_bm4ufi","id":"emu5knf","author":"lntrospectre","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"You can't have a successful decentralized Uber, or in fact any kind of successful decentralized application, without functioning account-and-transaction-level user privacy. It makes no sense to expect people to link their addresses to any decentralized service if those addresses can be ultimately traced to a centralized KYC/AML'd exchange. This isn't hard to understand. Most people with common sense don't want to participate in the decentralized economy if it gives third-parties near perfect knowledge of their blockchain history. It's a sick violation of human rights and it doesn't get talked about nearly enough. Let's see you all fix the root privacy issues first, i.e. genuine anonymity, before you go off dreaming about killer dapps with any kind of significant real-world adoption. The web3 dream, as something worth wanting, is very much null and void without that.","body_html":"<div class = \"md\"> <p> Вы не можете иметь успешный децентрализованный Uber или фактически любое успешное децентрализованное приложение без действующей конфиденциальности пользователей на уровне учетных записей и транзакций. Нет смысла ожидать, что люди свяжут свои адреса с какой-либо децентрализованной службой, если эти адреса в конечном итоге можно будет проследить до централизованного обмена KYC / AML. Это не сложно понять. Большинство людей со здравым смыслом не хотят участвовать в децентрализованной экономике, если она дает третьим сторонам почти полное знание их истории блокчейна. Это больное нарушение прав человека, и о нем мало говорят. Давайте посмотрим, как вы все исправите проблемы с конфиденциальностью корней, т. Е. Подлинную анонимность, прежде чем вы начнете мечтать об убийцах-даппах с любым существенным внедрением в реальный мир. Мечта web3, как то, чего стоит хотеть, без этого очень пуста. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu5knf/","name":"t1_emu5knf","created":1557358109,"created_utc":1557329309,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_bm4ufi","id":"emu62cu","author":"admin_default","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Give it time. Ethereum couldn’t even handle crypto kitties in the ‘17 peak. What makes you think it’s ready to handle a taxi service?","body_html":"<div class = \"md\"> <p> Дайте время. Эфириум даже не смог справиться с криптовалютами в пике 17 года. С чего вы взяли, что готовы справиться с услугами такси? </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu62cu/","name":"t1_emu62cu","created":1557358369,"created_utc":1557329569,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_bm4ufi","id":"emux9kz","author":"rhcpman","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Uber employee here. \n\nThere are other decentralized marketplaces that would work for this, but Uber, as it exists today, has to be centralized. You need Uber to manage identity and security of its drivers, insurance policies for its drivers, in New York now you need to have minimum driver wages so free markets are not allowed, etc. What most people mean by 'decentralized' is actually just a worse form of organization where the top line doesn't take as much of a % from drivers. In reality, just like protocol developers take premines, people who add value to this system with things like matching models, surge calculators, software development, etc would require payment. \n\nAirbnb I've actually thought of as something that would work really well in a market like this. The object you are putting up for sale / rent doesn't vary in value the way a driver does depending on their location / time of day. There are ways to get around safety issues with padlocks, meaning no owner has control of you like they do in cars. Bottom line is IMO Uber is too complex to disrupt with a simple marketplace.\n\nBecause Airbnb adds very little value as a firm beyond simply being a marketplace, it would be relatively easy to disrupt. See https://www.originprotocol.com, these guys are focusing on Airbnb listings to disrupt and not Uber rides for a reason.","body_html":"<div class = \"md\"> <p> Uber сотрудник здесь. </Р>\n\n<p> Существуют и другие децентрализованные рынки, которые будут работать для этого, но Uber, как он существует сегодня, должен быть централизованным. Вам нужно, чтобы Uber управлял идентификацией и безопасностью своих водителей, страховыми полисами для своих водителей, в Нью-Йорке теперь вам нужно иметь минимальную зарплату водителя, чтобы свободные рынки не допускались и т. Д. То, что большинство людей подразумевает под «децентрализованным», на самом деле является просто худшая форма организации, когда верхняя строка не берет столько от водителей. В действительности, так же, как разработчики протоколов берут верх, люди, которые добавляют ценность этой системе такими вещами, как сопоставление моделей, калькуляторы скачков напряжения, разработка программного обеспечения и т. Д., Требуют оплаты. </Р>\n\n<p> Airbnb, я на самом деле думал, что это будет действительно хорошо работать на рынке, подобном этому. Объект, который вы выставляете на продажу / аренду, не меняется по стоимости, как это делает водитель, в зависимости от его местоположения / времени суток. Есть способы обойти проблемы безопасности с навесными замками, а это означает, что ни один владелец не может контролировать вас, как это делают в автомобилях. Суть в том, что IMO Uber слишком сложен, чтобы нарушать его с помощью простого рынка. </P>\n\n<p> Поскольку Airbnb добавляет очень мало пользы как фирма, а не просто является рынком, ее было бы относительно легко нарушить. Смотрите <a href=\"https://www.originprotocol.com\"> https://www.originprotocol.com </a>, эти ребята сосредоточены на списках Airbnb, чтобы нарушить, а не на Uber по какой-то причине. </р>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emux9kz/","name":"t1_emux9kz","created":1557373811,"created_utc":1557345011,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_bm4ufi","id":"emw3bv7","author":"chalbersma","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I thought arcade city was making one, but I checked in a few weeks ago, nothing.","body_html":"<div class = \"md\"> <p> Я думал, что аркадный город делает один, но я зарегистрировался несколько недель назад, ничего. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emw3bv7/","name":"t1_emw3bv7","created":1557401464,"created_utc":1557372664,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emtwo4v","author":"GRelativist","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"No one funded us...","body_html":"<div class = \"md\"> <p> Никто нас не финансировал ... </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtwo4v/","name":"t1_emtwo4v","created":1557353334,"created_utc":1557324534,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","replies":[{"ups":2,"link_id":"t3_bm4ufi","id":"emu2sg9","author":"zomb_l","parent_id":"t1_emtx3ke","subreddit_id":"t5_2zf9m","body":"To be more precise: Uber is raising $10 billion in the IPO, at a price per share that results in a total market cap for Uber of $100 billion (approximately).","body_html":"<div class = \"md\"> <p> Если быть более точным: Uber привлекает 10 млрд долларов в ходе IPO по цене за акцию, что приводит к общей рыночной капитализации Uber в 100 млрд долларов (приблизительно). </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu2sg9/","name":"t1_emu2sg9","created":1557356626,"created_utc":1557327826,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"emtwtaz","author":"beyond_XBT","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"$100 bi IPO, not 10","body_html":"<div class = \"md\"> <p> 100 долларов США при IPO, а не 10 </p>\n</Div>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emtwtaz/","name":"t1_emtwtaz","created":1557353415,"created_utc":1557324615,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emu0jwh","author":"napoleon85","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Are they? I just loaded the app and see plenty of drivers nearby.","body_html":"<div class = \"md\"> <p> Они? Я только что загрузил приложение и вижу множество драйверов поблизости. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu0jwh/","name":"t1_emu0jwh","created":1557355461,"created_utc":1557326661,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emuetsl","author":"cryptohoney","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"This guy had the decentralized Uber idea last year   https://youtu.be/Kg7Kj8niCXI","body_html":"<div class = \"md\"> <p> У этого парня была идея децентрализованного убера в прошлом году <a href=\"https://youtu.be/Kg7Kj8niCXI\"> https://youtu.be/Kg7Kj8niCXI </a> </a> < / р>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emuetsl/","name":"t1_emuetsl","created":1557363080,"created_utc":1557334280,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emug1cc","author":"16th_hop","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"We released a whitepaper a few days ago for Commonwealth a p2p algorithmic bank that can be used to dispense micro-equity for a global network of localized Ubers! Key = MICRO-EQUITY\n\nIt's about 8 pages and 15 minutes if anyone wants to give it a read or leave feedback.\n\nhttps://p3c.io/commonwealth.pdf","body_html":"<div class = \"md\"> <p> Несколько дней назад мы выпустили официальный документ для Commonwealth - алгоритмический банк p2p, который можно использовать для распределения микро-эквити для глобальной сети локализованных Ubers! Ключ = МИКРО-КАПИТАЛ </p>\n\n<p> Это около 8 страниц и 15 минут, если кто-то захочет прочитать его или оставить отзыв. </p>\n\n<p> <a href=\"https://p3c.io/commonwealth.pdf\"> https://p3c.io/commonwealth.pdf </a> </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emug1cc/","name":"t1_emug1cc","created":1557363723,"created_utc":1557334923,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emuiwvb","author":"taa_dow","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I don't get it:  new company, same old business?","body_html":"<div class = \"md\"> <p> Я не понимаю: новая компания, тот же старый бизнес? </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emuiwvb/","name":"t1_emuiwvb","created":1557365258,"created_utc":1557336458,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emum69v","author":"ntanwo76","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Dash has it. It's called abee rideshare. And I've heard they have done some successfull pilots...\n\nhttps://abeefoundation.org/","body_html":"<div class = \"md\"> <p> У Dash это есть. Это называется abee rideshare. И я слышал, что они сделали несколько успешных пилотов ... </p>\n\n<p> <a href=\"https://abeefoundation.org/\"> https://abeefoundation.org/ </a> </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emum69v/","name":"t1_emum69v","created":1557367067,"created_utc":1557338267,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emuny03","author":"akhavr","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Marketplace startups are hard irrespective of tech, used to build it.  That's why creating uber #2 is many times harder than original uber.","body_html":"<div class = \"md\"> <p> Рыночные стартапы сложны независимо от технологий, используемых для их создания. Вот почему создать Uber # 2 во много раз сложнее, чем оригинальный. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emuny03/","name":"t1_emuny03","created":1557368183,"created_utc":1557339383,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emux028","author":"DeviateFish_","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"This post and some of the comments on it are a great reflection of just how disconnected from reality this subreddit really is.","body_html":"<div class = \"md\"> <p> Этот пост и некоторые комментарии к нему являются отличным отражением того, насколько оторван от реальности этот субредит на самом деле. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emux028/","name":"t1_emux028","created":1557373670,"created_utc":1557344870,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emuzkrl","author":"Karma_z","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Literally top 5 comments in this thread look like upvoted bot garbage. Decentralizing Uber wouldn’t fix this without the proper incentives. Decentralizing everything is definitely not always the solution.","body_html":"<div class = \"md\"> <p> Буквально первые 5 комментариев в этой теме выглядят как мусор для ботов, подвергнутых голосованию. Децентрализация Uber не исправит это без надлежащих стимулов. Децентрализация всего, безусловно, не всегда является решением. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emuzkrl/","name":"t1_emuzkrl","created":1557375019,"created_utc":1557346219,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emv4rjb","author":"saddit42","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"reputation reputation reputation.. we need good decentralized reputation... It's the most crucial part in 90% of the systems you're trying to build","body_html":"<div class = \"md\"> <p> репутация репутация репутация репутация .. нам нужна хорошая децентрализованная репутация ... это самая важная часть в 90% систем, которые вы пытаетесь построить </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emv4rjb/","name":"t1_emv4rjb","created":1557377797,"created_utc":1557348997,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emv9dne","author":"why_a_penny","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Contracts should be designed in a way that decouples the ui and calls for a % of fees to go to whatever front end is using it. In this way users can create their own ui for app stores and let the users decide which to use. Developers would get paid for every TX created using their frontend ui and this would drive improvements and incentive to continually improve and be the best to attract more users.\n\nThe initial developers would then remove their need to design it AND offload any initial costs of doing so at the same time.","body_html":"<div class = \"md\"> <p> Контракты должны разрабатываться таким образом, чтобы отделить пользовательский интерфейс и требовать% комиссионных для перехода на любой интерфейс, который его использует. Таким образом, пользователи могут создавать свои собственные интерфейсы для магазинов приложений и позволять пользователям решать, какой использовать. Разработчикам платят за каждый TX, созданный с использованием их внешнего интерфейса, и это будет стимулировать улучшения и стимулы к постоянному улучшению и быть лучшим для привлечения большего количества пользователей. </P>\n\n<p> Первоначальные разработчики тогда избавят от необходимости разрабатывать его И разгрузят все первоначальные затраты на это одновременно. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emv9dne/","name":"t1_emv9dne","created":1557380351,"created_utc":1557351551,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emv9noa","author":"Morescratch","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Like food delivery, ride hailing is largely an unprofitable enterprise. The more competition you have the lower the prices. It’s a race to zero.","body_html":"<div class = \"md\"> <p> Как и доставка еды, поездка на велосипеде во многом является убыточным предприятием. Чем больше у вас конкуренции, тем ниже цены. Это гонка до нуля. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emv9noa/","name":"t1_emv9noa","created":1557380523,"created_utc":1557351723,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvddtv","author":"Jimmy_bags","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Uber decentralized is kind of risky and dangerous. Nobody is going to get in a car with someone that doesnt have a background check, possibly no insurance, uber assumes all these risks thats the point.","body_html":"<div class = \"md\"> <p> Uber децентрализован - это довольно рискованно и опасно. Никто не собирается садиться в машину с кем-то, у кого нет проверки биографии, возможно, нет страховки, Uber принимает на себя все эти риски, в этом суть. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvddtv/","name":"t1_emvddtv","created":1557382872,"created_utc":1557354072,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvkag1","author":"FreeFactoid","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Uber pays a ton of fees to Google maps","body_html":"<div class = \"md\"> <p> Uber платит кучу сборов за карты Google </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvkag1/","name":"t1_emvkag1","created":1557387715,"created_utc":1557358915,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvl1ve","author":"shubham412302","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I think 5% is the most that should be taken from drivers.","body_html":"<div class = \"md\"> <p> Я думаю, что 5% - это самое большее, что нужно брать у водителей. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvl1ve/","name":"t1_emvl1ve","created":1557388270,"created_utc":1557359470,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvlr1j","author":"sdmikecfc","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I know Lyft is working with [Solve.Care](https://Solve.Care) (an erc-20 token) for non-emergency medical transportation. Using the SOLVE token to pay for and track rides. I know Lyft will be expanding their services too with their IPO that just happened. I know Uber is interested int he same (Uber Health) but they don't look to have started that yet.    \n\n\n\ndisclaimer: I am a community manager for Solve.Care","body_html":"<div class = \"md\"> <p> Я знаю, что Lyft работает с <a href=\"https://Solve.Care\"> Solve.Care </a> (токен erc-20) для неотложной медицинской помощи. транспорт. Использование токена SOLVE для оплаты и отслеживания поездок. Я знаю, что Lyft будет расширять свои услуги также с их IPO, которое только что произошло. Я знаю, что Uber заинтересован в том же самом (Uber Health), но они, похоже, еще этого не начали. </Р>\n\n<p> отказ от ответственности: я являюсь менеджером сообщества Solve.Care </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvlr1j/","name":"t1_emvlr1j","created":1557388784,"created_utc":1557359984,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvpbar","author":"areyouokb","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"I am not saying I had this concept, but I did and pitched it to a few investors. I did not get a reaction that I wanted so I'm sorry for failing. I put my heart and soul into it with another friend for almost a year and we could not get funding.","body_html":"<div class = \"md\"> <p> Я не говорю, что у меня была эта концепция, но я сделал и передал ее нескольким инвесторам. Я не получил реакцию, которую я хотел, поэтому я извиняюсь за неудачу. Я вложил свое сердце и душу в это вместе с другим другом почти год, и мы не смогли получить финансирование. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvpbar/","name":"t1_emvpbar","created":1557391390,"created_utc":1557362590,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emvujgt","author":"sayamemangdemikian","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"arcade city.\n\nbut kinda... i dunno.","body_html":"<div class = \"md\"> <p> аркадный город. </p>\n\n<p> но вроде ... я не знаю. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emvujgt/","name":"t1_emvujgt","created":1557395115,"created_utc":1557366315,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emwaegx","author":"e3ee3","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Uber is raising $10B","body_html":"<div class = \"md\"> <p> Uber привлекает 10 млрд долларов </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emwaegx/","name":"t1_emwaegx","created":1557409489,"created_utc":1557380689,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emwk4wr","author":"IllegalAlien333","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Eth can't handle that volume of transactions, be real.","body_html":"<div class = \"md\"> <p> Eth не может обработать такой объем транзакций, быть реальным. </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emwk4wr/","name":"t1_emwk4wr","created":1557422128,"created_utc":1557393328,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emx8zav","author":"[deleted]","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"[Cell 411](https://getcell411.com/) has ridesharing feature for years already. What Cell 411 is missing (and Uber brings) is promotion, exposure and a sense of a responsible corporate (centralized) entity behind it.","body_html":"<div class = \"md\"> <p> <a href=\"https://getcell411.com/\"> В ячейке 411 </a> уже несколько лет есть функция совместного использования. То, чего не хватает Cell 411 (и Uber приносит), - это продвижение, разоблачение и чувство ответственного корпоративного (централизованного) лица, стоящего за этим. </P>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emx8zav/","name":"t1_emx8zav","created":1557441217,"created_utc":1557412417,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_bm4ufi","id":"emxcffn","author":"[deleted]","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"what excactly is a functioning, decentralized uber?\n\nIf you cannot define it, what are you even asking? And more importantly how can it ever exist","body_html":"<div class = \"md\"> <p> что такое функционирующий децентрализованный убер? </p>\n<p> Если вы не можете определить это, что вы даже спрашиваете? И что более важно, как это может существовать </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emxcffn/","name":"t1_emxcffn","created":1557443257,"created_utc":1557414457,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":0,"link_id":"t3_bm4ufi","id":"emu7id0","author":"CalvinsStuffedTiger","parent_id":"t3_bm4ufi","subreddit_id":"t5_2zf9m","body":"Users don’t switch to a new platform that’s slower and more expensive than what they are currently using, and decentralized anything will always be slower and more expensive than their centralized counterparts this is just how computers and physics works, you can’t wave that away \n\nEveryone in crypto needs to focus on things that haven’t been done before instead of “its like x but with the blockchain” \n\nIt’s not gonna happen!","body_html":"<div class = \"md\"> <p> Пользователи не переключаются на новую платформу, которая медленнее и дороже, чем та, которую они используют в настоящее время, и децентрализованное все будет всегда медленнее и дороже, чем их централизованные аналоги, вот как компьютеры и физика работают, вы не можете отмахнуться от этого </p>\n\n<p> Каждый в криптографии должен сосредоточиться на вещах, которые раньше не делали, вместо того, чтобы «это как x, но с блокчейном» </p>\n\n<p> Этого не произойдет! </p>\n</DIV>","permalink":"/r/ethereum/comments/bm4ufi/today_uber_drivers_are_striking_due_to_a_25_cut/emu7id0/","name":"t1_emu7id0","created":1557359128,"created_utc":1557330328,"subreddit_name_prefixed":"r/ethereum","depth":0}]}