{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"ethereum","selftext":"Some of you might recall recall our initial facepalm failed launch about 3 months ago ([post-mortem here](https://medium.com/@coinop.logan/daihard-stillborn-an-ironic-post-mortem-dd96010c547b)). Well, we're back--this time with an audit and some new features. This version of DAIHard should should die a little harder this time ;)\n\n# The Audit\n\nAfter shopping around a bit in the auditor space, we decided to go with Adam Dossa--the very same Adam Dossa that actually found our launch vulnerability and responsibly disclosed it to us! You can see his report [here](https://github.com/burnable-tech/DAIHard/blob/d5926eaad4696c6735ee7e1d9ac3cca46b9520d3/audit-info/DAIHard_Audit.md). By the way, Adam has been a gem: friendly, professional, timely, and flexible. Definitely keep him in mind if you need an audit!\n\n# (Re)Introducing DAIHard\n\nFollowing is an updated version of our [original launch post](https://www.reddit.com/r/ethereum/comments/bdetr2/daihard_the_unkillable_cryptofiat_gateway_any/). If you've already read that, you might want to skip to the heading **What's New in v0.9.2**. Or you can [go straight to the app](https://burnable-tech.github.io/DAIHard/) or go to [our info site](https://daihardhome.wpcomstaging.com/) for more info!\n\n***\n\nHere is a legitimate concern most of us are familiar with:\n\n>To enter or exit the crypto economy, we rely on centralized exchanges such as Coinbase, which track their users, impose limits, and are tightly coupled to their jurisdiction and its banking system. And for all we know, any day now regulations could start tightening these controls further (*we've actually seen some of this play out in the two months since our first launch post). In light of this, can we say in any meaningful sense that crypto is anonymous, limtiless, borderless, immune to regulation, and (most importantly) unstoppable?\n\nTo really address this concern, we need a completely decentralized gateway between fiat and crypto: something that extends the benefits of crypto to the very act of moving between the old and new economies. But the design of such a platform is far from obvious.\n\n(Localethereum comes close, but as discussed under **Unkillable**, it doesn't quite cut it. And Bisq is decentralized, but has significant UX hurdles.)\n\nWe believe we've found a solution. We are proud to present:\n\n## *DAIHard v0.9.2 - Almost Definitely Not Broken This Time*\n\nIf you want to jump right in, we recommend first watching [our latest usage demo](https://youtu.be/WR4WovM0qwg) (7 min), then [diving in and giving it a shot](https://burnable-tech.github.io/DAIHard/) with a small amount of Dai. (Try it on Kovan first if mainnet is too scary!)\n\nDAIHard extends many of the promises of crypto (borderless, anonymous, limitless, unstoppable) into the exchange mechanism itself, allowing **anyone, anywhere** to bypass centralized exchanges and the control they impose.\n\nMore concretely, DAIHard is a platform, run on smart contracts, for forming one-off crypto/fiat exchanges with other users, in which:\n\n* The method of fiat transfer is open-ended, but agreed upon up-front (for example: bank transfer, cash handoff, transfer of online credit, cash drop...).\n* You and the counterparty can communicate via end-to-end encrypted chat to coordinate the fiat transfer (i.e. communicate bank account number or reveal a cash drop location).\n* Crucially, in the last phase, the Seller can choose to **burn the Dai** instead of releasing it to the Buyer (but he can't get it back). This *credible threat of burn* is what makes the platform reliable in the absence of a centralized group of arbitrators or moderators. For more on this see the [DAIHard Game Theory](https://medium.com/@coinop.logan/daihard-game-theory-21a456ef224e) medium article (10 min read).\n\nAgain, [our latest usage demo](https://youtu.be/WR4WovM0qwg) (7 min) shows this process in action.\n\n## Two drawbacks\n\n### You Need either xDai, or both Dai and Ether, to Use The Tool (At Least For Now)\n\nIf you want to buy Dai on DAIHard, you must already have Dai--1/3 of the amount you want to purchase--to put up as a **burnable deposit**. For example, if you only have 10 Dai now, you can only commit to buying 30 Dai, and must complete that trade before using the newly bought Dai to open up a bigger offer (for up to 120 Dai that time).\n\nMost tragically of course, this means that if you don't already have some crypto, you can't use this tool to get crypto--this is why we avoid calling DAIHard an onramp specifically. This comes from the fact that both parties must have \"skin in the game\" for the game theory to work, and a smart contract can only threaten to burn crypto.\n\nWe have some ideas on how to address this drawback in the not-too-distant future, which we'll write about soon. For now it's time to launch this thing and get some users!\n\n### Dangerous and Scary To Use\n\nIn rare cases, a user may have to burn Dai and face a loss on the entire trade amount. The necessity of this ever-present risk is explained in detail in [DAIHard Game Theory](https://medium.com/@coinop.logan/daihard-game-theory-21a456ef224e).\n\nHowever, a cautious, rational user can gather information (possibly via our [subreddit](r/daihard)!) about how people have used the tool, successfully and unsuccessfully. They can then create a buy or sell offer with wisely chosen settings based on what has worked for others. Other cautious, rational users can find this offer and commit to the trade if they dare. We expect the vast majority of committed trades should involve rational, cautious users, and should therefore resolve happily.\n\nStill, inevitably there will be sloppy trades that result in burns. As the tool is used, we'll be keeping a close eye on the frequency of burns and keeping you guys updated (perhaps via a \"System Status\" utility similar to the one found on [MakerDao's explorer](https://dai.makerdao.com/)). In the end, though, we expect the risk in using DAIHard to be comparable to the risk of using any exchange or DNM: ever-present but low enough for the platform to be useful as whole.\n\nSo, while DAIHard will never shut down and can't perform an exit scam, the bad news is it's not *risk-free*. Users will have to approach DAIhard with the same level of caution they would with any new exchange (albeit for different reasons and with a different approach).\n\nSo what's the good news?\n\n## The Good News\n\nWhile these drawbacks are significant, they enable some remarkable features that no other crypto/fiat exchange mechanism can boast.\n\n### Unkillable\n\n(Correction: Bisq seems to have a decentralized arbitration system)\n\nWe are aware of no other crypto/fiat exchange platform that is truly unkillable. ~~Bisq and~~ localethereum comes close, but ~~both~~ localethereum relies on centralized processes of arbitration. This means their fraud-and-scam-prevention system can be sued, jailed, or otherwise harrassed--and if that part stops working, it doesn't matter how decentralized the rest of the system was.\n\nDAIHard, in contrast, gives the users the power to police and punish each other, via the aforementioned credible threat of burn. This is simple game theory, and the rules of this game are etched permanently into the DAIHard Factory and Trade contract code: impervious to litigation, regulation, and political pressure.\n\nThis Factory contract has no owner and no suicide or pause code. It cannot be stopped by us or anyone else.\n\nLike [Toastycoin](http://www.toastycoin.com), this thing was immortal the moment it was deployed (even more immortal than RadarRelay, for example, which does rely on an ownership role). Both DAIHard and Toastycoin (and probably whatever we build next) will last for as long as a single Ethereum node continues mining, and it will remain easy to use as long as someone can find the HTML/JS front-end and a web3 wallet.\n\n(The HTML/JS front-end (built in Elm, by the way, with the lovely [elm-ethereum](https://github.com/cmditch/elm-ethereum)!) is currently hosted on Github pages, which is centralized--but even if Github takes down the page and deletes the code, it's a minor step to get the page hosted on IPFS, something that is on our near-term roadmap in any case)\n\n### No KYC, No Limits\n\nIt's smart contracts all the way down, so DAIHard never asks any nosy questions--if you have Metamask or some other web3 wallet installed and set up, with some ETH and Dai (or just xDai), you can immediately open or commit to a trade. You don't even need a username!\n\n(In fact, we're so inclusive, even machines are allowed--no CAPTCHA here!)\n\nYou're limited only by the collateral you put up, so if you have 10,000 Dai you could open up a buy offer for 30,000 Dai (or a sell offer for 10,000 Dai) right now.\n\nWe do *reccommend* trying the tool out first with a small amount of Dai... But we're not your mom! Do what you want!\n\n### Borderless\n\nIt simply doesn't matter where you are, because DAIHard doesn't need to interface with any particular jurisdiction or payment system to work. DIAHard works by incentivizing *people* (or robots?) to navigate the particular real-world hurdles of bank transfers, cash drops, or other fiat transfer methods. These incentives work whether you're in America, Zimbabwe, or the Atlantic; they work whether the fiat is USD, EUR, ZAR, seashells, or Rai Stones; and they work whether your counterparty is a human, an organization, a script, or a particularly intelligent dog with Internet access.\n\n### Any Fiat Type, and Highly Customizeable\n\nHere are some examples of the types of trades you might create or find on DAIHard.\n\n* Sell 5 xDai for $5 USD, sent via TransferWise.\n* Sell 200 Dai for $180 USD, granted they bring the cash to you by tomorrow afternoon in Central Park, NYC.\n* Buy 20 Dai with a $30 gift card for Amazon AWS that you were never going to use.\n* Sell 20 Dai in exchange for a $20 Steam game.\n* While in Vietnam, sell 200 Dai to someone for €180 anytime in the next two weeks, provided they deposit it into your German bank account.\n* While in Germany, sell 20 Dai to someone in exchange for them refilling your pre-paid Vietnamese phone plan.\n* Buy 30 Dai for 8,000 ZWD, which you deliver anonymously by cash drop in Hume Park, Bulawayo, sometime within the next month. (If there's one place that could use unstoppable access to crypto, [it's Zimbabwe](https://www.theguardian.com/world/2019/jul/21/millions-face-hardship-as-zimbabwe-comes-close-to-meltdown), and [you don't need to take our word for it](https://www.ccn.com/news/bitcoin-price-1000-premium-zimbabwe-hyperinflation/2019/07/17/).)\n* Buy 500 Dai for $550 via PayPal, but wait 3 weeks for before the Dai is released (so the paypal transaction can't be reversed).\n\nAs the DAIHard community grows, users will doubtless find much more creative ways to use the system, and we will discover together which types of trades are reliable and which are more risky. Because users can set their own prices and phase timeout settings, we expect the risky trades to charge a premium or have longer time windows, while the reliable ones rapidly multiply at close to a 1:1 price ratio, with quick turnaround times.\n\n## Extensible (with profit) by Third Parties\n\nNot satisfied with our interface? Do you have some nifty idea for how to display and organize user reputation? Or maybe some idea for how trades could be chained togeher? Maybe you'd like to design a notification system for DAIHard? Maybe you just want a different color scheme!\n\nWell, you won't need our permission to do any of this. Any tool that watches the same Factory contract will share the pool of trades, regardless of which tool actually creates the trade. This means we don't even have to fight over network effects!\n\nAnd if you look closely at our fee structure, you might notice that only half of the 1% DAIHard fee is \"hardcoded\" into the Factory contract. The other half is set and charged by our interface. What does this mean for you? If you go out and make a better interface, you can essentially replace half of our 1% fee with your own fee--it's up to you whether it's smaller or larger than the replaced 0.5%.\n\nThe reason for this is to explicitly welcome other developers to extend what we've built. For as long as our team is the only one improving the platform, a threat to us is a threat to future upgrades. But if others begin extending the DAIHard platform too, then DAIHard will not only be unstoppable *as it is today*, but also *grow* unstoppably.\n\n## (For Real This Time) This Is a Big Fucking Deal\n\nDAIHard is a turning point in crypto and a breakthrough in decentralized markets, and is an irreversible augmentation of the Ethereum platform.\n\nWhat we've built is a gateway to crypto completely devoid of centralized components--rendering entry and exit to crypto unkillable, flexible, borderless, and private. Centralized exchanges, and the control they impose, can now be bypassed by anyone with Dai and a web3 wallet.\n\n## What's New in v0.9.2\n\nThere have been many changes made since our first failed launch, but there are two rather important ones: xDai support and reputation tools.\n\n### xDai support\n\nDAIHard is now operational on xDai, a sidechain whose native token (xDai) is pegged to the Dai (and therefore $1). Add the xDai network to your Metamask (or just install Nifty Wallet), then switch to the xDai network in your wallet, to try it out. xDai has some pretty incredible benefits, compared to vanilla Ethereum:\n\n- Price: On xDai, a single DAIHard trade costs on the order of $0.01 to run start-to-finish, rather than the accumulated $2.40 (with the best-case-scenario 1gwei gas price) you'll spend on vanilla Ethereum.\n- Speed: Trade actions mine much faster, and don't require ERC20 'approve' transactions, making the whole process way snappier.\n- Gas priced in xDai: the main benefit here is that you only need one token (xDai) rather than two (Dai and Eth). Also, it's just nice having the gas cost expressed in (essentially) USD!\n\n### Reputation tools\n\nWe now have a few reputation tools. First, on any open trade, there is a widget showing the number of releases, aborts, and burns the given address has been involved in as that role (buyer or seller). Clicking on this expands the widget to show more detailed information, and also provides a link to a page that lists each trade this user has been or is involved in.\n\n## What's next?\n\nWe have tons of ideas on how to improve the product--too many, in fact, to commit to any before we get a good chunk of user feedback. Here are some of our favorite ideas:\n\n#### Near-Term, Smaller Features\n\n1. Lots of usability improvements.\n2. A \"System Status\" utility similar to the one found on [MakerDao's explorer](https://dai.makerdao.com/)).\n3. Marketplace / My Trades rework.\n4. A \"QuickTrade\" page, offering Trade Templates as an alternative to the current Create Offer page.\n\n#### Big Exciting Features\n\n1. Bootstrapping people with no DAI via other mechanisms and community outreach.\n2. Partial commits to trades. eg. Place a 10,000 DAI trade and allow it to be picked up in blocks larger than 500 DAI at a time.\n3. More chains, get this thing working on Bitcoin via Rootstock, on Ethereum Classic and Binance Chain.\n\n#### Stay Informed!\n\nA lot of the above features will be prioritized more clearly as we get user feedback, and we will be posting fairly frequent updates and articles on [our info site](https://daihardhome.wpcomstaging.com/). If you don't want to miss anything, note the subscribe widget and sign up!","title":"Re-Launching The Borderless, Unkillable Crypto-Fiat Gateway, DAIHard. Enter or Exit Crypto via Any Fiat and Any Payment Method, Anywhere in the World, Without KYC. All you need is a little Dai.","subreddit_name_prefixed":"r/ethereum","ups":186,"created":1564074373,"link_flair_background_color":"","id":"chl924","author":{"name":"coinop-logan"},"permalink":"/r/ethereum/comments/chl924/relaunching_the_borderless_unkillable_cryptofiat/","url":"https://www.reddit.com/r/ethereum/comments/chl924/relaunching_the_borderless_unkillable_cryptofiat/","created_utc":1564045573}