{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"Эфириума","selftext":"Я являюсь лидером, который взломал синтетическую Eth на 11,5 миллиардов долларов с платформы Synthetix, которую можно увидеть [здесь]  (https://etherscan.io/tx/0x93819f6bbea390d7709fa033f5733d16418674e99c43b9ed23adb41c0607) 7 десятки (сотни?) новостных сайтов, таких как [Coin Telegraph] <span translate = \"no\"> (https://cointelegraph.com/search?query=synthetix) \n\nЯ не собирался ломать систему, поэтому я вернул все это в обмен на награду в 40 тысяч долларов и сохранил баланс синтезаторов до 50 долларов.\n\nКейн (генеральный директор) сказал, что хотел бы, чтобы я продолжал запускать бота, чтобы они могли настроить платформу так, чтобы она была устойчивой к моим атакам.\n\nОказывается, он просто хотел нанести мне удар в спину, как только я достиг баланса в $ 100 тыс., Увеличив комиссию до 99%, когда одна из моих [транзакций]  (https://etherscan.io/tx/0x3efea6b1355ae7848dcc4c530e2b9fca534601babc1650a6017  был в mempool (обратите внимание на чрезвычайно высокий баланс XDR. Это плата)\n\nОшеломленный нарушением нашего соглашения, я защитил его плату за атаку и начал атаковать только ради атаки с намерением нанести ущерб системе в качестве мести. Я снова получил до 100 тысяч долларов\n\nКейн и команда решили, что не хотят притворяться, что у них больше есть децентрализованная система, и удалили мой баланс. Они снизили цену на синтезатор, который я держал в настоящее время, и [вынуждены]  (https://etherscan.io/tx/0x5d4f992a507d851bcdc7dcd35bf4d3545ddd9e20981fe12b3a708c40cde43740)  переводить нет \"> (https://etherscan.io/tx/0x0137d0ee34a8d688b583cc74f31ada35a5be5b15ff16b9c84dfe0a9fa1671b97) </ span> мой синтезатор для sUSD. Они могут сделать это с кем угодно\n\nМоя точка зрения здесь не в том, чтобы быть «бу-ху, я жертва». Я не белый рыцарь, но я также не плохой парень. Плохой парень мог бы сбросить $ 11,5 млрд на рынках, как только Кейн согласился возобновить торговлю на платформе после того, как мы пришли к нашей сделке. Моя точка зрения заключается в том, чтобы разоблачить их, потому что команда синтезаторов пытается [подкупить]  (https://blog.synthetix.io/win-1000-snx-by-voting-for-susd-in- соединения-голосование /)  их путь к тому, чтобы быть на Соединении.\n\nНе позволяйте централизованным системам заражать DeFi.\n\nРедактировать: встроенное форматирование ссылки.\n\n2-е редактирование: стоит отметить, что я предложил помочь исправить все недостатки, которые я видел в дизайне, в обмен на восстановление моего баланса синтезатора. Они не хотели сотрудничать.","title":"Synthetix \"dApp\" удалил мой баланс","subreddit_name_prefixed":"r/ethereum","ups":583,"created":1568541362,"link_flair_background_color":"","id":"d4edxm","author":{"name":"onyx_rogue"},"permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/","url":"https://www.reddit.com/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/","created_utc":1568512562,"replies":[{"ups":152,"link_id":"t3_d4edxm","replies":[{"ups":11,"link_id":"t3_d4edxm","replies":[{"ups":42,"link_id":"t3_d4edxm","id":"f0c24dd","author":"EvanVanNess","parent_id":"t1_f0bseo6","subreddit_id":"t5_2zf9m","body":"> Блог был опубликован уважаемым разработчиком Eth.\n\nв посте Амин не было ничего особенно нового. Но хорошо знать риски DeFi. они не равны нулю.","body_html":"<div class = \"md\"> <blockquote>\n<p> Сообщение в блоге опубликовано уважаемым разработчиком Eth </p>\n</BLOCKQUOTE>\n\n<p> В посте Амина не было ничего особенно нового. Но хорошо знать риски DeFi. они не равны нулю. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0c24dd/","name":"t1_f0c24dd","created":1568563538,"created_utc":1568534738,"subreddit_name_prefixed":"r/ethereum","depth":4},{"ups":19,"link_id":"t3_d4edxm","id":"f0cufbp","author":"eastsideski","parent_id":"t1_f0bseo6","subreddit_id":"t5_2zf9m","body":"Это была уже известная точка централизации, Амин просто привлекла к ней больше внимания.\n\nCompound ничего не скрывал, но пост Ameens ясно дал понять, что Compound следует рассматривать «в бета-версии», а составная команда ясно дала понять, что они намерены со временем децентрализовать больше компонентов.","body_html":"<div class = \"md\"> <p> Это была уже известная точка централизации, Амин просто привлекла к ней больше внимания. </Р>\n\n<p> Compound ничего не скрывал, но пост Ameens ясно дал понять, что Compound следует рассматривать «в бета-версии», а составная команда ясно дала понять, что они намерены со временем децентрализовать больше компонентов. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cufbp/","name":"t1_f0cufbp","created":1568574227,"created_utc":1568545427,"subreddit_name_prefixed":"r/ethereum","depth":4},{"ups":2,"link_id":"t3_d4edxm","id":"f0g3n0c","author":"Urban_Movers_911","parent_id":"t1_f0bseo6","subreddit_id":"t5_2zf9m","body":"Вроде. риск заключается в том, что кто-то с паролем администратора может в принципе заменить весь контракт через механизм обновления, чтобы украсть вещи.\n\nЯ, честно говоря, понятия не имею, как вы решаете эту проблему, потому что, как разработчик, вы должны иметь возможность обновлять свой код. Но разработчик, который может обновить контракт, также может украсть дерьмо (потенциально).","body_html":"<div class = \"md\"> <p> В некотором роде. риск того, что кто-то с паролем администратора может заменить весь контракт с помощью механизма обновления, чтобы украсть материал. </p>\n\n<p> Честно говоря, я понятия не имею, как вы решаете эту проблему, потому что, будучи разработчиком, вы сможете обновить свой код. Но разработчик, который может обновить контракт, также может украсть дерьмо (потенциально). </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0g3n0c/","name":"t1_f0g3n0c","created":1568621980,"created_utc":1568593180,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"f0bs5fy","author":"ssg691","parent_id":"t1_f0bp3wo","subreddit_id":"t5_2zf9m","body":"что случилось с соединением?","body_html":"<div class = \"md\"> <p> что случилось с составным? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bs5fy/","name":"t1_f0bs5fy","created":1568559939,"created_utc":1568531139,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0ay9la","author":"ezpzfan324","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"/ u / Kaiynne u / synthetix_io\n\nхорошо?","body_html":"<div class = \"md\"> <p> <a href=\"/u/Kaiynne\"> / u / Kaiynne </a> <a href=\"/u/synthetix_io\"> u / synthetix_io </a> </р>\n\n<Р> а? </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ay9la/","name":"t1_f0ay9la","created":1568549083,"created_utc":1568520283,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":89,"link_id":"t3_d4edxm","id":"f0aznvo","author":"objectivedirections","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Отличный пост.\n\n\n\nЭто совершенно неприемлемо для synthetix, если верно, как вы говорите.\n\n\n\n/ u / kaiynne u / synthetix io, люди хотят, чтобы вы ответили.","body_html":"<div class = \"md\"> <p> Отличный пост. </p>\n\n<Р> </р>\n\n<p> Это совершенно неприемлемо для synthetix, если оно истинно, как вы говорите. </p>\n\n<Р> </р>\n\n<p> <a href=\"/u/kaiynne\"> / u / kaiynne </a> <a href=\"/u/synthetix\"> u / synthetix </a> io, люди хотят, чтобы вы отвечали. < / р>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0aznvo/","name":"t1_f0aznvo","created":1568549557,"created_utc":1568520757,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":65,"link_id":"t3_d4edxm","replies":[{"ups":2,"link_id":"t3_d4edxm","id":"f0evm2i","author":"ArthurC92","parent_id":"t1_f0eiq6n","subreddit_id":"t5_2zf9m","body":"У ОП работает торговый бот, и ему повезло использовать неисправного оракула (не благодаря его возможностям). Он получил награду за сотрудничество в первую очередь, чтобы вернуть огромное количество Synths, которые у него есть.","body_html":"<div class = \"md\"> <p> У ОП работает торговый бот, и ему повезло использовать неисправного оракула (не благодаря его возможностям). Он получил награду за сотрудничество в первую очередь, чтобы вернуть огромное количество Synths, которые у него есть. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0evm2i/","name":"t1_f0evm2i","created":1568602915,"created_utc":1568574115,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":1,"link_id":"t3_d4edxm","id":"f0gdhec","author":"onyx_rogue","parent_id":"t1_f0eiq6n","subreddit_id":"t5_2zf9m","body":"Kayne заставил меня осознать 2k SNX или что-то еще за ошибку, когда я обратился после основного взлома (не сильно, но все же)\n\nМоя главная проблема заключалась в том, что я получил свой баланс до $ 50 тыс. За счет фронтального запуска незадолго до основной ошибки, которую использовал мой бот, и я подумал, что Кейн удалит весь мой баланс после его устранения, поэтому я потребовал токен не-синтезатора (Eth) в качестве гарантии того, что я сохраню свой баланс в обмен на возврат синтезаторов за $ 11,5 млрд.","body_html":"<div class = \"md\"> <p> Кейн дал мне знать о 2k SNX или о чем-то вроде ошибки, когда я обратился после основного взлома (не сильно, но все же) </p>\n\n<p> Мое главное беспокойство заключалось в том, что я получил свой баланс до $ 50 тыс. во время фронтального запуска незадолго до того, как основной баг, которым воспользовался мой бот, и я подумал, что Кейн удалит весь мой баланс после его устранения, поэтому я потребовал токен, не являющийся синтезатором. (Eth) в качестве гарантии того, что я сохраню свой баланс в обмен на возврат синтезаторов за $ 11,5 млрд. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0gdhec/","name":"t1_f0gdhec","created":1568626595,"created_utc":1568597795,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0bxny8","author":"Kaiynne","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Здесь есть что распаковать, но, пожалуй, первое, на что следует обратить внимание, это то, что Оникс в течение нескольких месяцев жаловался на нас и жаловался и пытался создать FUD, и мы позволили ему сделать это, потому что в его истории не было никакого смысла. В конце концов, когда всем стало скучно слушать его жалобы, он решил опубликовать это. Все это исходит от сценариста, который неоднократно заявлял, что пытается уничтожить проект, чтобы отомстить за то, что ему не удалось украсть у держателей SNX в ходе фронтального запуска.\n\nПосле первого инцидента я сказал ему, что он может продолжать атаковать систему, мы все равно не могли помешать ему сделать это, и попросить не делать этого, явно не собирался работать. Как только мы заплатили вознаграждение, мы начали работать над защитой спереди в оракуле. Эти средства защиты были разработаны, чтобы представлять собой реальную угрозу для бота, который определенно использовал фронтальные атаки для атаки на систему. Они были выпущены и задокументированы [здесь]  (https://sips.synthetix.io/sips/sip-6) . Конечно, мы ожидали, что он продолжит атаковать систему после этого, поэтому нам пришлось сделать несколько обновлений этого механизма. Все они использовали комбинацию оракула и существующей функциональности, чтобы позволить очистить синтезатор, чтобы победить его ботов и уменьшить баланс до нуля. Но думать, что каким-то образом его украденные средства не должны были подвергаться риску, откровенно смешно.\n\nПросто отступление: на данный момент его утверждение о том, что это было «преступление без жертв», полностью ложно, и он знает это, но пытается обмануть людей, чтобы те поняли, что он - жертва. Когда его передовой управляющий бот генерировал безрисковую прибыль, эта прибыль была получена за счет всех участников SNX, увеличив их долг. Таким образом, разрешение ему продолжать это было реальной угрозой для системы.\n\nМы открыто заявляли много раз, что у нас есть возможность модернизировать систему, включая возможность повторного развертывания контрактов с измененными сальдо. Мы никогда ранее не использовали эту возможность и не собираемся ее использовать, но это является следствием возможности быстрой итерации по контрактам и нашей прокси-архитектуре. Механизмы, которые использовались для победы над этими фронтальными ботами, не требовали изменения весов, они были целенаправленными изменениями в функциональности оракула, чтобы изменить стимулы для тех, кто развертывает фронтального робота.\n\nЧтобы быть ясным: если не было никакого риска потери средств, то оптимальной стратегией было продолжать атаковать, изменив это и подвергнув риску средства, исчисление изменилось, и, очевидно, это сработало, потому что Оникс здесь жаловался на Reddit, а не пытался писать более эффективный бот. Что-то, что грозило сделать какое-то время, но потом сдалось.\n\nИ последнее замечание: Оникс хотел бы думать, что он какой-то дьявольский гений, но печальный факт заключается в том, что его боты были даже не близки к оптимальным, и мы должны поблагодарить его за то, что он разоблачил существующие проблемы с оракулами, но сделал это таким образом. неэффективным способом, которым мы смогли залатать их без еще больших потерь. Его оплата за это была ** 40 тысяч долларов США **. Итак, еще раз, вы можете решить, кто является жертвой в этой ситуации, держатели SNX или какой-то случайный злоумышленник, которому была выплачена щедрая награда за ошибку.\n\nИ последнее заключительное замечание, но есть что-то странное в том, что кто-то запускает транзакции в mempool, а затем использует тот же самый вектор атаки, который используется против них, чтобы предотвратить их атаку, затем видит, как они кричат ​​о нечестной игре, но мы здесь.","body_html":"<div class = \"md\"> <p> Здесь есть кое-что, что нужно распаковать, но, вероятно, первое, на что следует обратить внимание, это то, что Оникс уже несколько месяцев находится в раздоре, жалуясь и пытаясь сгенерировать FUD, и мы позволили ему сделать это. потому что не было никакого вещества в его истории. В конце концов, когда всем стало скучно слушать его жалобы, он решил опубликовать это. Все это исходит от сценариста, который неоднократно заявлял, что он пытается уничтожить проект, чтобы отомстить за то, что ему не удалось украсть у держателей SNX через передний ход. </P>\n\n<p> После первого инцидента я сказал ему, что он может продолжать атаковать систему, мы все равно не могли помешать ему сделать это, и, прося не делать этого, он явно не собирался работать. Как только мы заплатили вознаграждение, мы начали работать над защитой спереди в оракуле. Эти средства защиты были разработаны, чтобы представлять собой реальную угрозу для бота, который определенно использовал фронтальные атаки для атаки на систему. Они были выпущены и задокументированы <a href=\"https://sips.synthetix.io/sips/sip-6\"> здесь </a>. Конечно, мы ожидали, что он продолжит атаковать систему после этого, поэтому нам пришлось сделать несколько обновлений этого механизма. Все они использовали комбинацию оракула и существующей функциональности, чтобы позволить очистить синтезатор, чтобы победить его ботов и уменьшить баланс до нуля. Но думать, что каким-то образом его украденные средства не должны были подвергаться риску, откровенно смешно. </P>\n\n<p> В данный момент просто отступление: его утверждение о том, что это было «преступление без жертв», является полностью ложным, и он знает это, но пытается обмануть людей, чтобы те поняли, что он - жертва. Когда его передовой управляющий бот генерировал безрисковую прибыль, эта прибыль была получена за счет всех участников SNX за счет увеличения их долга. Поэтому позволить ему продолжать это было реальной угрозой для системы. </P>\n\n<p> Мы неоднократно открыто заявляли, что у нас есть возможность модернизировать систему, включая возможность повторного развертывания контрактов с измененными сальдо. Мы никогда ранее не использовали эту возможность и не собираемся ее использовать, но это является следствием возможности быстрой итерации по контрактам и нашей прокси-архитектуре. Механизмы, которые использовались для победы над этими фронтальными ботами, не требовали изменения весов, они были целенаправленными изменениями в функциональности оракула, чтобы изменить стимулы для тех, кто развертывает фронтального бота. </Р>\n\n<p> Чтобы быть ясным: если не было риска потери средств, то оптимальной стратегией было продолжать атаковать, изменив это и подвергнув риску средства, исчисление изменилось, и, очевидно, это сработало, потому что Оникс здесь жалуется на Reddit, а не пытаюсь написать более эффективного бота. Что-то, что он угрожал сделать какое-то время, но потом сдался. </P>\n\n<p> И последнее замечание: Оникс хотел бы думать, что он какой-то дьявольский гений, но печальный факт заключается в том, что его боты были даже не близки к оптимальным, и мы должны поблагодарить его за то, что он разоблачил существующие проблемы с оракулами, но сделал это настолько неэффективно, что мы смогли их залатать без еще больших потерь. Его оплата за это составила <strong> 40 тысяч долларов США </strong>. Итак, еще раз, вы можете решить, кто является жертвой в этой ситуации, держатели SNX или случайный злоумышленник, которому была выплачена щедрая награда за ошибку. </P>\n\n<p> И последнее заключительное замечание, но есть кое-что странное в том, что кто-то запускает транзакции в mempool, а затем использует тот же самый вектор атаки, который используется против них, чтобы предотвратить их атаку, затем видит, как они кричат ​​о нечестной игре, но здесь мы . </р>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bxny8/","name":"t1_f0bxny8","created":1568561945,"created_utc":1568533145,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":49,"link_id":"t3_d4edxm","replies":[{"ups":2,"link_id":"t3_d4edxm","id":"f0d2ro2","author":"welcometotheregime","parent_id":"t1_f0c0636","subreddit_id":"t5_2zf9m","body":"Я думаю, что проблема заключается в прокси-контрактах, которые делегируют вызовы другому контракту для возможности обновления. Обновляемые контракты устраняют риск блокирования средств из-за ошибки, но они также позволяют редактору в любое время изменять контракт, что означает, что он не является неизменным или ненадежным.","body_html":"<div class = \"md\"> <p> Я думаю, что проблема заключается в прокси-контрактах, которые делегируют вызовы другому контракту для возможности обновления. Обновляемые контракты устраняют риск блокирования средств из-за ошибки, но они также позволяют редактору в любое время изменять контракт, что означает, что он не является неизменным или ненадежным. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0d2ro2/","name":"t1_f0d2ro2","created":1568577408,"created_utc":1568548608,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0at80f","author":"_degenerategambler","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я согласился с тем, что в настоящее время dApp - это просто ключевое слово для маркетинга, которое на самом деле не означает децентрализованное приложение.","body_html":"<div class = \"md\"> <p> В данный момент я согласен с тем, что dApp в настоящее время является лишь маркетинговым ключевым словом и фактически не означает децентрализованное приложение. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0at80f/","name":"t1_f0at80f","created":1568547394,"created_utc":1568518594,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":39,"link_id":"t3_d4edxm","replies":[{"ups":4,"link_id":"t3_d4edxm","id":"f0es8p4","author":"Ur_mothers_keeper","parent_id":"t1_f0ekoa9","subreddit_id":"t5_2zf9m","body":"Да, и есть законные причины, по которым они тоже это делают. DAO, взлом Polkadot, этого можно было бы избежать, если бы существовали центральные точки контроля для команд разработчиков. Также я уверен, что некоторые из этих проектов нацелены на получение прибыли и должны делать это в соответствии с VC или правилами, что не годится.\n\nЛично я не буду использовать какой-либо сервис, построенный на децентрализованных лесах, который отменяет эту работу и централизует их проект. Я особенно утомлен, если они не говорят, что контролируют средства пользователя. Я недоволен тенденцией пользователей просто принимать центральные точки контроля в используемых ими dapps.","body_html":"<div class = \"md\"> <p> Да, и есть законные причины, по которым они тоже это делают. DAO, взлом Polkadot, этого можно было бы избежать, если бы существовали центральные точки контроля для команд разработчиков. Также я уверен, что некоторые из этих проектов нацелены на получение прибыли и должны делать это в соответствии с ВК или правилами, что не годится. </P>\n\n<p> Лично я не буду использовать какой-либо сервис, построенный на децентрализованных лесах, который отменяет эту работу и централизует их проект. Я особенно утомлен, если они не говорят, что контролируют средства пользователя. Я недоволен тенденцией пользователей просто принимать центральные точки контроля в используемых ими dapps. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0es8p4/","name":"t1_f0es8p4","created":1568601487,"created_utc":1568572687,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0d0yoy","author":"Ur_mothers_keeper","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я прочитал ветку, вот что я собираю:\n\n1. OP не святой, но обнаружил ужасную уязвимость в dapp, которая могла стоить миллиарды. Он отдал все это за награду.\n\n2. Многие разработчики dapp хранят векторы контроля в своих «децентрализованных» приложениях для собственного использования и / или злоупотребления.\n\n3. Два разработчика этого двойника dapp пересекли его, используя те векторы, которые они преднамеренно вставили в свои dapps.\n\n4. Теперь они пытаются его размазать.\n\nПрочитав всю ветку, я склонен верить ОП. Опять же, я сомневаюсь, что он святой, но я вижу для него большой позитив - тот факт, что он вернул миллиарды, после чего последовали бессмысленные атаки разработчиков, которые противоречат предыдущим высказываниям в твиттере после того, как он помог им найти свои уязвимости.\n\nВы слишком поздно, однако, разработчики dapp по той или иной причине вводят рычаги управления, причины не имеют значения. Они собираются это сделать, и никто не перестанет пользоваться их услугами, потому что реклама включена. DeFi - еще одно маркетинговое модное слово, к которому, к сожалению, относятся люди, в большинстве своем оно не децентрализовано. Честно говоря, я был измучен и обескуражен \"экосистемой\" ethereum и сообществом пользователей, но в ретроспективе это всегда будет идти по этому пути. После «быка», пузыря ICO, горстки даппов, которые принесли ценность, взломов и непредвиденных обстоятельств, сообщество пользователей стало все о долгах, регулировании и обмане дня. Я скучаю по дням до дао и вскоре после этого, когда все было связано с возможностями, по-настоящему децентрализованными неконтролируемыми финансовыми приложениями, и я все еще люблю Ethereum, но я все меньше и меньше вовлекаюсь в сообщество и все меньше и меньше интересуюсь каждым новым dapp. это идет онлайн. К сожалению, я не думаю, что кто-то может что-то сделать, чтобы изменить направление, это то, куда рынок хочет идти, и это то, куда он собирается идти","body_html":"<div class = \"md\"> <p> Я прочитал ветку, вот что я понял: </p>\n\n<Ол>\n<li> <p> ОП не святой, но обнаружил ужасную уязвимость в приложении, которое могло стоить миллиарды. Он отдал все это за награду. </P> </li>\n<li> <p> Многие разработчики dapp хранят векторы управления в своих «децентрализованных» приложениях для собственного использования и / или злоупотребления. </p> </li>\n<li> <p> Два разработчика этого двойника dapp пересекли его, используя те векторы, которые они намеренно вставили в свои dapps. </p> </li>\n<li> <p> Теперь они пытаются его смазать. </p> </li>\n</Ол>\n\n<p> Прочитав всю ветку, я склонен поверить в ОП. Опять же, я сомневаюсь, что он святой, но я вижу для него большой позитив - тот факт, что он вернул миллиарды, после чего последовали бессмысленные атаки разработчиков, которые противоречат предыдущим высказываниям в твиттере после того, как он помог им найти свои уязвимости. </р>\n\n<p> Вы слишком поздно, однако, разработчики dapp по каким-либо причинам устанавливают рычаги управления, причины не имеют значения. Они собираются это сделать, и никто не перестанет пользоваться их услугами, потому что реклама включена. DeFi - еще одно маркетинговое модное слово, к которому, к сожалению, относятся люди, в большинстве своем оно не децентрализовано. Честно говоря, я был измучен и обескуражен \"экосистемой\" ethereum и сообществом пользователей, но в ретроспективе это всегда будет идти по этому пути. После «быка», пузыря ICO, горстки даппов, которые принесли ценность, взломов и непредвиденных обстоятельств, сообщество пользователей стало все о долгах, регулировании и обмане дня. Я скучаю по дням до дао и вскоре после этого, когда все было связано с возможностями, по-настоящему децентрализованными неконтролируемыми финансовыми приложениями, и я все еще люблю Ethereum, но я все меньше и меньше вовлекаюсь в сообщество и все меньше и меньше интересуюсь каждым новым dapp. это идет онлайн. К сожалению, я не думаю, что кто-то может что-то сделать, чтобы изменить направление, это то, где рынок хочет идти, и это то, куда он собирается идти. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0d0yoy/","name":"t1_f0d0yoy","created":1568576710,"created_utc":1568547910,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":19,"link_id":"t3_d4edxm","replies":[{"ups":7,"link_id":"t3_d4edxm","replies":[{"ups":3,"link_id":"t3_d4edxm","id":"f0e4qnr","author":"onyx_rogue","parent_id":"t1_f0daiiw","subreddit_id":"t5_2zf9m","body":"Если вы говорите о цифрах (более 40 миллионов долларов), они буквальные и точные. Мой баланс был около 100 тысяч долларов. Торговля примерно раз в 1 или 2 обновления ценового оракула (что составляет каждые 5 или около того минут), это объем торгов 40 миллионов долларов.","body_html":"<div class = \"md\"> <p> Если вы говорите о числах (более 40 миллионов долларов США), они буквальные и точные. Мой баланс был около 100 тысяч долларов. Торговля примерно раз в 1 или 2 обновления ценового оракула (то есть каждые 5 или около того минут), это объем торгов 40 миллионов долларов. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0e4qnr/","name":"t1_f0e4qnr","created":1568591948,"created_utc":1568563148,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"f0bk5se","author":"onyx_rogue","parent_id":"t1_f0bbbfs","subreddit_id":"t5_2zf9m","body":"Команда заявила, что они не против ботов, вероятно потому, что боты, как правило, имеют чрезвычайно большой объем торговли и генерируют много комиссионных. Они были против моего бота, потому что это был фронт, означающий безрисковую прибыль. Если бы я позволил моему боту продолжаться, он бы разрушил систему, потому что прибыль, которую он получил бы, была бы больше, чем залог, который поддерживает синтезаторы. Кейн публично заявил, что запуск - это существенная угроза для системы. Первоначально я не хотел идти так далеко, но сделал бы это после того, как меня нанесли удар в спину, и он знал это, поэтому он предпринял крайние меры и удалил мой баланс.\n\nЯ не смотрел на конкретных активных ботов, но они могут быть другими лидерами. Я на самом деле знаю, что в системе все еще есть слабые места. Когда я занимал первые позиции, я генерировал что-то вроде 40 миллионов долларов США + объем торговли за 24 часа, что намного превышает предыдущий день наибольшего объема торгов. Команда просто улыбнулась и кивнула людям, комментирующим это по большей части на канале диссонанса, только признав, что это 90% + я, как только их прямо спросили, связано ли это с ботом. Вы должны нажать на них для ответов и не предполагать, что это так, как кажется.","body_html":"<div class = \"md\"> <p> Команда заявила, что они не против ботов, возможно потому, что боты, как правило, имеют чрезвычайно большой объем торговли и генерируют много комиссионных. Они были против моего бота, потому что это был фронт, означающий безрисковую прибыль. Если бы я позволил моему боту продолжаться, он бы разрушил систему, потому что прибыль, которую он получил бы, была бы больше, чем залог, который поддерживает синтезаторы. Кейн публично заявил, что запуск - это существенная угроза для системы. Первоначально я не хотел идти так далеко, но сделал бы это после того, как меня нанесли удар в спину, и он знал это, поэтому он предпринял крайние меры и удалил мой баланс. </P>\n\n<p> Я не смотрел на конкретных активных ботов, но они могут быть другими лидерами. Я на самом деле знаю, что в системе все еще есть слабые места. Когда я занимал первые позиции, я генерировал что-то вроде 40 миллионов долларов США + объем торговли за 24 часа, что намного превышает предыдущий день наибольшего объема торгов. Команда просто улыбнулась и кивнула людям, комментирующим это по большей части на канале диссонанса, только признав, что это 90% + я, как только их прямо спросили, связано ли это с ботом. Вы должны нажимать на них для ответов и не предполагать, что это так, как кажется. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bk5se/","name":"t1_f0bk5se","created":1568556934,"created_utc":1568528134,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0b7fki","author":"florianleber","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Кажется, вы поднимаете здесь много разных тем:\n\n1) Если я правильно прочитал, вы получили награду в размере 40 тысяч долларов США за помощь в обнаружении этой ошибки и за возврат средств. Кажется, это действительно справедливая сделка и хорошая сумма денег.\n\n2) Вторая тема заключается в том, что ваш последующий баланс был исправлен. Это действительно немного касается. Вы говорите, что команда попросила вас продолжить работу своего бота. Вы попали на баланс 100 000 синтезаторов. Было ли это еще раз из-за слабых мест в их системе? Было ли предварительное понимание того, что произойдет, если ваш бот снова сможет использовать систему? Я чувствую, что нам нужно больше подробностей, чтобы судить о ситуации, а также заявление команды.\n\n3) составной: для меня это довольно не связано и не большая вещь. Людям лень голосовать, а вы выдвигаете небольшой стимул. Стимул довольно маленький. Другие проекты использовали армии ботов для настройки таких голосов. Это сомнительная практика для меня.","body_html":"<div class = \"md\"> <p> Похоже, вы поднимаете здесь много разных тем: </p>\n\n<p> 1) Если я правильно прочитал, вы получили награду в размере 40 тысяч долларов США за помощь в обнаружении этой ошибки и за возврат средств. Кажется, это действительно справедливая сделка и хорошая сумма денег. </P>\n\n<p> 2) Вторая тема - исправление вашего последующего баланса. Это действительно немного касается. Вы говорите, что команда попросила вас продолжить работу своего бота. Вы попали на баланс 100 000 синтезаторов. Было ли это еще раз из-за слабых мест в их системе? Было ли предварительное понимание того, что произойдет, если ваш бот снова сможет использовать систему? Мне кажется, нам нужно больше деталей, чтобы судить о ситуации, а также заявление команды. </P>\n\n<p> 3) соединение: для меня это довольно не связано и не имеет большого значения. Людям лень голосовать, а вы выдвигаете небольшой стимул. Стимул довольно маленький. Другие проекты использовали армии ботов для настройки таких голосов. Это сомнительная практика для меня. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0b7fki/","name":"t1_f0b7fki","created":1568552201,"created_utc":1568523401,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":17,"link_id":"t3_d4edxm","replies":[{"ups":13,"link_id":"t3_d4edxm","replies":[{"ups":1,"link_id":"t3_d4edxm","id":"f15g1bf","author":"Sythic_","parent_id":"t1_f15cu0r","subreddit_id":"t5_2zf9m","body":"Это не столько взлом, сколько аспект мести. Если вы расстроены этим человеком, они готовы разрушить ваши системы.","body_html":"<div class = \"md\"> <p> Это не столько взлом, сколько аспект мести. Если вы расстроите этого человека, он будет готов уничтожить ваши системы. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f15g1bf/","name":"t1_f15g1bf","created":1569218649,"created_utc":1569189849,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"f0cv6zk","author":"Sythic_","parent_id":"t1_f0blhcr","subreddit_id":"t5_2zf9m","body":"> Но как бы вы отреагировали на заключение сделки и нанесение ответного удара?\n\nС адвокатом. Делать это по-своему - карьерное самоубийство. Вы не можете быть наняты для этого. Любой, кто вас нанимает, подвергает свой бизнес огромному риску.","body_html":"<div class = \"md\"> <blockquote>\n<p> но как бы вы отреагировали на заключение сделки и получение удара в спину? </p>\n</BLOCKQUOTE>\n\n<p> С адвокатом. Делать это по-своему - карьерное самоубийство. Вы не можете быть наняты для этого. Любой, кто вас нанимает, подвергает свой бизнес огромному риску. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cv6zk/","name":"t1_f0cv6zk","created":1568574529,"created_utc":1568545729,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0bf6t5","author":"lacker","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я был удивлен, когда прочитал это и подумал: «Подожди, какой-нибудь случай на Reddit действительно взломал 11 миллиардов долларов? Тогда я читаю новости более внимательно:\n\n> * поскольку прибыль, которую они получили в этих сделках, обеспечена обеспечением SNX, было недостаточно обеспечения, чтобы покрыть прибыль, поэтому не было бы никакого способа обналичить эту прибыль *\n\nПонимаю. По сути, Synthetix является единственной квази-децентрализованной торговой системой, вы номинально обанкротили их, но объем торговли их токенами составляет всего около 20 000 долларов в день, поэтому на самом деле не было 11 миллиардов долларов для взятия.\n\nВы не в праве здесь. Когда вы пишете что-то вроде:\n\n> Я защищался от его атаки и начал атаковать только ради нападения с намерением нанести ущерб системе в качестве мести.\n\nIANAL, но это точно звучит так, как будто ты \"плохой парень\" для меня. Не пытайтесь повредить чью-то систему в качестве мести. Это сильно отличается от поиска неясного способа совершать прибыльные сделки в новой торговой системе.\n\nТем не менее, Synthetix также кажется довольно ненадежным, и кажется, что люди должны просто держаться подальше от них.","body_html":"<div class = \"md\"> <p> Я был удивлен, когда прочитал это, и подумал: «Подожди, какой-нибудь случай с Reddit действительно взломал 11 миллиардов долларов?» Тогда я читаю новости более внимательно: </p>\n\n<BLOCKQUOTE>\n<p> <em>, поскольку прибыль, которую они получили в этих сделках, обеспечена обеспечением SNX, было недостаточно обеспечения для покрытия прибыли, поэтому не было бы никакого способа обналичить эту прибыль </em> </p>\n</BLOCKQUOTE>\n\n<p> Понятно. По сути, Synthetix является единственной квази-децентрализованной торговой системой, вы номинально обанкротили их, но объем торговли их токенами составляет всего около 20 000 долларов в день, поэтому на самом деле не было 11 миллиардов долларов для взятия. </P>\n\n<p> Вы здесь не правы. Когда вы пишете что-то вроде: </p>\n\n<BLOCKQUOTE>\n<p> Я защищался от его атаки и начал атаковать только ради атаки с намерением нанести ущерб системе в качестве мести. </Р>\n</BLOCKQUOTE>\n\n<p> IANAL, но это звучит так, как будто ты \"плохой парень\" для меня. Не пытайтесь повредить чью-то систему в качестве мести. Это сильно отличается от поиска неясного способа прибыльных сделок в новой торговой системе. </P>\n\n<p> Тем не менее, Synthetix также кажется довольно ненадежным, и кажется, что люди должны просто держаться подальше от них. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bf6t5/","name":"t1_f0bf6t5","created":1568555044,"created_utc":1568526244,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":19,"link_id":"t3_d4edxm","replies":[{"ups":9,"link_id":"t3_d4edxm","id":"f0dd2yc","author":"nootropicat","parent_id":"t1_f0dcg0g","subreddit_id":"t5_2zf9m","body":"Я ничего не удалил. Это как третий раз, когда я вижу это обвинение, оно было изобретено на разногласиях с Синтетиксом?","body_html":"<div class = \"md\"> <p> Я ничего не удалил. Это как третий раз, когда я вижу это обвинение, оно было изобретено на разногласиях с Синтетиксом? </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0dd2yc/","name":"t1_f0dd2yc","created":1568581378,"created_utc":1568552578,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0bghmy","author":"nootropicat","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Да, это на 100% централизовано и залог крайне шаткий, см. Мой старый пост:\nhttps://www.reddit.com/r/ethereum/comments/bzxxv2/synthetix_is_a_disaster_waiting_to_happen_devs/\n\nЧтобы быть справедливым, я позже узнал, что Соединение также централизовано, но по крайней мере их система обеспечения является здоровой.","body_html":"<div class = \"md\"> <p> Да, он на 100% централизован, а залог крайне шаткий, см. мой старый пост: <br/>\n© > </p>\n\n<p> Честно говоря, позже я узнал, что Compound также централизован, но, по крайней мере, его система обеспечения является надежной. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bghmy/","name":"t1_f0bghmy","created":1568555529,"created_utc":1568526729,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":12,"link_id":"t3_d4edxm","id":"f0d55o9","author":"tincho5","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"> Мы неоднократно открыто заявляли, что у нас есть возможность модернизировать систему, включая возможность повторного развертывания контрактов с ** измененными сальдо **.\n\n\"Децентрализованное приложение\" LOL","body_html":"<div class = \"md\"> <blockquote>\n<p> Мы неоднократно открыто заявляли, что у нас есть возможность модернизировать систему, включая возможность повторного развертывания контрактов с <strong> измененными сальдо </strong>. </Р>\n</BLOCKQUOTE>\n\n<p> \"Децентрализованное приложение\" LOL </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0d55o9/","name":"t1_f0d55o9","created":1568578315,"created_utc":1568549515,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":12,"link_id":"t3_d4edxm","id":"f0guasu","author":"Kaiynne","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Более подробный ответ на этот пост можно найти здесь: [https://blog.synthetix.io/addressing-claims-of-deleted-balances/]<span translate = \"no\"> (https: //blog.synthetix .io / адресации-претензии-о-удаленных-остатков /) </ SPAN>","body_html":"<div class = \"md\"> <p> Более подробный ответ на этот пост можно найти здесь: <a href=\"https://blog.synthetix.io/addressing-claims-of-deleted-balances/\"> https://blog.synthetix.io/addressing-claims-of-deleted-balances/ </a> </р>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0guasu/","name":"t1_f0guasu","created":1568635151,"created_utc":1568606351,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":10,"link_id":"t3_d4edxm","replies":[{"ups":6,"link_id":"t3_d4edxm","id":"f0depbq","author":"zakholdsworth","parent_id":"t1_f0c6508","subreddit_id":"t5_2zf9m","body":"Да, но команда никогда не утверждала, что они на 100% децентрализованы. Это ранний проект, и существует компромисс между полной децентрализацией и скоростью. На самом деле это именно тот случай. Если бы команда не двигалась как освещение, чтобы решить эту проблему, вся защита могла бы быть уничтожена.\n\nОни постепенно приближаются к удалению себя из микса, и вы можете видеть, что это происходит через их управляющие вызовы и процесс sip, который они устанавливают, плюс тот факт, что весь их код медленно открывается. На самом деле, я вижу это из первых рук, потому что я работаю над предложением, которое изначально не понравилось основателю, но из-за поддержки сообщества он теперь одобряет и рекомендует мне написать официальное предложение, чтобы сообщество могло голосовать.\n\nЯ на самом деле видел, как тебя уничтожили, и мне показалось, что это было позором, но в то же время я одобрил эту акцию, потому что, как игрок, ты крал деньги прямо у меня, увеличивая мой долг. Это не было похоже на то, что вы просто управляли торгами других людей, вы были лидером оракула.","body_html":"<div class = \"md\"> <p> Да, но команда никогда не утверждала, что они на 100% децентрализованы. Это ранний проект, и существует компромисс между полной децентрализацией и скоростью. На самом деле это именно тот случай. Если бы команда не двигалась как освещение, чтобы решить эту проблему, вся защита могла бы быть уничтожена. </P>\n\n<p> Они медленно приближаются к удалению себя из микса, и вы можете видеть, что это происходит через их управляющие вызовы и процесс sip, который они устанавливают, плюс тот факт, что весь их код медленно открывается с открытым исходным кодом. На самом деле, я вижу это из первых рук, потому что я работаю над предложением, которое изначально не понравилось основателю, но из-за поддержки сообщества он теперь одобряет и рекомендует мне написать официальное предложение, чтобы сообщество могло голосовать. </Р>\n\n<p> Я на самом деле видел, как тебя уничтожили, и мне показалось, что это было позором, но в то же время я одобрил эту акцию, потому что, как игрок, ты крал деньги прямо у меня, увеличивая мой долг. Это не было похоже на то, что вы просто управляли торгами других людей, вы были лидером оракула. ​​</P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0depbq/","name":"t1_f0depbq","created":1568581997,"created_utc":1568553197,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0b56u2","author":"zakholdsworth","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Чувак, разве твой бот не управлял оракулом, когда тебя уничтожили?","body_html":"<div class = \"md\"> <p> Чувак, разве твой бот не управлял оракулом, когда тебя уничтожили? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0b56u2/","name":"t1_f0b56u2","created":1568551433,"created_utc":1568522633,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":8,"link_id":"t3_d4edxm","replies":[{"ups":0,"link_id":"t3_d4edxm","id":"f0ikr1r","author":"creativenauts","parent_id":"t1_f0bkklf","subreddit_id":"t5_2zf9m","body":"хм ... так вы используете централизованный консенсус для петиции за ребрендинг за пределами DeFi для этого проекта? Это звучит как очень \"де\" централизованный подход к тому, чтобы другие придерживались вашей идеологии. ЛОЛ!","body_html":"<div class = \"md\"> <p> хмм ... значит, вы используете централизованный консенсус для петиции за ребрендинг за пределами DeFi для этого проекта? Это звучит как очень \"де\" централизованный подход к тому, чтобы другие придерживались вашей идеологии. LOL! </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ikr1r/","name":"t1_f0ikr1r","created":1568671974,"created_utc":1568643174,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0bgv5k","author":"eddyg987","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"В разделе 2 условий предоставления услуг всем сказано, что они могут вас прокрутить, если захотят, так как они централизованы, они могут это сделать. Моим единственным возражением будет их требование децентрализации, они должны ребрендинг, чтобы открыть финансы.","body_html":"<div class = \"md\"> <p> В разделе 2 условий предоставления услуг всем сказано, что они могут вас прокрутить, если захотят, так как они централизованы, они могут это сделать. Моим единственным возражением будет их требование децентрализации, они должны ребрендинг, чтобы открыть финансы. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bgv5k/","name":"t1_f0bgv5k","created":1568555672,"created_utc":1568526872,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_d4edxm","id":"f0btp1j","author":"Nebuchadrezar","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Вау, черт возьми, синтетик, тогда, независимо от того, чего они добьются в будущем, мы никогда не должны больше использовать их дерьмо","body_html":"<div class = \"md\"> <p> Ничего себе, черт возьми, синтетик, тогда, независимо от того, чего они добьются в будущем, мы никогда не должны больше использовать их дерьмо. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0btp1j/","name":"t1_f0btp1j","created":1568560497,"created_utc":1568531697,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_d4edxm","id":"f0fyg8z","author":"AThoughtPolice","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"На самом деле не так много децентрализовано. Это просто «отправить эти на этот адрес» dApps, и мы обещаем отправить вам больше.","body_html":"<div class = \"md\"> <p> Сейчас немного децентрализовано. Это просто «отправить эти на этот адрес» dApps, и мы обещаем отправить вам больше. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0fyg8z/","name":"t1_f0fyg8z","created":1568619723,"created_utc":1568590923,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":6,"link_id":"t3_d4edxm","replies":[{"ups":2,"link_id":"t3_d4edxm","replies":[{"ups":0,"link_id":"t3_d4edxm","replies":[{"ups":1,"link_id":"t3_d4edxm","id":"f1efjxk","author":"creativenauts","parent_id":"t1_f15d4gs","subreddit_id":"t5_2zf9m","body":"Хватит дурачить себя в угол! Дело не в деньгах для тебя? Хаха! Это забавно, потому что, черт возьми, вы точно не отказались от награды в 30 тысяч долларов, которую вам предложили от команды SNX ... вы явно не в этом ради денег.","body_html":"<div class = \"md\"> <p> Хватит задирать себя в угол! Дело не в деньгах для тебя? Хаха! Это забавно, потому что, черт возьми, вы точно не отказались от награды в 30 тысяч долларов, которую вам предложили от команды SNX ... вы явно не в этом ради денег. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f1efjxk/","name":"t1_f1efjxk","created":1569449870,"created_utc":1569421070,"subreddit_name_prefixed":"r/ethereum","depth":6}],"id":"f0ikk0e","author":"creativenauts","parent_id":"t1_f0enoyn","subreddit_id":"t5_2zf9m","body":"BWAHAHA это смешно ... дело не в деньгах, а в децентрализации. LMFAO !! Хахахахах! Этот подходит!","body_html":"<div class = \"md\"> <p> БАХАХА, это смешно ... дело не в деньгах, а в децентрализации. LMFAO !! Хахахахах! Это хорошо! </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ikk0e/","name":"t1_f0ikk0e","created":1568671896,"created_utc":1568643096,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"f0en0qu","author":"themanndalore","parent_id":"t1_f0e5ht4","subreddit_id":"t5_2zf9m","body":"Таким образом, цель атаки состояла в том, чтобы, насколько это возможно, наглядно атаковать их централизацию и подвергнуть опасности / смущению проект и его основателей. Я бы поспорил с твоей тактикой, но каждому свое. Я не понимаю, как вы тогда доверяли Synthetix (который, как вы знаете, контролирует ваш баланс и, вероятно, не любит вас), за 100 тысяч долларов ...","body_html":"<div class = \"md\"> <p> Таким образом, цель атаки состояла в том, чтобы как можно более наглядно атаковать их централизацию и разоблачить / смущать проект и его основателей. Я бы поспорил с твоей тактикой, но каждому свое. Я не понимаю, как вы тогда доверяли Synthetix (который, как вы знаете, контролирует ваш баланс и, вероятно, не любит вас), за 100 тысяч долларов ... </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0en0qu/","name":"t1_f0en0qu","created":1568599468,"created_utc":1568570668,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0cyjgb","author":"themanndalore","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я думаю, что мне придется обвинить ОП в этом. Похоже, вы знали заранее, что система synthetix была централизованной (глупо тратить столько денег, если вы не заходили так далеко в их коде). Тем не менее, вы должны знать, что он может произвольно изменить ваш баланс в любое время. Если весь смысл состоял в том, чтобы доказать, что они не были децентрализованы, то поблагодарите вас и поблагодарите за то, что показали нам то, что мы уже знали, но если вы в любом случае собираетесь стать членом их системы, вам действительно нужно бежать и получать быстро или прими доброту, которую Кэйн собирается дать тебе.","body_html":"<div class = \"md\"> <p> Я думаю, мне придется винить в этом OP. Похоже, вы знали заранее, что система synthetix была централизованной (глупо тратить столько денег, если вы не заходили так далеко в их коде). Тем не менее, вы должны знать, что он может произвольно изменить ваш баланс в любое время. Если весь смысл состоял в том, чтобы доказать, что они не были децентрализованы, то поблагодарите вас и поблагодарите за то, что показали нам то, что мы уже знали, но если вы в любом случае собираетесь стать членом их системы, вам действительно нужно бежать и получать быстро или прими доброту, которую Кэйн собирается дать тебе. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cyjgb/","name":"t1_f0cyjgb","created":1568575817,"created_utc":1568547017,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":4,"link_id":"t3_d4edxm","replies":[{"ups":0,"link_id":"t3_d4edxm","id":"f0ikb76","author":"creativenauts","parent_id":"t1_f0gf3dw","subreddit_id":"t5_2zf9m","body":"Да! Вы можете вернуть свои средства через суд. Идите вперед и начните процесс, детка! Вы хотите, чтобы весь этот инцидент был публично зарегистрирован в судах! Поверьте мне, это именно то, что вы хотите! Я думаю, что вы можете получить еще больше от этого централизованного казино, если получите правильный юридический совет.\n\nПожалуйста, дайте нам знать, когда вы начнете судопроизводство!","body_html":"<div class = \"md\"> <p> Да! Вы можете вернуть свои средства через суд. Идите вперед и начните процесс, детка! Вы хотите, чтобы весь этот инцидент был публично зарегистрирован в судах! Поверьте мне, это именно то, что вы хотите! Я думаю, что вы можете получить еще больше от этого централизованного казино, если получите правильный юридический совет. </P>\n\n<p> Пожалуйста, дайте нам знать, когда вы начнете судиться с судебным разбирательством! </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ikb76/","name":"t1_f0ikb76","created":1568671796,"created_utc":1568642996,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0ezfrl","author":"ThudnerChunky","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Таким образом, Synthetix совершил преступление. Передний запуск пользователя с изменением платы может рассматриваться как кража, есть ли у него что-то в их TOS, что говорит, что он может сделать это?","body_html":"<div class = \"md\"> <p> Synthetix, возможно, совершил преступление, совершив это. Передний запуск пользователя с изменением платы может рассматриваться как кража, есть ли у него что-то в их TOS, что говорит, что он может сделать это? </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ezfrl/","name":"t1_f0ezfrl","created":1568604586,"created_utc":1568575786,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0bq902","author":"cryptowank","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Соединение довольно централизовано, если вы спросите меня.","body_html":"<div class = \"md\"> <p> Соединение довольно централизовано, если вы спросите меня. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bq902/","name":"t1_f0bq902","created":1568559244,"created_utc":1568530444,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":3,"link_id":"t3_d4edxm","replies":[{"ups":0,"link_id":"t3_d4edxm","id":"f0ijquv","author":"creativenauts","parent_id":"t1_f0e5qc9","subreddit_id":"t5_2zf9m","body":"Фигня. В «реальной» физической жизни тебя били за то, что ты сделал, братан. У вас будут федералы, которые будут пинать вашу дверь, заворачивать ваше хрупкое тело, как крендель, и бросать вас в тюрьму с настоящими мужчинами, которые покажут вам, что такое децентрализованные финансы, вымогая у вас и вашей семьи все деньги, которые они могут получить. Ты панк, братан, это так просто. Вы здесь плачете, как маленькая сука: «Бу-ху, посмотри на меня, посмотри на то, что они сделали с моим балансом…», как задница, маленькая централизованная плебофильная крэка.","body_html":"<div class = \"md\"> <p> Чушь собачья. В «реальной» физической жизни тебя били за то, что ты сделал, братан. У вас будут федералы, которые будут пинать вашу дверь, заворачивать ваше хрупкое тело, как крендель, и бросать вас в тюрьму с настоящими мужчинами, которые покажут вам, что такое децентрализованные финансы, вымогая у вас и вашей семьи все деньги, которые они могут получить. Ты панк, братан, это так просто. Вы здесь плачете, как маленькая сука: «Бу-ху, посмотри на меня, посмотри, что они сделали с моим балансом…», как задница, маленькая централизованная плебофильная крэка. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ijquv/","name":"t1_f0ijquv","created":1568671560,"created_utc":1568642760,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0cn8t7","author":"ArthurC92","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Звучит так, как будто вы получили 40кг за вознаграждение после неоднократного злонамеренного нападения на систему и ее использования, и вы почувствовали вкус механизма фронтальной защиты.\n\nЧем это отличается от условий сглаживания, налагаемых доказательством кола, когда вредоносные узлы, атакующие сеть, удаляются?\n\nВолк плачет о помощи здесь?","body_html":"<div class = \"md\"> <p> Звучит так, как будто вы получили 40 000 наград после неоднократного злонамеренного нападения на систему и ее использования, и вы почувствовали вкус механизма фронтальной защиты. </Р>\n\n<p> Чем это отличается от условий сокращения, налагаемых доказательством кола, когда вредоносные узлы, атакующие сеть, подвергаются сокращению? </p>\n\n<p> Волк плачет о помощи здесь? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cn8t7/","name":"t1_f0cn8t7","created":1568571437,"created_utc":1568542637,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":3,"link_id":"t3_d4edxm","replies":[{"ups":4,"link_id":"t3_d4edxm","id":"f0efmhc","author":"Suitguy2017","parent_id":"t1_f0ea2lc","subreddit_id":"t5_2zf9m","body":"1) Итак, есть ли эксплуатируемое отставание от обновления Oracle до их системы? УХ ТЫ. Если это задержка эфириума, DEFI необходимо перейти к более быстрой сети.\n\n2) Как из-за того, что они делают вашу транзакцию, вы теряете деньги? Разве они не совершают транзакцию вместо вас?\n\nЧасть об их второй транзакции ниже вашей звучит как часть, которую я не понимаю.\n\nСпасибо за объяснение.","body_html":"<div class = \"md\"> <p> 1) Значит, существует задержка при использовании обновления оракула в их системе? УХ ТЫ. Если это задержка эфириума, DEFI необходимо перейти на более быструю сеть. </P>\n\n<p> 2) Как из-за того, что они сгруппировали вашу транзакцию, вы потеряли деньги? Разве они не совершают транзакцию вместо вас? </P>\n\n<p> Часть об их второй транзакции ниже вашей звучит как часть, которую я не понимаю. </Р>\n\n<p> Спасибо за объяснение. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0efmhc/","name":"t1_f0efmhc","created":1568596445,"created_utc":1568567645,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0e44i6","author":"Suitguy2017","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Могу ли я получить ELI5 для этой атаки?\n\nЯ считаю, что контратаки они только что увеличили сборы до 99%? Как это повлияло только на Оникса, а не на всех остальных?","body_html":"<div class = \"md\"> <p> Могу ли я получить ELI5 для этой фронтальной атаки? </p>\n\n<p> Я полагаю, что для контратаки они просто увеличили сборы до 99%? Как это повлияло только на Оникса, а не на всех остальных? </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0e44i6/","name":"t1_f0e44i6","created":1568591700,"created_utc":1568562900,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_d4edxm","id":"f0bpmah","author":"ssg691","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"если они снизили цену на синтезатор, как они заставили вас торговать этим более низким синтезом?","body_html":"<div class = \"md\"> <p> если они снизили цену на синтезатор, как они заставили вас торговать этим более низким синтезатором? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0bpmah/","name":"t1_f0bpmah","created":1568559007,"created_utc":1568530207,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":2,"link_id":"t3_d4edxm","id":"f0dcbfb","author":"scott_lew_is","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"кажется очень разумным, что у них есть защитные ограждения, чтобы люди не могли украсть все деньги.\n\nэто новый продукт в новом пространстве, и я не думаю, что они лгали об их способности обновить контракт.\n\nЯ не уверен, что здесь есть что-то действительно противоречивое.","body_html":"<div class = \"md\"> <p> кажется очень разумным, что у них есть защитные ограждения, чтобы люди не могли украсть все деньги. </p>\n\n<p> это новый продукт в новом пространстве, и я не думаю, что они соврали об их способности обновить контракт. </p>\n\n<p> Я не уверен, что здесь есть что-то <em> на самом деле </em> противоречивое. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0dcbfb/","name":"t1_f0dcbfb","created":1568581091,"created_utc":1568552291,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0dqgxt","author":"Limzero","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Как честно удалить чей-либо баланс с использованием произвольных аргументов в DeFi?","body_html":"<div class = \"md\"> <p> Как честно удалить чей-либо баланс с использованием произвольных аргументов в DeFi? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0dqgxt/","name":"t1_f0dqgxt","created":1568586198,"created_utc":1568557398,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0e2509","author":"creative__username","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"ЗА","body_html":"<div class = \"md\"> <pre> <code> ZA\n</Код> </PRE>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0e2509/","name":"t1_f0e2509","created":1568590930,"created_utc":1568562130,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0fj55r","author":"notsogreedy","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Протокол ETH частично децентрализован.\nВсе остальное централизовано.","body_html":"<div class = \"md\"> <p> Протокол ETH частично децентрализован. <br/>\nВсе остальное централизовано. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0fj55r/","name":"t1_f0fj55r","created":1568612991,"created_utc":1568584191,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","replies":[{"ups":2,"link_id":"t3_d4edxm","id":"f0ij0wz","author":"creativenauts","parent_id":"t1_f0hi287","subreddit_id":"t5_2zf9m","body":"Почему вы пытаетесь нанести вред всем владельцам сумок SNX, создав эту провальную кампанию фуда? Зачем кому-то с полусознательным делать то, что вы делаете здесь, зная, что это может привести к материальному ущербу в этом процессе? Вы звучите очень эгоистично здесь ... LOL RECT CRAKA","body_html":"<div class = \"md\"> <p> Почему вы пытаетесь нанести вред всем владельцам сумок SNX, создав эту провальную кампанию по подделке? Зачем кому-то с полусознательным делать то, что вы делаете здесь, зная, что это может привести к материальному ущербу в этом процессе? Вы звучите очень мотивировано здесь ... LOL RECT CRAKA </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ij0wz/","name":"t1_f0ij0wz","created":1568671261,"created_utc":1568642461,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":1,"link_id":"t3_d4edxm","id":"f0hkbwe","author":"Notabene18","parent_id":"t1_f0hi287","subreddit_id":"t5_2zf9m","body":"Дай - синтетическое представление доллара США, не так ли?","body_html":"<div class = \"md\"> <p> Dai - это синтетическое представление доллара США, нет? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0hkbwe/","name":"t1_f0hkbwe","created":1568653014,"created_utc":1568624214,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0h4a18","author":"Notabene18","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Понятно, каковы намерения u / onyx_rogue, и они на самом деле имеют отношение к чему-то, почти полностью касающемуся инцидента с фронтальным управлением: «Моя цель - разоблачить их, потому что команда синтезаторов пытается [подкупить] <span translate =\" no \" > (https://blog.synthetix.io/win-1000-snx-by-voting-for-susd-in-compounds-vote/) </ span>, чтобы быть на Соединении. \"\n\nРоуг, вы рассказываете об этом инциденте в качестве предлога для того, чтобы попробовать себя в Synthetix, поскольку в DeFi он превращается в один из крупнейших проектов Total Value Locked.\n\nЯвляется ли это чистым совпадением, что это старое политическое нападение на предполагаемое отсутствие децентрализации - заявление, которое в основном является фуражом для ленивых журналистов, таких как взломщики в The Block, ищущих дешевый, взрывоопасный заголовок, - перефразирует прямо как [Эфир как залог]  (https://github.com/Synthetixio/synthetix/issues/232)  завоевывает популярность среди членов сообщества SNX?\n\nВозможно ли, что команда MakerDOA находится в полном режиме, в режиме прошлой паники, в режиме выжигания в мире в результате очень компетентного конкурента, приближающегося к его пятам, чтобы чеканить стабильные монеты децентрализованным способом, за исключением того, что SNX's модель более масштабируема с учетом спроса на рынке?\n\nНе обманывай себя / onyx_rogue, твои цвета проявляются.","body_html":"<div class = \"md\"> <p> Ясно, каковы намерения <a href=\"/u/onyx_rogue\"> u / onyx_rogue </a>, и они на самом деле имеют отношение к чему-то, почти полностью касающемуся передовой инцидент: «Моя цель в том, чтобы разоблачить их, потому что команда синтезаторов пытается <a href =» https://blog.synthetix.io/win-1000-snx-by-voting-for-susd-in-compounds -vote / \"> подкупить </a> их путь к Соединению.\" </Р>\n\n<p> Роуг, вы рассказываете об этом инциденте в качестве предлога, чтобы сделать снимок в Synthetix, когда он превращается в DeFi в один из крупнейших проектов Total Value Locked. </p>\n\n<p> Является ли это чистым совпадением, что это старое политическое нападение на предполагаемое отсутствие децентрализации - требование, которое в основном является фуражом для ленивых журналистов, таких как взломщики в The Block, ищущих дешевый, взрывоопасный заголовок, - всплывает как <a href = \"https://github.com/Synthetixio/synthetix/issues/232\"> Еще как залог </a> получает поддержку со стороны сообщества SNX? </p>\n\n<p> Возможно ли, что команда MakerDOA находится в полном режиме, в режиме прошлой паники, в режиме сгоревшего мира в результате того, что очень компетентный конкурент приближается к нему по пятам, чтобы чеканить стабильные монеты децентрализованным способом, разве что модель SNX более масштабируема с учетом рыночного спроса? </Р>\n\n<p> Не обманывайтесь <a href=\"/u/onyx_rogue\"> u / onyx_rogue </a>, ваши цвета проявляются. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0h4a18/","name":"t1_f0h4a18","created":1568641399,"created_utc":1568612599,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0ihhyw","author":"creativenauts","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"эй ... я сейчас в библиотеке, пользуюсь наиболее централизованным интернетом, который я мог найти в надежде, что боги мошенничества заметят мои действия и критически заметят, насколько децентрализована эта вечеринка SNX!\n\nВы говорите как дикарь, когда дело доходит до торговли ботами ... один большой вопрос, который я должен задать, почему вы не использовали эту же тактику на традиционных рынках и не получили сверхмегаплатежей, а не трахались с этими другими централизованными сервисами, предназначенными для плебофилов ? Я думаю, что знаю почему, и я дам всем подсказку ... ЭТО НЕЗАКОННО! ЛОЛ! REKT!\n\nВы, децентрализованные плебофилы, подгоните меня своей терминологией модного слова! Ничто в этом пространстве не является децентрализованным, ненадежным, цензурным, нереальным и т. Д. Вы все живете в каком-то фэнтезийном мире, кричащем о децентрализации при использовании множества \"централизованных\" услуг! ЛОЛ! РЕКТ КРЕКЕРЫ!\n\nМораль этой истории заключается в том, что этот взломщик стал жадным до чертиков, а затем получил Комптона, которого ударил Факеталик (лидер каина централизованного казино под названием SNX), и теперь он плачет, пытаясь создать фальшивую кампанию, чтобы вернуть этот проект к рект-ценам.\n\nОнкси не заботится ни о ком, кроме себя, и создание этого поста спустя месяцы после инцидента показывает, насколько ректом является этот плебофил на самом деле. Этот взломщик хочет навредить многим людям, которые держат мешки с этим дерьмом, создавая этот парад фудов, потому что это и есть децентрализация! Когда ваши идеологии будут разбиты, что может быть лучше, если вы попытаетесь ректировать всех других держателей сумок, чтобы они чувствовали вашу боль.\n\nCracka!","body_html":"<div class = \"md\"> <p> эй ... я сейчас в библиотеке, использую наиболее централизованный интернет, который я мог найти в надежде, что боги фуда примут к сведению мои действия и критически отнесутся к тому, насколько децентрализован эта вечеринка SNX действительно есть! </p>\n\n<p> Вы говорите как дикарь, когда дело доходит до торговли ботами ... один большой вопрос, который я должен задать, почему вы не использовали эту же тактику на традиционных рынках и не получили сверхмегаплатежей вместо того, чтобы трахаться с этими другими централизованными сервисами предназначен для плебофилов? Я думаю, что знаю почему, и я дам всем подсказку ... ЭТО НЕЗАКОННО! ЛОЛ! REKT! </P>\n\n<p> Вы, децентрализованные плебофилы, взбодрите меня своей модной лексикой! Ничто в этом пространстве не является децентрализованным, ненадежным, цензурным, нереальным и т. Д. Вы все живете в каком-то фэнтезийном мире, кричащем о децентрализации при использовании множества \"централизованных\" услуг! ЛОЛ! РЕКТ КРЕКЕРЫ! </P>\n\n<p> Мораль этой истории заключается в том, что этот взломщик стал жадным до чертиков, а затем получил Комптона похлопывания от Факеталика (лидера Kain централизованного казино под названием SNX), и теперь он плачет, пытаясь создать фальшивую кампанию, чтобы вернуть этот проект к рект-ценам. </р>\n\n<p> Онкси не заботится ни о ком, кроме себя, и создание этого поста спустя месяцы после инцидента показывает, насколько ректом является этот плебофил на самом деле. Этот взломщик хочет навредить многим людям, которые держат мешки с этим дерьмом, создавая этот парад фудов, потому что это и есть децентрализация! Когда ваши идеологии будут разбиты, что может быть лучше, если вы попытаетесь ректировать всех остальных держателей сумок, чтобы они чувствовали вашу боль. </P>\n\n<Р> Cracka! </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0ihhyw/","name":"t1_f0ihhyw","created":1568670621,"created_utc":1568641821,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":1,"link_id":"t3_d4edxm","id":"f0kbonh","author":"jpobfilm","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"OP был бы в тюрьме, если бы он сделал то, что он сделал здесь в реальном мире. И все же SNX платит ему. Люди должны проснуться.","body_html":"<div class = \"md\"> <p> OP был бы в тюрьме, если бы он сделал то, что сделал здесь в реальном мире. И все же SNX платит ему. Люди должны проснуться. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0kbonh/","name":"t1_f0kbonh","created":1568704214,"created_utc":1568675414,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":0,"link_id":"t3_d4edxm","replies":[{"ups":1,"link_id":"t3_d4edxm","id":"f0br9ki","author":"defistyle","parent_id":"t1_f0bnhl9","subreddit_id":"t5_2zf9m","body":"Какой у тебя гитхуб?","body_html":"<div class = \"md\"> <p> Какой у тебя github? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0br9ki/","name":"t1_f0br9ki","created":1568559617,"created_utc":1568530817,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":1,"link_id":"t3_d4edxm","replies":[{"ups":10,"link_id":"t3_d4edxm","id":"f0cpu7q","author":"18lucky17","parent_id":"t1_f0ckcbl","subreddit_id":"t5_2zf9m","body":"Круто определенно начинается с вашего комментария с ребенком.","body_html":"<div class = \"md\"> <p> Круто, конечно, начать свой комментарий с ребенком. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cpu7q/","name":"t1_f0cpu7q","created":1568572426,"created_utc":1568543626,"subreddit_name_prefixed":"r/ethereum","depth":4},{"ups":1,"link_id":"t3_d4edxm","replies":[{"ups":1,"link_id":"t3_d4edxm","replies":[{"ups":1,"link_id":"t3_d4edxm","id":"f0nz7ht","author":"cypher437","parent_id":"t1_f0gwkym","subreddit_id":"t5_2zf9m","body":"Я Боже, у меня никогда не будет бриллианта, я не буду жениться или покупать дом. Мы отворачиваемся от старого мира, покупаем тосты с крипто и авокадо. Я не хожу в колледж, я использую видео, и люди в Интернете учат меня.","body_html":"<div class = \"md\"> <p> Я - генз Я никогда не буду владеть бриллиантом, я не буду жениться или покупать дом. Мы отворачиваемся от старого мира, покупаем тосты с крипто и авокадо. Я не хожу в колледж, я использую видео, и люди в Интернете учат меня. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0nz7ht/","name":"t1_f0nz7ht","created":1568815526,"created_utc":1568786726,"subreddit_name_prefixed":"r/ethereum","depth":8}],"id":"f0gs8zs","author":"cypher437","parent_id":"t1_f0d31t9","subreddit_id":"t5_2zf9m","body":"Попс, алмазные ограбления это круто.","body_html":"<div class = \"md\"> <p> Попсы, кражи бриллиантов - это круто. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0gs8zs/","name":"t1_f0gs8zs","created":1568634010,"created_utc":1568605210,"subreddit_name_prefixed":"r/ethereum","depth":6}],"id":"f0cxeql","author":"cypher437","parent_id":"t1_f0ckcbl","subreddit_id":"t5_2zf9m","body":"Я знаю, что это круто.","body_html":"<div class = \"md\"> <p> Я знаю, что такое крутой попс. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cxeql/","name":"t1_f0cxeql","created":1568575386,"created_utc":1568546586,"subreddit_name_prefixed":"r/ethereum","depth":4}],"id":"f0brxna","author":"cypher437","parent_id":"t1_f0bnhl9","subreddit_id":"t5_2zf9m","body":"Я хочу быть крутым и учиться таким вещам","body_html":"<div class = \"md\"> <p> Я хочу быть крутым и изучать подобные вещи </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0brxna/","name":"t1_f0brxna","created":1568559859,"created_utc":1568531059,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0blrk4","author":"cypher437","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"ты можешь научить меня взломать?","body_html":"<div class = \"md\"> <p> вы можете научить меня, как взломать? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0blrk4/","name":"t1_f0blrk4","created":1568557548,"created_utc":1568528748,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":0,"link_id":"t3_d4edxm","id":"f0f559a","author":"boonroop","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"что за хрен синтетический эт? эт вилка?","body_html":"<div class = \"md\"> <p> что за хрень синтетическая Eth? эт вилка? </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0f559a/","name":"t1_f0f559a","created":1568606901,"created_utc":1568578101,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":-1,"link_id":"t3_d4edxm","id":"f0cdoga","author":"mustbemoney","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я в ужасе","body_html":"<div class = \"md\"> <p> Я потрясен. </p>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0cdoga/","name":"t1_f0cdoga","created":1568567862,"created_utc":1568539062,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":-1,"link_id":"t3_d4edxm","id":"f0eijkz","author":"jhuy5207","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Оба парня не правы здесь ИМО. Вы продолжали атаковать как месть, и у Synthetix (они были Хаввеном?) Есть возможность сделать это. Это не должно принадлежать крипто.","body_html":"<div class = \"md\"> <p> Оба парня ошибаются здесь, ИМО. Вы продолжали атаковать как месть, и у Synthetix (они были Хаввеном?) Есть возможность сделать это. Это не должно принадлежать крипто. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0eijkz/","name":"t1_f0eijkz","created":1568597763,"created_utc":1568568963,"subreddit_name_prefixed":"r/ethereum","depth":0},{"ups":-25,"link_id":"t3_d4edxm","replies":[{"ups":3,"link_id":"t3_d4edxm","id":"f0b6pl0","author":"zakholdsworth","parent_id":"t1_f0b5981","subreddit_id":"t5_2zf9m","body":"Да, но если бы команда не внедрила решение для вашего фронта атаки, вы и другие буквально убили бы систему. Команда действовала от имени сообщества, которое действительно хотело найти решение для фронта атаки, и оно было реализовано быстро.","body_html":"<div class = \"md\"> <p> Да, но если бы команда не внедрила решение для вашего фронта атаки, вы и другие буквально убили бы систему. Команда действовала от имени сообщества, которое действительно хотело найти решение для фронта атаки, и оно было реализовано быстро. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0b6pl0/","name":"t1_f0b6pl0","created":1568551958,"created_utc":1568523158,"subreddit_name_prefixed":"r/ethereum","depth":2},{"ups":-1,"link_id":"t3_d4edxm","id":"f0b7d6b","author":"iamvapist","parent_id":"t1_f0b5981","subreddit_id":"t5_2zf9m","body":"Что ж, благодаря вам он более или менее защищен до конца года, когда перейдет к оракулам Chainlink. И я согласен с вами инвестировать только в тот проект, в который вы верите.","body_html":"<div class = \"md\"> <p> Что ж, благодаря вам он более или менее защищен до конца года, когда перейдет к оракулам Chainlink. И я согласен с вами инвестировать только в тот проект, в который вы верите. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0b7d6b/","name":"t1_f0b7d6b","created":1568552178,"created_utc":1568523378,"subreddit_name_prefixed":"r/ethereum","depth":2}],"id":"f0b31ji","author":"iamvapist","parent_id":"t3_d4edxm","subreddit_id":"t5_2zf9m","body":"Я действительно счастлив, что команда смогла уничтожить вашу прибыль, взимая плату в размере 99%. Ваш бот не зарабатывал деньги на законных торгах. Вы зарабатывали деньги, подставляя других трейдеров, и брали деньги с их сделок в свой карман. Еще одна вещь о разрушении системы. Команда согласилась выплатить вам награду за успешное использование ошибки Oracle. В любом случае вы не сможете обналичить миллиарды долларов, которые вы «заработали». Я знаю, что вы соленый, потому что Synthetix сейчас в топ-80 и занимает второе место в Uniswap.","body_html":"<div class = \"md\"> <p> Я действительно счастлив, что команда смогла уничтожить вашу прибыль, взимая плату в размере 99%. Ваш бот не зарабатывал деньги на законных торгах. Вы зарабатывали деньги, подставляя других трейдеров, и брали деньги с их сделок в свой карман. Еще одна вещь о разрушении системы. Команда согласилась выплатить вам награду за успешное использование ошибки Oracle. В любом случае вы не сможете обналичить миллиарды долларов, которые вы «заработали». Я знаю, что вы соленый, потому что Synthetix сейчас в топ-80 со вторым по величине пулом в Uniswap. </P>\n</DIV>","permalink":"/r/ethereum/comments/d4edxm/the_synthetix_dapp_deleted_my_balance/f0b31ji/","name":"t1_f0b31ji","created":1568550703,"created_utc":1568521903,"subreddit_name_prefixed":"r/ethereum","depth":0}]}