{"subreddit":{"display_name":"ethereum"},"subreddit_loc":"Эфириума","selftext":"Поэтому я заявляю, что я из сообщества Streamr, но это приложение было создано командой из их более широкой экосистемы (около 20 разработчиков и продолжает расти) - и это действительно потрясающе.\n\nРазработчики Streamr создали общую инфраструктуру, позволяющую отдельным пользователям монетизировать свои данные. Как известно, эта инфраструктура существует только для продажи данных b2b. (Вспомните Bloomberg или Thomson Reuters). Но не для людей. Если вы хотите продать свои данные, вы должны скачать все это и продать на eBay. Вот где мы находимся в 2019 году. Отсутствие инфраструктуры для монетизации своих данных является основной причиной, по которой мы живем в обществе Panopticon, в котором мы сейчас живем. Физические лица не имеют права собственности на свои данные, следовательно, не имеют денег, никакой конфиденциальности, никакого уважения и никакой власти. Мы все информационные рабы.\n\n[Swash app]  (http://swashapp.io)  - это первое (но ни в коем случае не единственное) приложение, которое будет построено поверх инфраструктуры Streamr. На прошлой неделе это было продемонстрировано в Мозфесте. Первая версия Swash теперь [доступна только для пользователей Firefox]  (https://addons.mozilla.org/en-US/firefox/addon/swash/) . (Версии Chrome, Brave и Edge появятся очень скоро, насколько я понимаю).\n\n[Соучредитель Streamr Анри Пихкала, демонстрирующий Swash и Data Unions в Мозфесте, октябрь 2019 г.] <span translate = \"no\"> (https://preview.redd.it/6nlzu80m9fw31.jpg?width=4032&format=pjpg&auto=webp&s = 52ce4b674d7d3da882d24cb2bab29e24423e341b) </ SPAN>\n\nТак что же делает Swash? В основном вы можете заработать криптографию для своего просмотра и социальных сетей. Пользователи просто устанавливают плагин для браузера, настраивают свои параметры конфиденциальности, а затем через плагин Swash вы и все остальные, кто является оператором Swash, отправляют данные, которые вы хотите агрегировать, в пожарную базу данных на [Marketplace Marketplace] <span translate = \"нет\"> (https://streamr.network/marketplace) </ SPAN>. Streamr называет это объединением данных.\n\nЗачем собирать данные в пожарный шланг? Потому что сами по себе ваши данные имеют небольшую ценность. Но объедините это с другими в Data Union, и вы получите мощную коллективную власть для получения дохода для каждого участника и формирования будущего любой данной экосистемы данных.\n\nКогда эти данные будут проданы покупателям (все эти транзакции записаны в блокчейне Ethereum), каждый получает часть денег, которая распределяется по смарт-контракту, а НЕ через централизованного поставщика. Вот почему вся настройка Streamr отличается от таких проектов, как Wibson. Это без разрешения и (в значительной степени) децентрализовано.\n\nИллюстратор Мэгги Эпплтон полюбила увиденное и нарисовала это. (Спасибо, Мэгги!).\n\n[Иллюстратор Мэгги Эпплтон полюбил Data Unions и нарисовал это, чтобы помочь объяснить все это.] <Span translate = \"no\"> (https://preview.redd.it/b2iw77fb9fw31.png?width=3220&format=png&auto=webp&s=fbb3fcabff966304305b264) 2). </ SPAN>\n\nКраткое упоминание о том, что происходит на уровне 0 Streamr. P2p-сеть Streamr является базовой инфраструктурой, обеспечивающей агрегацию и передачу данных для таких приложений, как Swash. Чтобы любой разработчик мог легко создать объединение данных для своих пользователей, Streamr [выпустил свой моноплазменный платеж]  (https://www.coindesk.com/ethereum-scaling-tech- Решение monoplasma-want-to-let-dapps-broadcast-crypto)  для эффективной обработки микроплатежей один-ко-многим в феврале этого года. По сути, это сделало возможным, чтобы поток данных состоял из сотен тысяч, если не миллионов пользователей, при этом все еще наслаждаясь преимуществами, предлагаемыми децентрализованными технологиями.\n\nПонятие краудселинга данных является новым, но его последствия заключаются в том, что они обеспечивают шаг к владению данными и улучшают права пользователей. Это также середина между тем, чтобы слепо предлагать его бесплатно крупным технологиям в обмен на доступ к их услугам, и представлять себе будущее, в котором данные вообще не передаются. Вы можете встретиться с командой за плагином и узнать больше об их мотивации и амбициях для Swash в этом видео.\n\n[Swash - первое в мире объединение данных!] <Span translate = \"no\"> (https://reddit.com/link/dqxfay/video/ydsigpb5ffw31/player) </ span>\n\nТак будет ли Swash убийцей приложения Эфириума? Что ж, общепринятые разговоры о данных никогда не были такими яркими, а ненависть к централизованным гигантам данных, таким как Facebook, никогда не была такой сильной. Это приложение позиционирует себя как решение многих проблем в этом разговоре. И потому, что его так легко использовать с криптографической точки зрения - без регистрации / KYC и т. Д. - и поскольку он фактически приносит вам деньги из законного источника, у него есть все шансы получить более нескольких тысяч пользователей. Конечно, Swash (и фактически первая версия Streamr их базовой инфраструктуры) не запускается до марта 2020 года. До этого момента я ожидал, что первые 50 пользователей Swash превратятся в очень здоровый поток первых пользователей.","title":"Приложение убийцы Эфириума? Похоже, экосистема разработчиков Streamr просто создала что-то с огромной аудиторией ...","subreddit_name_prefixed":"r/ethereum","ups":182,"created":1572796274,"link_flair_background_color":"","id":"dqxfay","author":{"name":"smmblue"},"permalink":"/r/ethereum/comments/dqxfay/ethereums_killer_app_looks_like_streamrs/","url":"https://www.reddit.com/r/ethereum/comments/dqxfay/ethereums_killer_app_looks_like_streamrs/","created_utc":1572767474}