{"subreddit":{"display_name":"sciences"},"subreddit_loc":"науки","selftext":"Дезинформация:\n\n* https://old.reddit.com/r/Futurology/comments/aauu83/young_children_are_not_being_exposed_to_microbes/\n\n* https://old.reddit.com/r/EverythingScience/comments/aauu9s/young_children_are_not_being_exposed_to_microbes/\n\n\n\nСчетчик:\n\nhttps://medium.com/@MaximilianKohler/do-not-eat-dirt-63b5d04bf4ca\n\n---\n\n\n\nДезинформация вредна во многих отношениях. Если вы видите это, вы обязаны остановить его распространение.\n\n---\n\n** РЕДАКТИРОВАТЬ **: Вот резюме:\n\nОдна из интерпретаций гигиенической гипотезы заключается в том, что из-за более высоких стандартов гигиены отсутствует воздействие на окружающую среду микробов, и это отсутствие воздействия является корнем проблем. В тех ссылках / субтитрах, где обсуждалась статья, 99% людей были согласны с этим и высказывали мнение о том, что они предлагают все виды плохой гигиены, включая употребление грязи.\n\nТеперь это чрезвычайно проблематично, потому что это полное неправильное толкование литературы. Литература поддерживает антибиотики как одну из основных причин. Таким образом, плохое гигиеническое поведение совершенно противоречиво и приведет к еще большему использованию антибиотиков. Это также проблематично, поскольку полностью игнорирует реальные проблемы (антибиотики, неправильное питание, отсутствие грудного вскармливания и нездоровые люди, имеющие детей), и вместо этого предлагает людям простое и ужасно неправильное решение, а именно плохую гигиену.\n\nЛюдям нравятся простые люди, и поэтому тысячи людей пожирают это и распространяют опасную дезинформацию.","title":"Вчера была популярная статья, которая распространяла опасную дезинформацию среди тысяч людей. Ни один из комментаторов не был достаточно осведомлен, чтобы противостоять этому, и вместо этого только укрепил это.","subreddit_name_prefixed":"r/sciences","ups":32,"created":1546296322,"link_flair_background_color":"","id":"ab7ozi","author":{"name":"MaximilianKohler"},"permalink":"/r/sciences/comments/ab7ozi/there_was_a_popular_article_yesterday_that_spread/","url":"https://www.reddit.com/r/sciences/comments/ab7ozi/there_was_a_popular_article_yesterday_that_spread/","created_utc":1546267522}