{"subreddit":{"display_name":"sciences"},"subreddit_loc":"науки","selftext":"Для меня р / науки начинался как страстный проект. Но я начинаю думать, что это может стать началом чего-то действительно особенного. Путь от менее 300 подписчиков до более 30000 менее чем за год - это удивительно. И много говорит об этом сообществе и желании - может быть, даже необходимости - найти лучшие способы поговорить о науке в Reddit.\n\nТеперь, когда у нас 30 000 подписчиков, я подумал, что стоит пересмотреть то, о чем я думал, когда делал этот саб. В то время я был модом в r / science. Но я становился все более и более недовольным тем, как о науке говорили и изображали на крупнейшем научном субреддите Reddit. Мне казалось, что правление становится устаревшим: оно переполнено некритическими университетскими пресс-релизами и политикой, маскирующейся под науку. И некоторые из самых интересных, новаторских исследований фактически формально не допускались из-за правила «рецензирования». Разделы с комментариями тоже были не намного лучше - везде были удалены комментарии, и многие из них были довольно подозрительными.\n\nНаучное общение всегда было моей страстью. Я наблюдал снижение интереса к науке (это делало первую полосу реже, комментарии становились все более пессимистичными), и это меня очень расстраивало.\n\nКак и многие изобретения, я думаю, что научные исследования начинались с разочарования в статус-кво. Я хотел, чтобы сабвуфер помог вернуть жизнь в разговоры о науке. Потому что, честно говоря, я думаю, что наука офигенная. Возможно, лучшее, что люди когда-либо делали.\n\n* Так как у нас дела? *\n\nДо сих пор я думаю, что этот эксперимент имел большой успех. Я думаю, что мы нашли способ доставить потрясающий контент [как это] (https://www.reddit.com/r/sciences/comments/aogzvt/genetically_modified_tcells_hunting_down_and/) [или это] (https: //www.reddit. ru / r / Sciences / comments / ahxdun / spider_hauls_a_shell_into_a_tree_to_use_for /) [или это] (https://www.reddit.com/r/sciences/comments/aldub7/yesterday_a_series_of_stories_ran_in_major_news/ https://www./) reddit.com/r/sciences/comments/9lmum5/boy_treated_with_experimental_gene_therapy_for/) снова на первую страницу. И это удивительно!\n\n* Есть вещи, которые мы можем сделать лучше? *\n\nЯ думаю так! В дополнение к продолжению роста этого сообщества, я надеюсь, что мы сможем найти способы привлечь больше экспертов в данной области, чтобы поделиться своими увлечениями. У нас есть большой список завсегдатаев - специальностей от медицины до экологии - которые делятся своими знаниями. Я бы хотел привлечь больше таких людей. Это, вероятно, будет одним из моих главных приоритетов на 2019 год.\n\n* Конец мысли *\n\nВы все великолепны. Действительно. Продолжайте в том же духе и не бойтесь сообщить нам, когда вы думаете, что мы можем добиться большего.\n\nУра - и поздравляю по 30к!","title":"30 000 подписчиков! Самый быстрорастущий научный субреддит. Лучшее сообщество. Отличная работа всем!","subreddit_name_prefixed":"r/sciences","ups":38,"created":1549843253,"link_flair_background_color":"","id":"ap55zk","author":{"name":"SirT6"},"permalink":"/r/sciences/comments/ap55zk/30000_subscribers_fastest_growing_science/","url":"https://www.reddit.com/r/sciences/comments/ap55zk/30000_subscribers_fastest_growing_science/","created_utc":1549814453}