{"subreddit":{"display_name":"sciences"},"subreddit_loc":"науки","selftext":"Одна из наиболее интересных историй для меня, возникшая из [гипотезы гигиены] (https://en.wikipedia.org/wiki/Hygiene_hypothesis), - это загадка витамина B12 в связи с ростом [западного веганства] (https: / /www.medicalnewstoday.com/articles/320524.php).\n\n«Проблема» с веганством заключается в том, что витамин B12 редко встречается в растениях, а B12 является незаменимым витамином для человека, особенно для неврологического здоровья.\n\nЗагадка в том, что мы можем получить его из мяса. Это может не показаться загадкой, пока вы не спросите себя, как животное, такое как корова (которое обязательно даст вам В12), получает необходимый витамин? Ответ, безусловно, должен прийти из его рациона - но коровы ... * веганы *.\n\nОказывается, что коровы и другие ** жвачные животные ** (термин для животных с множественным желудком) получают витамин B12 из [кишечных бактерий] (https://www.dsm.com/markets/anh/en_US/Compendium/). жвачные / vitamin_B12.html). Они потребляют большое количество растительного вещества, которое находится в первом желудке, и ферментируют с помощью микроорганизма, обладающего биосинтетической способностью продуцировать B12, который затем абсорбируется через слизистую оболочку кишечника. Мы всеядные тогда можем получить наш B12 из этого источника.\n\n** Там, где загадка сгущается **, это то, что в течение сотен (если не тысяч) лет многочисленные религиозные группы, наиболее заметно [джайны в Индии, полностью веганы] (https://en.wikipedia.org/wiki/Jain_vegetarianism) ), и начал сбивать с толку ученых, поскольку открытие и важность B12 начали выясняться.\n\nРешение этой загадки проявляется в умно обнаруженном расхождении в джайнах по географическим регионам. У джайнов в Великобритании появятся недостатки B12, а у тех, кто живет в Индии, - нет. Разница между двумя состояниями, очевидно, многочисленна, но оказывается, что основной причиной этого несоответствия является * гигиена *.\n\nВ Индии вода и пища часто подвергаются меньшей обработке и остаются нестерилизованными. [Исследования показывают] (https://link.springer.com/article/10.1007%2FBF00007957), что растения и сады с высоким содержанием навоза содержат на растениях достаточно B12 для рекомендованного DV для B12. Кроме того, хотя западная водопроводная вода по существу уничтожает все микроорганизмы, Euglena, распространенный микроорганизм в прудовой воде, [может производить достаточное количество B12] (https://www.jstor.org/stable/2482180?seq=1#page_scan_tab_contents) для средний человек. Фактически, использование воды обратного осмоса в Западной Индии [было напрямую связано с дефицитом B12] (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4948445/).\n\nТак что у вас есть это! Гигиеническая гипотеза, проявляющаяся как главный виновник дефицита B12 в западных культурах.\n\n\n\n\n\n","title":"Витамин В12, веганство и гигиена","subreddit_name_prefixed":"r/sciences","ups":409,"created":1551266640,"link_flair_background_color":"","id":"av8iys","author":{"name":"IJesusChrist"},"permalink":"/r/sciences/comments/av8iys/the_vitamin_b12_veganism_and_hygiene/","url":"https://www.reddit.com/r/sciences/comments/av8iys/the_vitamin_b12_veganism_and_hygiene/","created_utc":1551237840}