{
    "subreddit": {
        "display_name": "AdvancedFitness"
    },
    "subreddit_loc": "AdvancedFitness",
    "selftext": "Говори по-ботански со мной. Вот мой сайт: http://evidencebasedfitness.net",
    "title": "АМА Брайана Чанга (Доказательная медицина)",
    "subreddit_name_prefixed": "r/AdvancedFitness",
    "ups": 601,
    "created": 1373403119,
    "link_flair_background_color": "",
    "id": "1hxjqx",
    "author": {
        "name": "evidencebasedfitness"
    },
    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/",
    "url": "https://www.reddit.com/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/",
    "created_utc": 1373374319,
    "replies": [
        {
            "ups": 32,
            "link_id": "t3_1hxjqx",
            "id": "cayy2dg",
            "author": "freshandsticky",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What's the greatest misunderstanding in the fitness world right now in your opinion?",
            "body_html": "<div class=\"md\"><p> Какое, по вашему мнению, самое большое недоразумение в мире фитнеса сейчас? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayy2dg/",
            "name": "t1_cayy2dg",
            "created": 1373409129,
            "created_utc": 1373380329,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 23,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 10,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 17,
                            "link_id": "t3_1hxjqx",
                            "replies": [
                                {
                                    "ups": 10,
                                    "link_id": "t3_1hxjqx",
                                    "id": "cazwx2h",
                                    "author": "Gymrat777",
                                    "parent_id": "t1_cazuv7y",
                                    "subreddit_id": "t5_2s9km",
                                    "body": "This response and the other one you left me in this thread are incredibly helpful. I haven't had the ability to ask someone in the field the necessary follow-up questions to get to the final answer of, \"It's really tough to know what to trust and who to trust and if you want to know what to trust, do plenty of research on the study and its follow-ups before making conclusions.\" Its obviously not the answer I would like (it would be great if there was a database of papers that rated how much you can trust the findings, but alas, with the continuously changing landscape, such a database seems to not be feasible now), but your answer is solid and definite and I can move forward now.\n\nThanks again. I truly appreciate your input.",
                                    "body_html": "<div class=\"md\"><p> Этот ответ и другой, который вы оставили мне в этой теме, невероятно полезны. У меня не было возможности задать кому-то на местах необходимые дополнительные вопросы, чтобы получить окончательный ответ: «Действительно сложно понять, чему доверять, кому доверять, и если вы хотите знать, чему доверять, сделайте много исследований на исследование и его последующие действия, прежде чем делать выводы &quot;. Очевидно, это не тот ответ, который я хотел бы получить (было бы замечательно, если бы существовала база данных, в которой оценивалось, насколько вы можете доверять полученным данным, но, увы, в условиях постоянно меняющегося ландшафта такая база данных сейчас кажется нереальной), но ваш ответ тверд и определен, и я могу двигаться вперед. </p><p> Еще раз спасибо. Я действительно ценю ваш вклад. </p></div>",
                                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazwx2h/",
                                    "name": "t1_cazwx2h",
                                    "created": 1373514813,
                                    "created_utc": 1373486013,
                                    "subreddit_name_prefixed": "r/AdvancedFitness",
                                    "depth": 6
                                }
                            ],
                            "id": "cazrmmi",
                            "author": "Gymrat777",
                            "parent_id": "t1_cazrb5c",
                            "subreddit_id": "t5_2s9km",
                            "body": "Thank you for such a detailed reply to what I now see (after some sleep) was a snarky question. Your framing of the problem in the guise of advanced math research really crystallized the issue.\n\nI guess I would push back one more time, specifically in reference to when you said: \"you have to decide whether to trust in something like a guideline written by experts\". I'd love to do that - but where do I find experts?! Implicit in my original question is that I would expect the academic research to be where one would find experts. You contend that while this is likely where the experts *are* found, this source isn't good for lay-people. You are convincing me this is true, but it still leaves me at a loss for a source I can go to in order to answer questions.\n\nTo make this more grounded, I have two specific areas of interest (not that I would expect you to answer, but just to put a question to the hypothetical). I'm interested in endurance/long distance triathlon training and, particularly, the most efficient ways to train the required systems (how does one go about stimulated the most growth in mytochondrial density? is it true that over 2-2.5 hours of steady state cardio, the body has such diminishing returns it is more dangerous to keep going than the further stimulus is worth? What is the appropriate place for HIIT in half and full iron distance/marathon training? Why is it that long, steady efforts are used to train cycling and running, but swimming is best attacked from shorter, fast burst (100s, 200s, etc)?) I also used to be a powerlifter a little over a decade ago and I wasn't into the science of it much then. If I were to return to that area of sport, where would I go to find the most up to date research on the subject?\n\nThank you very much for (1) doing the AMA in the first place and (2) coming back to deal with my question in a thorough manner. I wasn't familiar with your site before, but your on my list now!",
                            "body_html": "<div class=\"md\"><p> Спасибо за такой подробный ответ на то, что я теперь вижу (после некоторого сна) был странный вопрос. Ваша формулировка проблемы под маской передовых математических исследований действительно кристаллизовала проблему. </p><p> Думаю, я бы отодвинулся еще раз, особенно в связи с тем, что вы сказали: «Вы должны решить, следует ли доверять чему-то подобному руководству, написанному экспертами». Я бы с удовольствием это сделал - но где мне найти экспертов ?! В моем первоначальном вопросе подразумевалось, что я ожидаю, что научное исследование будет таким, где можно найти экспертов. Вы утверждаете , что в то время как это, вероятно , где встречаются эксперты, этот источник не хорошо для мирян. Вы убеждаете меня, что это правда, но это все еще оставляет меня в растерянности из-за источника, к которому я могу обратиться, чтобы ответить на вопросы. </p><p> Чтобы сделать это более обоснованным, у меня есть две конкретные области интереса (не то, чтобы я ожидал, что вы ответите, но просто поставьте вопрос на гипотетический). Меня интересует тренировка на выносливость / триатлон на длинные дистанции и, в частности, наиболее эффективные способы тренировки требуемых систем (как можно стимулировать наибольший рост плотности миохондрий? Правда ли, что в течение 2-2,5 часов устойчивого состояния кардио, у тела такие убывающие отдачи, что продолжать движение опаснее, чем стоит дальнейший стимул? Какое место для ГИИТа в тренировках на половину и полную дистанцию / марафон по железу? тренируйся ездить на велосипеде и бегать, но плавание лучше всего атаковать с помощью коротких, быстрых ударов (100, 200 и т. д.)?) Я также был пауэрлифтером чуть более десяти лет назад, и тогда я не слишком увлекался наукой об этом. Если бы я вернулся в эту область спорта, куда бы я отправился, чтобы найти самые свежие исследования по этому вопросу? </p><p> Большое спасибо за (1) выполнение АМА в первую очередь и (2) возвращение, чтобы тщательно обсудить мой вопрос. Я не был знаком с вашим сайтом раньше, но вы сейчас в моем списке! </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazrmmi/",
                            "name": "t1_cazrmmi",
                            "created": 1373501881,
                            "created_utc": 1373473081,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cazg647",
                    "author": "Gymrat777",
                    "parent_id": "t1_caz91g6",
                    "subreddit_id": "t5_2s9km",
                    "body": "This is great, but doesn't do anything to answer the question. Your answer merely casts doubt on all fitness research. While almost everyone here is familiar with how flawed experiments can become, your comment merely paralyzes ones ability to consider how to adapt their training to what the research says.\n\nWithout getting a PhD in fitness (I'm busy getting one in a different discipline), what can an empirically minded athlete do to take advantage of/find the 'good' research?",
                    "body_html": "<div class=\"md\"><p> Это здорово, но ничего не делает, чтобы ответить на вопрос. Ваш ответ просто ставит под сомнение все исследования фитнеса. В то время как почти все здесь знакомы с тем, какими могут быть ошибочные эксперименты, ваш комментарий просто парализует способность думать о том, как адаптировать свою подготовку к тому, что говорится в исследовании. </p><p> Не получив докторскую степень по фитнесу (я занят изучением другой дисциплины), что может сделать эмпирически настроенный спортсмен, чтобы воспользоваться / найти «хорошее» исследование? </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazg647/",
                    "name": "t1_cazg647",
                    "created": 1373455533,
                    "created_utc": 1373426733,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayzc7u",
            "author": "gentrfam",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "When/if you get back from training: \n\nWhat's the gold standard for evidence-based fitness? What should we, as non-professionals, be looking at to separate the woo and bro-science from reality? Consensus from Institute of Medicine or American College of Sports Medicine? Large-scale studies in reputable journals? ",
            "body_html": "<div class=\"md\"><p> Когда / если вы вернетесь с тренировки: </p><p> Что является золотым стандартом для доказательной пригодности? Что мы, непрофессионалы, должны смотреть на то, чтобы отделить науку и братскую науку от реальности? Консенсус от Института медицины или Американского колледжа спортивной медицины? Масштабные исследования в авторитетных журналах? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayzc7u/",
            "name": "t1_cayzc7u",
            "created": 1373412760,
            "created_utc": 1373383960,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 25,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 7,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 10,
                            "link_id": "t3_1hxjqx",
                            "id": "cb1pnfc",
                            "author": "CopeSe7en",
                            "parent_id": "t1_cb18zx6",
                            "subreddit_id": "t5_2s9km",
                            "body": "O",
                            "body_html": "<div class=\"md\"><p> </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1pnfc/",
                            "name": "t1_cb1pnfc",
                            "created": 1373726867,
                            "created_utc": 1373698067,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cb0rp0v",
                    "author": "babyimreal",
                    "parent_id": "t1_caz97dx",
                    "subreddit_id": "t5_2s9km",
                    "body": "I was wondering if you have read Your Inner Fish and if you shared the same sort of \"humanity\" connection that Shubin describes upon finally dissecting his cadavers hand. ",
                    "body_html": "<div class=\"md\"><p> Мне было интересно, читали ли вы «Твою внутреннюю рыбу» и разделяли ли вы ту же «гуманистическую» связь, которую описывает Шубин, когда, наконец, рассекает свою руку с трупами. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb0rp0v/",
                    "name": "t1_cb0rp0v",
                    "created": 1373610232,
                    "created_utc": 1373581432,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz3i40",
            "author": "MrTomnus",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I often hear that the deadlift is \"CNS intensive\" because it is taxing on the grip, and that the hands and forearms are very neurally dense. I've seen at least a few people saying that they're able to do far more volume and/or frequency on the deadlift if they use straps. Mainly I'm curious regarding frequency.\n\nThe general rationale seems to be that even if the rest of your body is capable of the pull, your brain/CNS might say \"Nope, your hands can't hold it so I won't bother lifting it.\" Could be broscience, I don't know. Never personally experimented with it.\n\nHave you ever run into this, and if so do you have any good resources regarding the phenomenon? ",
            "body_html": "<div class=\"md\"><p> Я часто слышу, что становая тяга является «интенсивной ЦНС», потому что она обременительна, а руки и предплечья очень плотные. Я видел, по крайней мере, несколько человек, которые говорили, что они могут сделать намного больше объема и / или частоты в тяге, если они используют ремни. В основном мне любопытно по поводу частоты. </p><p> Общее обоснование, по-видимому, заключается в том, что даже если остальная часть вашего тела способна тянуть, ваш мозг / ЦНС может сказать: «Нет, ваши руки не могут держать его, поэтому я не буду беспокоиться, поднимая его». Это может быть общение, я не знаю. Никогда лично не экспериментировал с этим. </p><p> Вы когда-нибудь сталкивались с этим, и если так, у вас есть какие-либо хорошие ресурсы относительно этого явления? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz3i40/",
            "name": "t1_caz3i40",
            "created": 1373422872,
            "created_utc": 1373394072,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 44,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 9,
                    "link_id": "t3_1hxjqx",
                    "id": "cazfwx9",
                    "author": "herman_gill",
                    "parent_id": "t1_caz5p1h",
                    "subreddit_id": "t5_2s9km",
                    "body": "Is there a possibility you were retaining more water during this time, and not fat?",
                    "body_html": "<div class=\"md\"><p> Есть ли вероятность того, что в течение этого времени вы сохраняли больше воды, а не жира? </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazfwx9/",
                    "name": "t1_cazfwx9",
                    "created": 1373454875,
                    "created_utc": 1373426075,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                },
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "cazml3k",
                    "author": "[deleted]",
                    "parent_id": "t1_caz5p1h",
                    "subreddit_id": "t5_2s9km",
                    "body": "[deleted]",
                    "body_html": "<div class=\"md\"><p> [Удалено] </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazml3k/",
                    "name": "t1_cazml3k",
                    "created": 1373483520,
                    "created_utc": 1373454720,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayzjvl",
            "author": "wutangclan90",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What are your opinions on Layne Norton's \"metabolic damage\" issue?\n\nAvid reader of your blog, thanks for doing this.",
            "body_html": "<div class=\"md\"><p> Что вы думаете о проблеме «метаболического повреждения» Лэйна Нортона? </p><p> Заслуженный читатель вашего блога, спасибо за это. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayzjvl/",
            "name": "t1_cayzjvl",
            "created": 1373413327,
            "created_utc": 1373384527,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 37,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 44,
                    "link_id": "t3_1hxjqx",
                    "id": "caza8qm",
                    "author": "evidencebasedfitness",
                    "parent_id": "t1_caz8j20",
                    "subreddit_id": "t5_2s9km",
                    "body": "I had to start somewhere! :)",
                    "body_html": "<div class=\"md\"><p> Я должен был начать где-то! :) </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caza8qm/",
                    "name": "t1_caza8qm",
                    "created": 1373439408,
                    "created_utc": 1373410608,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz6sjp",
            "author": "evidencebasedfitness",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Ok. Starting from the bottom. :)",
            "body_html": "<div class=\"md\"><p> Хорошо. Начиная снизу. :) </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz6sjp/",
            "name": "t1_caz6sjp",
            "created": 1373430663,
            "created_utc": 1373401863,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 16,
            "link_id": "t3_1hxjqx",
            "id": "cazb7xt",
            "author": "evidencebasedfitness",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Sorry, I didn't get to respond at 2pm when I checked the questions. If there's more, I'm happy to respond into tomorrow.",
            "body_html": "<div class=\"md\"><p> Извините, я не смог ответить в 2 часа дня, когда проверил вопросы. Если есть что-то еще, я с удовольствием отвечу на завтра. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazb7xt/",
            "name": "t1_cazb7xt",
            "created": 1373441999,
            "created_utc": 1373413199,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 16,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 6,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1u8fn",
                    "author": "evidencebasedfitness",
                    "parent_id": "t1_cb1t2tj",
                    "subreddit_id": "t5_2s9km",
                    "body": "Non-call weekends will be your friend on your heavy clinical rotations (Friday night, Saturday, Sunday--three workouts). You will have weeks where you can eke your way to the gym just once in the week and that's okay. It means you don't program deloads into your workout cycle because your job is going to do that for you.\n\nPersonally, I think intermittent-fasting is the best thing since sliced bread for clerks and residents. You're so fracking busy some days, the fast just happens on its own!",
                    "body_html": "<div class=\"md\"><p> Выходные без звонков будут вашим другом в тяжелых клинических сменах (вечер пятницы, суббота, воскресенье - три тренировки). У вас будут недели, когда вы сможете отправиться в спортзал только один раз в неделю, и это нормально. Это означает, что вы не программируете разгрузки в свой тренировочный цикл, потому что ваша работа сделает это за вас. </p><p> Лично я думаю, что прерывистый пост - лучшая вещь, так как нарезанный хлеб для клерков и жителей. Вы так заняты несколько дней, пост происходит сам по себе! </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1u8fn/",
                    "name": "t1_cb1u8fn",
                    "created": 1373756693,
                    "created_utc": 1373727893,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1on3h",
            "author": "Shenaniganz08",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "3 questions \n\n1) Thoughts on ECA stack \n\n2) I'm also a doctor (pediatrician) I don't really have time to workout. Whats a good workout routine for someone that only has about 30-45 mintues to spend working out. Also mornings or after work ? \n\n3) How old are you, you look like you are in awesome shape (congrats man) ",
            "body_html": "<div class=\"md\"><p> 3 вопроса </p><p> 1) Мысли о стеке ECA </p><p> 2) Я тоже врач (педиатр), у меня нет времени на тренировки. Что такое хорошая тренировка для человека, у которого есть только около 30-45 минут, чтобы потратить тренировки. Также утром или после работы? </p><p> 3) Сколько тебе лет, ты выглядишь, как будто ты в отличной форме (поздравляю человека) </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1on3h/",
            "name": "t1_cb1on3h",
            "created": 1373722477,
            "created_utc": 1373693677,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 15,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 9,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1pg91",
                    "author": "ShadowsAreScary",
                    "parent_id": "t1_caz8nkt",
                    "subreddit_id": "t5_2s9km",
                    "body": "You had me at lindy hop.",
                    "body_html": "<div class=\"md\"><p> Ты взял меня на Линди хоп. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1pg91/",
                    "name": "t1_cb1pg91",
                    "created": 1373725925,
                    "created_utc": 1373697125,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz2nru",
            "author": "khajiitFTW",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hi Dr. Chung.  What does your typical workout routine (lets say 1 week) look like?  Thanks for the AMA.",
            "body_html": "<div class=\"md\"><p> Привет доктор Чунг. Как выглядит ваша обычная тренировка (скажем, 1 неделя)? Спасибо за АМА. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz2nru/",
            "name": "t1_caz2nru",
            "created": 1373420872,
            "created_utc": 1373392072,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 29,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 5,
                    "link_id": "t3_1hxjqx",
                    "id": "caz3hpv",
                    "author": "EnLilaSko",
                    "parent_id": "t1_cayztzm",
                    "subreddit_id": "t5_2s9km",
                    "body": "I doubt these graphs. First graph:\n\nIf they talk about decline for a normal male (overweight, does not train, etc) it might be right (but not that it peaks at 15), but if the male is active and live a \"healthy\" lifestyle, the testosterone drop shouldn't be that much. I have not seen anything like that study on GH, but I'm guessing it's about the same though.\n\nhttp://www.sciencedaily.com/releases/2012/06/120623144944.htm\n\nhttp://expressindia.indianexpress.com/latest-news/testosterone-man-hits-sexual-peak-at-22-says-study/336380/ (Peak at 22).\n\nWe've also been told small drops/increases in testosterone does not do much, thus it should be about the same until you turn 40-50 with the graphs you provided. (assuming GH doesn't drop that quickly, but got no source for that)",
                    "body_html": "<div class=\"md\"><p> Я сомневаюсь в этих графиках. Первый график: </p><p> Если они говорят о снижении у нормального мужчины (избыточный вес, не тренируются и т. Д.), Это может быть правильным (но не то, что он достигает пика в 15 лет), но если мужчина активен и ведет «здоровый» образ жизни, падение тестостерона не должно не так много. Я не видел ничего подобного в исследовании GH, но думаю, что примерно так же. </p><p> <a href=\"http://www.sciencedaily.com/releases/2012/06/120623144944.htm\">http://www.sciencedaily.com/releases/2012/06/120623144944.htm</a> </p><p> <a href=\"http://expressindia.indianexpress.com/latest-news/testosterone-man-hits-sexual-peak-at-22-says-study/336380/\">http://expressindia.indianexpress.com/latest-news/testosterone-man-hits-sexual-peak-at-22-says-study/336380/</a> (Пик в 22 года). </p><p> Нам также сказали, что небольшое снижение / повышение уровня тестостерона мало что дает, поэтому оно должно быть примерно таким же, пока вам не исполнится 40-50 с графиками, которые вы предоставили. (при условии, что GH не падает так быстро, но у него нет источника для этого) </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz3hpv/",
                    "name": "t1_caz3hpv",
                    "created": 1373422846,
                    "created_utc": 1373394046,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayxed0",
            "author": "rabbit12x",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Can you talk about the hormonal advantages in teenagers? I've heard the term \"natural steroids\" used, but what specifically allows teenagers to progress faster than adults? Testosterone? HGH? At roughly what age do these benefits taper off?\n\nWhat role do macronutrient ratios play in body composition? If someone is eating at a caloric surplus of say, 500 calories, does it matter if someone eats a disproportionately high amount of either macro? Thanks for the AMA!",
            "body_html": "<div class=\"md\"><p> Можете ли вы рассказать о гормональных преимуществах у подростков? Я слышал термин «натуральные стероиды», но что конкретно позволяет подросткам прогрессировать быстрее, чем взрослые? Тестостерон? Гормон роста? Примерно в каком возрасте эти преимущества сужаются? </p><p> Какую роль играют макроэлементы в составе тела? Если кто-то ест с избытком калорий, скажем, 500 калорий, имеет ли значение, если кто-то съест непропорционально большое количество одного из этих макросов? Спасибо за АМА! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxed0/",
            "name": "t1_cayxed0",
            "created": 1373406975,
            "created_utc": 1373378175,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 13,
            "link_id": "t3_1hxjqx",
            "id": "caz2029",
            "author": "stevonyx",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What is your view on diet? More specifically, in your opinion, how much of a role does the intake of protein, carbs, and fats have on body composition and overall leaness?",
            "body_html": "<div class=\"md\"><p> Что вы думаете о диете? Более конкретно, по вашему мнению, какую роль играет потребление белка, углеводов и жиров в составе тела и общей худобе? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz2029/",
            "name": "t1_caz2029",
            "created": 1373419326,
            "created_utc": 1373390526,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 24,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 4,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1vzly",
                    "author": "lemonfluff",
                    "parent_id": "t1_caz9gc9",
                    "subreddit_id": "t5_2s9km",
                    "body": "This sounds very low carb! What are your views on a low carb / keto diet? ",
                    "body_html": "<div class=\"md\"><p> Это звучит очень низкоуглеводно! Что вы думаете о низкоуглеводной / кето-диете? </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1vzly/",
                    "name": "t1_cb1vzly",
                    "created": 1373763164,
                    "created_utc": 1373734364,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz0jl3",
            "author": "l33r",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What is your favorite \"healthy\" meal to cook in terms of taste, balance of nutrition and \"healthiness\"?",
            "body_html": "<div class=\"md\"><p> Какое ваше любимое «здоровое» блюдо готовить с точки зрения вкуса, баланса питания и «здоровья»? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz0jl3/",
            "name": "t1_caz0jl3",
            "created": 1373415835,
            "created_utc": 1373387035,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 11,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 3,
                            "link_id": "t3_1hxjqx",
                            "id": "cb1iq9s",
                            "author": "Daddybaby",
                            "parent_id": "t1_cazns1q",
                            "subreddit_id": "t5_2s9km",
                            "body": "Oh right thanks. Thought by reverse association you meant greater grip strength = lesser longevity or lesser grip strength = greater longevity.",
                            "body_html": "<div class=\"md\"><p> О, верно, спасибо. Мысль обратной связи означала большую силу сцепления = меньшую долговечность или меньшую силу сцепления = большую долговечность. </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1iq9s/",
                            "name": "t1_cb1iq9s",
                            "created": 1373701718,
                            "created_utc": 1373672918,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cazkxwj",
                    "author": "Daddybaby",
                    "parent_id": "t1_caz9c4e",
                    "subreddit_id": "t5_2s9km",
                    "body": "I thought it was the other way around: greater grip strength = greater longevity?",
                    "body_html": "<div class=\"md\"><p> Я думал, что все наоборот: большая сила сцепления = большая долговечность? </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazkxwj/",
                    "name": "t1_cazkxwj",
                    "created": 1373472264,
                    "created_utc": 1373443464,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayxxws",
            "author": "misplaced_my_pants",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "How has your specialization in hand surgery influenced your thoughts, if any, on training grip strength? Both in terms of strength training and BJJ.\n\nAlso, obligatory questions you're never asked but wish you were? ",
            "body_html": "<div class=\"md\"><p> Как ваша специализация в области хирургии кисти повлияла на ваши мысли, если таковые имеются, на силу захвата? Как с точки зрения силовых тренировок, так и с BJJ. </p><p> Кроме того, обязательные вопросы, которые вы никогда не задавали, но хотели бы, чтобы вы были? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxxws/",
            "name": "t1_cayxxws",
            "created": 1373408755,
            "created_utc": 1373379955,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 12,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1vfqi",
                    "author": "Brosencephalon",
                    "parent_id": "t1_cb1v1g5",
                    "subreddit_id": "t5_2s9km",
                    "body": "Wow. Thanks for the input.\n\nI see your point on being able to reach caloric goals and it being something that I can plan for. It took me a while to adjust to med school itself. When I finally did, I lost all the bulking habits I established in the summer leading up to first year. From that point, trying to balance the 2 provided me with more of a headache. I'll def have a better grasp on things come MS2 though so I think I'll be able to get some sort of balance in there.\n\nI really appreciate your perspective. It's definitely pushed me in the right direction. ",
                    "body_html": "<div class=\"md\"><p> Вау. Спасибо за вклад. </p><p> Я вижу вашу точку зрения в том, что я могу достичь калорийных целей, и это то, что я могу планировать. Мне потребовалось некоторое время, чтобы приспособиться к самой медицинской школе. Когда я наконец это сделал, я потерял все привычки, которые я приобрел летом, вплоть до первого года жизни. С этого момента, попытка сбалансировать 2 дала мне больше головной боли. Я, конечно, лучше разбираюсь в вещах, которые придет к MS2, хотя, думаю, я смогу найти какой-то баланс там. </p><p> Я действительно ценю вашу точку зрения. Это определенно подтолкнуло меня в правильном направлении. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1vfqi/",
                    "name": "t1_cb1vfqi",
                    "created": 1373761233,
                    "created_utc": 1373732433,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1ox6g",
            "author": "Brosencephalon",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hey, I hope I'm not too late to the party:\n\nI'm currently a medical student. Just finished MS1 and about to start MS2 (my body is not ready for path/micro/pharm). My question is, how did you maintain a conducive workout schedule with the hectic studying/workload? I'm sure you understand the challenges with balance in med school. I'm currently bulking (Forever Bulking Crew), so caloric intake is another issue I'm trying to deal with.\n\nI'm having trouble keeping all the pieces together. When I lift on a consistent schedule I find myself not getting enough sleep. Or with the constant exams/tests, I sometimes don't hit my daily caloric/macro goals (5000 calories, 200+ g of protein).\n\nI appreciate any insight you have on this.\n\nAlso, big fan of the blog. Read each update on my RSS reader. Thanks for putting out great content!",
            "body_html": "<div class=\"md\"><p> Эй, я надеюсь, что я не слишком поздно на вечеринку </p><p> В настоящее время я студент-медик. Только что закончил MS1 и вот-вот начнется MS2 (мое тело не готово к пути / микро / фарм). У меня вопрос, как вы поддерживали график тренировок, способствующих напряженной учебе / нагрузке? Я уверен, что вы понимаете проблемы с балансом в медицинской школе. Я в настоящее время набухаю (Forever Bulking Crew), поэтому потребление калорий - еще одна проблема, с которой я пытаюсь справиться. </p><p> У меня проблемы с хранением всех частей вместе. Когда я поднимаюсь по согласованному графику, я не выспался. Или с постоянными экзаменами / тестами, я иногда не достигаю своих ежедневных калорий / макро целей (5000 калорий, 200+ г белка). </p><p> Я ценю ваше понимание этого вопроса. </p><p> Также большой поклонник блога. Читайте каждое обновление на моем читателе RSS. Спасибо за публикацию отличного контента! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1ox6g/",
            "name": "t1_cb1ox6g",
            "created": 1373723596,
            "created_utc": 1373694796,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 9,
            "link_id": "t3_1hxjqx",
            "id": "caz0kx5",
            "author": "[deleted]",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "[deleted]",
            "body_html": "<div class=\"md\"><p> [Удалено] </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz0kx5/",
            "name": "t1_caz0kx5",
            "created": 1373415927,
            "created_utc": 1373387127,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 9,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 3,
                            "link_id": "t3_1hxjqx",
                            "id": "ccccdaw",
                            "author": "catfightonahotdog",
                            "parent_id": "t1_cb31fge",
                            "subreddit_id": "t5_2s9km",
                            "body": "I've seen rice used for scar/nerve sensitivity management (specifically in finger amputations) but not for strengthening. Is it the same thing; that is, increasing tolerance to stimulus to reuse the digit or limb at the previous base line of mechanical strength? Or are they separate concepts?",
                            "body_html": "<div class=\"md\"><p> Я видел рис, используемый для лечения чувствительности рубцов / нервов (особенно при ампутации пальцев), но не для укрепления. Это то же самое; то есть повышение толерантности к раздражителю для повторного использования цифры или конечности на предыдущей базовой линии механической прочности? Или это отдельные понятия? </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/ccccdaw/",
                            "name": "t1_ccccdaw",
                            "created": 1379745630,
                            "created_utc": 1379716830,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cb1xr0d",
                    "author": "IronEngineer",
                    "parent_id": "t1_cb1v3fe",
                    "subreddit_id": "t5_2s9km",
                    "body": "What do you feel is a good way to train the diverse gripping ability used in rock climbing.  Myself and my friends enjoy heading to the mountains when we can to get a good weekend of climbing in, but can't get out as often as would likely be necessary to use climbing itself as the primary means of increasing grip strength.  I've seen lots of different grip workouts over in climbing forums proposed, and some were interesting.  Here are the primary points I've seen.  \n1)  Simply climbing itself as the primary means of improving grip strength.  The motivation here being that the act of climbing requires holding onto rocks at various angles and with different amounts of fingers at one time.  Thus a really thorough and diverse workout.  As I've stated above though, I just can't get out more than every other weekend at best so really am limited if this is all I do for grip strength.  \n2)  Wrist curls or attaching a weight to a bar with a string and rolling the weight up.  The criticism I've seen here in the climbing crowd is that while this certainly improves your grip strength in the one direction, it has limited benefits when you are trying to hold onto a rock at a weird angle or with only a couple of fingers.  I'm really not sure myself if this rational holds.  I've been doing double overhand grip deadlifts and have seen my grip improve to the point where I can lift 370 pounds without the grip failing though.  As far as the benefits to hanging onto rocks in off angles and pinching rocks to hold myself in place, not so sure on the carry through.  \n3)  Using a bucket of rice and performing hand motions such as spreading, clenching or extending your fingers through the rice to build strength.  The thought being amongst climbers that this is the most effective training regiment besides actually climbing or using hangboards.  \n4)  Using hangboards.  I like hangboards myself, but am unconvinced of their being the best method for improving grip strength.  \nFrom the perspective of improving grip strength for climbing, which requires hanging at weird angles with different fingers, and pinching the rock to hold weight, what are your thoughts on training regimens?",
                    "body_html": "<div class=\"md\"><p> Что вы чувствуете, это хороший способ тренировать разнообразные захватывающие способности, используемые в скалолазании. Я и мои друзья с удовольствием едем в горы, когда мы можем провести хорошие выходные лазания, но не можем выходить так часто, как это может понадобиться, чтобы использовать лазание в качестве основного средства увеличения силы сцепления. Я видел много разных тренировок по сцеплению на предложенных форумах по скалолазанию, и некоторые были интересными. Вот основные моменты, которые я видел. <br/> 1) Просто взбираться на себя в качестве основного средства улучшения силы захвата. Мотивация здесь заключается в том, что акт лазания требует удержания камней под разными углами и с разным количеством пальцев одновременно. Таким образом, действительно тщательная и разнообразная тренировка. Как я уже говорил выше, я просто не могу выбраться больше, чем через каждые выходные в лучшем случае, поэтому я действительно ограничен, если это все, что я делаю для силы сцепления. <br/> 2) Завитки запястья или прикрепление груза к штанге с помощью веревки и свертывание веса вверх. Критика, которую я видел здесь среди скалолазной толпы, заключается в том, что, хотя это, безусловно, улучшает вашу силу захвата в одном направлении, оно имеет ограниченные преимущества, когда вы пытаетесь удержать камень под странным углом или всего лишь несколькими пальцами. Я действительно не уверен, что это рационально. Я делал двойные тяги с ручным захватом и видел, как улучшилось мое сцепление до такой степени, что я могу поднять 370 фунтов без провала сцепления. Что касается пользы от подвешивания на скалы под углами и защемления камней, чтобы удержать себя на месте, не так уверен в переносе. <br/> 3) Использование ведра риса и выполнение движений рук, таких как распространение, сжатие или вытягивание пальцев через рис для создания силы. Среди альпинистов думают, что это самый эффективный тренировочный полк, помимо того, что он лазает или использует вешалки. <br/> 4) Использование Hangboards. Я сам люблю рекламные щиты, но не уверен, что это лучший способ улучшить силу захвата. <br/> Что вы думаете о режимах тренировок с точки зрения улучшения силы сцепления при лазании, которое требует подвешивания под странными углами разными пальцами и защемления скалы для удержания веса? </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1xr0d/",
                    "name": "t1_cb1xr0d",
                    "created": 1373769115,
                    "created_utc": 1373740315,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1v32u",
            "author": "evidencebasedfitness",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I'll be checking in periodically to continue answering questions. Just time marking right now. If I didn't answer your question yet, I will try my best, so please be patient.",
            "body_html": "<div class=\"md\"><p> Я буду периодически проверять, чтобы продолжить отвечать на вопросы. Просто отметка времени прямо сейчас. Если я еще не ответил на ваш вопрос, я постараюсь изо всех сил, поэтому, пожалуйста, будьте терпеливы. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1v32u/",
            "name": "t1_cb1v32u",
            "created": 1373759940,
            "created_utc": 1373731140,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 16,
            "link_id": "t3_1hxjqx",
            "id": "cayxehc",
            "author": "thinklewis",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "* What's the largest myth out there related to fitness by people in the fitness industry?\n\n* What's your best piece of advice for someone that has a good amount of knowledge, in good health, decent cardiovascular shape, above average strength (basically the populous here at /r/AdvancedFitness)?\n\n* What exiting studies are out there that you know of that have either not been completed peer review process or have been discussed much publicly that could change some thinking of many people in your industry?\n\nI'll think of some more...",
            "body_html": "<div class=\"md\"><ul><li><p> Какой самый большой миф, связанный с фитнесом людьми в фитнес-индустрии? </p></li><li><p> Какой ваш лучший совет для кого-то, у кого есть хорошее знание, хорошее здоровье, приличная сердечно-сосудистая форма, сила выше средней (в основном многолюдная здесь на <a href=\"/r/AdvancedFitness\">/ r / AdvancedFitness</a> )? </p></li><li><p> Какие интересные исследования существуют, о которых вам известно, что они либо не прошли процесс рецензирования, либо были широко обсуждены, что может изменить представление многих людей в вашей отрасли? </p></li></ul><p> Я подумаю еще немного ... </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxehc/",
            "name": "t1_cayxehc",
            "created": 1373406987,
            "created_utc": 1373378187,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 6,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 6,
                    "link_id": "t3_1hxjqx",
                    "id": "cazjjjn",
                    "author": "Quakespeare",
                    "parent_id": "t1_caz98bi",
                    "subreddit_id": "t5_2s9km",
                    "body": "Hey, thanks for your reply.\n\nI've been supplementing Vit D for years, because I was under the impression, that it not only had positive effects on bone health and cancer prevention, but also naturally increaded testosterone ([Source](http://www.ncbi.nlm.nih.gov/pubmed/21154195)).\n\nHowever, the correlation between dietary Vit D3 intake and cirulating Vit D levels is [questionable](http://www.nrjournal.com/article/S0271-5317%2813%2900121-8/abstract).\n\n\nPersonally, I don't notice any effect of supplementing even very high dosages of Vit D3 (10,000IU/day), but significant rises in energy and libido upon prolonged exposure to sunlight (i.E. I spend time outside in nice weather).",
                    "body_html": "<div class=\"md\"><p> Эй, спасибо за твой ответ. </p><p> Я годами дополнял витамин D, потому что у меня сложилось впечатление, что он не только положительно влияет на здоровье костей и профилактику рака, но и естественным образом повышает уровень тестостерона ( <a href=\"http://www.ncbi.nlm.nih.gov/pubmed/21154195\">источник</a> ). </p><p> Однако корреляция между потреблением витамина D3 с пищей и уровнем циркулирующего витамина D <a href=\"http://www.nrjournal.com/article/S0271-5317%2813%2900121-8/abstract\">сомнительна</a> . </p><p> Лично я не замечаю никакого эффекта от добавления даже очень высоких доз витамина D3 (10 000 МЕ / день), но значительное увеличение энергии и либидо при длительном воздействии солнечного света (т.е. я провожу время на улице в хорошую погоду). </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazjjjn/",
                    "name": "t1_cazjjjn",
                    "created": 1373465700,
                    "created_utc": 1373436900,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz11v0",
            "author": "Quakespeare",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "How efficient is Vitamin D3(/2) supplementation -if at all- not only for fitness, but also overall well being?",
            "body_html": "<div class=\"md\"><p> Насколько эффективны добавки витамина D3 (/ 2) - если вообще - не только для фитнеса, но и для общего самочувствия? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz11v0/",
            "name": "t1_caz11v0",
            "created": 1373417064,
            "created_utc": 1373388264,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 11,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1nq1u",
                    "author": "Furthur",
                    "parent_id": "t1_caz9mwe",
                    "subreddit_id": "t5_2s9km",
                    "body": ">but good god, I'd rather watch a movie\n\nso do some wingates, stay hooked up to the cart and watch EPOC happen for a couple hours",
                    "body_html": "<div class=\"md\"><blockquote><p> но, боже мой, я бы лучше посмотрел фильм </p></blockquote><p> так что сделайте несколько крылатых, оставайтесь подключенными к телеге и наблюдайте за EPOC в течение пары часов </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1nq1u/",
                    "name": "t1_cb1nq1u",
                    "created": 1373719135,
                    "created_utc": 1373690335,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayyr0g",
            "author": "danbradster",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Since HIIT increases fat oxidation for hours afterwards (http://www.sportsscience.co/wp-content/uploads/2013/02/fat-oxidation-post-hiit-exercise.jpg) and burns more fat than moderate intensity cardio (http://www.sportsscience.co/wp-content/uploads/2013/02/skinfold-test-after-hiit.jpg), can HIIT reduce fat while you are lifting weights and have a calorie surplus and are putting on muscle?\n\nSimply: can HIIT be used for body recomposition?",
            "body_html": "<div class=\"md\"><p> Поскольку HIIT увеличивает окисление жиров в течение нескольких часов после этого ( <a href=\"http://www.sportsscience.co/wp-content/uploads/2013/02/fat-oxidation-post-hiit-exercise.jpg\">http://www.sportsscience.co/wp-content/uploads/2013/02/fat-oxidation-post-hiit-exercise.jpg</a> ) и сжигает больше жира, чем кардио средней интенсивности ( <a href=\"http://www.sportsscience.co/wp-content/uploads/2013/02/skinfold-test-after-hiit.jpg\">http://www.sportsscience.co/wp-content/uploads/2013/02/skinfold-test-after-hiit.jpg</a> ), может HIIT уменьшить жир, когда вы поднимаете вес и у вас есть избыток калорий и нарастить мышечную массу ? </p><p> Просто: можно ли использовать HIIT для перекомпоновки тела? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayyr0g/",
            "name": "t1_cayyr0g",
            "created": 1373411119,
            "created_utc": 1373382319,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 5,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 8,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1udqz",
                    "author": "evidencebasedfitness",
                    "parent_id": "t1_cb1p19i",
                    "subreddit_id": "t5_2s9km",
                    "body": "Small sample size is only problematic in two situations\n\n1) No significant p-value but a practically important effect observed.\n\nIf the difference between two groups is large enough to be important, but the p-value is not-significant, we are still left with the quandry of whether the difference observed was due to chance alone, or the intervention. This is an issue of power. \n\n2) Generalizability\n\nIf there is a practically important effect AND the p-value is significant, then we reject the null hypothesis and conclude that the intervention works, and that its use is practical. If the p-value is significant, we obviously had the power to detect it, so you cannot have an underpowered test of significance if it yielded a significant p-value (I see this type of comment a lot). The problem with the small sample size in this scenario is that you can only generalize to the characteristics of the sample. So when you have a significant p-value and an important effect with 10 college-aged untrained males, you're really restricted as to who these results apply. It's definitely not all untrained, college-aged males; it's whoever fits the characteristics of those TEN guys. So things like racial background, height, weight, starting strength...all of that comes into play. When you have a large sample size, this tends to blend away because your diversity tends to be wider (within the confines of your inclusion/exclusion criteria)",
                    "body_html": "<div class=\"md\"><p> Небольшой размер выборки проблематичен только в двух ситуациях </p><p> 1) Не наблюдается значительного значения p, но наблюдается практически важный эффект. </p><p> Если различие между двумя группами достаточно велико, чтобы быть важным, но значение р не является значимым, мы все равно остаемся в затруднительном положении, было ли различие наблюдалось только благодаря случайности или вмешательству. Это вопрос власти. </p><p> 2) Обобщаемость </p><p> Если есть практически важный эффект И значение р является значительным, то мы отвергаем нулевую гипотезу и делаем вывод, что вмешательство работает и что его использование является практичным. Если значение p является значимым, мы, очевидно, имели возможность его обнаружить, поэтому вы не можете пройти тест на значимость с недостаточным уровнем мощности, если он дал значительное значение p (я часто вижу комментарии такого типа). Проблема с небольшим размером выборки в этом сценарии заключается в том, что вы можете обобщать только характеристики выборки. Таким образом, когда у вас есть 10 значительных р-значений и важный эффект с 10 неподготовленными мужчинами колледжа, вы действительно ограничены в отношении того, к кому применимы эти результаты. Это определенно не все неподготовленные мужчины в возрасте от колледжа; это тот, кто соответствует характеристикам этих ДЕСЯТИ парней. Такие вещи, как расовая принадлежность, рост, вес, стартовая сила ... все это входит в игру. Когда у вас большой размер выборки, это имеет тенденцию смешиваться, потому что ваше разнообразие имеет тенденцию быть более широким (в пределах ваших критериев включения / исключения) </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1udqz/",
                    "name": "t1_cb1udqz",
                    "created": 1373757291,
                    "created_utc": 1373728491,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz3939",
            "author": "riraito",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "This might be too general, but this is based on old impressions of the state of fitness literature:\n\nWhy do many studies have such small sample sizes? And also why do they make such poor attempts to control for confounding variables?",
            "body_html": "<div class=\"md\"><p> Это может быть слишком общим, но это основано на старых впечатлениях о состоянии фитнес-литературы: </p><p> Почему во многих исследованиях такой маленький размер выборки? И также, почему они делают такие плохие попытки контролировать смешанные переменные? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz3939/",
            "name": "t1_caz3939",
            "created": 1373422276,
            "created_utc": 1373393476,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 6,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 6,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1njc3",
                    "author": "[deleted]",
                    "parent_id": "t1_cazrzdq",
                    "subreddit_id": "t5_2s9km",
                    "body": "i took Exercise Physio @ ucsd, undergrad. my prof answered that question with a Yes as well, but didnt recommend doing it. ",
                    "body_html": "<div class=\"md\"><p> Я взял физкультуру @ ucsd, старшекурсник. Мой профессор также ответил на этот вопрос Да, но не рекомендовал делать это. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1njc3/",
                    "name": "t1_cb1njc3",
                    "created": 1373718482,
                    "created_utc": 1373689682,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cazlrpf",
            "author": "clangclang",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Can you build muscle without a calorie surplus ? if no what amount is the most optimum to have the least amount of fat gain.",
            "body_html": "<div class=\"md\"><p> Можете ли вы накачать мышцы без избытка калорий? если нет, какое количество является наиболее оптимальным, чтобы иметь наименьшее количество жира. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazlrpf/",
            "name": "t1_cazlrpf",
            "created": 1373477646,
            "created_utc": 1373448846,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 7,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 9,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1rouv",
                    "author": "shallnotwastetime",
                    "parent_id": "t1_cb1p6gh",
                    "subreddit_id": "t5_2s9km",
                    "body": "> You need to work on your anxiety\n\nbecause THIS is very important. A gym membership not so much.\n",
                    "body_html": "<div class=\"md\"><blockquote><p> Вы должны работать над своим беспокойством </p></blockquote><p> потому что это очень важно. Членство в спортзале не так уж и много. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1rouv/",
                    "name": "t1_cb1rouv",
                    "created": 1373740857,
                    "created_utc": 1373712057,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1onmv",
            "author": "feureau",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "As a fat antisocial neckbeard trying to lose weight, can you recommend a good routine one can do at home to lose weight so I don't have to deal with stares and snickers at the gym?\n\n(And some food recipe/menu to go along with it?) \n\nThank you very much.",
            "body_html": "<div class=\"md\"><p> Как толстый антиобщественный бородатый борода, пытающийся похудеть, можете ли вы порекомендовать хорошую рутину, которую можно выполнять дома, чтобы похудеть, чтобы мне не приходилось иметь дело со взглядами и смехом в спортзале? </p><p> (И какой-нибудь рецепт / меню с едой?) </p><p> Большое спасибо. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1onmv/",
            "name": "t1_cb1onmv",
            "created": 1373722534,
            "created_utc": 1373693734,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "id": "caz43n9",
            "author": "Abbelwoi",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What's the current opinion on myofibrillar vs. sarcoplasmic hypertrophy?",
            "body_html": "<div class=\"md\"><p> Каково текущее мнение о миофибриллярной и саркоплазматической гипертрофии? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz43n9/",
            "name": "t1_caz43n9",
            "created": 1373424288,
            "created_utc": 1373395488,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 5,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 7,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1qame",
                    "author": "fork-hand",
                    "parent_id": "t1_caz7i1u",
                    "subreddit_id": "t5_2s9km",
                    "body": "Is there anything inherently wrong with using caffeine as part of a pre-workout routine?\n\nI mean I COULD workout just fine without it, but I also enjoy working out with the extra focus and I guess energy I get from a 200mg tab beforehand.\n\nNot sure if im too late to ask this, hope not.",
                    "body_html": "<div class=\"md\"><p> Есть ли что-то не так с использованием кофеина в качестве части тренировки перед тренировкой? </p><p> Я имею в виду, что я мог бы тренироваться очень хорошо без него, но мне также нравится работать с дополнительным фокусом, и я предполагаю, что энергия, которую я получаю из вкладки 200 мг заранее. </p><p> Не уверен, если я слишком поздно, чтобы спросить это, надеюсь, что нет. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1qame/",
                    "name": "t1_cb1qame",
                    "created": 1373730266,
                    "created_utc": 1373701466,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz5lxu",
            "author": "halodoze",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "How useful are supplements? If you're a beginner (or even advanced) do you need much more than a multi, creatine, and maybe whey protein for low kcal protein? \n\nIf you were to take supplements other than the ones I listed, what would they be? Vit. D, psyllium husk, fish oil?\n\nI just think a lot of supplements are unneeded and made to make money off a placebo. ",
            "body_html": "<div class=\"md\"><p> Насколько полезны добавки? Если вы новичок (или даже продвинутый), вам нужно гораздо больше, чем мульти, креатин и, возможно, сывороточный белок для белка с низким ккал? </p><p> Если бы вы принимали добавки, отличные от тех, которые я перечислил, какими бы они были? Vit. D, шелуха псиллиума, рыбий жир? </p><p> Я просто думаю, что многие добавки не нужны и сделаны, чтобы заработать на плацебо. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz5lxu/",
            "name": "t1_caz5lxu",
            "created": 1373427900,
            "created_utc": 1373399100,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 5,
            "link_id": "t3_1hxjqx",
            "id": "cb1povd",
            "author": "kazneus",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I don't know if you're still doing this ama, but I have a question and you seem like one of the best people to answer.\n\nI'm 26. Last year I had a single level discectomy in my cervical spine. I've been told I can't (shouldn't) lift any significant weight above my head, basically for the rest of my life. I am very worried about exacerbating any stress on the adjacent discs in my neck since they already show some signs of degradation. (Basically, I have degenerative disc disease.)\n\nI'm wondering what sort of exercises are still available for me to do for my shoulders, etc. without causing additional stress on my cervical spine. As I understand it the trapezius muscles anchor to the base of my skull and compress my spine when they are flexed, so I shouldn't do anything that involves flexing them?\n\nAre there any lower-impact exercises I can do without stressing my cervical spine?\n\nI've been fairly fit up until I found out I had herniated my disc. It was always important to me since I lost a lot of weight over the course of high school (on my own, and gradually.) I got into weight lifting a little bit since I read it would help to increase my resting metabolism. But I want to make sure if I'm lifting weights I am doing so in a way that is even throughout my body (I don't leave out muscle groups,) because I'm worried about hurting myself if I have to overcompensate for an underdeveloped muscle group when I'm lifting something.\n\nI'm sorry about the wall of text, but I would really appreciate an answer since I don't really know who to ask this to. Or maybe if you or somebody else could direct me to where I could find some advice.\n\nThank you so much",
            "body_html": "<div class=\"md\"><p> Я не знаю, продолжаете ли вы эту аму, но у меня есть вопрос, и вы, кажется, один из лучших людей, чтобы ответить. </p><p> Мне 26. В прошлом году у меня была одноуровневая дискэктомия в шейном отделе позвоночника. Мне сказали, что я не могу (не должен) поднимать какой-либо значительный вес над головой, в основном, до конца своей жизни. Я очень беспокоюсь о том, чтобы усугубить любое напряжение на соседних дисках в моей шее, так как они уже показывают некоторые признаки деградации. (В основном, у меня дегенеративное заболевание диска.) </p><p> Мне интересно, какие упражнения мне еще можно выполнить для моих плеч и т. Д., Не вызывая дополнительного напряжения в шейном отделе позвоночника. Насколько я понимаю, мышцы трапеции прикрепляются к основанию моего черепа и сжимают позвоночник, когда они согнуты, поэтому я не должен делать ничего, что включает их сгибание? </p><p> Могу ли я выполнять упражнения с меньшим воздействием, не напрягая шейный отдел позвоночника? </p><p> Я был в хорошей форме, пока не узнал, что у меня грыжа диска. Это всегда было важно для меня, так как я сильно похудела в старшей школе (самостоятельно и постепенно). Я немного начала заниматься тяжелой атлетикой, так как прочитала, что это поможет улучшить мой метаболизм в покое. Но я хочу убедиться, что если я поднимаю тяжести, я делаю это так, чтобы это происходило даже по всему телу (я не оставляю мышечные группы), потому что я боюсь причинить себе боль, если мне придется сверхкомпенсировать слаборазвитая группа мышц, когда я поднимаю что-то. </p><p> Я сожалею о стене текста, но я был бы очень признателен за ответ, так как я действительно не знаю, к кому обратиться. Или, может быть, вы или кто-то еще могли бы направить меня туда, где я мог бы найти какой-нибудь совет. </p><p> огромное спасибо </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1povd/",
            "name": "t1_cb1povd",
            "created": 1373727067,
            "created_utc": 1373698267,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 9,
            "link_id": "t3_1hxjqx",
            "id": "cayxmxc",
            "author": "evidencebasedfitness",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Just about to head out to train here, so just clarifying questions below.",
            "body_html": "<div class=\"md\"><p> Просто собираюсь отправиться тренироваться здесь, так что уточняю вопросы ниже. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxmxc/",
            "name": "t1_cayxmxc",
            "created": 1373407790,
            "created_utc": 1373378990,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 6,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb32egg",
                    "author": "bobthemagiccan",
                    "parent_id": "t1_cb31zcj",
                    "subreddit_id": "t5_2s9km",
                    "body": "i like your reply, respect+1. I'm a clinical epidemiologist who is annoyed by many physicians that easily dismiss alternative treatments due to lack of evidence, but also do not realize that many drug treatments lack evidence as well",
                    "body_html": "<div class=\"md\"><p> Мне нравится ваш ответ, уважение +1. Я - клинический эпидемиолог, которого раздражают многие врачи, которые легко отказываются от альтернативного лечения из-за отсутствия доказательств, но я также не понимаю, что многие лекарства не имеют доказательств </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb32egg/",
                    "name": "t1_cb32egg",
                    "created": 1373930034,
                    "created_utc": 1373901234,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1p2j5",
            "author": "bobthemagiccan",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "what is your honest personal opinion of chiropractors?",
            "body_html": "<div class=\"md\"><p> Каково ваше честное личное мнение о мануальных терапевтах? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1p2j5/",
            "name": "t1_cb1p2j5",
            "created": 1373724219,
            "created_utc": 1373695419,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_1hxjqx",
                    "id": "caz85yq",
                    "author": "daammyy",
                    "parent_id": "t1_caz83po",
                    "subreddit_id": "t5_2s9km",
                    "body": "Ok thanks! Yea can't find any studies either and people claiming it has a neuromuscular effect dont respond back :( \nThank you!",
                    "body_html": "<div class=\"md\"><p> Хорошо спасибо! Да, я не могу найти никаких исследований, и люди, утверждающие, что он обладает нервно-мышечным эффектом, не отвечают :( Спасибо! </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz85yq/",
                    "name": "t1_caz85yq",
                    "created": 1373434028,
                    "created_utc": 1373405228,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayxte9",
            "author": "daammyy",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What effect does Methylphenidate have on losing weight or gaining muscle? Some redditors claim that as many other stimulants not only does it regulate your appetite but it's a form of enhancement drug.\n\nPardon the bad english :( Great site by the way.  ",
            "body_html": "<div class=\"md\"><p> Какое влияние оказывает метилфенидат на снижение веса или увеличение мышечной массы? Некоторые реддиторы утверждают, что, как и многие другие стимуляторы, он не только регулирует ваш аппетит, но и является формой улучшающего лекарства. </p><p> Простите за плохой английский :( Отличный сайт, кстати. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxte9/",
            "name": "t1_cayxte9",
            "created": 1373408368,
            "created_utc": 1373379568,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "id": "cayye8w",
            "author": "eric_twinge",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hi Bryan, thanks for stopping by for the AMA.  \n\nWhat are you thoughts on [NuSi](http://nusi.org/), the Taubes affiliated nutrition science initiative?  After reading more of Peter Attia's stuff on his website, I'm a lot more hopeful of the venture than I was initially.  \n\nCare to hazard a guess at what they'll find?",
            "body_html": "<div class=\"md\"><p> Привет Брайан, спасибо, что заглянули на АМА. </p><p> Что вы думаете о <a href=\"http://nusi.org/\">NuSi</a> , инициативе Taubes, связанной с наукой о питании? После прочтения большего количества материала Питера Аттиа на его веб-сайте, я гораздо больше надеюсь на это предприятие, чем изначально. </p><p> Хотите рискнуть догадаться, что они найдут? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayye8w/",
            "name": "t1_cayye8w",
            "created": 1373410103,
            "created_utc": 1373381303,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 4,
                    "link_id": "t3_1hxjqx",
                    "id": "cazowmr",
                    "author": "martyfunkhoser",
                    "parent_id": "t1_caz7vzv",
                    "subreddit_id": "t5_2s9km",
                    "body": "Yes, the condyles were broken at the nubs (not even enough material for the skilled surgeons to anchor a screw through), which my body absorbed while I was in wired shut (IMF), leaving my mandible free-floating since then (3 years).\n\nOcclusion is class 2 category II in my (now) normal/resting state. I have the ability to move my jaw (in the anterior plane), and while relaxing the muscles I can manipulate (with light force on the proximal plane) the assembly into a class 1 occlusion. When I do this, I enter nirvana (no pain, no tension, no mental \"noise\"). IDK which nerves it's resting on, but I can definitely say that it's very difficult to live with.\n\nWhile my dentist has been encouraging me to consider braces, I'm concerned that the increased torque will exacerbate my muscle tension issues(nearly chronic neck/upper back tension).\n\nAside from frequent active release, myofascial release, and RICE, I have hit a plateau with the level of comfort I am able to achieve on an ongoing basis.\n\nSorry for the extreme lay-speak, but while this is far beyond my area of expertise, I am very passionate about it. If you know of a PT, preferably within NYC, that you can recommend, I would be immensely grateful for the reference. Short of that, I am pretty much open to trying anything to reduce the muscle tension in/around my neck/jaw.\n",
                    "body_html": "<div class=\"md\"><p> Да, у насадок были сломаны наконечники (даже у опытных хирургов недостаточно материала, чтобы закрепить винт), который мое тело впитало, когда я был в проводном закрытом положении (IMF), с тех пор моя мандибула свободно плавала (3 года ). </p><p> Окклюзия относится ко 2-й категории 2 класса в моем (теперь) нормальном состоянии / состоянии покоя. У меня есть возможность двигать челюстью (в передней плоскости), и, расслабляя мышцы, я могу манипулировать (с легкой силой в проксимальной плоскости) сборкой в окклюзию класса 1. Когда я делаю это, я вхожу в нирвану (без боли, без напряжения, без умственного «шума»). ИДК, на чьи нервы он опирается, но я могу с уверенностью сказать, что с ним очень трудно жить. </p><p> В то время как мой стоматолог поощрял меня принимать брекеты, я обеспокоен тем, что увеличение крутящего момента усугубит мои проблемы с мышечным напряжением (почти хроническое напряжение шеи / верхней части спины). </p><p> Помимо частого активного высвобождения, миофасциального высвобождения и RICE, я достиг уровня плато с уровнем комфорта, которого я могу достигать на постоянной основе. </p><p> Извините за крайнее молчание, но, хотя это далеко выходит за рамки моей компетенции, я очень увлечен этим. Если вы знаете о PT, желательно в Нью-Йорке, который вы можете порекомендовать, я был бы очень благодарен за справку. Если не считать этого, я в значительной степени открыт для любых попыток уменьшить мышечное напряжение внутри / вокруг моей шеи / челюсти. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazowmr/",
                    "name": "t1_cazowmr",
                    "created": 1373494298,
                    "created_utc": 1373465498,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz1d40",
            "author": "martyfunkhoser",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hi Dr. Chung,\n\nI suffered a guardsman fracture(broke jaw into 4 pieces), and now have no condyles. Since recovery I've noticed an increased level of tension in my neck/upper back, and a decreased ability to safely break-fall(eg. receiving a Judo throw) w/o injuring my trap/rhomboid.\n\nI would like to improve my understanding of the kinetic chain that has been effected by this life-changing incident. Can you please direct me to references for targeting musculature/soft tissue effected by guardsman fractures?\n\nThank you,",
            "body_html": "<div class=\"md\"><p> Привет доктор Чунг, </p><p> У меня был перелом гвардейца (сломал челюсть на 4 части), и теперь у меня нет мыщелков. С момента выздоровления я заметил повышенный уровень напряжения в моей шее / верхней части спины и снижение способности безопасно падать (например, получая бросок по дзюдо) без травм моей ловушки / ромбоида. </p><p> Я хотел бы улучшить мое понимание кинетической цепи, которая была затронута этим изменяющим жизнь инцидентом. Не могли бы вы направить меня к рекомендациям по нацеливанию на мускулатуру / мягкие ткани, вызванные переломами гвардейца? </p><p> Спасибо, </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz1d40/",
            "name": "t1_caz1d40",
            "created": 1373417799,
            "created_utc": 1373388999,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_1hxjqx",
                    "id": "caz7xin",
                    "author": "MoltenSteel",
                    "parent_id": "t1_caz7u3k",
                    "subreddit_id": "t5_2s9km",
                    "body": "Building muscle.  I remember reading that the citrulline malate works with creatine to promote building muscle.  It was probably in a forum somewhere, so I was hoping to get some kind of conclusive answer on it.",
                    "body_html": "<div class=\"md\"><p> Наращивание мышц. Я помню, как читал, что цитруллин малат работает с креатином, чтобы способствовать наращиванию мышц. Вероятно, это было где-то на форуме, так что я надеялся получить какой-то окончательный ответ на него. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz7xin/",
                    "name": "t1_caz7xin",
                    "created": 1373433443,
                    "created_utc": 1373404643,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz2fcc",
            "author": "MoltenSteel",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Citrulline malate and creatine.  Is there a proven connection between the two?  And do you recommend taking both or just creatine?",
            "body_html": "<div class=\"md\"><p> Цитруллин малат и креатин. Есть ли доказанная связь между ними? И вы рекомендуете принимать оба или только креатин? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz2fcc/",
            "name": "t1_caz2fcc",
            "created": 1373420327,
            "created_utc": 1373391527,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "cazdkkg",
                    "author": "riraito",
                    "parent_id": "t1_cazdaui",
                    "subreddit_id": "t5_2s9km",
                    "body": "Funny you mention that cartoon guide to statistics. I just started reading it yesterday and I like it \n\nEdit: by the way, thanks for doing this AMA.",
                    "body_html": "<div class=\"md\"><p> Забавно, что вы упомянули этот мультипликационный справочник по статистике. Я только начал читать это вчера, и мне это нравится </p><p> Редактировать: кстати, спасибо за это AMA. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazdkkg/",
                    "name": "t1_cazdkkg",
                    "created": 1373448582,
                    "created_utc": 1373419782,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz817e",
            "author": "riraito",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Are there any \"underrated\" exercises that you think more people should be doing? How about supplements? or foods?  Any recommended reading?",
            "body_html": "<div class=\"md\"><p> Есть ли «недооцененные» упражнения, которые, по вашему мнению, должны делать больше людей? Как насчет добавок? или продукты? Любое рекомендуемое чтение? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz817e/",
            "name": "t1_caz817e",
            "created": 1373433705,
            "created_utc": 1373404905,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "id": "cazahy8",
            "author": "[deleted]",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "[deleted]",
            "body_html": "<div class=\"md\"><p> [Удалено] </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazahy8/",
            "name": "t1_cazahy8",
            "created": 1373440088,
            "created_utc": 1373411288,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "cb062rl",
                    "author": "StarKiller66",
                    "parent_id": "t1_cazqfcb",
                    "subreddit_id": "t5_2s9km",
                    "body": "Thanks for the info man, really appreciate it",
                    "body_html": "<div class=\"md\"><p> Спасибо за информацию человек, очень ценю это </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb062rl/",
                    "name": "t1_cb062rl",
                    "created": 1373539922,
                    "created_utc": 1373511122,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cazfdvf",
            "author": "StarKiller66",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Former basketball player who tore my ACL (hamstring harvest) and meniscus requiring two surgeries. I hope to continue playing but I was wondering what the factors of re tearing not just in basketball but lifting as well?",
            "body_html": "<div class=\"md\"><p> Бывший баскетболист, который разорвал мой ACL (сбор подколенных сухожилий) и мениск, требующий двух операций. Я надеюсь продолжить игру, но мне было интересно, какие факторы разрывают не только баскетбол, но и подъем? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazfdvf/",
            "name": "t1_cazfdvf",
            "created": 1373453500,
            "created_utc": 1373424700,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "id": "cb1nu3d",
            "author": "Furthur",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "also: which other publications do you review for?",
            "body_html": "<div class=\"md\"><p> также: какие другие публикации вы просматриваете? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1nu3d/",
            "name": "t1_cb1nu3d",
            "created": 1373719531,
            "created_utc": 1373690731,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 3,
            "link_id": "t3_1hxjqx",
            "id": "cb2g79p",
            "author": "longDaddy",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "1. Does spreading out your daily calories (whether it be 3000 or 5000) over 5 meals hold any advantage over consuming it over 3 meals?\n2. If money wasn't an issue, would you recommend a casein shake before bed to perhaps say a chicken breast to impede the catabolic process?",
            "body_html": "<div class=\"md\"><ol><li> Распределяет ли ваше ежедневное потребление калорий (будь то 3000 или 5000) за 5 приемов пищи какое-либо преимущество перед потреблением более 3 приемов пищи? </li><li> Если бы деньги не были проблемой, вы бы порекомендовали встряхивать казеин перед сном, чтобы, возможно, сказать, что куриная грудка препятствует катаболическому процессу? </li></ol></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb2g79p/",
            "name": "t1_cb2g79p",
            "created": 1373846380,
            "created_utc": 1373817580,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 10,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 15,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 12,
                            "link_id": "t3_1hxjqx",
                            "id": "caz1u7s",
                            "author": "[deleted]",
                            "parent_id": "t1_caz11c2",
                            "subreddit_id": "t5_2s9km",
                            "body": ">*over-shooting*\n\nCome on, that had to be intentional.",
                            "body_html": "<div class=\"md\"><blockquote><p> <em>над-съемки</em> </p></blockquote><p> Да ладно, это должно быть преднамеренно. </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz1u7s/",
                            "name": "t1_caz1u7s",
                            "created": 1373418931,
                            "created_utc": 1373390131,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cayxscl",
                    "author": "741789456f",
                    "parent_id": "t1_cayxnoo",
                    "subreddit_id": "t5_2s9km",
                    "body": "Does ejaculation have any effect on your testosterone levels? Like lower/higher testosterone after ejaculation. Also some people are saying that not ejaculating for a week will increase your testosterone levels.\n\npls respond",
                    "body_html": "<div class=\"md\"><p> Влияет ли эякуляция на уровень тестостерона? Как ниже / выше тестостерона после эякуляции. Также некоторые люди говорят, что отсутствие эякуляции в течение недели увеличит уровень тестостерона. </p><p> пожалуйста, ответь </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxscl/",
                    "name": "t1_cayxscl",
                    "created": 1373408273,
                    "created_utc": 1373379473,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayxfy4",
            "author": "741789456f",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Do testosterone levels and ejaculation have anything to do with each other?",
            "body_html": "<div class=\"md\"><p> Уровни тестостерона и эякуляция имеют какое-либо отношение друг к другу? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxfy4/",
            "name": "t1_cayxfy4",
            "created": 1373407126,
            "created_utc": 1373378326,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cayy5ks",
            "author": "hinduguru",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What are your thoughts on sprint interval training?",
            "body_html": "<div class=\"md\"><p> Что вы думаете о спринтерских интервалах? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayy5ks/",
            "name": "t1_cayy5ks",
            "created": 1373409401,
            "created_utc": 1373380601,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "caz4o7w",
            "author": "Jtsunami",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "what your opinion on the higher chance of bicep tears occurring due to alternate grip on DL?   \nis that true?  \n\nand if so what to do to prevent it?",
            "body_html": "<div class=\"md\"><p> Каково ваше мнение о более высокой вероятности появления разрывов бицепса из-за альтернативного захвата DL? <br/> это правда? </p><p> и если так, что делать, чтобы предотвратить это? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz4o7w/",
            "name": "t1_caz4o7w",
            "created": 1373425665,
            "created_utc": 1373396865,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1nv3w",
            "author": "ImUsuallyTony",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I recently discovered I have a drop shoulder.  Are there any kinds of exercises I could do to balance them out? \n\nAlso what are your thoughts on supplements like creatine monohydrate or nitric oxide?  Whenever I try them out I feel like I can do more but I also have been off them for awhile and haven't seen much of a change in strength.  ",
            "body_html": "<div class=\"md\"><p> Я недавно обнаружил, что у меня есть плечо. Могу ли я сделать какие-нибудь упражнения, чтобы сбалансировать их? </p><p> Кроме того, что вы думаете о добавках, таких как креатин моногидрат или оксид азота? Всякий раз, когда я испытываю их, я чувствую, что могу сделать больше, но я также отказался от них некоторое время и не видел большого изменения в силе. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1nv3w/",
            "name": "t1_cb1nv3w",
            "created": 1373719627,
            "created_utc": 1373690827,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb25ojq",
                    "author": "MaryIsGood",
                    "parent_id": "t1_cb1zf6f",
                    "subreddit_id": "t5_2s9km",
                    "body": "Thanks :) I was really discouraged.",
                    "body_html": "<div class=\"md\"><p> Спасибо :) Я был очень обескуражен. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb25ojq/",
                    "name": "t1_cb25ojq",
                    "created": 1373796933,
                    "created_utc": 1373768133,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1ptqd",
            "author": "[deleted]",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "[deleted]",
            "body_html": "<div class=\"md\"><p> [Удалено] </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1ptqd/",
            "name": "t1_cb1ptqd",
            "created": 1373727732,
            "created_utc": 1373698932,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1rohg",
            "author": "levettron",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What are your thoughts on Clenbuterol as a fat loss drug?",
            "body_html": "<div class=\"md\"><p> Что вы думаете о Кленбутероле как о препарате для похудения? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1rohg/",
            "name": "t1_cb1rohg",
            "created": 1373740769,
            "created_utc": 1373711969,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1uek9",
            "author": "crimsonmia",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I'm on a bunch of anti-inflammatory drugs for RA, including 5mg prednisone daily.  How much impact do you think the steroid has on my ability to gain strength? (I'm less interested in hypertrophy)\n\nThanks for doing this AMA, has been interesting and helpful even if you don't get around to my late question.",
            "body_html": "<div class=\"md\"><p> Я принимаю противовоспалительные препараты для лечения РА, в том числе 5 мг преднизона в день. Как вы думаете, насколько сильно стероид влияет на мою способность набирать силу? (Меня меньше интересует гипертрофия) </p><p> Спасибо за выполнение этого AMA, было интересно и полезно, даже если вы не нашли время ответить на мой последний вопрос. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1uek9/",
            "name": "t1_cb1uek9",
            "created": 1373757382,
            "created_utc": 1373728582,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1uf8d",
            "author": "daffadina",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "im suffering from fistula wen ever started doing workout and getting relief from it after stopping workout for fewdays help me....",
            "body_html": "<div class=\"md\"><p> Я страдаю от свища, когда-либо начал делать тренировки и получить облегчение после остановки тренировки на несколько дней, помогите мне .... </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1uf8d/",
            "name": "t1_cb1uf8d",
            "created": 1373757455,
            "created_utc": 1373728655,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb40fut",
                    "author": "LazarusRises",
                    "parent_id": "t1_cb3zvef",
                    "subreddit_id": "t5_2s9km",
                    "body": "Got it. Thanks for the advice!",
                    "body_html": "<div class=\"md\"><p> Понял. Спасибо за совет! </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb40fut/",
                    "name": "t1_cb40fut",
                    "created": 1374036329,
                    "created_utc": 1374007529,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1umh9",
            "author": "LazarusRises",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hi Bryan! Cool AMA.\n\nWhat's your take on barefoot running? I sort of got sucked into it and used Vibram Five-Fingers for a while, but developed what I think was a stress fracture in my right shin and couldn't run for months. I'm back into it now, working back up to where I used to be, and using Saucony shoes recommended to me by the Super Runner's Store with a 2mm heel lift (as opposed to I think 8 or 16mm in regular shoes?). The barefoot running style (forefoot strike rather than heel strike) has stayed with me, and feels natural in these shoes, but every once in a while I feel a twinge in my leg. I'm not sure if it's just from running or from running in this style, since I no longer have any regular-heel sneakers. \n\nI did a fair amount of research into barefoot running before starting it, and it seems pretty legit, but I'm interested in what you have to say. I've heard a former Olympian trainer saying that foot doctors love barefoot running because it gets them more customers, so I'm not entirely sure what to think. \n\nThanks!",
            "body_html": "<div class=\"md\"><p> Привет, Брайан! Классная АМА. </p><p> Что ты думаешь о беге босиком? Я как бы втянулся в это и некоторое время использовал Vibram Five-Fingers, но развил, как мне кажется, стресс-перелом правой голени и не мог бегать месяцами. Я вернулся к этому сейчас, возвращаясь туда, где я был раньше, и используя туфли Saucony, рекомендованные мне в магазине Super Runner&#39;s Store с подъемом пятки 2 мм (в отличие от 8 или 16 мм в обычных туфлях?). Стиль бега босиком (удар в переднюю ногу, а не в пятку) остался со мной, и я чувствую себя естественно в этих туфлях, но время от времени я чувствую укол в ноге. Я не уверен, что это просто из-за бега или из-за того, что бегаю в этом стиле, так как у меня больше нет кроссовок на обычном каблуке. </p><p> Я провел довольно много исследований бега босиком, прежде чем начать, и это кажется вполне законным, но мне интересно, что вы скажете. Я слышал, как бывший олимпийский тренер говорил, что пешие врачи любят бегать босиком, потому что это дает им больше клиентов, поэтому я не совсем уверен, что и думать. </p><p> Благодарность! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1umh9/",
            "name": "t1_cb1umh9",
            "created": 1373758225,
            "created_utc": 1373729425,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1vwmz",
            "author": "lemonfluff",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Can you talk about how type 1 diabetes can effect exercise? I don't mean like how exercise can change insulin resistance, more how energy is used during sport. I am T1 and whilst I try to get fit I find it hard managing my sugar levels with and throughout the sport I do. I feel drained and exhausted a lot (especially when doing anaerobic) and feel like I have less energy than other people, possibly because of my sugar levels fluctuating. Would this change how my body uses the energy? I know it can be difficult for diabetics to lose weight. I hope this question makes sense! ",
            "body_html": "<div class=\"md\"><p> Можете ли вы рассказать о том, как диабет 1 типа может влиять на физические упражнения? Я не имею в виду то, как физические упражнения могут изменить резистентность к инсулину, а то, как энергия используется во время занятий спортом. Я - T1, и, хотя я пытаюсь быть в форме, мне трудно управлять уровнем сахара во всем и во всем спорте, которым я занимаюсь. Я чувствую себя истощенным и истощенным (особенно когда занимаюсь анаэробикой) и чувствую, что у меня меньше энергии, чем у других людей, возможно, из-за колебаний уровня сахара. Изменится ли это, как мое тело использует энергию? Я знаю, что для диабетиков может быть трудно похудеть. Я надеюсь, что этот вопрос имеет смысл! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1vwmz/",
            "name": "t1_cb1vwmz",
            "created": 1373762881,
            "created_utc": 1373734081,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb4hfyh",
                    "author": "Vonheretric",
                    "parent_id": "t1_cb406we",
                    "subreddit_id": "t5_2s9km",
                    "body": "I ruptured my ankle ligaments about 2 years ago, I used to run alot before I had my injury though. Thank you very much for commenting though!",
                    "body_html": "<div class=\"md\"><p> Я порвал связки голеностопного сустава около 2 лет назад, хотя раньше я много бегал до того, как получил травму. Спасибо большое за комментарии! </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb4hfyh/",
                    "name": "t1_cb4hfyh",
                    "created": 1374099427,
                    "created_utc": 1374070627,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1w7ei",
            "author": "Vonheretric",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I want to get back into running again, but my ankles feel stiff just after a short period of walking/running due to an injury. What kind of advice could you give me? I do cycle alot, and that does not cause any troubles.",
            "body_html": "<div class=\"md\"><p> Я хочу вернуться к бегу снова, но мои лодыжки чувствуют себя жесткими сразу после короткого периода ходьбы / бега из-за травмы. Какой совет вы могли бы дать мне? Я много занимаюсь велосипедом, и это не доставляет никаких хлопот. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1w7ei/",
            "name": "t1_cb1w7ei",
            "created": 1373763903,
            "created_utc": 1373735103,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1xtkt",
            "author": "marbel",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Thank you for this AMA-it's awesome!  I've since bookmarked your (and Bill Hartman's) blog and am now your newest stalker, lol...one thing I'm gathering, perhaps incorrectly, is that a lot of the weight-loss and training advice seems to be targeted towards men.  Is this because there should be no difference between how men and women train/ diet/ etc?  Or, are there other, reputable resources out there you would say were as sound as yours?\n\nThanks in advance for answering, if you can...if you can't, I completely understand!  ",
            "body_html": "<div class=\"md\"><p> Спасибо за эту АМА - это круто! С тех пор я добавил в закладки ваш (и блог Билла Хартмана), и теперь я ваш самый новый сталкер, лол ... одна вещь, которую я собираю, возможно, неправильно, заключается в том, что многие советы по снижению веса и тренировкам, похоже, направлены на мужчины. Это потому, что не должно быть никакой разницы между тем, как мужчины и женщины тренируются / питаются / и т.д.? Или есть ли другие авторитетные ресурсы, которые вы бы назвали такими же надежными, как и ваши? </p><p> Спасибо заранее за ответ, если можете ... если не можете, я полностью понимаю! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1xtkt/",
            "name": "t1_cb1xtkt",
            "created": 1373769359,
            "created_utc": 1373740559,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "id": "cb40wc4",
                    "author": "eurotrashshow",
                    "parent_id": "t1_cb40j53",
                    "subreddit_id": "t5_2s9km",
                    "body": "You are a rockstar. Thanks so much for taking the time to answer this for me. I really, really appreciate it.",
                    "body_html": "<div class=\"md\"><p> Вы рок-звезда. Большое спасибо, что нашли время, чтобы ответить на это для меня. Я очень, очень ценю это. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb40wc4/",
                    "name": "t1_cb40wc4",
                    "created": 1374037460,
                    "created_utc": 1374008660,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1zh66",
            "author": "eurotrashshow",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I've got a question for you: Recently diagnosed with a minor inguinal hernia. Causes occasional minor discomfort but no major pain. I'm uninsured at the moment, so no surgery in the near future. The doc told me I could still work out, but to be careful not to make things worse. Unfortunately she wasn't able to describe what exactly I could do. \n\nGenerally, I lift 3-4 days per week, and I run, cycle and swim for cardio on off-days. I've read that swimming/cycling is ok with a hernia, at least until I can have the operation.\n\nAny advice for things I could/should do to keep fit? Is lifting possible if I'm careful not to hold my breath while lifting or straining the area? I never miss a workout, so the prospect of taking months off until I can get this repaired is really daunting.\n\nTHANK YOU!!",
            "body_html": "<div class=\"md\"><p> У меня к вам вопрос: недавно диагностировали небольшую паховую грыжу. Вызывает незначительный дискомфорт, но не вызывает сильных болей. В настоящий момент я не застрахован, поэтому в ближайшее время не буду делать никаких операций. Док сказал мне, что я все еще могу потренироваться, но будь осторожен, чтобы не усугубить ситуацию. К сожалению, она не смогла описать, что именно я мог сделать. </p><p> Обычно я поднимаю 3-4 дня в неделю и бегаю, езжу на велосипеде и плаваю для кардио в выходные дни. Я читал, что плавание / езда на велосипеде нормально с грыжей, по крайней мере, пока я не смогу сделать операцию. </p><p> Какой-нибудь совет для вещей, которые я мог / должен сделать, чтобы быть в форме? Возможен ли подъем, если я стараюсь не задерживать дыхание во время подъема или напряжения в области? Я никогда не пропускаю тренировки, поэтому перспектива использования месяцев, пока я не смогу починить, действительно устрашает. </p><p> СПАСИБО!! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1zh66/",
            "name": "t1_cb1zh66",
            "created": 1373774994,
            "created_utc": 1373746194,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb2anax",
            "author": "isaginger",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I had twins 3 months ago.  I have always been in shape but with the high risk pregnancy I wasn't able to work out for essentially the entire 9 months.  My abdominal muscles are wrecked from the pregnancy.  What are some good ways to get the muscles back into the shape they were used to?  ",
            "body_html": "<div class=\"md\"><p> У меня были близнецы 3 месяца назад. Я всегда был в форме, но с беременностью с высоким риском я не мог тренироваться по существу все 9 месяцев. Мои мышцы живота разрушены от беременности. Какие есть хорошие способы вернуть мышцы в форму, к которой они привыкли? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb2anax/",
            "name": "t1_cb2anax",
            "created": 1373813892,
            "created_utc": 1373785092,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb2efor",
            "author": "laserspewpewepw",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "first, thank you so much for doing this AMA. I've found loads of good info and there's still more to go.\n\nAlthough it's a fifth day and I doubt that you are hanging around, but I will try:\n\nabout a year and a half ago I have broken my C5 vertebrae. It was a  compression damage and the vertebrae was split into 3 pieces. Docs chose not to operate me and now my C5 and C4 have joined on the face side(as appose to back/bum side). I was advised not to do any heavy lifting or other heavy loads.\n\nmy stats are: 23/M/5'11\" | CW 148 | BF ~17%\n\nCurrently my workout routine consists of pull ups, crunches, kettle bell swings and squats with a kettlebell for extra weight.\n\nI would like to get into heavier exercises (deadlifts and alike).\n\nDo you think, I could do them safely? or should I stay away from them completely. maybe you could provide an advice for some specific exercises? \n\nfew extra questions if you will have time:\n\nis it worth taking BCAA for gaining muscule?\n\nwhat do you think of Tim Ferris' 30g of protein within 30-60min within waking up rule?\n\nthank you, once more",
            "body_html": "<div class=\"md\"><p> Во-первых, большое спасибо за эту АМА. Я нашел много полезной информации, и еще многое предстоит сделать. </p><p> Хотя это уже пятый день и я сомневаюсь что ты слоняешься вокруг, но я попробую </p><p> около полутора лет назад у меня сломались позвонки C5. Это было повреждение при сжатии, и позвонки были разделены на 3 части. Документы решили не работать со мной, и теперь мои C5 и C4 соединились на лицевой стороне (как в случае со спиной / задницей). Мне посоветовали не делать никаких тяжелых работ или других тяжелых грузов. </p><p> моя статистика: 23 / M / 5&#39;11 &quot;| CW 148 | BF ~ 17% </p><p> В настоящее время моя тренировка состоит из подтягиваний, хрустов, качелей чайника и приседаний с гирей для дополнительного веса. </p><p> Я хотел бы заняться более тяжелыми упражнениями (тяга и тому подобное). </p><p> Как вы думаете, я мог бы сделать их безопасно? или я должен держаться подальше от них полностью. Может быть, вы могли бы дать совет для некоторых конкретных упражнений? </p><p> Несколько лишних вопросов, если у вас будет время: </p><p> стоит ли брать BCAA для наращивания мышечной массы? </p><p> Что вы думаете о 30 г белка Тима Ферриса в течение 30-60 минут после пробуждения? </p><p> спасибо еще раз </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb2efor/",
            "name": "t1_cb2efor",
            "created": 1373839184,
            "created_utc": 1373810384,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb2kv04",
            "author": "evidencebasedfitness",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I can realistically put in about an hour a day here :) Trying to get to everyone's questions. Sorry for the delay.",
            "body_html": "<div class=\"md\"><p> Я могу реально потратить около часа в день здесь :), пытаясь ответить на все вопросы. Извините за задержку. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb2kv04/",
            "name": "t1_cb2kv04",
            "created": 1373860998,
            "created_utc": 1373832198,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb2syq9",
            "author": "Jtsunami",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "is there any evidence to prove supposed differneces bw hypertrophy based training (higher volume 8-12,3-4sets) and strength training?  \n\nthat hypertrophy training does lead to bigger muscles than strength based?  ",
            "body_html": "<div class=\"md\"><p> есть ли доказательства, подтверждающие предполагаемые различия между тренировками на основе гипертрофии (более высокий объем 8-12,3-4 комплекта) и силовыми тренировками? </p><p> что тренировка гипертрофии приводит к увеличению мышц, чем основанная на силе? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb2syq9/",
            "name": "t1_cb2syq9",
            "created": 1373886071,
            "created_utc": 1373857271,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb35b9f",
            "author": "Cheeseman182",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "What do you think of Kiefer?  (Dangerously Hardcore / Athlete.io, inventor of Carb Back-Loading and The Carb Nite Solution)\n\nThanks!",
            "body_html": "<div class=\"md\"><p> Что вы думаете о Кифер? (Dangerously Hardcore / Athlete.io, изобретатель обратной загрузки Carb и решения Carb Nite) </p><p> Благодарность! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb35b9f/",
            "name": "t1_cb35b9f",
            "created": 1373938102,
            "created_utc": 1373909302,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 4,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "cb1pg3n",
                    "author": "zibbidy007",
                    "parent_id": "t1_cb1pd3f",
                    "subreddit_id": "t5_2s9km",
                    "body": "Thank you, I didn't know about this induction period.",
                    "body_html": "<div class=\"md\"><p> Спасибо, я не знал об этом вводном периоде. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1pg3n/",
                    "name": "t1_cb1pg3n",
                    "created": 1373725906,
                    "created_utc": 1373697106,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cb1p0xm",
            "author": "zibbidy007",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Hello I'm having an issue. I'm trying this new diet called Keto. It's low carb high protein based. But I can't seem to stay on it.\n\nHow do I keep by cravings at bay? I drink a lot of water but that really doesn't seem to help. I haven't been able to get past day 1. And I've had plenty day 1's now. How can I stop the cravings?",
            "body_html": "<div class=\"md\"><p> Здравствуйте, у меня возникла проблема. Я пробую эту новую диету под названием Кето. Это низкоуглеводный с высоким содержанием белка на основе. Но я не могу остановиться на этом. </p><p> Как я могу сдерживать тягу к страху? Я пью много воды, но это, похоже, не помогает. Я не смог пройти первый день. И у меня было много первого дня. Как я могу остановить тягу? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1p0xm/",
            "name": "t1_cb1p0xm",
            "created": 1373724026,
            "created_utc": 1373695226,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "id": "cb1ogor",
            "author": "Laubgoblin",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "In case you're still answering questions, what academic field do you realistically think provides the most all-encompassing, objective view of steps to take to live a long and active life? There are many fields of study that specialise in various aspects of fitness, but which do you consider to offer the biggest, most complete picture of how to live and be healthy longer?\n\nThank you.",
            "body_html": "<div class=\"md\"><p> Если вы по-прежнему отвечаете на вопросы, как вы думаете, в какой области науки вы найдете наиболее всеобъемлющий, объективный взгляд на шаги, которые необходимо предпринять, чтобы прожить долгую и активную жизнь? Есть много областей исследований, которые специализируются на различных аспектах фитнеса, но какие, по вашему мнению, дают самую большую и наиболее полную картину того, как дольше жить и быть здоровым? </p><p> Спасибо. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1ogor/",
            "name": "t1_cb1ogor",
            "created": 1373721802,
            "created_utc": 1373693002,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 3,
                    "link_id": "t3_1hxjqx",
                    "id": "caz0f3y",
                    "author": "Cmille19",
                    "parent_id": "t1_cayxopx",
                    "subreddit_id": "t5_2s9km",
                    "body": "im 19, turn 20 in november. I go to the gym daily and run atleast 4 miles along with lifting. im 6 feet tall. i maxed my bench out at 200 and squat at 350. ",
                    "body_html": "<div class=\"md\"><p> в 19, 20 в ноябре. Я хожу в тренажерный зал ежедневно и бегаю по крайней мере 4 мили вместе с подъемом. я 6 футов ростом. я разогнал свою скамейку на 200 и приседал на 350. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz0f3y/",
                    "name": "t1_caz0f3y",
                    "created": 1373415526,
                    "created_utc": 1373386726,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cayxi1h",
            "author": "Cmille19",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "So im having this issue. I wrestled in high school and never topped more than 150 pounds. Now a year after graduation I am 200 pounds, despite remaining active. I cant lift much more than I did in high school. Is this just normal?",
            "body_html": "<div class=\"md\"><p> Так что у меня возникла эта проблема. Я боролся в средней школе и никогда не превышал более 150 фунтов. Сейчас через год после окончания учебы у меня 200 фунтов, несмотря на то, что я остаюсь активным Я не могу поднять гораздо больше, чем в старшей школе. Это просто нормально? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cayxi1h/",
            "name": "t1_cayxi1h",
            "created": 1373407325,
            "created_utc": 1373378525,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 2,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 2,
                    "link_id": "t3_1hxjqx",
                    "replies": [
                        {
                            "ups": 2,
                            "link_id": "t3_1hxjqx",
                            "id": "cb1wi14",
                            "author": "[deleted]",
                            "parent_id": "t1_cazvmtz",
                            "subreddit_id": "t5_2s9km",
                            "body": "[deleted]",
                            "body_html": "<div class=\"md\"><p> [Удалено] </p></div>",
                            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cb1wi14/",
                            "name": "t1_cb1wi14",
                            "created": 1373764890,
                            "created_utc": 1373736090,
                            "subreddit_name_prefixed": "r/AdvancedFitness",
                            "depth": 4
                        }
                    ],
                    "id": "cazr87j",
                    "author": "schnellkochtopf",
                    "parent_id": "t1_cazdggr",
                    "subreddit_id": "t5_2s9km",
                    "body": "Well, just in the first set. After that i drop to a weight where i can do 8-10reps. But yeah every bench workout in the last 2 weeks, I tried 130lbs after my warmup set. I could do 8 of those but then somehow instead of progressing i dropped down and am now stagnating at 6. But it is only my bench that is stagnating, in the the other exercises i am progressing well.",
                    "body_html": "<div class=\"md\"><p> Ну просто в первом сете. После этого я падаю в вес, где я могу сделать 8-10reps. Но да, на каждой тренировке на скамейке за последние 2 недели я пробовал 130 фунтов после разминки. Я мог сделать 8 из них, но потом каким-то образом, вместо того, чтобы прогрессировать, я упал и теперь застаиваюсь на 6. Но только моя скамья застаивается, в других упражнениях я хорошо прогрессирую. </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazr87j/",
                    "name": "t1_cazr87j",
                    "created": 1373500858,
                    "created_utc": 1373472058,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "caz8atf",
            "author": "schnellkochtopf",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "So i started working out kind of serious maybe 2.5 years ago, i had a really bad routine, doing only bench-press and weighted chin-ups with a horrible diet. (Gained like 20lbs in 5months, needlessly to say that most of it was fat). Than after a pause i started working out in a gym, only with machines at first, then after a while (roughly 10months ago) switch back to barbells, but this time use them to train the whole body. After my bulk i was at 155lbs with 5ft 10.5''. After cutting at 130lbs, now at 152 (with much less fat than after my bulk). But here is my problem since i started working out with barbells again, i gained like 15lbs but my benchpress is still lower than it was during my bulk. My deadlifts are at 242lbs 10-12reps. Squats 155lbs 12-15reps. But my bench stagnates at 130 6times pretty much for weeks now. I tried going for strength (3-5 reps) for a while, now tried 8-10reps again, and even dropped from 8reps 130lbs to 6reps 2 weeks ago. So pretty much no real progress for over a month. Put some isolation exercises in my routine to hit them harder, tried one more rest-day etc.. Nothing worked. What would you, the expert, recommend to get over this plateau? ",
            "body_html": "<div class=\"md\"><p> Так что я начал заниматься серьезными упражнениями, может быть, 2,5 года назад, у меня была очень плохая рутина, я делал только жим лежа и взвешенные подбородки с ужасной диетой. (Получил, как 20 фунтов за 5 месяцев, не говоря уже о том, что большая часть была жирной). После паузы я начал тренироваться в тренажерном зале, сначала только с тренажерами, затем через некоторое время (примерно 10 месяцев назад) снова переключаюсь на штанги, но на этот раз использую их для тренировки всего тела. После моей большой я был в 155 фунтах с 5 футами 10,5 &#39;&#39;. После резки на 130 фунтов, теперь на 152 (с гораздо меньшим количеством жира, чем после моей массы). Но вот моя проблема, так как я снова начал работать со штангой, я набрал около 15 фунтов, но мой жим лежа все еще ниже, чем во время моей основной массы. Мои тяги на 242 фунтах 10-12 репсов. Приседания 155 фунтов 12-15reps. Но моя скамья застаивается на 130 6 раз в течение нескольких недель. Некоторое время я пытался набрать силу (3-5 повторений), теперь снова пробовал 8-10reps, и даже упал с 8reps 130lbs до 6reps 2 недели назад. Так что почти никакого реального прогресса больше месяца. Поместите в мою рутину упражнения на изоляцию, чтобы ударить их сильнее, попробовали еще один день отдыха и т. Д. Ничего не помогло. Что бы вы, эксперт, посоветовали преодолеть на этом плато? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/caz8atf/",
            "name": "t1_caz8atf",
            "created": 1373434371,
            "created_utc": 1373405571,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_1hxjqx",
            "replies": [
                {
                    "ups": 1,
                    "link_id": "t3_1hxjqx",
                    "id": "cazrfn6",
                    "author": "devedander",
                    "parent_id": "t1_cazrd80",
                    "subreddit_id": "t5_2s9km",
                    "body": "I was afraid of that.  My only thoughts are they are massively damaging to platelet count and I wondered if platelet's are responsible for repairing/building muscle...",
                    "body_html": "<div class=\"md\"><p> Я боялся этого. Мои единственные мысли - они наносят огромный ущерб количеству тромбоцитов, и я подумал, ответственны ли тромбоциты за восстановление / наращивание мышечной массы ... </p></div>",
                    "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazrfn6/",
                    "name": "t1_cazrfn6",
                    "created": 1373501396,
                    "created_utc": 1373472596,
                    "subreddit_name_prefixed": "r/AdvancedFitness",
                    "depth": 2
                }
            ],
            "id": "cazexhq",
            "author": "devedander",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Do you have any understanding of the effects of pegylated interferon on strength training/muscle growth?  Does it have a negative impact?",
            "body_html": "<div class=\"md\"><p> Есть ли у вас понимание влияния пегилированного интерферона на силовые тренировки / рост мышц? Оказывает ли это негативное влияние? </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazexhq/",
            "name": "t1_cazexhq",
            "created": 1373452268,
            "created_utc": 1373423468,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_1hxjqx",
            "id": "cazfym6",
            "author": "[deleted]",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "Have you done research on the effects triphasic style of training and opinions either good or bad.",
            "body_html": "<div class=\"md\"><p> Провели ли вы исследование влияния трехфазного стиля тренировок и мнений, как хороших, так и плохих. </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazfym6/",
            "name": "t1_cazfym6",
            "created": 1373454993,
            "created_utc": 1373426193,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        },
        {
            "ups": 1,
            "link_id": "t3_1hxjqx",
            "id": "cazpnil",
            "author": "darkeningsoul",
            "parent_id": "t3_1hxjqx",
            "subreddit_id": "t5_2s9km",
            "body": "I'm interested in becoming a personal trainer on the side and have been researching different certification sites.  Which certification do you think would be the most valuable/reputable (ACE, NASM, ISSA, etc)?  Thanks so much man!",
            "body_html": "<div class=\"md\"><p> Я заинтересован в том, чтобы стать личным тренером на стороне и изучал различные сайты сертификации. Какую сертификацию вы считаете наиболее ценной / заслуживающей доверия (ACE, NASM, ISSA и т. Д.)? Большое спасибо, человек! </p></div>",
            "permalink": "/r/AdvancedFitness/comments/1hxjqx/bryan_chung_evidencebased_fitnesss_ama/cazpnil/",
            "name": "t1_cazpnil",
            "created": 1373496573,
            "created_utc": 1373467773,
            "subreddit_name_prefixed": "r/AdvancedFitness",
            "depth": 0
        }
    ]
}