{
    "subreddit": {
        "display_name": "AdvancedFitness"
    },
    "subreddit_loc": "AdvancedFitness",
    "selftext": " \n\nВам столько лет, сколько вы думаете ... или, по крайней мере, действуете. Когда дело доходит до вашего фитнес-возраста, вы можете быть старше 50 или 60 лет и при этом иметь возможность кого-то в возрасте 20 лет, если вы поступите правильно.\n\n\n\nЕсть несколько компонентов, чтобы оставаться физически молодыми, и ни одна вещь не лучше и не важнее, чем другая. Но соберите их вместе, и ваше здоровье, качество жизни и ваша внешность будут благодарны вам на долгие годы.\n\n\n\n** Сердечно-сосудистая емкость (он же VO2max) **\n\n\n\nИсследование, проведенное в 2007 году Ульриком Вислеффом, профессором физиологии физических упражнений в Норвегии, разработало алгоритм расчета возраста с точки зрения уровня его физической подготовки (который, к сожалению, фактически не меняет ваш реальный возраст).\n\n\n\nИсследование было сосредоточено вокруг сердечно-сосудистых способностей, веса, талии, досуга и пола, чтобы вычислить ваш фитнес-возраст.\n\n\n\nИсследования, которые первоначально проводил доктор Вислефф, были частью последующего исследования, которое началось в 1980 году (исследование HUNT) с участием 37 000 человек.\n\n\n\nТо, что они обнаружили, не было неожиданностью. Те, кто был в форме, жили дольше. Фактически, они рассчитали степень, в которой физическая форма снижает риск сердечных заболеваний.\n\n\n\n** Takeaways: **\n\nНедостаточно просто поднимать тяжести и делать умеренные кардио\n\nКардио высокой интенсивности, такие как HIIT (например, Boot Camp, Intervals, Tabata), является необходимой частью вашего тренировочного режима, так как это наиболее эффективный способ увеличить ваш VO2max.\n\nПройдите тест Вислеффа здесь: [https://www.worldfitnesslevel.org/#/](https://www.worldfitnesslevel.org/#/)\n\n\n\n** Основная сила **\n\n\n\nНо только кардио является не единственной защитой от старения и связанных с ним болезней. Исследование, опубликованное в 2015 году в The Lancet, проверило силу сцепления на 140 000 взрослых в возрасте от 35 до 70 лет.\n\n\n\nРезультаты показали, что снижение силы рук на 5 кг (или 11 фунтов) было связано с повышенным на 17% риском сердечного приступа или инсульта.\n\n\n\nЗачем? Сила рук была отличным показателем общей потери мышц.\n\n\n\nСила сцепления также была хорошим показателем потери подвижности. Исследование, проведенное в 2014 году журналом Gerontology Series A: биологические и медицинские науки, пришло к выводу, что значительное снижение силы сцепления совпало со значительным снижением подвижности.\n\n\n\nЭто ни в коем случае не ракетостроение, если вы неактивны, неудивительно, что с возрастом вы будете становиться все слабее и жестче.\n\n\n\nХорошая новость заключается в том, что это легко предотвратить, и рост силы и мобильности наблюдается у людей в возрасте 80-90 лет.\n\n\n\n** Takeaways: **\n\nВы также должны работать со своей основной силой с тяжелыми подъемами, такими как прогулки фермеров, становая тяга и приседания\n\nПриседания и тяга - сложные упражнения, которые требуют правильной тренировки. Вы должны иметь хорошую форму и достаточную подвижность, чтобы избежать травм. Получите хотя бы пару личных тренировок с уважаемым тренером, чтобы изучить основы этих двух упражнений.\n\nПодробнее о приседаниях читайте здесь: [https://www.youtube.com/watch?v=SOIJ\\_WkCGh8](https://www.youtube.com/watch?v=SOIJ_WkCGh8)\n\nПримечание: приседания и тяга также являются двумя лучшими основными упражнениями\n\n\n\n** Сила веса тела **\n\n\n\nНе вся сила развивается из любых силовых упражнений. То, что вы хорошо справляетесь с весами, не означает, что вы будете хорошо выполнять упражнения с собственным весом. Управление весом тела требует сбалансированной общей силы тела, что важно, поскольку многие травмы связаны с дисбалансом сил между противоположными мышечными группами.\n\n\n\n** Takeaways: **\n\n\n\nОтжимания, подтягивания, приседания и доски - все это основы, которые должны присутствовать в вашей программе тренировок (или в какой-то мере соответствовать им)\n\nМожет быть, вы никогда не делали подтягивания раньше. Люди в пожилом возрасте научились это делать, и вы тоже можете.\n\n\n\n** Скоординированное упражнение **\n\n\n\nВ книге Джона Дж. Рейти «Спарк. Революционная новая наука об упражнениях и мозге» Рейти показал, что наука доказала, что физические упражнения могут на самом деле заново вырастить клетки мозга, что раньше считалось невозможным.\n\n\n\nЕще более интересным было то, что упражнения, требующие новых уровней координации, еще лучше способствовали росту клеток мозга.\n\n\n\n** Takeaways: **\n\nПопробуйте новые вещи в упражнении, не только новые упражнения, но и новые навыки в целом\n\nЕсли вы изучаете новый навык, тренировка важна. Чем сложнее новый навык, тем больше потребность в хорошем тренере.\n\nПрекрасные примеры умелых упражнений: боевые искусства, гольф, олимпийский подъем, гири и базовая гимнастика (хождение руками, мостики на руках и т. Д.)\n\n\n\n\n\n** Мобильность / Гибкость **\n\n\n\nОтдельные исследования, проведенные Университетом Северной Дакоты и Университетом Каштелу-Бранку в Бразилии, показали, что тяжелая атлетика (при правильной форме) так же хороша, как статическое растяжение для улучшения подвижности.\n\n\n\nЭто неудивительно, так как олимпийцы высшего уровня невероятно гибки. Изучение того, как сидеть на корточках на полную глубину и приседания наверху на всю глубину, требует огромной гибкости.\n\n\n\nХорошей новостью является то, что вам не нужно ждать, пока ваша гибкость улучшится, чтобы выполнять эти упражнения. Скорее, делайте упражнения, которые требуют гибкости в меру ваших возможностей в пределах вашего текущего диапазона движения. Это будет действовать как растяжение, а также тонус и нарастить мышечную массу.\n\n\n\nСо временем вы увидите, что ваша гибкость и диапазон движений в этих упражнениях улучшатся, когда вы будете медленно и постепенно проверять свою глубину, сохраняя хорошую форму на протяжении всего движения.\n\n\n\n** Takeaways: **\n\nНаучитесь хорошо сидеть на корточках и каждые несколько недель уменьшайте высоту бокса на дюйм, пока вам больше не понадобится бокс.\n\nСделайте тот же подход с приседом наверху\n\nСохраняйте вес на свету, даже подойдет штанга, сосредоточьтесь на форме и глубине\n\nМедленно проходите через эти движения, которые потребуют контроля и развития силы в более глубокой части движений, где вам это нужно больше всего\n\n\n\n** Соединяя все вместе **\n\n\n\nЧтобы бросить вызов старению, вы хотите, чтобы в вашем тренировочном режиме было всего понемногу; некоторые высокоинтенсивные кардио, некоторые силовые упражнения, некоторые движения веса тела, и некоторые подвижные работы.\n\n\n\nХорошая рутина будет заключаться в том, что вы будете тренироваться 3-4 дня в неделю следующим образом:\n\n& # X200B;\n\n* Хорошая процедура HIIT может длиться от 10 до 30 минут.\n* Силовые тренировки, как правило, медленнее с большим количеством периодов отдыха, поэтому они могут занять от 45 минут до часа\n* Попробуйте 2 HIIT и 1 - 2 силовых тренировки в неделю\n* Мобильность может быть частью любой рутины, выбирая упражнения, которые работают гибко\n* Включайте упражнения с отягощениями как в свои ВИИТ, так и в силовые тренировки, и у вас будет все необходимое для поддержания низкого возраста.\n\n\n\nСбалансированная рутина - это путь к юношеской жизни, крепкому здоровью и долголетию.",
    "title": "Я написал это руководство о том, как снизить свой фитнес-возраст",
    "subreddit_name_prefixed": "r/AdvancedFitness",
    "ups": 56,
    "created": 1544650786,
    "link_flair_background_color": "",
    "id": "a5i7t4",
    "author": {
        "name": "hiphellec"
    },
    "permalink": "/r/AdvancedFitness/comments/a5i7t4/i_wrote_this_guide_on_how_to_lower_your_fitness/",
    "url": "https://www.reddit.com/r/AdvancedFitness/comments/a5i7t4/i_wrote_this_guide_on_how_to_lower_your_fitness/",
    "created_utc": 1544621986
}