{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Всем привет.\n\nЯ столкнулся с несколько раздражающей проблемой, пытаясь покрыть упражнения с короткой бицепс-головкой - есть тонна противоречивой информации о том, будет ли локон проповедника отдавать предпочтение короткой бицепс-голове или длинной бицепс-голове.\n\nЯ занялся поиском на этом форуме и, к моему разочарованию, нашел ветку, покрывающую это, которая, как ни странно, не дала удовлетворительного ответа, несмотря на количество комментариев:\n\nhttps://www.reddit.com/r/AdvancedFitness/comments/7gged5/can_someone_help_clarify_a_discrepancy_im_finding/\n\nПользователь хорошо освещает большинство вещей, с которыми я столкнулся, с точки зрения противоречивой информации. Если вам интересно узнать ссылки, проверьте это. Есть много других случайных статей и фитнес-видео и бесконечные темы форума, которые также говорят короткую или длинную голову в любом случае.\n\nТем не менее, я заметил в другой ветке, которая поднимает некоторые интересные моменты от пользователей из этого подпункта:\n\nhttps://www.reddit.com/r/AdvancedFitness/comments/10zkmi/just_a_quickie_biceps_innerouter_head/\n\nВ частности, следующие несколько цитат и ссылок:\n\n«Когда предплечье супинируется, бицепс плечевого пояса способствует более значительному сгибанию. Первичной функцией бицепса плечевого плеча является скорее супинация предплечья, чем сгибание локтя.\n\nТеперь о короткой головке и длинной головке двуглавой мышцы плеча: они имеют одну и ту же дистальную привязку и поэтому не могут работать отдельно или преимущественно. Если это вас не убеждает, у них один и тот же мышечный живот, и их проксимальные вложения находятся очень близко друг к другу. Я не хотел бы работать с разными головами. Вместо этого сосредоточьтесь на супинации предплечья с сгибанием локтя, чтобы увеличить нагрузку на бицепс плеча. \"- u / hockeyguy22\n\n«AFAIK, локоны проповедника подчеркивают короткую (внутреннюю) голову, в то время как локоны наклонной гантели подчеркивают длинную (внешнюю) голову, как объяснено:\n\nhttp://www.exercisebiology.com/index.php/site/articles/how_to_hit_your_biceps_long_head_short_head_muscle/\n\nhttp://www.charlespoliquin.com/ArticlesMultimedia/Articles/Article/558/The_Top_Seven_Biceps_Movements_.aspx\n\nЧего я не совсем понимаю, так это как объяснить это на exrx.net. \"- u / truefelt\n\n«Физиотерапевт здесь:\n\nВы правы, вы не можете изолировать, но вы можете сместить, какие мышцы делают большую часть работы. Brachialis всегда работает, так как он вставляется в локтевую кость, но можно подчеркнуть, что brachialis / бицепс помогают больше / меньше, так как они оба вставляются в радиус\n\nBrachiorad: Молотковые кудри Бицепс: супинирующие кудри (выполняйте супинацию, пока вы скручиваете) Brachialis (будет хорошо работать с обоими кудрями, но с предвзятостью, с прядными кудрями) \"- u / quagwire\n\nТак что это? Требование супинации для короткой головки бицепса кажется довольно убедительным повсюду, но как насчет остальных?\n\nПрежде всего, имеет ли сгибание плеча предпочтительную нагрузку на одну голову над другой? Если да, то что это?\n\nВо-вторых, как в него влияет ширина захвата? Вы часто видите, что люди упоминают более широкое сцепление для увеличения работы над более короткой головой бицепса. Это правда?\n\nСпасибо.","title":"Дезинформация локона проповедника","subreddit_name_prefixed":"r/AdvancedFitness","ups":3,"created":1549274529,"link_flair_background_color":"","id":"amwta5","author":{"name":"thunder_crane"},"permalink":"/r/AdvancedFitness/comments/amwta5/preacher_curl_misinformation/","url":"https://www.reddit.com/r/AdvancedFitness/comments/amwta5/preacher_curl_misinformation/","created_utc":1549245729}