{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"В часто цитируемой научной статье «* Индекс массы тела без жира у пользователей и не пользующихся анаболическими и андрогенными стероидами *» и на высоком уровне объясняется, о чем на самом деле статья, как рассчитывается FFMI, и затем я перехожу к очень распространенному и расстраивающие ошибки люди все уходят от этой статьи, утверждая. Главным образом:\n\n1 - верхняя граница человеческого потенциала - это FFMI, равная 25 (взято из второго предложения аннотации, в котором рассматривается только первое исследование, проведенное с 187 спортсменами из Лос-Анджелеса и Бостона).\n\n2 - верхняя граница для человеческого потенциала - FFMI 25,4 (взято из третьего предложения реферата, в котором говорится о СРЕДСТВЕ контрольной группы Mr America\n\n3 - (вы действительно не можете указать ЛЮБОЕ число или уйти с РЕАЛЬНОЙ верхней границей человеческого потенциала, измеряемой FFMI, из этой статьи ...\n\n4 - наконец, что люди используют этот калькулятор FFMI, чтобы найти FFMI для индивидов, которые НЕ В ПРОЦЕССАХ ЖИРА ТЕЛА КОНКУРЕНЦИИ ... Затем я объясняю, как и почему модель ломается для людей, которые не являются исключительно худыми, и почему они не могут быть по сравнению с контрольной группой Mr America (не стероидная контрольная группа пользователей). Это наиболее часто упускаемый из виду, большинство людей просто хватают кого-либо и добавляют свои статистические данные в калькулятор FFMI, который, конечно, даст вам определенное количество, но на самом деле модель ломается, когда люди не находятся на уровне соревновательного уровня (они будут имеют поддельные показания FFMI), и их нельзя сравнивать с MR. Америка Контрольная группа.\n\n\n\nНиже приведена ссылка на мой Vid, объясняющая и углубляющаяся в подробности об исследовании, а также об этих ошибках, которые допускают люди, когда они используют или пытаются понять чтение FFMI, и что оно действительно означает и как оно относится к статье.\n\n\n\n[https://youtu.be/0zsaUpRx1S4] (https://youtu.be/0zsaUpRx1S4) \n\n\n\n","title":"Что люди ошибаются в FFMI - смешные распространенные ошибки, которые люди делают","subreddit_name_prefixed":"r/AdvancedFitness","ups":12,"created":1549290683,"link_flair_background_color":"","id":"amyyvy","author":{"name":"Robnerlandfit"},"permalink":"/r/AdvancedFitness/comments/amyyvy/what_people_are_getting_wrong_about_the_ffmi/","url":"https://www.reddit.com/r/AdvancedFitness/comments/amyyvy/what_people_are_getting_wrong_about_the_ffmi/","created_utc":1549261883}