{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Я читал много статей в Интернете (всегда путешествие само по себе ... особенно в области фитнеса), которые пытаются опровергнуть всю теорию \"мышечной путаницы\" - тот факт, что переключение упражнений означает, что вы не обязательно увидите большой рост и прогресс. Многие статьи ссылаются на прогрессивную перегрузку как на лучший способ приблизиться к тренировкам.\n\n\n\nЯ понимаю, что они имеют в виду. Чтобы улучшить жим лежа на скамье подсудимых, лучше не делать этого, выполняя другое упражнение на следующей неделе. Это все равно, что совершенствовать свой прыжковый прыжок - вы не можете практиковать свой прыжковый прыжок одну неделю, а затем тренируйтесь на следующей неделе в надежде, что ваш прыжковый удар станет лучше. Это кривая обучения, как и все остальное.\n\n\n\nОднако я чувствую, что чего-то не хватает. Я также вижу аргументы для переключения ваших упражнений. Разве ваше тело не адаптируется к этим вещам? Если мы говорим исключительно о росте мышц, разве это упражнение не помогает работать мышцам по-другому? [Эта статья очень о чем я говорю. Ссылки на него перечислены внизу]  (http://xbodyconcepts.com/confused-about-muscle-confusion/)  Мне нравится, как они определяют термин \"мета\" растерянность мышц, когда вы ходите в тренажерный зал каждый день и выполняете совершенно разные упражнения, в отличие от стратегического входа в тренажерный зал и смены упражнения после определенного периода времени, в котором оно требуется.\n\n\n\nУ меня есть проблемы с пониманием этой серой области того, что считается мышечным беспорядком по сравнению с тем, что считается разнообразием упражнений и программированием.\n\n\n\nЯ хотел бы услышать ваши мысли и если это какие-то исследования, которые явно нацелены на такие вещи. К сожалению, все мои поиски в Google приводят к блоггерам и их мнениям, которые трудно обосновать вокруг.","title":"Буквально путая «спутанность мышц» с «разнообразием упражнений»: хорошо ли разнообразие?","subreddit_name_prefixed":"r/AdvancedFitness","ups":48,"created":1549457541,"link_flair_background_color":"","id":"ann7b1","author":{"name":"99_Mining"},"permalink":"/r/AdvancedFitness/comments/ann7b1/literally_confusing_muscle_confusion_with/","url":"https://www.reddit.com/r/AdvancedFitness/comments/ann7b1/literally_confusing_muscle_confusion_with/","created_utc":1549428741}