{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"[Итак, все началось с простого поиска в Reddit] (https://www.reddit.com/r/Fitness/comments/1g1syr/can_excess_protein_be_stored_as_body_fat/cag7yis/). Интересно ... поэтому я решил изучить некоторые исследования.\n\nК сожалению, большая часть родного языка выходит за рамки моей лиги (веская причина, почему я публикую здесь). Тем не менее, [я наткнулся на этот действительно отличный сайт] (https://sci-fit.net/overfeeding-study-collection/), связанный с перекармливанием, особенно с белком. У этого есть маленькие лакомые кусочки, такие как\n\n> Белок является специальным макроэлементом. Организм не обязательно набирает жир при переедании белка.\n\nИтак, я еще больше покопался, чтобы посмотреть, что случилось, и наткнулся на [это исследование] (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5786199/#b47-ijes-10-8-1275. ) и, что важно, эта цитата (FM = жирная масса)\n\n> Употребление диеты с высоким содержанием белка также, по-видимому, не дает окончательного эффекта на ФМ: одно исследование не показало эффекта на ФМ, а другое исследование показало снижение прироста ФМ.\n\nИтак, вы не набираете жир при употреблении избыточного белка? Однако, что случилось с калориями? Вы не наберете вес просто потому, что белок содержит калории? Ну конечно, хватит\n\n> [Переедание привело к значительно меньшему увеличению веса в группе с низким содержанием белка (3,16 кг; 95% ДИ, 1,88–4,44 кг) по сравнению с группой с нормальной белковой диетой (6,05 кг; 95% ДИ, 4,84–7,26 кг) или с высоким группа белковой диеты (6,51 кг; 95% ДИ, 5,23–7,79 кг) (P = 0,002). Жир в организме одинаково увеличивался во всех трех группах белковой диеты и составлял от 50% до более чем 90% избыточных хранимых калорий.] (Https://www.ncbi.nlm.nih.gov/pmc/articles/PMC3777747/)\n\nТаким образом, это исследование признает увеличение веса.\n\n----\n\nМожет быть, я нуб и все путаю? Жир прибавка в весе? Я все путаю?","title":"Можно ли хранить белок в виде жира, и можно ли набрать вес, съев избыточное количество белка?","subreddit_name_prefixed":"r/AdvancedFitness","ups":40,"created":1551538132,"link_flair_background_color":"","id":"awezbk","author":{"name":"FungoGolf"},"permalink":"/r/AdvancedFitness/comments/awezbk/can_protein_be_stored_as_fat_and_can_you_gain/","url":"https://www.reddit.com/r/AdvancedFitness/comments/awezbk/can_protein_be_stored_as_fat_and_can_you_gain/","created_utc":1551509332}