{
    "subreddit": {
        "display_name": "AdvancedFitness"
    },
    "subreddit_loc": "AdvancedFitness",
    "selftext": "**Аннотация**\n\nЦель настоящего исследования состояла в том, чтобы сравнить изменения в антропометрических показателях и работе мышц у пользователей и не пользующихся андрогенными анаболическими стероидами (AAS), выполняющих программы тренировки с отягощениями (RT), включающие только упражнения с несколькими суставами (MJ) или комбинацию MJ и одиночные совместные (SJ) упражнения. Тридцать бодибилдеров-любителей были разделены на 4 группы: пользователи без AAS, выполняющие только упражнения MJ (MJ), пользователи без AAS, выполняющие MJ + SJ (MJ + SJ), пользователи AAS, выполняющие только упражнения MJ (AAS - MJ), и пользователи AAS, выполняющие Упражнения MJ + SJ (AAS - MJ + SJ). До и после 8 недель обучения участников тестировали на максимум 10 повторений (10 ПМ) в различных упражнениях ОТ. Измеряли окружность согнутой руки (FAC), складки бицепса и трицепса. Не было обнаружено никаких взаимодействий между временем и выполнением упражнений SJ ни по одной переменной (p> .05). Тем не менее, между использованием AAS и временем (p <.001) наблюдалась значительная взаимосвязь, так что пользователи AAS демонстрировали более значительный прирост 10RM во всех упражнениях, уменьшение кожных складок и увеличение FAC по сравнению с не пользователями. В заключение ** наше исследование показывает, что добавление упражнений SJ к упражнениям MJ не дает дополнительных преимуществ с точки зрения мышечной деятельности и антропометрических изменений у тренированных мужчин **, независимо от того, использовали ли они AAS или нет. Эти результаты свидетельствуют о том, что ** обученные мужчины могут сэкономить время, не включая SJ в своей рутине, и все же достичь ** *** оптимальных результатов ***. Кроме того, наши результаты показывают, что использование AAS связано с большим увеличением мышечной силы и FAC и большим уменьшением толщины кожной складки бицепса и трицепса.\n\n** Некоторые мысли об этом исследовании **\n\nСначала я думал, что причина, по которой не было обнаружено различий, заключалась в том, что ученики были близки к своему генетическому потенциалу. Можно было бы подумать, что 30 участников, близких к их генетическому потенциалу, изученных всего за 8 недель, не продемонстрировали бы статистически значимой разницы. Но если присмотреться к данным, слушатели не настолько сильны, когда начинают.\n\nДругая мысль состоит в том, что все участники уже занимаются MJ + SJ перед началом исследования. Таким образом, исследование показывает эффекты удаления упражнений SJ из программы MJ + SJ по сравнению с продолжением программы MJ + SJ. Может быть, мышцы рук положительно реагируют на это изменение, потому что это стимул нового типа, даже если объем мышц уменьшается?\n\nТогда я подумал, что результаты можно объяснить объемом обучения. Если объем тренировок для многосуставных упражнений был выше, чем необходимо, то любое отсутствие эффекта на дополнительные односуставные упражнения, например, на бицепс, можно объяснить этим. Но исследователи не раскрывают, сколько наборов было сделано (или я слепой?). Лично я предпочел бы выполнять достаточный объем упражнений на спину MJ и выполнять дополнительную работу на бицепс, чем делать слишком большой объем для спины, чтобы иметь достаточный объем бицепса. Это исходит от кого-то с недостатком оружия, хотя.\n\n** Цитата из полного текста предполагает, что это может быть очень индивидуальным? **\n\n> Предположение, что добавление упражнений SJ может быть необходимо для обеспечения оптимальной стимуляции и, следовательно, адаптации, особенно к мышцам рук, частично подтверждается в современной литературе. В связи с этим, острые (Ferreira et al., 2017; Soares et al., 2015) и хронические (Ogasawara, Thiebaud, Loenneke, Loftin, & Abe, 2012) исследования показывают, что мышцы рук недостаточно стимулируются во время упражнений MJ.\n>\n> Взятые вместе, они предполагают, что упражнения MJ могут стимулировать неоптимальный стимул для некоторых мышц и, следовательно, добавление упражнений SJ может улучшить адаптацию мышц (Gentil, Fisher, et al., 2017). Однако эта гипотеза оспаривается исследованиями, показывающими, что упражнения SJ и MJ способствуют одинаковому увеличению мышечного размера и силы у молодых мужчин (Gentil, Soares, & Bottaro, 2015), а исследования показывают, что добавление упражнений SJ не приводит к дополнительному увеличению мышц. гипертрофия и увеличение силы по сравнению с программой, включающей только упражнения MJ для неподготовленных (Gentil et al., 2013) и тренированных мужчин (de Franca et al., 2015) и женщин (Barbalho, Coswig, Raiol, Steele, Fisher, Paoli, & Gentil, 2018).\n>\n> Однако о противоречивых результатах сообщили Barbalho et al. которые обнаружили большее увеличение окружности согнутой руки (FAC) у неподготовленных молодых женщин (Barbalho, Gentil и др., 2018) и мужчин (Barbalho, Coswig, Raiol, Стил, Фишер, Паоли, Bianco и др., 2018), выполняющих сочетание упражнений MJ и SJ по сравнению с группой, которая выполняла только упражнения MJ.\n\nЯ все еще собираюсь делать упражнения для рук SJ, потому что их не хватает, и я хочу их поднять :)\n\n\nРЕДАКТИРОВАТЬ:\nСсылка для изучения: [https://www.ncbi.nlm.nih.gov/pubmed/31072272](https://www.ncbi.nlm.nih.gov/pubmed/31072272)",
    "title": "Одиночные совместные упражнения не дают преимуществ в производительности и антропометрических изменениях у рекреационных бодибилдеров (2019)",
    "subreddit_name_prefixed": "r/AdvancedFitness",
    "ups": 107,
    "created": 1557861509,
    "link_flair_background_color": "",
    "id": "bohlgh",
    "author": {
        "name": "trsdm"
    },
    "permalink": "/r/AdvancedFitness/comments/bohlgh/single_joint_exercises_do_not_provide_benefits_in/",
    "url": "https://www.reddit.com/r/AdvancedFitness/comments/bohlgh/single_joint_exercises_do_not_provide_benefits_in/",
    "created_utc": 1557832709
}