{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Исследование (полный текст: [https://www.researchgate.net/publication/333322619\\_Ecdysteroids\\_as\\_non-conventional\\_anabolic\\_agent\\_performance\\_enhancement\\_by\\_ecdysterone\\_supplementation\\_in\\_humans]h //www.researchgate.net/publication/333322619_Ecdysteroids_as_non-conventional_anabolic_agent_performance_enhancement_by_ecdysterone_supplementation_in_humans#pfa )), получив финансовую поддержку от Всемирного антидопингового агентства по повышению эффективности мужских тестирований, протестировавшего 46 мужчин, проверили эфемерное мужское тестирование. Все они занимались силовыми тренировками за год до исследования. Они получали либо 200 мг экдистерона + 200 мг лейцина, 800 мг экдистерона + 800 мг лейцина (ну, по крайней мере, если вы хотите верить этикетке производителя, но об этом позже), либо плацебо.\n\nОни тренировались по двухуровневому плану тренировок в течение 10 недель, тренируясь каждый день. План тренировок состоял из 6 упражнений со штангой, с 3 подходами по 12 повторений в течение первых 6 недель, затем 3 подхода по 8 повторений. Веса увеличивались на 2,5-5 кг в неделю, за исключением четвертой и седьмой недель (недели восстановления), начиная с 70% от 1-RM. Веса будут уменьшены, если форма выполнения не была оптимальной. Состав тела (безжировая масса, мышечная масса, жировая масса и общее количество воды в организме) измеряли с помощью анализа биоэлектрического импеданса.\n\n**Результаты:**\n\nУ всех групп повышенная масса тела. группа с низким уровнем экди ** увеличила мышечную массу на 1,5 кг, группа с высоким уровнем - на 2 кг. ** Сила отряда также увеличилась в зависимости от дозы. Однако на жиме лежа наблюдалось наибольшее увеличение в группе с низкой дозировкой, за которой следовала группа с высокой дозировкой, в то время как плацебо потеряло мышечную массу. Побочных эффектов не обнаружено. Стероидные гормоны не были изменены.\n\n** Почему тогда экдистерон не популярен, несмотря на долгое время на рынке? **\n\nИсследователи также проанализировали содержание добавки (** PeakPerformance Products SA \"Пик Экдизон\" **). ** Вместо 100 мг экдистерона на капсулу было обнаружено только 6 мг. Это на 94% (!!) ниже, чем рекламируется. ** Это означает, что группа с низкой дозой на самом деле пополнилась только 12 мг, а группа с высокой дозой - 48 мг в день. Это делает результаты еще более впечатляющими.\n\nТаким образом, вопрос заключается в следующем: может быть, большинство добавок эдцистерона, представленных на рынке, содержат гораздо меньшие количества этого вещества или вообще не содержат его? Дело в том, что из тех, кто нашел добавку эффективной, многие говорили, что для достижения результатов необходима гораздо более высокая дозировка. Совпадение? Я так не думаю.\n\nСообщается, что экди гораздо эффективнее при приеме пищи с высоким содержанием белка. Это означает, что люди, которые не следуют этому совету, скорее всего, также не будут отвечать.\n\n** Но, может быть, все это было связано с лейцином? **\n\nЛейцин не должен был играть большую роль в результатах, так как для синтеза белка требуются гораздо более высокие дозы, и эти эффекты были тщательно изучены. Вы не наберете 1,5-2 кг мышечной массы за 10 недель с 200-800 мг лейцина. Кроме того, пиковые уровни лейцина в крови важны для анаболического ответа, и для этого лейцин следует принимать за 30 минут до еды. Но они взяли половину капсул после завтрака, что сделало всплеск лейцина гораздо менее вероятным. Это оставляет только после тренировки или вечернюю дозу, и даже если те были приняты на пустой желудок (что не было правилом изучения, так что, скорее всего, большинство не будет принимать его натощак в любом случае), только 100-400 мг на день у некоторых субъектов мог привести к легкому всплеску лейцина. Так что - вряд ли. Немного грустно видеть, что контрольные группы не получали лейцин в той же дозе, что и другие группы.\n\n** Почему контрольная группа потеряла мышечную массу? **\n\nВозможно, контрольная группа использовалась для тренировок с большим объемом, и поэтому новая программа тренировок была шагом назад. Это всего лишь мои предположения. Но если бы это было так, наблюдаемые эффекты были еще более впечатляющими, потому что это позволило бы предположить, что лечебные группы также, вероятно, получали меньший стимул гипертрофии по сравнению с тренировкой до исследования. Или способ, которым они измеряли состав тела, был просто неточным (биоэлектрический импеданс).\n\n** Была ли добавка загрязнена веществами, повышающими эффективность? **\n\nДобавку проверяли на отсутствие загрязнения другими повышающими эффективность препаратами. Загрязнения этих продуктов веществами, запрещенными в спорте, обнаружено не было. Так что это не может быть причиной выигрыша.\n\nАвторы исследования приходят к выводу, что экдистерон эффективен, и поэтому рекомендуют включать экдистерон в класс S1 \"Анаболические агенты\" WADA, он же запрещает его.\n\n** Однако критический взгляд на дизайн исследования оправдан. **\n\nВызывает разочарование то, что в исследовании использовался коммерческий продукт, содержащий не только 6% рекламируемого содержания экди, но и лейцин. Который, хотя он был включен в низких дозах, в принципе является основным активатором синтеза мышечного белка.\n\nДругим недостатком является метод измерения тела. Использование импеданса для измерения состава тела имеет некоторую изменчивость, в зависимости от времени суток, содержимого мочевого пузыря, содержимого кишечника, общего количества воды в организме, проводимости кожи, даже этнической принадлежности (и я, вероятно, не перечислил все факторы, которые могут повлиять на результаты). Это означает, что измерение может немного занижать или переоценивать показатели состава тела.\n\nИ поэтому эта комбинация плохих факторов (слишком низкая дозировка, второе смешивающее вещество, слишком изменчивый метод измерения) в сочетании с относительно небольшими размерами выборки затруднили сказать, были ли многие из сообщенных результатов исследования случайными или нет. Как конотокаурий указал ниже, не было никакого значения в весе тела против плацебо, росте прыжка против плацебо или силе приседа против плацебо.\n\nЭто не значит, что не было никакого эффекта. Это означает, однако, что нельзя сказать с достаточно высокой вероятностью того, что изменения, которые мы наблюдали, действительно были связаны с добавлением экди + лейцина.\n\nНо есть надежда. Хотя многие результаты не были статистически значимыми, группы экди + лейцин были последовательно лучше, чем плацебо. Кроме того, во всех показателях, кроме жимовой, наблюдалась зависимость дозы от экди + лейцина, что означало, что группа с более высокой дозой получала лучшие результаты. Это, в сочетании, с меньшей вероятностью произойдет случайно в одиночку.\n\n** Так как же мы можем быть уверены, что Ecdy работает, в конце концов? **\n\nНу, исследование должно быть воспроизведено. И с лучшим дизайном исследования. Следующие факторы должны быть рассмотрены:\n\n* Метод состава тела должен быть изменен на более точный (например, DEXA или гидростатическое взвешивание).\n* Добавка должна состоять только из одного соединения, экдистерона.\n* Дозировка должна быть увеличена до первоначальной нацеленности на 200 мг для низких и 800 для высоких. Из авторитетного источника или, по крайней мере, проверки лаборатории перед началом исследования. И только начиная с добавки, которая действительно содержит указанные дозы.\n* Время добавки должно быть рассчитано с источником белка каждый раз.\n\nДругие факторы, такие как увеличение продолжительности обучения и большее количество предметов, тоже будут хорошими. Но только изменения вышеуказанных факторов должно быть достаточно, чтобы получить гораздо более точные результаты и, следовательно, более статистически значимые результаты - если ecdy действительно имеет эффект.\n\n& # X200B;\n\nМое мнение: возможно, Экдистерон работает. Теперь у нас есть выбор: дождаться тиражирования исследования, которое займет некоторое время (если оно когда-либо произойдет), или протестировать его самостоятельно. Что я лично сделаю. Потому что я уже несколько лет заинтригован экди, и это исследование, несмотря на свои недостатки, мне достаточно. Но где, черт возьми, мы находим добавки, действительно содержащие этот материал, и даже если это так, в количестве, указанном на этикетке?\n\nКроме того, компании-производители пищевых добавок часто рекламируют экстракт шпината, но вместо этого используют Cyanotis rachnoidea ([https://www.nature.com/articles/srep37322](https://www.nature.com/articles/srep37322)), так как это очень богатый источник экдистерона (до 4-5%, по сравнению с 0,005-0,08% в шпинате). Не ясно, насколько безопасен цианотис, так как он не имеет исторического медицинского применения в Китае. Кроме того, по крайней мере 2 новых экдистероидов были обнаружены в этом растении, с неизвестными эффектами. Но шпинат и цианотис не единственные источники экди ...","title":"Исследование WADA показало увеличение мышечной массы на 1,5 - 2 кг после 8 недель применения экдистерона - добавка содержала только 6% рекламируемого содержимого","subreddit_name_prefixed":"r/AdvancedFitness","ups":77,"created":1561573497,"link_flair_background_color":"","id":"c5o5a1","author":{"name":"Modazull"},"permalink":"/r/AdvancedFitness/comments/c5o5a1/wada_study_shows_15_2kg_gain_in_muscle_mass_after/","url":"https://www.reddit.com/r/AdvancedFitness/comments/c5o5a1/wada_study_shows_15_2kg_gain_in_muscle_mass_after/","created_utc":1561544697}