{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Я наткнулся на эту магистерскую диссертацию под названием «[Влияние кроссфита против тренировок с отягощениями на аэробную, анаэробную и скелетно-мышечную физкультуру] (https://era.library.ualberta.ca/items/a2a29cb4-2ed3-4b36-b974-6c2b009572caca /view/dc17d34b-f2e0-4e49-ac4a-c187f4868ffe/Mcweeny_David_K_201901_MSc.pdf&hl=en&sa=X&d=16492319360112869127&scisig=AAGBfm3ZXtvcwssNznxDqLV8MXQn3-2GiA&nossl=1&oi=scholaralrt&hist=BNLot7oAAAAJ:13872588108262713189:AAGBfm0ca6sQ4-zNkL7CEr5BgfYBLPcNkQ)»(предупреждение PDF).\n\nАвтор разделил «рекреационно активных» участников на три группы: «продолжай делать все, что ты делаешь», контроль, «делай Crossfit» и «делай традиционную программу сопротивления с PT». Затем он проверил через шесть недель и оценил производительность каждого:\n\n> Заключение: Хотя CF вызывал значительные улучшения в аэробной силе, мышечной силе всего тела, выносливости верхней части тела и общей выносливости нижней части тела с течением времени, эта группа также испытала значительное снижение анаэробной силы нижней части тела от до и после тренировки. По сравнению с TRAD, CF вызывал только большее улучшение мышечной выносливости верхней части тела и большее снижение анаэробной силы нижней части тела. Таким образом, по сравнению с традиционными тренировками с отягощениями, CrossFit может быть лучше в улучшении выносливости верхней части тела, уступать в улучшении анаэробной силы в нижней части тела и аналогичным в улучшении силы всего тела, аэробной мощности и общей выносливости нижней части тела у рекреационно активных взрослых (через 6 недель). обучения). В будущих исследованиях следует изучить, могут ли эти адаптации быть распространены на другие группы населения (например, на элитных спортсменов на выносливость), которые могут извлечь выгоду из одновременных улучшений как в силовой, так и в аэробной форме, или спортсменов, занимающихся спортом, требующих значительных физических нагрузок на мышцы верхней части тела (таких как скала). альпинизм). В будущих исследованиях следует также изучить молекулярные и генетические факторы, лежащие в основе изменений в физической форме во время одновременной тренировки (которая используется во время тренировок CrossFit).\n\nЧестно говоря, я не слишком впечатлен дизайном исследования. Кажется, что автор искал способ научно обосновать CF. Используемая «традиционная тренировка с отягощениями» была разделена на две части с упором на сбрасывание до отказа при использовании машин. По какой-то причине, тренер заставил их нацеливаться на 10-12 повторений в начале работы, а затем постепенно снижать его до 4-6 повторений в течение шести недель (при увеличении веса). Я никогда не слышал об этом? Я также подвергаю сомнению использование 8 различных движений, три набора каждый, менее чем за 70 минут.","title":"Влияние кроссфита против сопротивления Влияние кроссфита против сопротивления на аэробную, анаэробную и скелетно-мышечную форму","subreddit_name_prefixed":"r/AdvancedFitness","ups":46,"created":1565127733,"link_flair_background_color":"","id":"cmqqik","author":{"name":"Chr0me"},"permalink":"/r/AdvancedFitness/comments/cmqqik/the_effect_of_crossfit_vs_resistance_the_effect/","url":"https://www.reddit.com/r/AdvancedFitness/comments/cmqqik/the_effect_of_crossfit_vs_resistance_the_effect/","created_utc":1565098933}