{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Привет всем, я искал вики и форум в меру своих возможностей, и не мог найти ответ на свой вопрос о том, что именно составляет «объем» и «объем приравнивается» при чтении научных исследований. В частности, я читаю много статей о MASS, поэтому, возможно, / u / gnuckols может помочь здесь.\n\nУ меня начиналось впечатление, что научное сообщество тяжелоатлетов сходится к определению объема как «количества достаточно жестких подходов, близких к провалу», * но во многих статьях того же сообщества, похоже, все еще используются представители в качестве меры объема, когда количество наборов одинаково.\n\nВ качестве конкретного примера, в первом выпуске 5-го номера журнала MASS есть статья Эрика Хелмса под названием «Восстановление после тренировки: высокая интенсивность против большого объема» *. В этом исследовании высокая интенсивность составляет ** 8 подходов ** по 3 повторения при 90%, а высокий объем составляет ** 8 подходов ** по 10 повторений при 70%. Я не уверен, что RPE похож, но для меня оба этих протокола выглядят так, как будто они соответствуют стандарту «** 8 достаточно жестких наборов **, близких к отказу», и поэтому я думаю, что они будут «уравнены по объему» и все же протокол с большим количеством повторений считается более объемным.\n\nМожет ли кто-то помочь прояснить мою путаницу относительно того, что составляет «объем»? И как следствие, существует ли консенсус в отношении того, что означает, что два подъемных протокола являются «уравненными по объему»?\n\n** РЕДАКТИРОВАТЬ ** - Я уже получил два комментария о том, как Volume = Sets x Reps x Weight, поэтому я хочу процитировать отрывок из второго издания The Muscle and Strength Pyramid Эрика Хелмса и других\n\n> На уровне 2 громкость, интенсивность и частота больше не являются громкостью\nколичественно определяется по повторениям на часть тела, а точнее за наборы на мышцу\nшаблон группы или движения, который информируется наиболее актуальным\nисследование.\n\n... и позже в книге:\n\n> Подсчет объема для силы и гипертрофии\n>\n> Как я уже упоминал в первом разделе этой главы, подсчет наборов, вероятно,\nсамый простой и эффективный способ количественного определения объема и имеет дополнительные\nбонус за регулировку громкости и написание программ проще.\n\nТак что здесь у меня есть тот же Эрик Хелмс, который описывает объем как количество подходов, независимых от повторений, но также зависящих от повторений. Книга вышла в 2018 году, а статья MASS - в 2017 году, так что это может изменить мышление в течение этого периода времени.","title":"Есть ли точное определение «объема» и «приравненного объема»?","subreddit_name_prefixed":"r/AdvancedFitness","ups":18,"created":1566387573,"link_flair_background_color":"","id":"ctb9bc","author":{"name":"voodoochile78"},"permalink":"/r/AdvancedFitness/comments/ctb9bc/is_there_a_precise_definition_of_volume_and/","url":"https://www.reddit.com/r/AdvancedFitness/comments/ctb9bc/is_there_a_precise_definition_of_volume_and/","created_utc":1566358773}