{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Привет, я немного запутался в том, что [это исследование] (https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2796950/) говорит о большой поясничной мышце, противодействующей действию подвздошной кости во время сгибания бедра , «Они полагают, что подвздошная кость будет подтягивать таз в переднем тазовом наклоне, и что поясничная мышца работает против этих сил, увеличивая жесткость в тазу и поясничном отделе позвоночника».\n\nЭто имеет смысл для меня, глядя на мышцы и их привязанности - я могу представить себе происхождение поясничных мышц на T12 и верхних поясничных сегментах, желающих удлинить поясничный отдел позвоночника, когда он укорачивается (представьте себе укорочение струны между L6 и передней частью лобка), в то время как подвздошная кость, прикрепленная внизу к тазу, уменьшит его угол относительно бедра, сгибая позвоночник. Но классифицирует ли это поясничные мышцы как поясничный разгибатель? Согласно Jorgensson et al., 1993, подвижность межпозвоночных возрастает по мере сокращения основной поясничной мышцы, что, как я предполагаю, означает, что она способствует лордотической кривизне поясничного отдела позвоночника. Если сокращение илиопсоа в целом работает для сгибания поясничного отдела позвоночника, то означает ли это, что подвздошная кость подавляет действие поясничного отдела?\n\nРЕДАКТИРОВАТЬ: Я нашел другое исследование, которое говорит, что весь поясничный пояс работает, чтобы согнуть позвоночник, и кажется, что нижние пучки сгибают нижний поясничный отдел позвоночника, в то время как верхние пучки расширяют верхние поясничные позвонки. Я нахожу это несовместимым с идеей, что она противодействует подвздошной кости, но разве это не подразумевает, что она способствует кифотическому изменению кривизны, начинающемуся на более низком уровне грудного отдела позвоночника? (Я знаю, что это странный способ сказать это, но вы понимаете.)","title":"Psoas Major противодействует iliacus?","subreddit_name_prefixed":"r/AdvancedFitness","ups":19,"created":1572355676,"link_flair_background_color":"","id":"dolh73","author":{"name":"informant720"},"permalink":"/r/AdvancedFitness/comments/dolh73/psoas_major_counteracts_iliacus/","url":"https://www.reddit.com/r/AdvancedFitness/comments/dolh73/psoas_major_counteracts_iliacus/","created_utc":1572326876}