{"subreddit":{"display_name":"AdvancedFitness"},"subreddit_loc":"AdvancedFitness","selftext":"Это сборник ресурсов, темы Reddit и исследования для людей, чья цель №1 - гипертрофия. Я собрал эти ресурсы вместе за несколько месяцев и поэтому хотел поделиться.\n\n## Осуществлять ресурсы и исследования\n\nПрофилактика травм: https://www.reddit.com/r/weightroom/comments/8mue7a/a_list_of_good_books_to_help_prevent_the_most/\n\nОснованные на фактических данных руководящие принципы для тренировок с отягощениями для максимизации мышечной гипертрофии https://www.researchgate.net/publication/322023636_Evidence-Based_Guidelines_for_Resistance_Training_Volume_to_Maximize_Muscle_Hypertrophy tl; не менее 10 наборов в неделю на мышечную массу 10-20 комплектов возможно идеальных. (Хотя см. Следующий раздел, в котором указано, что 30 групп мышц в неделю могут получить значительно больше гипертрофии, чем 10 или 20).\n\nБольше подходов в неделю на мышцу = больше роста для этой мышцы. И согласно новому исследованию, верхний предел еще не виден. «Гипертрофия мышц следует за зависимостью« доза-ответ », причем все большие успехи достигаются при увеличении объема тренировок» https://www.ncbi.nlm.nih.gov/pubmed/30153194 https://weightology.net/responding-to-critiques -of-наш-объемно-исследование /\n\n«Если я читаю это правильно, можно ли это обобщить так: не имеет значения, как вы тренируетесь / поднимаетесь, пока тренируетесь и пытаетесь делать большие объемы, вы увидите результаты гипертрофии?» https://www.reddit.com/r/Fitness/comments/514t91/the_current_state_of_hypertrophy_research/\n\n«Хотите стать большим? Объем имеет наибольшее значение (как подтверждают Шенфельд и Вернбом). Если вы хотите сэкономить время, лучше придерживаться традиционного диапазона гипертрофии (6–12)». https://www.reddit.com/r/naturalbodybuilding/comments/2dwwoy/frequency_and_volume_for_hypertrophy/\n\nПолезная диаграмма, обобщающая некоторые исследования https://www.reddit.com/r/Fitness/comments/5d5ecj/i_made_a_chart_detailing_the_current_research_on/\n\n2-3 раза в неделю на группу мышц, в первую очередь самые важные упражнения. https://www.reddit.com/r/AdvancedFitness/comments/5x9n8y/scientific_recommendations_for_strength_and/\n\nОбъем, не близкий к неудаче, является нежелательным. https://www.reddit.com/r/naturalbodybuilding/comments/9om79s/most_effective_hypertrophy_program_possible/e7v0rj5/\n\nУпражнения для изоляции могут быть полезны для снижения риска травм. https://old.reddit.com/r/Fitness/comments/9r5s9k/i_rarely_see_jacked_dudes_at_the_gym_performing/e8ekfia/\n\nПредставления Myo кажутся полезными для эффективной гипертрофии: https://www.reddit.com/r/AdvancedFitness/comments/8j89g0/looking_for_most_bang_for_your_buck_hypertrophy/dyxr1rk/\n\n## Рутины оптимизированы для гипертрофии и роста мышц\n\nЭти процедуры, кажется, оптимизируют # 1 для гипертрофии. Если ваша цель - сила, смотрите в другом месте. Общий принцип заключается в том, что ваш мышечный рост для данной части тела будет примерно пропорционален количеству подходов, которые вы делаете в неделю для этой части тела.\n\nПроблемы с программами для начинающих + Хорошая «эстетическая» рутина для начинающих\n\nPPL Metallicadpa через вики https://archive.fo/gMUfM, имеет 12-24 комплекта в неделю на мышцу\n\nCoolcicada PPL, https://forum.bodybuilding.com/showthread.php?t=149807833, имеет 12-18 подходов в неделю на мышцу для большинства\n\nIronBuff, https://www.reddit.com/r/naturalbodybuilding/comments/9om79s/most_effective_hypertrophy_program_possible/e7v0rj5/ и https://www.reddit.com/r/IronBuff/wiki/bodybuilding, кажется относительно новым, и я думаю, что объяснение может выиграть от большей ясности и упрощения, чтобы облегчить понимание большему количеству людей, но кажется многообещающим и согласуется с некоторыми исследованиями по максимизации гипертрофии, которые я видел\n\n## Потребность в белке для наращивания мышечной массы\n\nРесурс, показывающий, на сколько белка нужно стремиться, изучите: https://examine.com/nutrition/how-much-protein-do-you-need/\n\nТакже:\n\n«При добавлении белка потребление белка в количествах, превышающих ~ 1,6 г / кг / день, не способствует дальнейшему усилению FFM, вызванному RET».\n«Добавки белка, превышающие общее потребление белка 1,62 г / кг / день, не привели к дальнейшему RET-индуцированному увеличению FFM».\nhttps://bjsm.bmj.com/content/52/6/376\n\nУровень мышечной массы: https://bodyrecomposition.com/muscle-gain/muscle-gain-math.html/\n\nИдеальный избыток калорий для гипертрофии: https://imgur.com/a/N88G8lW, https://www.reddit.com/r/Fitness/comments/2vbbym/ideal_calorie_surplus_for_building_muscle/cog62fw/\n\n## Поддержание мышечной массы\n\nМинимальное количество упражнений для поддержания мышц: https://web.archive.org/web/20150711062436/https://muscleevo.net/minimum-amount-of-exercise/\n\n> Даже если период технического обслуживания растягивается на восемь месяцев, подъема веса всего один раз в неделю достаточно для поддержания роста мышечной массы.\n> Одна группа вообще перестала заниматься физическими упражнениями. Вторая группа сокращается от тренировок три раза в неделю до тренировок один раз в неделю. Третья группа сократила как количество еженедельных тренировок, так и количество подходов, которые они делали на каждой тренировке, с трех подходов на упражнение до одного.\n> Неудивительно, что субъекты, которые бросили упражнения, полностью потеряли большую часть мышц, которые они построили.\n> Но те, кто продолжал тренироваться раз в неделю, даже те, кто сократил как количество еженедельных тренировок, так и количество упражнений, которые они выполняли в каждой тренировке, смогли поддерживать большую часть своей мышечной массы. Кроме того, обе программы технического обслуживания увеличили прочность на 7–8%.","title":"Оптимизация роста мышц: сборник ресурсов, ориентированных на гипертрофию.","subreddit_name_prefixed":"r/AdvancedFitness","ups":74,"created":1543738425,"link_flair_background_color":"","id":"a28fe2","author":{"name":"arikr"},"permalink":"/r/AdvancedFitness/comments/a28fe2/optimizing_muscle_growth_a_compilation_of/","url":"https://www.reddit.com/r/AdvancedFitness/comments/a28fe2/optimizing_muscle_growth_a_compilation_of/","created_utc":1543709625}