{"subreddit":{"display_name":"calorierestriction"},"subreddit_loc":"ограничение калорий","selftext":"Привет друзья Reddit. Я пробую что-то новое и любопытное, если у людей есть реальный, личный опыт или научно обоснованные мысли о моем нынешнем подходе. У меня избыточный вес (5’10, F, 230). Я потерял и набрал 50 фунтов как минимум уже 3 раза. Я отстой при умеренности - я отлично в очень жестких рамках, но в ту минуту, когда я получаю любую комнату для маневра, все идет прямо в ад. В настоящее время я пробую график, в котором я ем чрезвычайно ограниченные калории (почти считающиеся калориями «натощак») в течение недели, и я буду есть и пить все что угодно на F / Sa / Su. Конкретно <= 650 калорий каждый день M, Tu, W, Th. Пожалуйста, не будьте противны в своих ответах. Я пожилой человек, и кажется, что в противном случае это просто невозможный подвиг, так как мой ТАК любит все, что угодно: пиво, хлеб, зерно, жир. Единственное, что я могу сделать, это есть полностью независимо, и если я даю себе выходные, я чувствую, что это будет устойчивым, потому что я ничего не теряю «навсегда» и не чувствую, что я должен жениться на своем калорийнике в трудных ситуациях. такие как рестораны, где калории в основном неизвестны и трудоемки для расчета. Люди постятся неделями, поэтому я не вижу, где эта рутина вредна. Я также прочитал много статей о том, что ограничение калорийности может быть полезным для продолжительности жизни и снижения заболеваемости. Кто-нибудь еще делает что-то подобное? Мне интересно учиться на непосредственном опыте людей или любых законных научных источниках.","title":"Чрезвычайное ограничение калорий неполный рабочий день","subreddit_name_prefixed":"r/calorierestriction","ups":2,"created":1554946732,"link_flair_background_color":"","id":"bbowhf","author":{"name":"yeah_so_"},"permalink":"/r/calorierestriction/comments/bbowhf/extreme_calorie_restriction_part_time/","url":"https://www.reddit.com/r/calorierestriction/comments/bbowhf/extreme_calorie_restriction_part_time/","created_utc":1554917932}