{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Прежде всего, позвольте мне сказать, что я не верю, что масло любого вида является здоровой пищей. Масла являются обработанными продуктами по определению и поэтому должны использоваться в строгой умеренности, поскольку они предлагают очень мало пищи в отношении их крайней калорийности.\n\nВ настоящее время существует много путаницы в отношении «полезности» различных видов масла. Обычно считается, что оливковое масло первого отжима является лучшим выбором. Канола часто считается дьяволом, потому что она слишком промышленна и связана с уровнем транс-жиров, или потому что подверглась биотехнологическим вмешательствам. Затем есть масло авокадо, которое предположительно лучше, и подсолнечное масло, которое считается худшим из-за высокого содержания омега-6.\n\nПоэтому я решил сравнить все эти масла и посмотреть на их состав жирных кислот, соотношения омега и содержание витаминов. Поскольку подсолнечное масло определенно будет повреждено из-за содержания омега-6, я буду использовать подсолнечное масло с высоким содержанием олеина в этом сравнении.\n\nЯ использую данные из этикеток фактов питания в моем местном супермаркете, дополненные данными из NCCDB. Эти цифры могут отличаться в зависимости от страны, где выращиваются масличные культуры и какие сорта используются.\n\n| на 100 г | EV оливковое масло | рапсовое масло | масло авокадо | HO подсолнечное масло |\n|: - |: - |: - |: - |: - |\n| Monounsat. жир (n-9) | 76 г | 59 г | 70,6 г | ** 83,7 ** г |\n| Омега-3 | 0,5 г | ** 7,4 ** г | 0,9 г | 0,2 г |\n| Омега-6 | 6,0 г | 17,6 г | 12,5 г | ** 3,6 ** г |\n| Насыщенные жиры | 14,0 г | ** 6,0 ** г | 11,6 г | 9,9 г |\n| Транс-жиров | <0,5 г | <0,5 г | <0,5 г | <0,5 г |\n| Витамин Е | 18 мг | 30 мг | 12,6 мг | ** 41,1 ** мг |\n| Витамин К | 60 мг | ** 112,5 ** мг | 91,4 мг | 5,4 мг |\n| Температура дыма | 160-190 ° C (320-374 ° F) | 107 ° C (225 ° F) | ** 270 ** ° C (520 ° F) | 232 ° C (450 ° F) |\n\nЯ отметил числа, которые набрали наибольшее количество баллов для каждой категории в соответствии с «консенсусом», который, по-видимому, содержит меньше насыщенных жиров и омега-6, а также больше витаминов и омега-3.\n\n& # X200B;\n\nИтак, что думает / р / питание? Давайте поговорим.\n\n** Оливковое масло EV соответствует своей репутации? **\n\n** Мысли о рапсовом масле? **\n\n** Где в этом сравнении стоит авокадо и подсолнечное масло HO? **\n\n** Как тепло влияет на качество этих масел? **\n\nКонечно, есть больше факторов, которые определяют здоровье масел, таких как содержание полифенолов и антиоксидантов (кроме витамина Е, являющегося основным антиоксидантом). Являются ли эти факторы импортированными, как показано в таблице?\n\nРедактировать 1: Добавлена точка дыма на стол.\n\nИзменить 2: Уровни транс-жиров различаются в зависимости от бренда и настолько малы, что это не способствует сравнению.\n\nИзменить 3: Подсолнечное масло обычно рафинировано, поэтому дымовая точка выше.","title":"Сравнение различных видов масел (оливковое, рапсовое, авокадо, подсолнечное)","subreddit_name_prefixed":"r/nutrition","ups":87,"created":1547541733,"link_flair_background_color":"","id":"ag2m0x","author":{"name":"Leek72"},"permalink":"/r/nutrition/comments/ag2m0x/comparing_different_types_of_oils_olive_canola/","url":"https://www.reddit.com/r/nutrition/comments/ag2m0x/comparing_different_types_of_oils_olive_canola/","created_utc":1547512933}