{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Для тех из вас, кто заботится о политике США в области питания -\n\nСегодня я зашел в блог Марион Нестле [www.foodpolitics.com] (https://www.foodpolitics.com) и получил напоминание о том, что Министерство здравоохранения и социальных служб собирает комментарии по проектам целей до ** 17 января. **\n\nС ее сайта:\n\n> Бесконечно повторяющийся процесс определения целей здравоохранения на следующие десять лет продолжается, и Департамент здравоохранения и социальных служб сейчас (или будет после закрытия) собирает комментарии по проектам целей.\n>\n> Вы можете увидеть список категорий [здесь] (https://www.healthypeople.gov/2020/About-Healthy-People/Development-Healthy-People-2030/Public-Comment/topics-objectives).\n>\n> На этом сайте также есть ссылки на историю целей (которая датируется 1979 годом) и на то, как работает весь процесс.\n>\n> Суть целей состоит в том, чтобы установить очень конкретные, измеримые цели для улучшения здоровья, чтобы можно было отслеживать прогресс в достижении целей (или их отсутствие).\n>\n> Вот, например, первые два в разделе «Питание»:\n>\n> NWS-2030-01: снизить уровень продовольственной безопасности в семье и тем самым уменьшить голод\n>\n> NWS-2030-02: сократить долю взрослых, страдающих ожирением\n>\n> Проблема: процесс не определяет *** как *** эти цели должны быть достигнуты или *** кто *** отвечает за их достижение.\n>\n> Но подсчет очков полезен, и крайний срок для оценки поставленных целей - ** 17 января. **\n>\n> Вот ваш шанс!\n\n& # X200B;","title":"Последний шанс прокомментировать цели в области продовольствия и питания на 2030 год","subreddit_name_prefixed":"r/nutrition","ups":25,"created":1547586762,"link_flair_background_color":"","id":"ag8cvv","author":{"name":"callsignmaggie"},"permalink":"/r/nutrition/comments/ag8cvv/last_chance_to_comment_on_2030_food_and_nutrition/","url":"https://www.reddit.com/r/nutrition/comments/ag8cvv/last_chance_to_comment_on_2030_food_and_nutrition/","created_utc":1547557962}