{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Две большие базы данных по питательным веществам, о которых я знаю, - Национальная база данных по питательным веществам и База данных по питанию и питательным веществам Координационного центра по питанию - превосходны, но, насколько мне известно, не приводят количественные данные по КАЖДОМУ микроэлементу в каждой пище. Вы согласны со мной или я что-то упустил?\n\nБолее того, я считаю, что эти базы данных являются слабыми, когда речь идет о шести микроэлементах, в частности: витамине К, хроме, меди, фториде, марганце и молибдене. Вы согласны?\n\nЕсли вы до сих пор со мной, то, пожалуйста, скажите мне, что, если что-то, вы проконсультируетесь, чтобы узнать, сколько из этих шести витаминов и минералов вы потребляете. Они редко появляются на этикетках продуктов питания.\n\nКонечно, незнание этого почти наверняка не означает, что в большинстве наших диет критически не хватает витаминов или минералов. Я понимаю, что с большинством наших диет все в порядке, даже если мы не знаем их числа.\n\nТем не менее, я думаю, что имеет смысл оптимизировать / управлять этими микроэлементами, если это возможно, как многие из нас делают для макросов. Активное управление не может повредить, и в теории это может помочь в некоторой степени (например, для некоторых людей, возможность сбить чуть-чуть больше их калорийности; для других, получая немного больше свободы для настройки диет или макросъемки отношения и т. д.). Если бы у нас были только необработанные данные.\n\nИтак, у вас есть какие-либо идеи о том, где искать такие данные, особенно для витамина К, хрома, меди, фторида, марганца и молибдена? Есть ли лучший ресурс, чем две упомянутые мною базы данных, случайно?\n\nСпасибо.","title":"Шесть менее известных микроэлементов.","subreddit_name_prefixed":"r/nutrition","ups":62,"created":1547958113,"link_flair_background_color":"","id":"ahptqv","author":{"name":"JSanzi"},"permalink":"/r/nutrition/comments/ahptqv/the_six_less_famous_micronutrients/","url":"https://www.reddit.com/r/nutrition/comments/ahptqv/the_six_less_famous_micronutrients/","created_utc":1547929313}