{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"** \\ [опрос закрыт \\] **\n\nВсем привет,\n\nЯ аспирант программы «Взаимодействие человека и компьютера» в Рочестерском технологическом институте, которая в настоящее время работает над исследовательским проектом по отслеживанию продуктов питания. ** Если у вас есть опыт отслеживания потребления пищи или ведения журналов, не могли бы вы помочь заполнить небольшой опрос? **\n\nОпрос (14 коротких вопросов) займет у вас ** около 3 минут **. Ваш ответ и информация будут храниться в тайне и будут использоваться только для исследования. По сути, цель этого опроса состоит в том, чтобы получить первоначальный обзор опыта отслеживателей потребления пищи и того, как они относятся к визуализации данных своих данных отслеживания потребления пищи.\n\nЕсли у вас есть какие-либо вопросы или проблемы, пожалуйста, оставляйте комментарии ниже или пишите мне по адресу [**cz7661@rit.edu **] (mailto: cz7661@rit.edu).\n\n*** N.B. Сообщение было *** *** одобрено *** [*** / r / nutrition ***] (https://www.reddit.com/r/nutrition) *** Модератором команды ** *\n\n\\ ------------------------------------------------- -------------------------------------------------- ----\n\n** Большое спасибо за ваше время и любезно помочь! Этот опрос был закрыт, так как я получил большое количество ответов от вас, ребята, которые превзошли все мои ожидания. Вы, ребята, так поддерживаете! Я действительно очень ценю вашу помощь в этом исследовании. **\n\n** Я начну организовывать и анализировать результаты этого опроса и использовать его в качестве основы для последующих разделов. Я подготовлю окончательный отчет по всему исследованию для выпуска, который займет около 4 месяцев. Надеюсь, я могу поделиться окончательными результатами здесь. Не стесняйтесь обращаться ко мне, если у вас есть какие-либо вопросы! **\n\nС наилучшими пожеланиями,\n\nChuqi","title":"Вы трекер еды? Краткий академический обзор по отслеживанию продуктов питания","subreddit_name_prefixed":"r/nutrition","ups":152,"created":1548728308,"link_flair_background_color":"","id":"akq8dq","author":{"name":"Chuqi_Z"},"permalink":"/r/nutrition/comments/akq8dq/are_you_a_food_tracker_a_brief_academic_survey/","url":"https://www.reddit.com/r/nutrition/comments/akq8dq/are_you_a_food_tracker_a_brief_academic_survey/","created_utc":1548699508}