{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"*** Персональные атаки никогда не помогают и не допускаются здесь. ***\n\nМы прилагаем все усилия, чтобы обеспечить достаточное количество правил и напоминания, где это уместно.\n\n* Правила находятся на боковой панели старого и нового reddit - / r / nutrition / about / sidebar\n* Правила в посте в верхней части subreddit\n* Правила находятся на странице правил sub / r / nutrition / about / rules\n* На странице публикации есть напоминания о некоторых правилах как старого, так и нового reddit.\n* У нас есть автоматические напоминания о правилах постов здесь.\n\nСледовательно\n\n> Ты мудак, идиот, придурок, тупица, интеллектуально неспособный и т. Д ...\n\nНет.\n\nВы можете свободно выражать свою точку зрения через науку о питании, обмениваясь фактами и информацией. Вы не можете атаковать другого человека.\n\nНа самом деле мы получаем модмейлы от людей, отвечающих на их запреты, которые настаивают на том, что их оскорбления других были действительны, потому что другой человек \"просто слишком глуп\". Вы можете думать, что вы «правы» в дебатах, но нет свободных проходов для оскорблений. Если вы не можете справиться с обсуждением с кем-либо, не прибегая к оскорблениям, вам нужно перейти к другому субредиту.\n\nЕсли вы пришли к этому субмарину, чтобы преднамеренно обсудить свою точку зрения или защитить свои диетические предпочтения, то держите чип на плече дома и придерживайтесь науки.\n\n*** Избегайте неуважения к диетическим убеждениям / точкам зрения ***\n\nВам не нужно выбирать ту же диету, что и пожиратель камней, но нет необходимости обобщать их, оскорблять их или их убеждения. Спорить с наукой.\n\nЭто не ваша работа, чтобы обратить людей к вашей диетической точке зрения. Предложите информацию и оставьте это на этом.\n\nЛюди бывают разных форм и размеров и имеют различные потребности, точки зрения и факторы здоровья. НЕ совершайте ошибку, рассматривая всех здесь, как будто они все одинаковы.\n\n*** Относитесь к другим и их диетическим POV с уважением ***\n\nСпасибо, вот и все.","title":"Напоминание о праве субреддита - требуется реддикет. Оскорбления не побеждают в дебатах и не раскачивают других на другую точку зрения. Придерживайтесь науки.","subreddit_name_prefixed":"r/nutrition","ups":47,"created":1549029293,"link_flair_background_color":"","id":"alyz6p","author":{"name":"soundeziner"},"permalink":"/r/nutrition/comments/alyz6p/subreddit_rule_reminder_reddiquette_is_required/","url":"https://www.reddit.com/r/nutrition/comments/alyz6p/subreddit_rule_reminder_reddiquette_is_required/","created_utc":1549000493}