{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Итак, новое 6-месячное исследование с участием 217 здоровых людей вышло несколько дней назад. Они разделили людей на 3 группы: диета с высоким содержанием жиров, умеренный жир и обезжиренный. Все они ели одинаковое количество калорий, только жиры и углеводы были разными. Исследование размещено ниже.\n\n[https://gut.bmj.com/content/early/2019/01/18/gutjnl-2018-317609](https://gut.bmj.com/content/early/2019/01/18/gutjnl- 2018-317609)\n\nЧерез 6 месяцев они обнаружили, что у группы с высоким содержанием жиров были неблагоприятные изменения в микробиоте кишечника и воспалительных факторах. Они также отметили, что это может привести к негативным долгосрочным проблемам со здоровьем.\n\nНО вам нужно прочитать мелкий шрифт. Прежде всего, диета с высоким содержанием жиров составляла всего 40% жира. Теперь назовите меня сумасшедшим, но диета с 40% -ным содержанием жира я бы не назвал диетой с высоким содержанием жира\n\nОни использовали соевое масло в качестве основного источника жира для группы с высоким содержанием жира. До 24% их общего количества калорий приходилось на соевое масло. Большое количество соевого масла является провоспалительным. Они даже признались в этом, но он полностью похоронен внизу. Вот цитата\n\n«Следует отметить, что потребление полиненасыщенных жирных кислот (ПНЖК) было относительно высоким в группе с высоким содержанием жиров (24% от общей энергии) благодаря исключительному использованию соевого масла, которое богато n-6 ПНЖК. сообщалось, что более высокое потребление n-6 PUFA оказывает провоспалительное действие ».\n\nАутлеты уже работают с этим, такие как Webmd, который разместил это- [https://www.webmd.com/diet/news/20190220/high-fat-diets-do-no-favors-for-your-gut-bacteria# 1] (https://www.webmd.com/diet/news/20190220/high-fat-diets-do-no-favors-for-your-gut-bacteria#1)\n\nУ меня нет ног в этой гонке. Я не тот, кто ест жирную диету, но я не люблю вводить в заблуждение подобные вещи. «Диета с высоким содержанием жиров» не была даже жирной, и они кормили их сумасшедшим количеством соевого масла. Мы действительно удивлены результатами.\n\n\"РЕДАКТИРОВАТЬ\" Добавление цитаты для этого\n\nВан Й, Ван Ф, Юань Дж * и др. *\n\nВлияние пищевых жиров на кишечную микробиоту и фекальные метаболиты и их связь с кардиометаболическими факторами риска: 6-месячное рандомизированное исследование с контролируемым кормлением\n\n* Gut * Опубликовано в Интернете впервые: 19 февраля 2019 года. Doi: 10.1136 / gutjnl-2018-317609","title":"Новое исследование показывает, что диеты с высоким содержанием жира вредны для микробиома кишечника и приводят к воспалению .... Или это так?","subreddit_name_prefixed":"r/nutrition","ups":246,"created":1550842269,"link_flair_background_color":"","id":"atdmn3","author":{"name":"flaxseed1"},"permalink":"/r/nutrition/comments/atdmn3/new_study_shows_high_fat_diets_are_harmful_to_the/","url":"https://www.reddit.com/r/nutrition/comments/atdmn3/new_study_shows_high_fat_diets_are_harmful_to_the/","created_utc":1550813469}