{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Добро пожаловать в еженедельную / r / Nutrition функцию для вопросов личного характера и запросов оценки диеты. Хотите знать, если вы едите слишком много чего-то, недостаточно чего-то, или если то, что вы регулярно едите, содержит то, что вам нужно или нужно? Спросите здесь.\n\n** Правила для вопросов **\n\n* Могут быть заданы вопросы, касающиеся питания, относительно вашей конкретной диеты. Однако, прежде чем спрашивать, пожалуйста, не забудьте сначала проверить [** FAQ **] (https://www.reddit.com/r/nutrition/wiki/faq#/c/purple/) и посмотреть, был ли он уже охвачено в subreddit.\n\n* Вы НЕ МОЖЕТЕ спрашивать совета о том, как выбор питания повлияет на конкретное заболевание. Проконсультируйтесь с профессионалом.\n\n* Если вы не получили ответ здесь, вы все равно не можете создать сообщение об этом. Отсутствие ответа не дает вам исключения из правила публикации Personal Nutrition.\n\n** Правила для ответчиков **\n\n* Поддерживайте ваши заявления - если применимо, ВСЕ ответы должны поддерживать любые заявления, включая ссылки на научно обоснованные доказательства / исследования / данные. Нужно найти доказательства и отследить первоисточники? Попробуйте найти информацию на [** PubMed **] (http://www.ncbi.nlm.nih.gov/pubmed/) или [** Google Scholar **] (http://www.scholar.google. ком). Другие источники информации о питании можно найти в [** базе данных по составу продуктов питания USDA **] (https://ndb.nal.usda.gov/ndb/search/list), [** NutritionData **] (http: //nutritiondata.self.com/), [** Nutrition Journal **] (https://nutritionj.biomedcentral.com/) и [** Nutrition.gov **] (https: //www.nutrition. правительство /) (служба Национальной сельскохозяйственной библиотеки).\n\n* Сохраняйте это вежливым - говорите с другим человеком, а не разговаривайте о другом. Если вы не согласны с наукой, источником (ами) или интерпретацией (ями), сделайте это вежливо. Любые личные атаки будут удалены и могут привести к бану. Сообщите модераторам о подобных проблемах, используя кнопку отчета под любыми комментариями, содержащими личные атаки.\n\n* Держите это на теме - Этот subreddit для обсуждения о питании. Отдельные комментарии о других не по теме. Непищевые аспекты пищи даже не по теме. Не по теме комментарии будут удалены. Сообщите модераторам о подобных проблемах, используя кнопку отчета под любыми комментариями, не относящимися к теме.\n","title":"The / r / Nutrition Personal Nutrition Discussion Post (25 февраля 2019 г.) - все личные обстоятельства и вопросы, связанные с тем, что вы едите или можете есть, должны использовать этот пост","subreddit_name_prefixed":"r/nutrition","ups":25,"created":1551128833,"link_flair_background_color":"","id":"aul26w","author":{"name":"AutoModerator"},"permalink":"/r/nutrition/comments/aul26w/the_rnutrition_personal_nutrition_discussion_post/","url":"https://www.reddit.com/r/nutrition/comments/aul26w/the_rnutrition_personal_nutrition_discussion_post/","created_utc":1551100033}