{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Независимо от того, вводят ли они гормоны или нет, это известный факт, что продукты животного происхождения содержат гормоны, потому что, ну, их животные.\n\nИх гормоны также являются настоящими гормонами млекопитающих, некоторые говорят, что они более сильные, чем ксеноэстрогены, поэтому они, вероятно, влияют на организм, но вот мой вопрос:\n\nВ то время как все продукты животного происхождения содержат их, первое, что люди думают, когда мы говорим о гормонах, это молочные продукты, особенно молоко, и мой вопрос: почему? Хотя мясо имеет только небольшое количество (5 нг на 500 г)\nМолоко имеет только 2 нг на 100 мл. Для сравнения: масло (которое люди забывают - это молочные продукты) имеет ТРИДЦАТЬ на 100 г, а сливочное масло дико потребляется сообществом палео и кето, и я не вижу влияния на их гормоны, так почему же молоко будет врагом? Кроме того, в 100 мл молока содержится 9 нг тестостерона, так что, по крайней мере, не отменят ли они это?\nЯйца, также известные для энтузиастов тестостерона и сообщества кето, имеют ПЯТНАДЦАТЬ нанограмм на яйцо.\n\nЕсли гормоны, где и проблемы, эти продукты не будут иметь гораздо большее влияние, чем молоко? Или есть что-то особенное в молоке, которое обеспечивает лучшее усвоение.\n\nКогда я говорю эстроген, я имею в виду именно эстрадиол, я не уверен, что такие вещи, как прогестерон, также являются антиандрогенными\n\nTL; DR Почему молоко является врагом, когда речь идет о гормонах, а тестостерон в этих продуктах не влияет на эстроген и не устраняет его?","title":"Гормоны (в частности, эстрогены) в продуктах животного происхождения: зачем винить молочные продукты?","subreddit_name_prefixed":"r/nutrition","ups":25,"created":1551762248,"link_flair_background_color":"","id":"axccis","author":{"name":"lennonpaiva"},"permalink":"/r/nutrition/comments/axccis/hormones_specifically_estrogen_in_animal_products/","url":"https://www.reddit.com/r/nutrition/comments/axccis/hormones_specifically_estrogen_in_animal_products/","created_utc":1551733448}