{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Хорошо, я сделал так много сообщений об этом дерьме, но я думаю, что я наконец там.\n\nЗерна содержат нечто, называемое фитиновая кислота, которая является анти-питательным веществом, которое связывается с минералами и предотвращает их поглощение. Однажды связанный с минералом, это называют фитатом.\nФитаза - это фермент, который разлагает фитаты, обеспечивая высвобождение этих питательных веществ. Он активируется кислой средой при замачивании или вырабатывается бактериями во время ферментации. Я еще не уверен, разлагает ли она фитиновую кислоту или она все еще присутствует в воде и может снова связываться с минералами.\nЭто два независимых химических вещества. Зерна могут иметь высокое содержание фитатов и низкий уровень фитазы, или даже высокое количество фитатов и высокий уровень фитазы.\n\nОвес имеет относительно высокое содержание фитата и низкую фитазу, которая дополнительно разрушается после того, как зерно растрескивается и / или нагревается. Так что впитывать овсяные хлопья в принципе бессмысленно.\n\nЯ пытаюсь использовать фитазу пшеницы для активации фитата в овсе. Технически это возможно, но у меня все еще есть некоторые сомнения:\n\n1 - Есть ли риск при использовании сырой пшеницы? Я тщательно вымыл их, но нужно ли их готовить или что-то еще? Есть ли риск заражения бактериями или что-то подобное?\n\n2 - я не мог купить их без отрубей, в которых сконцентрирована большая часть фитиновой кислоты. Будет ли впитывать их вместе больше вреда, чем пользы? Исследование, которое я видел, что использовало два зерна, использовало пшеницу без отрубей, есть ли где-нибудь так, чтобы дома?\n\n3 - Я обычно ополаскиваю овес, чтобы удалить фитиновую кислоту, это правильный вызов?\n\n","title":"Пшеница + овсяная замачивание для уменьшения содержания фитатов. Это будет работать?","subreddit_name_prefixed":"r/nutrition","ups":15,"created":1552292957,"link_flair_background_color":"","id":"azmlt0","author":{"name":"lennonpaiva"},"permalink":"/r/nutrition/comments/azmlt0/wheat_oat_soaking_to_reduce_phytate_content_will/","url":"https://www.reddit.com/r/nutrition/comments/azmlt0/wheat_oat_soaking_to_reduce_phytate_content_will/","created_utc":1552264157}