{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Это то, что некоторое время не дает мне покоя, как кто-то, кто боролся за этический веганство, кто чертовски завидует веганским культуристам и кто предпочитает минимизировать риск атеросклероза. В течение многих лет я пробовал различные степени диеты на растительной основе, и пришел к выводу, что чистая диета на растительной основе, даже с кучей растительных белковых добавок (а также таурин, карнитин, бета-аланин и креатин), для меня это невозможно. Даже сейчас, когда я снова пытаюсь подобраться как можно ближе, мне приходится потреблять очень нетривиальное количество сывороточного белка, чтобы избежать нестерпимой слабости, которую я мог бы испытать в противном случае.\n\nЯ слышал, что Майкл Клэпер собирается всерьез разобраться в этом, потом я увидел его видео на YouTube, в котором говорилось, что в основном один «просто должен приспособиться». Что они все говорят.\n\nЯ бы предпочел, чтобы кто-то сказал, что неспособность преуспеть на веганской диете является результатом какого-то странного нарушения обмена веществ - при условии, что это утверждение основано на здравой науке. По крайней мере, тогда я мог бы знать, как лучше заботиться о себе, но нет. Все просто говорят одно и то же.\n\nПочему это не воспринимается всерьез? Если растительное сообщество действительно верило в здоровье вегетарианских диет, то, похоже, им следует понять, почему некоторые люди не могут поддерживать хорошее здоровье. Это просто не похоже на случай.\n\n& # X200B;\n\nРедактировать: вот комментарий, который я сделал далее в ветке, который развивает мои разочарования, если кому-то интересно. Ссылка [здесь] (https://www.reddit.com/r/nutrition/comments/b320nr/why_does_the_vegan_community_inclusive_its/eix5qht/). Комментарий здесь:\n\nЯ не могу найти каких-либо подробных случаев FTT, провозглашенных врачами на растительной основе, которые, по всей вероятности, видели такие случаи. Поэтому не существует широко распространенного совета от врачей, работающих на растениях, за исключением: «Вы просто адаптируетесь». Нет отчетов о случаях, детализирующих основные причины FTT, нет лабораторных работ, нет последующих проверок с другими тестами, нет решений, нет ничего, на что я мог бы взглянуть, что могло бы дать мне некоторое представление о том, что может происходить.\n\nПоэтому у меня есть две мысли о том, почему этого может не существовать: 1.) Люди, которые пробуют PBD и испытывают достаточно серьезные симптомы, не проходят PBD и поэтому не обращаются за какой-либо профессиональной помощью, потому что это будет слишком большой нагрузкой. на их жизни, поэтому у нас нет сообщений о случаях. 2.) Сообщество на основе растений, включая врачей на основе растений, не предоставляет достаточной помощи тем, кто пытается перейти на PBD, у которых есть серьезные проблемы со здоровьем, вызванные переходом.\n\nВместо этого врачи говорят, что «все в вашей голове» (произошло в этой теме), опровергают человека, который борется, говоря «но наука обесценивает ваш анекдот» (произошло в этой теме), или цитируют какую-то вещь ВОЗ в них и по сути говорят «что происходит с вами, не должно происходить / вы не должны существовать \"(произошло в этой теме) ИЛИ дает ряд решений, которые исправляют переходы PBD для многих людей, но неизбежно потерпят неудачу для других, и последующую работу, чтобы выяснить, почему FTT на PBD никогда не происходит, потому что человек, пытающийся перейти, расстраивается и сдается. Люди, которые сталкиваются с подобными вещами из сообщества растений, вероятно, не пойдут на консультацию к врачу из растений. В любом случае, работа по выяснению того, что пошло не так, никогда не выполняется, потому что люди, пытающиеся перейти, уходят.","title":"Почему веганское сообщество (включая его врачей) не принимает всерьез неудачу?","subreddit_name_prefixed":"r/nutrition","ups":216,"created":1553054058,"link_flair_background_color":"","id":"b320nr","author":{"name":"dissolved_remainder"},"permalink":"/r/nutrition/comments/b320nr/why_does_the_vegan_community_including_its/","url":"https://www.reddit.com/r/nutrition/comments/b320nr/why_does_the_vegan_community_including_its/","created_utc":1553025258}