{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я просто слушал подкаст Майкла Грегера о воспалении, и он сослался на некоторые исследования, показывающие, что потребление рыбы на самом деле хуже для воспаления, вопреки распространенному мнению, что омега-3 полезны.\n\nТеперь, до того, как все стали бандитами Грейгера за то, что он злой, пропагандирующий пропаганду (и) вегетарианец, он цитировал гораздо больше рандомизированных двойных слепых плацебо-контролируемых испытаний, чем раньше. Честно говоря, я могу уважать парня, который не держит никаких доходов от своих книг, не продвигает какие-либо добавки и не рекламирует свой сайт рекламой. Он прилагает усилия, чтобы не иметь конфликта интересов, и независимо от того, являетесь ли вы веганом или нет, вы должны согласиться с тем, что он делает хорошую работу, рассказывая людям о преимуществах диеты, состоящей из цельных продуктов.\n\nЭто безумие, что мне нужно написать такой гигантский абзац, если я ссылаюсь на вегетарианца-диетолога. В любом случае, кто-нибудь может указать мне на эти исследования, указывающие на то, что рыба вызывает воспаление? У меня возникли проблемы с их поиском. Благодарность\n\n& # X200B;\n\nИзменить: Вот некоторые исследования, на которые он ссылается в отношении рыбы:\n\n1. [Г. К. Пот, И. А. Брауэр, А. Эннеман, Г. Т. Рейкерс, Э. Кампман и А. Гилен. Отсутствие влияния добавок рыбьего жира на маркеры воспаления в сыворотке крови и их взаимосвязь: рандомизированное контролируемое исследование у здоровых людей среднего возраста. Eur J Clin Nutr, 63 (11): 1353-1359, 2009.] (http://www.ncbi.nlm.nih.gov/pubmed/19623203)\n2. [В. Арсенеску, Р. И. Арсенеску, В. Кинг, Х. Свансон и Л. А. Кассис. Полихлорированный бифенил-77 индуцирует дифференцировку адипоцитов и провоспалительные адипокины и способствует ожирению и атеросклерозу. Environ. Health Perspect., 116 (6): 761-768, 2008.] (http://www.ncbi.nlm.nih.gov/pmc/articles/PMC2430232/)\n3. [Кристиан Сонн, Руне Дитц, Палл С. Лейфссон, Эрик В. Борн, Роберт Дж. Лечер, Майя Киркегард, Дерек С. Г. Мьюр, Фрэнк Ф. Ригет, Ларс Хилдструп. Вносят ли галогенорганические загрязнения вклад в гистопатологию печени у полярных медведей Восточной Гренландии (Ursus maritimus)? Перспектива здоровья окружающей среды. Ноябрь 2005 г .; 113 (11): 1569–1574.] (Http://www.ncbi.nlm.nih.gov/pmc/articles/PMC1310920/)\n4. [Е. Хох, С. Дж. Леготай, К. С. Пангалло, К. Мастовска, Х. Л. Нго, К. М. Редди и В. Веттер. Одновременный количественный анализ нескольких классов галогенорганических соединений в рыбьем жире с непосредственным введением пробы, комплексной двумерной газовой хроматографией и масс-спектрометрией по времени пролета. J. Agric. Продукты питания. Chem., 57 (7): 2653-2660, 2009.] (http://www.ncbi.nlm.nih.gov/pubmed/19265383)\n5. [D. Cannon. От рыбьего жира до масла микроводорослей ... беспроигрышный переход для людей и нашей среды обитания. Исследуйте (Нью-Йорк, Нью-Йорк), 5 (5): 299-303, 2009.] (http://www.ncbi.nlm.nih.gov/pubmed/19733817)\n6. [Миранда Д.А., Де Карвалью-Соуза Г.Ф. Мы едим пластиковую рыбу? Мар Поллут Булл. 2016; 103 (1-2):. 109-114] (https://www.ncbi.nlm.nih.gov/pubmed/26763323)\n7. [E C Rizos, E E Ntzani, E Bika, M S Kostapanos, M S Elisaf. Связь между приемом омега-3 жирных кислот и риском развития основных сердечно-сосудистых заболеваний: систематический обзор и метаанализ. JAMA. 2012 сентябрь 12; 308 (10): 1024-33. doi: 10.1001 / 2012.jama.11374.] (http://www.ncbi.nlm.nih.gov/pubmed/22968891)\n8. [Р. Де Катерина. n-3 жирные кислоты при сердечно-сосудистых заболеваниях. N Engl J Med. 2011 июнь 23; 364 (25): 2439-50.] (Http://www.ncbi.nlm.nih.gov/pubmed/21696310)\n9. [Смоделированное влияние рыбного изменения популяции n - 3 жирных кислот на воздействие диоксинов и диоксиноподобных соединений.] (Https://www.youtube.com/redirect?q=https%3A% 2F% 2Fwww.ncbi.nlm.nih.gov% 2Fpubmed% 2F17637492 & redir_token = Hb8yclt4rCWPoXiPOPvnoKhWEM58MTU1NjM5NjQ2MEAxNTU2MzEwMDYw & события = video_description & v = jTttCfZsId8)\n10. [Руководство по здравоохранению для сердечно-сосудистых преимуществ и рисков, связанных с потреблением рыбы.] (Https://www.ncbi.nlm.nih.gov/pubmed/17956606)","title":"Доказательства того, что рыба в рационе на самом деле провоспалительная?","subreddit_name_prefixed":"r/nutrition","ups":65,"created":1556280128,"link_flair_background_color":"","id":"bhhzin","author":{"name":"ColdBoreShooter"},"permalink":"/r/nutrition/comments/bhhzin/evidence_for_fish_in_the_diet_actually_being/","url":"https://www.reddit.com/r/nutrition/comments/bhhzin/evidence_for_fish_in_the_diet_actually_being/","created_utc":1556251328}