{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Эй, сообщество по питанию,\n\nЯ работаю над проектом на арабском веб-сайте для предоставления услуг по питанию для арабского сообщества, в настоящее время я почти завершила часть для диеты для беременной женщины, и мне интересно, могу ли я где-нибудь найти научный и точный список продуктов питания, показывающий сколько в нем содержится:\n\n\\ - Каждая порция (в граммах)\n\n\\ - Сколько углеводов в порции\n\n\\ - Сколько белка в порции\n\n\\ - Сколько жира в порции\n\n** Цель проекта: **\n\n\\ - Помогите простому человеку: составить свой ежедневный рацион без необходимости посещать диетолог и иметь возможность выбирать из широкого ассортимента блюд и в то же время получать его / ее ежедневное питание.\n\n\\ - Помогите диетологам: просто и легко создавать ежедневные диеты для своих клиентов.\n\n\\ - Может быть, заработать немного денег от рекламы на сайте.\n\n** Что у меня уже есть: **\n\nЯ уже заполнил таблицу из примерно 450 записей, и сайт может работать на основе этого в настоящее время.\n\nЯ уже знаю о сайте NDB и загрузил таблицы составов продуктов питания (для ссылки: [https://ndb.nal.usda.gov/ndb/](https://ndb.nal.usda.gov/ ОПРС /)).\n\n** Что я ищу: **\n\n\\ - Любой источник, предоставляющий список надежных и научных продуктов питания, как описано выше.\n\n\\ - Я сотрудничаю со всеми, кто интересуется этой областью, возможно, создаю версии на других языках.\n\nЯ ** не буду ** публиковать ссылку на веб-сайт, чтобы избежать ограничения \"** Самореклама **\", однако, если вам интересно узнать о проекте, я и я отвечу вам ссылкой.","title":"Поиск научных списков продуктов питания (ближневосточная, европейская, западная и восточная) с указанием в них количества основных питательных ингредиентов.","subreddit_name_prefixed":"r/nutrition","ups":17,"created":1556809220,"link_flair_background_color":"","id":"bjrxwm","author":{"name":"Ghojah"},"permalink":"/r/nutrition/comments/bjrxwm/looking_for_scientific_food_lists_middle_eastern/","url":"https://www.reddit.com/r/nutrition/comments/bjrxwm/looking_for_scientific_food_lists_middle_eastern/","created_utc":1556780420}