{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Есть ли видеоматериал, объясняющий, как витамины и питательные вещества способствуют тому, как ребенок, взрослый, может представить себе и понять, что каждое питательное вещество делает для нашего тела? IDC, если это видео серии или длиннее, поскольку я нахожу только упрощенный и оставшийся в роли этого невидимого предмета, с которым моему ребенку трудно связываться. Я пытался, но продолжал получать только «морковь, помогающая вашим глазам», или это «заставляет ваши волосы расти», так как ребенок постоянно хочет ассоциировать каждую еду / питательный элемент с реальной пользой для жизни\n\n& # X200B;\n\nтакже негативные последствия употребления пищи, не приносящей полезных веществ, и последствия отказа от употребления пищи, наполненной питательными веществами\n\n& # X200B;\n\nЯ не могу найти ни одного, который сделал бы большую работу на YT или любой другой платформе\n\nЯ, честно говоря, не получал никаких прямых уроков по «здоровью» до 7-го класса, так как у мамы были очень плохие привычки в еде (пойди разберись с медсестрой) и хотел бы действительно подчеркнуть / осмыслить здоровье в раннем возрасте\n\nСпасибо за любую помощь\n\n& # X200B;\n\nредактировать .. Я знаю, что есть много видео, я говорю о всестороннем руководстве для возрастов, которые едва читают, но хочу продвинуться в информации о еде без повторяющихся тех же самых оле каждый день кое-что, что прогрессирует и проходит каждый процесс и использование пищи ... и т. д.\n\n& # X200B;\n\nДоктор Бинокс ... кажется, все в порядке ... просто немного карикатуры ... но информация, кажется, соответствует той линии, о которой я говорил, просто не такой всеобъемлющей / собранной, полной или \"реальной\"\n\n& # X200B;\n\nотличная дискуссия .. МИР. Многие взрослые смотрят .. все смотрят на телефонные поиски, и они получают один и тот же оле, один и тот же ол, и, как я сказал, много поисков на разных платформах разбросало информацию ... это может быть проблемой","title":"Видео о питании для детей","subreddit_name_prefixed":"r/nutrition","ups":30,"created":1556910816,"link_flair_background_color":"","id":"bk78d7","author":{"name":"time4line"},"permalink":"/r/nutrition/comments/bk78d7/nutrition_videos_for_children/","url":"https://www.reddit.com/r/nutrition/comments/bk78d7/nutrition_videos_for_children/","created_utc":1556882016}