{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я пытался прочитать это утверждение, потому что оно кажется весьма актуальным, если вы хотите нарастить мускулатуру, а у меня нет никаких формальных знаний по этому вопросу. Все проглоченные белки свыше 30 г уходят в отходы? В результате вы должны есть меньшие порции еды чаще? Когда вы начинаете просматривать Интернет, вы наталкиваетесь на бесчисленные статьи с очень строго сформулированными заголовками, часто в духе «разрушения мифа», «объяснения синтеза белка» или иногда «Истины, стоящей за ........ \"\n\n& # X200B;\n\nК сожалению, фактическое содержание этих статей часто узкое. Они часто пытаются решить какой-то конкретный аспект проблемы, но очень немногие из них на самом деле затрагивают некоторые фундаментальные вопросы о том, как работает абсорбция и синтез белка. Это похоже на то, как люди пытаются ослепить вас фрагментированными знаниями «высокого уровня», чтобы отвлечь внимание от того факта, что они, кажется, не знают основ.\n\n& # X200B;\n\nНапример, то, что редко упоминается, является временным аспектом поглощения и синтеза белка, хотя в этом случае это кажется чем-то довольно фундаментальным. Исследования, которые люди приводят в отношении 20-30 г протеиновой шапки, по-видимому, использовали протеиновые коктейли непосредственно после тренировки или в одном случае некоторую форму постной говядины. Они показали, что не было никакой разницы в синтезе мышечного белка между людьми, принимающими 20-30 г, и теми, кто принимает, скажем, 90 г. Сейчас большинство статей, которые я читал, похоже, неявно рассматривают это как единичное событие. Как будто где-то в теле есть люк, который открывается, как только вся пища «обработана», а затем все сразу поглощается. Это кажется абсурдным.\n\n& # X200B;\n\nТак хорошо, что вам может потребоваться не более 30 г белка молочной сыворотки или какого-либо другого быстро усваивающегося белка после тренировки, но что происходит, когда вы едите полноценную еду, скажем, с 50 г белка, сложных углеводов и других питательных веществ, другими словами, когда организм нужно обрабатывать еду медленнее? Каждый грамм старше 30 лет по-прежнему теряется, когда речь идет о наращивании мышечной массы? Я слышал разные цифры, когда приходит время, чтобы организм переваривал пищу, некоторые говорят, 6-8, другие 36 часов, конечно, это должно играть определенную роль. Сколько белка может поглощать организм, скажем, в час, и как это влияет на синтез? Как долго после приема пищи это начинается? Как это зависит от еды?\n\n& # X200B;\n\nНи одна из статей, которые я читал, не решает эти фундаментальные проблемы удовлетворительным образом. Может быть, некоторые диетологи-реддиторы могут пролить свет на это?","title":"Все невзгоды, связанные с утверждением, что синтез белка в 20-30 г пищевого белка достигает максимума, сводят меня с ума.","subreddit_name_prefixed":"r/nutrition","ups":120,"created":1558137169,"link_flair_background_color":"","id":"bpsz79","author":{"name":"VisibleExcitement"},"permalink":"/r/nutrition/comments/bpsz79/all_the_broscience_surrounding_the_claim_that/","url":"https://www.reddit.com/r/nutrition/comments/bpsz79/all_the_broscience_surrounding_the_claim_that/","created_utc":1558108369}