{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Раньше я работал в психиатрической больнице, и у нас был этот переплет, полный руководств / мероприятий по укреплению психического и физического здоровья.\n\nОдним из листов было это подробное руководство по питанию, в котором перечислены:\n1. все витамины и минералы, необходимые вашему телу для правильной работы.\n2. эмоциональные / физические симптомы, вызванные дефицитом этих конкретных питательных веществ.\n3. конкретные продукты, которые обеспечивали эти питательные вещества.\n\nНапример, под витамином B12 будет список источников пищи, таких как рыба и молочные продукты. Далее следует, почему это важно для работы мозга, и список симптомов дефицита, таких как спутанность сознания, депрессия и усталость.\n\nУ меня была личная копия, на которую я ссылался в любое время, когда я не чувствовал себя (я очень склонен к симптомам тревоги и депрессии). Я, должно быть, потерял его, когда уезжал из дома в колледже, и я больше не работаю или не имею доступа к больнице, откуда я первоначально получил руководство.\n\nЯ значительно похудела и увидела, что мое психическое здоровье значительно улучшилось, когда я получила доступ к этой информации. Я надеюсь вернуться на правильный путь и снова найти это руководство для планирования еды.\n\nЯ искал в Google, Pinterest и на всех других сайтах, которые мог придумать, в надежде найти онлайновую копию руководства, но мне не повезло.\n\nКто-нибудь видел что-то похожее на это руководство и можете ли вы предоставить ссылку? Если нет, то какие интернет-ресурсы я могу использовать, чтобы создать свой собственный лист питания со всей упомянутой выше информацией?\n\nЕсли / когда я смогу снова найти это руководство или получить доступ к информации, чтобы создать свое собственное, я с удовольствием опубликую его для всех вас. Это невероятный ресурс для тех, кто склонен к психическим заболеваниям и / или пытается питаться здоровее. И иметь простое руководство, чтобы повесить на холодильник или держать в кармане, может быть очень эффективным для начала этих изменений в вашей жизни.\n\nЯ очень ценю вашу помощь и надеюсь, что смогу ответить вам взаимностью, предоставив вам новую информацию. Заранее спасибо!\n\n**РЕДАКТИРОВАТЬ:**\nСпасибо всем за интерес и предложения!\n\nЯ получил много полезной информации от ресурсов, о которых вы упомянули, и я все еще планирую создать специальное руководство, чтобы поделиться со всеми вами.\n\nЯ вижу, что многие из вас устанавливают напоминания, для которых я предполагаю, что это либо оригинальное руководство, которое я искал, либо то, которое я сказал, что сделаю. Я просто немного занят, и у меня еще не было времени поработать над этим, но я обещаю, что в конце концов доберусь до него и поделюсь им, как только он закончится!\n\nДо тех пор в комментариях есть несколько замечательных ресурсов для питания и здоровья, так что не стесняйтесь просматривать их!\n\nЕще раз спасибо всем за то, что вы так же хорошо вложены в ваше благополучие, как и я. Я ценю ваше терпение, и я буду обновлять вас, как только смогу!","title":"Подробное руководство по питанию для психического и физического здоровья?","subreddit_name_prefixed":"r/nutrition","ups":207,"created":1559349678,"link_flair_background_color":"","id":"bv9uey","author":{"name":"shyopossum"},"permalink":"/r/nutrition/comments/bv9uey/detailed_nutrition_guide_for_mental_and_physical/","url":"https://www.reddit.com/r/nutrition/comments/bv9uey/detailed_nutrition_guide_for_mental_and_physical/","created_utc":1559320878}