{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"\"АННОТАЦИЯ\n\nЗадний план\nДиетические рекомендации по ограничению употребления красного мяса основаны на обсервационных исследованиях, связывающих потребление с риском сердечно-сосудистых заболеваний (ССЗ), а также потенциал содержания насыщенных жирных кислот (СЖК) в повышении уровня холестерина липопротеинов низкой плотности (ЛПНП). Тем не менее, отношение белого мяса к риску сердечно-сосудистых заболеваний и влияние источника белка в рационе на субфракции липопротеиновых частиц не были тщательно оценены.\n\nЗадача\nМы проверили, значительно ли отличались уровни атерогенных липидов и липопротеинов после потребления диет с высоким содержанием красного мяса по сравнению с рационами с аналогичным количеством белка, полученного из источников белого мяса или немясного мяса, и были ли эти эффекты изменены в результате одновременного потребления высоких по сравнению с низким ОТВС.\n\nметоды\nОбычно здоровые мужчины и женщины, 21–65 лет, индекс массы тела 20–35 кг / м2, были случайным образом распределены на 1 из 2 параллельных рук (с высоким или низким SFA), а внутри каждого - на красное мясо, белое мясо и мясо белковые диеты потребляются в течение 4 недель в случайном порядке. Первичными исходами были холестерин ЛПНП, аполипопротеин В (апоВ), частицы ЛПНП малого + среднего размера и общий / высокий уровень холестерина липопротеинов высокой плотности.\n\nПолученные результаты\nАнализ включал участников, которые выполнили все 3 назначения белка с пищей (61 для высокого SFA; 52 для низкого SFA). Холестерин ЛПНП и апоВ были выше с красным и белым мясом, чем с немясом, независимо от содержания SFA (P <0,0001 для всех, кроме апоВ: красное мясо по сравнению с немясным [Р = 0,0004]). Это было связано, в первую очередь, с увеличением крупных частиц ЛПНП, тогда как на источник белка не влиял малый + средний ЛПНП и общий / высокий уровень холестерина липопротеинов высокой плотности (P = 0,10 и P = 0,51 соответственно). Первичные исходы существенно не различались между красным и белым мясом. Независимо от источника белка, высокий по сравнению с низким SFA повышенный уровень холестерина ЛПНП (P = 0,0003), апоВ (P = 0,0002) и большой ЛПНП (P = 0,0002).\n\nВыводы\nПолученные результаты соответствуют рекомендациям по продвижению диеты с высокой долей растительной пищи, но, основываясь на эффектах липидов и липопротеинов, не дают оснований для выбора белого мяса по сравнению с красным мясом для снижения риска сердечно-сосудистых заболеваний ».\n\nhttps://academic.oup.com/ajcn/advance-article-abstract/doi/10.1093/ajcn/nqz035/5494812?redirectedFrom=fulltext","title":"Влияние источников красного мяса, белого мяса и немясного белка на показатели атерогенных липопротеинов в контексте низкого по сравнению с высоким потреблением насыщенного жира: рандомизированное контролируемое исследование","subreddit_name_prefixed":"r/nutrition","ups":136,"created":1559691731,"link_flair_background_color":"","id":"bwq6gy","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/bwq6gy/effects_of_red_meat_white_meat_and_nonmeat/","url":"https://www.reddit.com/r/nutrition/comments/bwq6gy/effects_of_red_meat_white_meat_and_nonmeat/","created_utc":1559662931}