{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"\"Аннотация\n\nМолекулярные часы присутствуют почти в каждой клетке, чтобы предвидеть ежедневные повторяющиеся и предсказуемые изменения, такие как ритмическая доступность питательных веществ, и соответственно адаптировать клеточные функции. В то же время пути восприятия питательных веществ могут реагировать на острый дисбаланс питательных веществ и модулировать и ориентировать обмен веществ, поэтому клетки могут оптимально адаптироваться к уменьшению или увеличению доступности питательных веществ. Циркадианные организменные ритмы координируются с помощью поведенческих ритмов, таких как циклы активности-отдыха и кормления-голодания, чтобы временно организовать последовательность физиологических процессов для оптимизации метаболизма. Фундаментальные исследования циркадных ритмов в основном сосредоточены на функционировании самоподдерживающегося молекулярного циркадного осциллятора, в то время как научные исследования в области питания позволили понять физиологические реакции на недостаток калорий или специфические макроэлементы. Интеграция этих двух областей в новые действенные концепции по срокам приема пищи привела к появлению практики ограниченного по времени приема пищи. В этой парадигме ежедневное потребление калорий ограничено постоянным интервалом 8–12 часов. Эта парадигма имеет всеобъемлющие преимущества для систем с несколькими органами ».\nhttps://www.annualreviews.org/doi/abs/10.1146/annurev-nutr-082018-124320","title":"Ограниченное по времени питание для профилактики и лечения хронических метаболических заболеваний","subreddit_name_prefixed":"r/nutrition","ups":78,"created":1560587386,"link_flair_background_color":"","id":"c0rcmh","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/c0rcmh/timerestricted_eating_to_prevent_and_manage/","url":"https://www.reddit.com/r/nutrition/comments/c0rcmh/timerestricted_eating_to_prevent_and_manage/","created_utc":1560558586}