{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я немного сбит с толку, когда речь идет о посте, потому что разные книги говорят разные вещи, и у всех, похоже, есть «источники».\n\nВ частности, в книге доктора Джейсона Фанга «Кодекс об ожирении» он говорит (выделение мое):\n\n> Подумайте о последствиях сжигания мышц для энергии. В течение долгих зим было много дней, когда не было еды. После первого эпизода вы будете сильно ослаблены. После нескольких повторных эпизодов вы будете настолько слабы, что не сможете охотиться или собирать еду. Люди никогда бы не выжили как вид.\n\n> Лучшим вопросом было бы, почему человеческое тело будет накапливать энергию в виде жира, если оно планирует вместо этого сжигать белок. ** Ответ, конечно, заключается в том, что не сжигает мышцы в отсутствие пищи. Это всего лишь миф. **\n\n> Режим голодания, как известно в народе, - это таинственный призрак, которого всегда поднимают, чтобы отпугнуть нас от пропуска ни одного приема пищи. Это просто абсурдно. ** Разрушение мышечной ткани происходит только при крайне низких уровнях жира в организме - примерно 4 процента - это не то, о чем большинство людей должно беспокоиться. ** На этом этапе нет больше жира, который можно мобилизовать для получения энергии, и нежирная ткань потребляется. Организм человека эволюционировал, чтобы пережить эпизодические периоды голодания. Жир накапливает энергию, а мышца является функциональной тканью. Жир сжигается первым. Эта ситуация похожа на хранение огромного количества дров, но вместо этого вы решили сжечь свой диван. Это глупо. Почему мы предполагаем, что человеческое тело настолько глупо? ** Тело сохраняет мышечную массу до тех пор, пока запасы жира не станут настолько низкими, что у него не будет другого выбора. **\n\nИ в то же время я читаю «Руководство по быстрой потере жира» Лайла Макдональда, где он говорит (опять же, мой акцент):\n\n> Итак, допустим, вы перестали есть что-нибудь и посмотрите, что происходит [...]. В течение первых нескольких часов голодания уровни глюкозы и инсулина в крови падают. Это сигнализирует организму о расщеплении гликогена (запасенного углевода) в печени, чтобы выпустить его в кровоток. Кроме того, организм начинает мобилизовать жир из жировых клеток для использования в качестве топлива. После 12-18 часов или около того (быстрее, если вы занимаетесь спортом), гликоген печени опорожняется. В этот момент уровень глюкозы в крови упадет до нормального уровня и останется там. Содержание жирных кислот в крови значительно возросло.\n\n> Примерно через день большинство клеток в организме, за некоторыми исключениями, используют жирные кислоты в качестве топлива. [...]\n\n> Должен быть недостаток, и вот он: несколько тканей, которые требуют глюкозы, получают ее через глюконеогенез в печени. Как указано выше, глюконеогенез происходит из глицерина, лактата, пирувата и аминокислот. ** Теперь, если человек, который голодает, не ест белок, откуда эти аминокислоты должны поступить? Это верно, из белка, который уже находится в организме. ** Но вспомните из прошлой главы, что в организме действительно нет белка в организме, если не считать мышцы и органы. ** Это означает, что во время полного голодания организм должен расщеплять белковые ткани, чтобы обеспечить аминокислоты для образования глюкозы. Тело начинает потреблять свою собственную мышечную массу, чтобы глюкоза могла питать определенные ткани. Это плохо**.\n\nТак кто же конкретно прав? Обоснование Фунга имеет эмпирический смысл в терминах пещерного человека, но аргумент Макдональда также имеет смысл (по крайней мере, для меня).\n\nЕсть ли окончательный ответ о том, вызывает ли голод мышечную массу в качестве топлива, и если да, то через какое время?","title":"Во время голодания организм использует или НЕ использует мышечный белок для производства гликогена?","subreddit_name_prefixed":"r/nutrition","ups":124,"created":1561070327,"link_flair_background_color":"","id":"c2wt5g","author":{"name":"throw_my_username"},"permalink":"/r/nutrition/comments/c2wt5g/during_fasting_does_the_body_use_or_not_use/","url":"https://www.reddit.com/r/nutrition/comments/c2wt5g/during_fasting_does_the_body_use_or_not_use/","created_utc":1561041527}