{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Итак, я некоторое время был на Кето. Мой местный продуктовый магазин прекратил приносить какие-либо замороженные продукты с низким содержанием углеводов около месяца назад, и я наконец исчерпал все, что у меня было.\n\nЯ выбираю смотреть на это как на смешанное благословение; В любом случае я изо всех сил пытался остаться на Кето, и я тратил * состояние * на эти вещи. (Честно говоря, это было очень легко, и большая часть была довольно вкусной)\n\nВ любом случае, я вчера купил продукты, и я обнаружил, что впадаю в старые привычки покупать; «дешевая» еда, которая, как я знала, будет * вкусной * хорошей, но она ни в коем случае не будет полезной.\n\nМне * нужно * похудеть, и мне многое нужно потерять. Мне нужно начать уделять время готовке, желательно как можно проще. Я скажу, я не большой поклонник курицы, но я знаю культуриста, с которым я жил * клялся * запеченной курицей, коричневым рисом, бананами и * иногда * рисовыми лепешками (лучше всего я помню, он посоветовал мне против последнего, просто потому, что это, вероятно, что-то, что я был бы склонен злоупотреблять и переедать).\n\nЕсли есть какие-либо подкасты о здоровом питании или о здоровом приготовлении пищи, я тоже буду признателен за это (поскольку в любом случае я ношу наушники целый день, я также могу взять некоторую полезную информацию).\n\nТакже стоит отметить ... У меня есть * ноль * талант к кулинарии. И не много терпения для этого, тоже (что странно, потому что моя мама шеф-повар и также любит выпекать; ни я, ни моя сестра никогда не любили готовить).\n\nСпасибо заранее за любые предложения!","title":"Кто-нибудь знает какие-нибудь хорошие руководства (особенно видео), показывающие, как готовить действительно полезные продукты, которые, надеюсь, не стоят тонны?","subreddit_name_prefixed":"r/nutrition","ups":35,"created":1561500150,"link_flair_background_color":"","id":"c590hf","author":{"name":"Jcorb"},"permalink":"/r/nutrition/comments/c590hf/does_anyone_know_any_good_guides_especially/","url":"https://www.reddit.com/r/nutrition/comments/c590hf/does_anyone_know_any_good_guides_especially/","created_utc":1561471350}