{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Мне очень любопытно, кому мы можем доверять в диетологическом сообществе. Есть ли люди, за которыми вы, ребята, следите за питанием, они законные или у них просто голова в заднице?\n\nМои наблюдения:\n\nМайкл Грегер - Множество информации о том, как пищевые продукты на растительной основе могут иметь разные эффекты, хороший взгляд на то, как разные здоровые продукты могут иметь разные эффекты (например, черника, ограничивающая всплеск сахара в крови), НО предвзято, когда речь идет о продуктах животного происхождения, кажется, отказывается признать любую положительную пользу продуктов животного происхождения. Тем не менее, он также кажется наименее ориентированным на прибыль среди всех этих людей, чего бы это ни стоило.\n\nРонда Патрик - много полезной информации о том, насколько плох сахар, насколько хорош прерывистый пост, и в целом много полезной информации, но слишком сфокусированной на «биологическом взломе» (используя дополнения для «решения» различных проблем)\n\nПитер Аттиа - Кажется страстным, но у него слишком далеко голова. Я хочу узнать, что этот парень может предложить, но он тратит так много времени на разговоры ни о чем, что в итоге я чувствую, что он в основном говорит просто для того, чтобы повысить свое эго и доказать себе, что он такой умный. Также кажется самым жадным, запирая свои подкасты за платным доступом.\n\nКрис Мастерджон (Chris Masterjohn) - очень информативное видео о YT, дает много практической информации о том, как наблюдать различные дефициты витаминов и их последствия, а также о том, как их устранить, и, если вы прошли тестирование 23andme, он дает больше информации о том, как разобраться с вашим геномом конкретно\n\nЕсть какие-нибудь мысли об этих людях или о тех, кому вы могли бы предложить следовать?","title":"Питание \"Гуру\" - Майкл Грегер, Ронда Патрик, Питер Аттиа и др .... кому доверять?","subreddit_name_prefixed":"r/nutrition","ups":162,"created":1563945829,"link_flair_background_color":"","id":"cgyptm","author":{"name":"greenpoe"},"permalink":"/r/nutrition/comments/cgyptm/nutrition_gurus_michael_greger_rhonda_patrick/","url":"https://www.reddit.com/r/nutrition/comments/cgyptm/nutrition_gurus_michael_greger_rhonda_patrick/","created_utc":1563917029}