{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я нашел первое исследование от / u / VisaEchoed здесь: https://www.reddit.com/r/nutrition/comments/ceehvr/caloric_surplus_required_for_building_muscle/eu279h5/ (https://www.ncbi.nlm.nih.gov/pubmed / 26817506)\n\n> В результате вмешательства LBM увеличился (P <0,05) в группе PRO (1,2 ± 1,0 кг) и в большей степени (P <0,05) по сравнению с группой CON (0,1 ± 1,0 кг). У группы PRO была большая потеря жировой массы, чем у группы CON (PRO: -4,8 ± 1,6 кг; CON: -3,5 ± 1,4 кг; P <0,05)\n\nНекоторые критики говорят, что мужчины имели избыточный вес (около 29 ИМТ) и не могут применяться к худым людям. Ну, вот тот, у которого не было людей с избыточным весом. Это исследование с участием женщин было недавно опубликовано Брэдом Шоенфилдом здесь: https://www.instagram.com/p/B0Vq2LiF0g6/ Он дает краткое резюме:\n\n> Мне выпала честь сотрудничать в этом исследовании потребления белка с моим коллегой, доктором Биллом Кэмпбеллом (следуйте за ним на @billcampbellphd). Исследование показало, что кормление амбициозных женщин-конкурентов по телосложению с помощью высокобелковой диеты (примерно в 3 раза выше рекомендаций RDA) значительно увеличивало количество обезжиренной массы, получаемой во время 8-недельной программы тренировок с отягощениями. В соответствии с другими исследованиями, это усиливает важность потребления большего количества белка, когда целью является добавление сухой массы. Интересно, что субъекты в группе с высоким содержанием белка также потеряли значительное количество жира в организме (более 2 фунтов). Таким образом, вопреки тому, что некоторые утверждают, вы можете одновременно нарастить мышечную массу, уменьшая при этом жир. Теперь важно отметить, что, хотя испытуемые имели предыдущий опыт тренировки, они не были хорошо подготовлены (включение требовало, чтобы они поднимались в течение как минимум 3 месяцев и имели возможность тяги в 1,5 раза больше массы тела). Тем не менее, они не были новичками и были относительно худыми в начале исследования. Возьмите домой: комбинация высокобелковой диеты и программы регулируемого лифтинга может помочь добиться перестройки тела! #gainz\n\nСсылка для этого исследования находится здесь: https://www.ncbi.nlm.nih.gov/pubmed/29405780, которая может представлять интерес для / u / crabcakesandoldbay","title":"Два недавних исследования показывают, что вам не нужно быть в избытке калорий, чтобы наращивать мышцы и терять жир одновременно. В одном исследовании участвовали мужчины с избыточным весом, а в другом - худые женщины. Мужчины съели 2,4 г белка на кг. Женщины съели 2,5 г белка на кг.","subreddit_name_prefixed":"r/nutrition","ups":297,"created":1564115269,"link_flair_background_color":"","id":"cht21o","author":{"name":"cangetenough"},"permalink":"/r/nutrition/comments/cht21o/two_recent_studies_show_that_you_dont_need_to_be/","url":"https://www.reddit.com/r/nutrition/comments/cht21o/two_recent_studies_show_that_you_dont_need_to_be/","created_utc":1564086469}