{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я чувствую, что везде, куда бы я ни шел, все, что я читаю, все не могут прийти к согласию относительно того, что полезно есть или нет;\n\nВеганы говорят, что мясо вредно по причине b, а веганская диета - лучшая, люди на кето-диете говорят, что веган вреден по причине d, e, f и кето - хорошо. И все они, похоже, имеют какую-то научную поддержку, некоторые исследования подтверждают их точку зрения.\n\n\nБольшинство людей склонны считать, что насыщенные жиры вредны, но есть научные доказательства того, что на самом деле это полная противоположность. То же самое с молоком и многими другими продуктами.\n\n\nЯ просто не знаю, кому верить, потому что я иду и проверяю исследования, на которые ссылается каждый человек, но кажется, что даже исследования ошибочны и им нельзя доверять, иногда возникает конфликт интересов, иногда исследование ошибочно в методологии, некоторые исследования просто неточны.\n\n\nИ я не знаю о вас, ребята, но у меня нет времени, чтобы проверить каждое исследование, чтобы увидеть, хорош ли темный шоколад для меня или плохо.\n\n\nКаждый человек имеет право, и у всех есть предубеждения, и информация, представленная в Интернете, повсеместно, если я найду исследование, которое говорит, что сахар полезен для мозга, я уверен, что где-нибудь его найду.\n\n\nТаким образом, мой вопрос: есть ли способ провести научно обоснованные, независимые и объективные исследования о питании в легкодоступной форме, где мне не нужно * проверять каждый аспект статьи, чтобы составить мнение?\n\nРЕДАКТИРОВАТЬ: добавлено слово.","title":"Как получить точную и проверенную информацию о питании?","subreddit_name_prefixed":"r/nutrition","ups":183,"created":1564859845,"link_flair_background_color":"","id":"clhnvd","author":{"name":"InnoSang"},"permalink":"/r/nutrition/comments/clhnvd/how_to_get_accurate_and_verified_info_about/","url":"https://www.reddit.com/r/nutrition/comments/clhnvd/how_to_get_accurate_and_verified_info_about/","created_utc":1564831045}