{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"https://www.tandfonline.com/doi/abs/10.1080/07315724.2001.10719017\n\n\n** Морщины на коже: может ли еда изменить ситуацию? **\n\nОпубликовано на сайте: 27 июня 2013\nhttps://doi.org/10.1080/07315724.2001.10719017\n\n\nАннотация\n\nЦели: В этом исследовании рассматривалось, коррелировали ли потребление пищи и питательных веществ с морщинами на коже в местах, подверженных воздействию солнца.\n\nМетоды: 177 предметов греческого происхождения, проживающих в Мельбурне (GRM), 69 предметов греческого происхождения, проживающих в сельской Греции (GRG), 48 пожилых англо-кельтских австралийцев (ACA), проживающих в Мельбурне, и 159 шведских предметов, проживающих в Швеции (SWE), участвующих в Международный союз наук о питании IUNS [Пищевые привычки в позднем возрасте Lifersqb; В исследовании были измерены их диетическое потребление и оценена их кожа. Потребление пищи и питательных веществ оценивали с использованием утвержденного полуколичественного опросника частоты употребления пищи (FFQ). Морщинки кожи измеряли с помощью микротографического кожного метода.\n\nРезультаты: у пожилых SWE было наименьшее количество морщин на месте, подверженном воздействию солнца, затем следовали GRM, GRG и ACA. Корреляционный анализ объединенных данных и использование основных групп продуктов питания позволили предположить, что актиническое повреждение кожи может быть меньше при более высоком потреблении овощей (rs = -0,31, р <0,0001), оливкового масла (rs = -0,29, р <0,0001) , рыба (rs = -0,24, р <0,0001) и бобовые (rs = -0,16, р <0,0001), а также меньшее потребление масла (rs = 0,46, р <0,0001) и маргарина (rs = 0,24, р <0,001) молочные продукты (rs = 0,16, р <0,01) и сахарные продукты (rs = 0,12, р <0,01). Аналогичные результаты были получены с использованием регрессионного анализа, за исключением того, что рыба больше не была значимой; 32% дисперсии для актинического повреждения кожи было предсказано шестью из десяти основных пищевых групп. В частности, высокий уровень потребления овощей, бобовых и оливкового масла, по-видимому, защищал от кожного актинического повреждения (что в совокупности объясняет 20% отклонений); высокое потребление мяса, молочных продуктов и сливочного масла оказалось неблагоприятным (что объясняет <5% дисперсии). Чернослив, яблоки и чай объясняют 34% различий среди ACA.\n\nВывод: Это исследование показывает, что на морщины на открытом солнце у пожилых людей различных этнических групп могут влиять типы потребляемой пищи.","title":"Исследование: Продукты, полезные для вашей кожи и предотвращающие морщины = овощи, оливковое масло, рыба и бобовые. Пища, не подходящая для вашей кожи = масло, маргарин, молочные продукты и сахар.","subreddit_name_prefixed":"r/nutrition","ups":338,"created":1564967224,"link_flair_background_color":"","id":"clypw8","author":{"name":"Bluest_waters"},"permalink":"/r/nutrition/comments/clypw8/study_foods_good_for_your_skin_and_prevent/","url":"https://www.reddit.com/r/nutrition/comments/clypw8/study_foods_good_for_your_skin_and_prevent/","created_utc":1564938424}