{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Мне интересно, что думают люди о том, чтобы есть овощи с относительно низким содержанием питательных веществ.\n\nЯ не думаю об этом, когда готовлю еду; Прямо сейчас я пробую много разных овощей, потому что, например, я не знаю, какой вкус у свеклы, и поэтому я пробую рецепт со свеклой (оказывается, они очень вкусные).\n\nНо в конце концов у меня будет хорошее представление о том, на что похожи мои овощи в супермаркете, и я буду выбирать их, чтобы поесть без рецептов, которыми я буду руководствоваться. По сути, я задаюсь вопросом, можно ли стать дефицитом в питании, съев слишком много овощей с низким содержанием питательных веществ, и следует ли мне ориентировать свои покупки, основываясь частично на питании? Мои инстинкты говорят мне, что «диета, состоящая примерно на 50% из овощей, полезна для вашего здоровья, не нужно думать о том, какие они есть», и все же ....\n\nЯ смотрю на репу. Чтобы получить 100% своей дневной потребности в количестве витаминов и минералов, вам нужно ежедневно съедать по 5,5 фунта. Чтобы приблизиться к тому, что вам нужно в день от свеклы, нужно 3,5 фунта. Шпинат находится на другом уровне: вам нужно всего около 1 фунта, и вы удовлетворяете много своих ежедневных потребностей в витаминах и минералах. Лук и, ну, довольно много других сортов овощей, находятся где-то между свеклой и репой. Кажется, ничто не приближается к зелени.\n\nТак в чем же дело? Почему овощи считаются такими важными для питания, если вам нужно ежедневно съедать килограммы (большинства) из них, чтобы получить от них ощутимый эффект? Если вы хотите по-настоящему питаться, кажется, что вы должны придерживаться основных продуктов питания, таких как различные цельные зерна, картофель, бананы и так далее. Или бобы. Итак, почему нехватка овощей рассматривается как проблема со здоровьем, а не недостаток этих видов основных продуктов питания?\n\nРазве вы \\ * должны \\ * есть несколько фунтов овощей каждый день? Руководство, которое я где-то читал, состояло в том, чтобы съесть 1 фунт в день, который, для большинства из них, с точки зрения питания, на самом деле не навредит.\n\nЯ люблю есть овощи, и моя кишка говорит мне, что они важны, потому что есть больше пищи, чем ее научные составляющие питания. И все же я хотел бы проверить работоспособность, потому что количество питательных веществ во многих овощах кажется низким.","title":"Овощи с низким содержанием питательных веществ","subreddit_name_prefixed":"r/nutrition","ups":16,"created":1566354819,"link_flair_background_color":"","id":"ct3pwd","author":{"name":"[deleted]"},"permalink":"/r/nutrition/comments/ct3pwd/low_nutrient_vegetables/","url":"https://www.reddit.com/r/nutrition/comments/ct3pwd/low_nutrient_vegetables/","created_utc":1566326019}