{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Когда я впервые обнаружил закусочные марки Quest около 4 месяцев назад, они звучали как панацея: с высоким содержанием белка (обычно 20 г для закусок весом от 180 до 240 ккал), с высоким содержанием клетчатки (в основном в бочке около 15 г, но, конечно, не сытные сорта), низкое содержание углеводов (\\ ~ 4 г).\n\nПо-видимому, этого можно достичь, заменив большую часть сахара, содержащегося в рецепте, на [эритрит] (https://en.wikipedia.org/wiki/Erythritol#Side_effects), пищевую добавку на основе сахарного спирта (была обнаружена в 1848 году) на 60–70% больше. воспринимается сладость как сахароза, но это почти нулевая энергия.\n\nПроблема, конечно, в том, что\n\n«По сравнению с другими сахарными спиртами кишечным бактериям также намного труднее перевариваться, поэтому он реже вызывает образование газов или вздутие живота, чем другие полиолы», [[`[9]`] (https: //en.wikipedia .org / wiki / Erythritol # cite_note-Arrigoni-2005-9) `такие как` [`maltitol`] (https://en.wikipedia.org/wiki/Maltitol)`, `[` sorbitol`] (https: //en.wikipedia.org/wiki/Sorbitol) `или or [[lactitol`] (https://en.wikipedia.org/wiki/Lactitol)` .`\n\nЯ думаю, что, вероятно, я могу справиться с двумя из их закусок в день, прежде чем я начну страдать от симптомов, поэтому я отказался от них в качестве моей основной закуски, устойчивой при хранении.\n\nПродукты марки Think! Сравнимые по белку, но только \"~ 1 грамм\" клетчатки, и я не заметил их содержания сахара.\n\nКто-нибудь знает хорошую альтернативу квестовой марке Quest со стабильными белковыми закусками?\n\nДОБАВИТЬ: Должен заметить: я испытываю газ и вздутие живота от 4 или более штук в день, поэтому продукты с другими полиолами могут вызвать у меня взрыв!","title":"Эритрит, квест-бары и квест для идеальной закуски при хранении","subreddit_name_prefixed":"r/nutrition","ups":21,"created":1566695855,"link_flair_background_color":"","id":"cuw67a","author":{"name":"Diche_Bach"},"permalink":"/r/nutrition/comments/cuw67a/erythritol_quest_bars_and_the_quest_for_the/","url":"https://www.reddit.com/r/nutrition/comments/cuw67a/erythritol_quest_bars_and_the_quest_for_the/","created_utc":1566667055}