{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"RDA на транс-жиры составляет 2% или 2 г, но эти рекомендации могут отставать, поэтому я решил спросить. Действительно ли 1 г много, если говорить о транс-жирах?\n\nРедактировать: Я немного читал, чтобы выяснить разницу между природными транс-жирами в мясе и промышленными транс-жирами и их влиянием на здоровье. Я нашел это: [https://www.reddit.com/r/zerocarb/comments/8kwncu/trans\\_fat\\_in\\_ground\\_beef/](https://www.reddit.com/r/zerocarb/comments / 8kwncu / trans_fat_in_ground_beef /)\n\n> Существуют существенные различия между природными транс-жирами в жирах жвачных животных (коров, овец, коз) и транс-жирами в растительных жирах и маслах промышленного производства. Процесс гидрирования радикально отличается, как и типы и количество созданных транс-жиров.\n>\n> Эффекты естественных транс-жиров, особенно жвачных животных, менее ясны. Современные данные свидетельствуют о том, что трансжиры жвачных животных не связаны с повышенным риском сердечно-сосудистых заболеваний. Фактически, новые данные свидетельствуют о положительном влиянии специфических трансжирных кислот жвачных животных на здоровье сердечно-сосудистой системы.\n>\n> Нет никакой связи между потреблением транс-жиров жвачных животных и риском сердечно-сосудистых заболеваний.\n>\n> Количество трансжирных кислот жвачных животных из молока и молочных продуктов не вредно для здоровья сердечно-сосудистой системы.\n>\n> Появляющиеся данные свидетельствуют о том, что могут быть сердечно-сосудистые преимущества, связанные с некоторыми трансжирными кислотами жвачных животных.\n>\n> В то время как промышленные транс-жиры увеличивают риск сердечно-сосудистых заболеваний, природные транс-жиры, такие как трансжиры жвачных животных, имеют различную биологическую активность и могут быть связаны с пользой для здоровья сердечно-сосудистой системы.\n>\n> Трансжиры жвачных животных не были связаны с изменением отношения общего холестерина к холестерину ЛПНП.\n>\n> Трансжиры жвачных животных не были связаны с изменением соотношения холестерина ЛПНП к холестерину ЛПВП.","title":"Является ли 1 г транс-жиров незначительным или чем-то, о чем стоит беспокоиться?","subreddit_name_prefixed":"r/nutrition","ups":43,"created":1567884493,"link_flair_background_color":"","id":"d0uv1y","author":{"name":"javascript_dev"},"permalink":"/r/nutrition/comments/d0uv1y/is_1g_of_trans_fat_negligible_or_something_to_be/","url":"https://www.reddit.com/r/nutrition/comments/d0uv1y/is_1g_of_trans_fat_negligible_or_something_to_be/","created_utc":1567855693}