{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Короче говоря, моя девушка призналась, что у нее были нездоровые привычки в еде, и ее здоровье ухудшилось, поэтому она начала посещать диетолога, что было здорово, и ее здоровье улучшилось, и я очень взволнована. Тем не менее, как ее парень, она возвращалась домой со своих назначений диетологов с «делами» для меня, и я начал чувствовать, что они не просто несправедливы, но почти бессмысленны, и я не думаю, на самом деле помочь ей помочь себе.\n\nНапример, совсем недавно она пришла домой и сказала мне: «У моего диетолога есть домашнее задание для тебя - всякий раз, когда я перекусываю или пью слишком много, тебе нужно отвлечь меня и развлечь меня чем-нибудь другим». Я бы сделал это в любом случае, так как я этого не делаю хочу, чтобы она вернулась к тому, что она признает, что не хочет делать. Но более глубокий аспект, который меня отталкивает от всего этого, заключается в том, что мне говорят, что у меня есть «домашняя работа», которую я должен делать и делать каждый раз? Я никак не могу победить, и, честно говоря, я могу только испортить это и выглядеть плохо, если я пропускаю время или просто устаю и хочу вздремнуть после работы. Как взрослый, я вижу, когда меня за что-то зацепит, и могу выйти только в виде плохого парня. Да, конечно, я абсолютно помогаю, как могу и помогаю, как могу, но теперь я должен полностью согласиться «отвлекать и развлекать ее» каждый раз? Мне трудно понять, как сделать меня ответственным как таковым, чтобы она сделала правильный выбор в своем собственном уме.\n\n«Отвлекай и развлекайся новыми вещами» каждый раз? Я не клоун.","title":"Диетолог дает работу по дому","subreddit_name_prefixed":"r/nutrition","ups":22,"created":1571987663,"link_flair_background_color":"","id":"dmon99","author":{"name":"WskyRcks"},"permalink":"/r/nutrition/comments/dmon99/nutritionist_giving_chores/","url":"https://www.reddit.com/r/nutrition/comments/dmon99/nutritionist_giving_chores/","created_utc":1571958863}