{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Итак, я не чужды веганскую (чечевица - отличный бюджетный белок) или вегетарианскую (я мог бы получить в 3 раза больше белка по той же цене через Quorn multibuys) пищу вообще, но я никогда не придерживался этого.\n\nЯ и моя подруга, а также ее семья наблюдали за изменениями в игре на Netflix, и мы все заинтересованы в том, чтобы снизить потребление продуктов животного происхождения (особенно тех, которые, как мы знаем, не могут быть оправданы как полезные для здоровья), на основе информации, выдвинутой в отношении физического здоровья и благополучия. и влияние на окружающую среду.\n\nПохоже, мы думаем начать с замены простых вещей и пробовать 3 полных дня в неделю.\n\nЯ умеренно атлетичен, обычно 4 раза по 1 час 30 минут в тренажерном зале каждую неделю, иногда 5 или, наоборот, день с низким уровнем активности.\n\nМоя девушка не так активна и здорова, но стремится к этому.\n\nЕе родители просто пытаются лучше питаться и поправляться.\n\nЯ знаком с биохимией и молекулярной биологией от биолога старшекурсника, поэтому я понимаю, что некоторые аминокислоты требуются для определенных функций, а некоторые несоразмерно ниже в определенных источниках неживотного белка - очевидно, дефицит аминокислот - это не то, чего никто не хочет.\n\nТаким образом, без огненной войны, может ли кто-нибудь, кто увлекается питанием на основе растений или предан ему, объяснить, как мы, как группа, можем адаптировать свои потребности в питании в течение этих трех дней, используя растительные источники белка?\n\nОпределенные продукты для определенных аминокислот, и их концентрации были бы полезны.","title":"Объективное питание на основе растений","subreddit_name_prefixed":"r/nutrition","ups":18,"created":1572468172,"link_flair_background_color":"","id":"dp67bu","author":{"name":"Wantoliveoilwiththat"},"permalink":"/r/nutrition/comments/dp67bu/objective_plant_based_nutrition/","url":"https://www.reddit.com/r/nutrition/comments/dp67bu/objective_plant_based_nutrition/","created_utc":1572439372}