{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"источник: https://www.ncbi.nlm.nih.gov/pubmed/28480298\n\n> 3-кратное увеличение скорости выздоровления от простуды является клинически значимым эффектом. Следует изучить оптимальный состав таблеток цинка и идеальную частоту их приема. Принимая во внимание доказательства эффективности, пациенты, страдающие простудой, могут быть проинструктированы попробовать пастилки с ацетатом цинка в течение 24 часов после появления симптомов.\n\nОт Крис Мастерджон, доктор философии по этой теме:\n\n> Высокий уровень цинка в носу и горле предотвращает проникновение вирусов простуды в ваши клетки. Таблетки для цинка, специально разработанные для полного высвобождения цинка изо рта, чтобы он мог мигрировать через нос, а ткань горла могла остановить простуду при правильном применении.\n>\n> В настоящее время единственными ромбами на рынке, оптимизированными для этого процесса, являются цинковые пастилки с увеличенным сроком службы. Убедитесь, что в названии присутствует слово «улучшенный», а в ингредиентах написано, что он содержит ацетат цинка.\n>\n> Их следует принимать при первых признаках простуды, таких как первое чихание или первое ощущение холода в горле. Соси их, не жуй их. Принимайте их непрерывно, пока симптомы не прекратятся, затем принимайте их каждые два часа, пока бутылка не исчезнет. Подумайте о том, чтобы принимать 3–6 мг / сут меди во время приема, чтобы сохранить их в равновесии.\n>\n> К сожалению, в них есть декстроза, и нет никаких таблеток без сахара, которые были бы оптимизированы для этого эффекта на рынке прямо сейчас. Таким образом, вы не сможете использовать этот подход, если у вас есть строгая необходимость избегать всех сахаров или ограничивать количество углеводов.","title":"Пациенты, которым вводили таблетки цинка, быстрее выздоравливали от простуды в соотношении 3,1.","subreddit_name_prefixed":"r/nutrition","ups":246,"created":1572934047,"link_flair_background_color":"","id":"drp363","author":{"name":"cangetenough"},"permalink":"/r/nutrition/comments/drp363/patients_administered_zinc_lozenges_recovered/","url":"https://www.reddit.com/r/nutrition/comments/drp363/patients_administered_zinc_lozenges_recovered/","created_utc":1572905247}