{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Извините за чрезмерно длинный пост.\n\nПо сути, в прошлом году я прочитал «Как не умереть» доктора Майкла Грегера, и некоторые вещи в этой книге поразили меня. Не поймите меня неправильно, книга является * абсолютной пропагандой * для целой диеты, основанной на растительных продуктах, и в ней есть множество тщательно отобранных исследований, поэтому ее определенно не следует принимать за чистую монету. Тем не менее, одной вещью, которая выделялась для меня, было исследование реверса сердечно-сосудистых заболеваний с помощью диеты, основанной на растительной пище. Доктор Дин Орниш и доктор Колдуэлл Эссельстин являются двумя врачами, которые успешно остановили или даже обратили вспять развитие сердечной недостаточности у своих пациентов посредством образа жизни и диетического вмешательства.\n\n[Здесь] (https://www.ncbi.nlm.nih.gov/pubmed/7500065) вы можете увидеть одно из первых исследований доктора Эссельстина по этому вопросу;\n\n> Из 22 участников 5 бросили в течение 2 лет, и 17 соблюдали диету, 11 из которых прошли в среднем 5,5 лет наблюдения. ** Все 11 из этих участников снизили уровень холестерина со среднего базового уровня 246 мг / дл (6,36 ммоль / л) до уровня ниже 150 мг / дл ** (3,88 ммоль / л). Анализ поражений по проценту стеноза показал, что ** из 25 поражений, 11 регрессировали и 14 оставались стабильными **. Средний ** артериальный стеноз снизился с 53,4% до 46,2% ** (предполагаемое снижение = 7%; 95% доверительный интервал \\ [ДИ \\], от 3,3 до 10,7, р <0,05). Анализ с минимальным диаметром просвета 25 поражений показал, что 6 регрессировали, 14 оставались стабильными, а 5 прогрессировали. Средний диаметр просвета увеличился с 1,3 мм до 1,4 мм (предполагаемое увеличение = 0,08 мм; 95% ДИ от -0,06 до 0,22, P = NS). Болезнь была клинически остановлена у всех 11 участников, и ни у одного не было новых инфарктов. ** Из 11 оставшихся пациентов после 10 лет шесть продолжали диету и больше не имели коронарных событий, тогда как пять выбывших, которые возобновили свою предстартовую диету, сообщили о 10 коронарных событиях. **\n\n[Здесь] (https://www.ncbi.nlm.nih.gov/pubmed/1973470) вы можете увидеть исследование доктора Орниша;\n\n> В проспективном рандомизированном контролируемом исследовании, чтобы определить, влияют ли комплексные изменения образа жизни на коронарный атеросклероз через 1 год, 28 пациентов были отнесены к экспериментальной группе (вегетарианская диета с низким содержанием жира, отказ от курения, тренировка по управлению стрессом и умеренные физические нагрузки) и 20 в контрольной группе по обычному уходу. 195 поражений коронарной артерии были проанализированы с помощью количественной коронарной ангиографии. ** Средний процент стеноза диаметра регрессировал от 40,0 (SD 16,9)% до 37,8 (16,5)% в экспериментальной группе, но прогрессировал с 42,7 (15,5)% до 46,1 (18,5)% в контрольной группе **. Когда анализировались только поражения, превышающие 50% стеноза, средний процент стеноза диаметра регрессировал от 61,1 (8,8)% до 55,8 (11,0)% в экспериментальной группе и прогрессировал от 61,7 (9,5)% до 64,4 (16,3)% в контроле. группа. ** В целом, 82% пациентов экспериментальной группы имели среднее изменение в сторону регрессии. ** Комплексные изменения образа жизни могут привести к регрессу даже тяжелого коронарного атеросклероза только через 1 год без применения гиполипидемических препаратов.\n\nДа, я признаю, что в обоих исследованиях популяция низкая, но я не понимаю, почему результаты не будут одинаковыми для более крупных групп населения, и доктор Орниш успешно провел тысячи людей в своей программе «Обращение вспять сердечных заболеваний» с момента проведения исследования.\n\nКажется, что цельная пищевая растительная диета обладает всеми другими преимуществами таких диет, как кето, средиземноморская, палео и т. Д., Таких как [помощь в потере веса] (https://link.springer.com/article/10.1007/s11606-015 -3390-7? Mc_cid = 9c67e30310 & mc_eid = b5dd23aed2), [снижение артериального давления] (https://jamanetwork.com/journals/jamainternalmedicine/article-abstract/1832195), [гликемический контроль при диабете 2 типа] (https: // www.ncbi.nlm.nih.gov/pmc/articles/PMC4221319/), [защитные эффекты против рака, болезней сердца и всех причин смертности] (https://www.tandfonline.com/doi/abs/10.1080/10408398.2016. 1138447) и [подходит для всех этапов жизни, включая беременность, кормление грудью, младенчество, детство, юность, зрелую зрелость и спортсменов] (https://www.ncbi.nlm.nih.gov/m/pubmed/ 27886704 /) по данным Американской ассоциации диетологов.\n\nЯ не могу найти точное количество, но здесь говорится, что [1/4 человека умирают от болезней сердца каждый год в Америке] (https://www.cdc.gov/heartdisease/facts.htm] (https: // www. cdc.gov/heartdisease/facts.htm) и [по оценкам ВОЗ, 31% людей в мире умирают от болезней сердца каждый год] (https://www.who.int/health-topics/cardiovascular-diseases/] (https://www.who.int/health-topics/cardiovascular-diseases/), поэтому мы можем предположить, что эти цифры несколько точны. Как люди больше не обеспокоены убийцей номер один в мире, когда в большинстве случаев это явно можно предотвратить? Почему единственная в своем роде диета, предотвращающая эту болезнь, не является стандартной рекомендуемой диетой? Я что-то упускаю?\n\nКак вы, наверное, уже поняли, я придерживаюсь веганской диеты и стараюсь есть только цельные растительные продукты. Я хочу, чтобы было ясно, что я не всегда был веганом, я стал веганом менее года назад, когда занимался исследованиями о питании и здоровье. Я не пытаюсь начать спор, я искренне пытаюсь начать диалог.\n\nМне любопытно, почему на данном этапе это не общеизвестно, поскольку некоторые исследования в области профилактики сердечных заболеваний уходят в 90-е годы. Является ли исследование поддельным? Есть ли какая-то другая причина, которую я пропустил? Неправильно ли я подозревать, что цельная пищевая растительная диета оптимальна для здоровья человека? Я пишу здесь, так как знаю, что люди, которые следуют этому подпункту, следуют многим различным диетам, поэтому, если я был в эхо-камере или полагался на ложные исследования, вы, я надеюсь, сможете мне это показать. Спасибо за ваше время.","title":"Почему единственная диета, доказавшая, что она способна обратить болезнь сердца, не рекомендуется в качестве стандартной диеты, которую должен есть каждый?","subreddit_name_prefixed":"r/nutrition","ups":67,"created":1574046769,"link_flair_background_color":"","id":"dxqxao","author":{"name":"SoyBoy14800"},"permalink":"/r/nutrition/comments/dxqxao/why_is_it_that_the_only_diet_proven_to_reverse/","url":"https://www.reddit.com/r/nutrition/comments/dxqxao/why_is_it_that_the_only_diet_proven_to_reverse/","created_utc":1574017969}