{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Так что я только что посмотрел The Gamechangers, действительно интересный документальный фильм Netflix о пользе для здоровья растительных диет.\n\nОн охватывает предполагаемую проблему с витамином B12: другими словами, в растительных диетах не хватает витамина B12, поэтому те, кто их употребляет, должны принимать добавки.\n\nЭто объясняется тем, что настоящей причиной дефицита витамина В12 в современных диетах является чрезмерно чистые овощи и источники воды. Животные получают витамин B12 из бактерий в следах почвы на траве, ручьях и т. Д. Согласно документу, многие мясоеды также испытывают дефицит по той же причине.\n\nЗатем рассказчик предполагает, что в основном большинство из нас, включая мясоедов, лучше просто принимать добавки В12, чтобы убедиться, что нам не хватает витамина.\n\nНо я нахожу это немного запутанным - я постоянно вижу в средствах массовой информации истории о том, как те маленькие витаминные таблетки, которые вы покупаете у фармацевта, A-Z, бустеры с витамином C и т. Д., Все, очевидно, появляются в вашей моче. Ни один из витаминов на самом деле не усваивается вашим организмом.\n\nТак в чем же разница между приемом добавок В12 и таблеток витамина С по £ 1? Как некоторые добавки могут быть рекомендованы медицинскими работниками, часто людям, которые предполагают, что собираются начать диету на растительной основе, и все же большая часть научного мира, кажется, говорит, что добавки - пустая трата времени?\n\nИ как во все это вписываются обогащенные продукты? Принцип тот же - отличается ли овсяное молоко, обогащенное В12, от меня тем, что я пью некачественное овсяное молоко и ем витаминную таблетку?\n\nОчевидно, очень важно, чтобы люди, которые едят на растительной основе, получали достаточно B12, поэтому странно, что существует такая противоречивая информация о добавках.","title":"Витамин В12 в сравнении с вашими классическими витаминами A-Z","subreddit_name_prefixed":"r/nutrition","ups":20,"created":1574734406,"link_flair_background_color":"","id":"e1k1c3","author":{"name":"johnmarstonlover"},"permalink":"/r/nutrition/comments/e1k1c3/vitamin_b12_supplements_versus_your_classic_az/","url":"https://www.reddit.com/r/nutrition/comments/e1k1c3/vitamin_b12_supplements_versus_your_classic_az/","created_utc":1574705606}