{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"«Исследования Jhee et al. [5] и Esmeijer et al. [3] должны быть квалифицированы для их эпидемиологического характера, учитывая, что ассоциация не приравнивается к причинно-следственной связи. Использование вопросника по частоте пищевых продуктов в обоих исследованиях является еще одним ограничением, поскольку эти вопросники, как правило, недооценивают среднесуточное потребление питательных веществ, хотя ранжирование субъектов по потребляемой ими пище, например, в форме квартилей пищевого белка, является эффективным средством против указанных заболеваний. недостаток. Кроме того, гломерулярная гиперфильтрация не может быть надежно обнаружена по значениям eGFR. Несмотря на эти ограничения, эти исследования предполагают, что высокий DPI может оказывать вредное воздействие на здоровье почек в общей популяции, особенно с ранее существовавшей гиперфильтрацией или с другими факторами риска, такими как предшествующая история сердечно-сосудистых заболеваний, как в случае с альфа-омега исследование [3]. Учитывая эти и другие данные, пришло время снять табу и сделать громким и ясным, что диета с высоким содержанием белка не так безопасна, как утверждается, поскольку это может поставить под угрозу здоровье почек и привести к более быстрому снижению функции почек у людей или группы населения с высоким риском ХБП. ** Несмотря на то, что необходимы дополнительные исследования, чтобы пролить больше света, и, хотя мы ожидаем, что обсуждение будет продолжено по этой и другим темам табу [17], целесообразно избегать рекомендовать потребление большого количества белка для снижения веса у пациентов с ожирением или диабетом или у тех, кто с предшествующими сердечно-сосудистыми заболеваниями или одиночной почкой, если здоровье почек не может быть адекватно защищено. ** »\nhttps://academic.oup.com/ndt/advance-article/doi/10.1093/ndt/gfz216/5614387\n\nДва из основных исследований, цитируемых в этой статье\n\n* Потребление белка с пищей и снижение функции почек после инфаркта миокарда: альфа-омега-когорта *\n\n\" Вывод\nБолее высокое потребление белка было в значительной степени связано с более быстрым снижением функции почек у пациентов после ИМ ».\n\nhttps://academic.oup.com/ndt/advance-article/doi/10.1093/ndt/gfz015/5320337\n\n\n* Высокобелковая диета с почечной гиперфильтрацией связана с быстрым снижением почечной функции: проспективное когортное исследование на базе сообщества *\n\n«Выводы\nДиета с высоким содержанием белка увеличивает риск RHF и быстрого снижения функции почек среди населения в целом. Эти данные свидетельствуют о том, что высокобелковая диета оказывает вредное влияние на функцию почек в общей популяции ».\n\nhttps://academic.oup.com/ndt/advance-article-abstract/doi/10.1093/ndt/gfz115/5511599","title":"«Высокобелковая диета вредна для здоровья почек: снятие табу»","subreddit_name_prefixed":"r/nutrition","ups":22,"created":1574946725,"link_flair_background_color":"","id":"e2t6fu","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/e2t6fu/highprotein_diet_is_bad_for_kidney_health/","url":"https://www.reddit.com/r/nutrition/comments/e2t6fu/highprotein_diet_is_bad_for_kidney_health/","created_utc":1574917925}