{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"У меня есть друг, который в последний год постился с перерывами и оставался относительно активным (он учится в моей академии BJJ, и поэтому мы в основном занимаемся борьбой пару часов 3 раза в неделю). Я также выполняю прерывистый пост, но я также начал макро-диету, чтобы помочь мне сбросить лишние килограммы (и для ясности, я также делаю некоторые тренировки с отягощениями, чтобы помочь сохранить мышечную массу здоровой, в то время как я снижаю вес при дефиците 500 калорий). .)\n\n[Согласно этому видео]  (https://www.youtube.com/watch?v=SdNc_6F15mc)  о максимальном синтезе мышц, так как я становлюсь немного старше (в середине -40-е годы), я должен пытаться убедиться, что я принимаю белок в кусках по крайней мере 30 г, чтобы оптимизировать мышечный синтез. Я обсуждал это с моим другом, и его комментарий состоял в том, что он ест свою еду либо в одном большом куске (как и все свои калории за день в одном приеме пищи) в дни, когда он ранее голодал в течение 24 часов, или в двух больших кусках на его обычные ежедневные 16-часовые посты. Я выразил некоторое недоверие по этому поводу, полагая, что нельзя полностью использовать весь белок, который он принимает, около 140 г в день, за один или два приема пищи. И мой беглый Гуглинг говорит мне, что, вероятно, избыток белка, который он принимает, просто окисляется. Тем не менее, он настаивает на том, что он не потерял мышц за последний год с этой диетой.\n\nИтак / г / питание я задаю вам этот вопрос: что дает? Есть ли ограничение на количество белка, которое я могу потреблять и до сих пор использовать для синтеза мышц или нет? Если есть ограничение, почему мой друг сообщает, что в течение года не было потери мышечной массы, по-видимому, он не получал достаточного количества белка в своем рационе? Я спрашиваю, главным образом, потому что выливание моего белка в 30 г кусочков в течение 8-часового перерыва на голодание иногда бывает довольно трудным. Моя мышечная масса составляет около 170 фунтов (77 кг), и мой целевой белок сейчас составляет 155 г / день (прямо на 2 г / кг) ... так что я иногда пытаюсь принять четыре или пять приемов пищи с 30-40 г белка каждый в течение этих 8 часов окно. Если бы я мог сделать это за 2 или 3 без потери мышечного синтеза или потери белка, который я не могу использовать, это было бы здорово! :)\n\nИзменить: одна вещь, которую я специально ищу здесь, это как долго белок остается доступным в вашей системе после приема. Например, в какой момент я просто помещаю в свой организм белок, который скорее будет окисляться, чем использоваться для синтеза мышц? Один конец шкалы, согласно видео выше, моя нижняя линия для потребления белка, вероятно, должна быть около 30 г на заседании (но что такое сидячее? Как долго до следующего приема?) Кажется, что одна доза всего белка в моем теле как будто это другой вариант использования на дальнем конце ... конечно, белок не остается доступным для вашего тела весь день (насколько я знаю, у нас нет механизма для хранения избыточного белка, не так ли?), но что часть этого потрачена впустую и когда?","title":"Что такое крышка для потребления белка? т. е. сколько белка человек может потреблять за один раз и может ли он быть полезен для мышечного синтеза?","subreddit_name_prefixed":"r/nutrition","ups":26,"created":1550714281,"link_flair_background_color":"","id":"asre7c","author":{"name":"Cainer"},"permalink":"/r/nutrition/comments/asre7c/what_is_the_cap_for_protein_intake_ie_how_much/","url":"https://www.reddit.com/r/nutrition/comments/asre7c/what_is_the_cap_for_protein_intake_ie_how_much/","created_utc":1550685481}