{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Вы когда-нибудь смотрели на этикетку продуктов питания и видели добавки / ингредиенты, о которых вы никогда раньше не слышали. Или присадки, которые вы, возможно, знаете, например, частично гидрогенизированные масла (которые содержат транс-жиры), и подумайте, как это попало сюда. Обычно, если компания хочет добавить новую добавку в пищевой продукт, она должна пройти длительный и строгий процесс тестирования FDA, чтобы определить, можно ли его использовать. Но есть и другой способ, которым компании могут обойти это. Вставьте ГРАС (обычно считается безопасным)\n\nЕсли ингредиент считается GRAS, то компания может обойти этот длительный процесс FDA. А вот и кикер. Сами компании могут определить, считается ли ингредиент GRAS. Тогда компания может либо добровольно сообщить FDA об этом ингредиенте, либо они могут просто кататься на коньках и доставить его на рынок. Обратите внимание, что это правило действует уже более 20 лет. Ниже я разместил цитату с сайта FDA.\n\n«Любое вещество, которое, как разумно ожидается, станет компонентом пищи, является пищевой добавкой, которая подлежит предварительному одобрению FDA, если это вещество не признано безопасным (GRAS)».\n\nЯ также публикую более подробное объяснение этого ниже случая, если я не объяснил это достаточно хорошо. [https://www.consumerreports.org/food-safety/gras-hidden-ingredients-in-your-food/]<span translate = \"no\"> (https://www.consumerreports.org/food-safety / гра-скрытых ингредиентов-в-ваш-фуд /) </ SPAN>\n\n\n\nДополнительное примечание - FDA заставляет производителей начать поэтапное прекращение использования частично гидрогенизированных масел в пищевых продуктах в течение следующих нескольких лет. Так что слава им за это. Видите, это не все плохие парни, ха-ха. Вот ссылка: ucm449162.htm) </ SPAN>","title":"Законная лазейка может привести к потенциально вредным ингредиентам в пище. (добро пожаловать в ГРАС)","subreddit_name_prefixed":"r/nutrition","ups":87,"created":1551599136,"link_flair_background_color":"","id":"awnzpo","author":{"name":"flaxseed1"},"permalink":"/r/nutrition/comments/awnzpo/legal_loophole_could_result_in_potentially/","url":"https://www.reddit.com/r/nutrition/comments/awnzpo/legal_loophole_could_result_in_potentially/","created_utc":1551570336}