{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"[Здесь] (https://www.nap.edu/catalog/25353/dietary-reference-intakes-for-sodium-and-potodium) является ссылкой на страницу NASEM и [здесь] (https: // диск). google.com/open?id=1mcRbPoR-meX6gpU5Xb4etYlANj6gH0Ui) - ссылка на Google Диск на полный текст статьи для интересующихся.\n\nНекоторые большие изменения с этим! Я постараюсь процитировать некоторые соответствующие разделы ниже, но это большой документ (более 500 страниц), поэтому я наверняка пропущу некоторые вещи. Большая часть информации на вынос содержится на первых страницах, а остальная часть документа содержит подробную информацию об исследованиях, которые были рассмотрены, и о том, как были определены рекомендации.\n\n> Большая часть соли в нашем современном рационе\nобразец поступает из коммерчески приготовленных компонентов и продуктов питания и напитков, а не\nот соли, добавленной потребителями, готовящими дома, или от соли, добавленной потребителем во время\nпотребление. ** При рассмотрении источников натрия для населения старше 2 лет большинство\nраспространенными источниками натрия являются хлеб, пицца, колбасные изделия и птица. Для детей\nв частности, сыр является основным источником питания для пищевой категории, за ним следует вяленое мясо и\nдомашняя птица, а затем смешанные блюда, включая пиццу. ** Для желаемой пользы для здоровья снижается\nпотребление натрия должно быть достигнуто, промышленность должна уделять больше внимания снижению натрия в\nпоставка продуктов питания и потребителями, которые имеют необходимую информацию о содержании натрия и\nпонимание того, как сделать здоровый выбор продуктов питания. Потребление калия с пищей связано\nк конкретному овощному или фруктовому потреблению, а затем помните, что как население, наш овощ и\nПотребление фруктов редко соответствует рекомендуемой порции в день. ** Если учесть все возрасты, выше\nдиетические источники калия из молока, белого картофеля и фруктов. Кофе является главным источником\nкалий у людей в возрасте 51 года и старше в США. **\n\n> ....\n\n> В дополнение к организационной структуре DRI, ** комитету было предложено применить\nруководящие указания из доклада о руководящих принципах, в котором приводятся данные о риске хронических заболеваний\nиспользоваться для получения значений DRI отдельно от других категорий DRI для адекватности и\nтоксичность. ** С учетом существующих категорий DRI, которые сосредоточены на существенности и токсичности, которые могут затронуть всех людей, общее предположение состоит в том, что неспособность получить эталонное значение часто\nне жизнеспособный вариант общественного здравоохранения. В отличие от эталонных значений для DRI на основе хронического\nзаболевание, как правило, предполагается установить только тогда, когда доказательств достаточно\nсделать это. В частности, в Отчете о руководящих принципах рекомендуется, по крайней мере, умеренная сила\nдоказательств как причинно-следственной связи, так и зависимости между потреблением и питанием между\nриск заболевания.\n ** В контексте этого обзора DRI калия и натрия, комитет имеет\nназывается конкретной категорией DRI, основанных на хронической болезни эталонное значение хронического\nПотребление снижения риска заболеваний (CDRR). **\n\n> ....\n\nЧто касается калия, обратите внимание, что новая категория наивысшего адекватного потребления (МА) предназначена для мужчин в возрасте 19 лет и старше и составляет 3400 мг / день. Верхний предел (UL) или CDRR не были установлены.\n\nРезюме обновлений калия:\n\n> Как и в случае с отчетом DRI 2005 года, доказательств для установления недостаточно\nРасчетные средние требования, рекомендуемые диетические надбавки или верхний\nДопустимые уровни потребления калия.\n\n> При отсутствии конкретного показателя адекватности или дефицита калия, адекватный\nПотребления (AI) были получены с использованием двух национальных репрезентативных обследований. Самый высокий\nСреднее потребление калия в двух исследованиях было выбрано для каждой группы DRI в\nдети, для взрослых женщин и для взрослых мужчин. Для взрослых данные, которые информировали\nкалиевые ИИ были от нормотензивных мужчин и женщин без истории самоотчетов\nсердечно-сосудистых заболеваний. Для младенцев AI был получен из оценок калия\nприемы у грудных детей.\n\n> Несмотря на умеренную силу доказательств того, что добавки калия снижают содержание крови\nдавление, особенно среди взрослых с гипертонией, калия Хроническая болезнь риск\nСокращение потребления не может быть установлено из-за разнородности в исследованиях, отсутствия\nвзаимосвязь между потреблением и ответом, а также низкий или недостаточный уровень доказательств для\nконечные точки хронического заболевания.\n\nДля натрия самый высокий ИО по-прежнему установлен на уровне 1500 мг / день (у мужчин старше 14 лет), тогда как UL не установлен, а CDRR составляет 2300 мг / день.\n\nРезюме обновлений натрия:\n\n> Как и в случае с отчетом DRI 2005 года, доказательств для установления недостаточно\nРасчетные средние требования (EAR) или рекомендуемые диетические надбавки (RDA)\nдля натрия.\n\n> Адекватное потребление (МА) для взрослых от 19 лет и старше основано на самых низких\nуровни потребления натрия оцениваются в рандомизированных контролируемых испытаниях, для которых не было\nсвидетельство недостатка, свидетельство от лучшего разработанного исследования баланса, и недостаточного\nдоказательства вредного воздействия наблюдательных исследований. ИИ натрия для детей были\nэкстраполируется на основе оценочных энергетических требований. Для младенцев были получены ИИ\nпо оценкам потребления натрия у детей на грудном вскармливании.\n\n> Доказательств токсикологического риска от высокого уровня потребления натрия недостаточно,\nотдельно от риска хронических заболеваний. Как таковой, нет допустимого верхнего уровня потребления натрия\n(UL) устанавливается.\n\n> Существует достаточно доказательств причинно-следственной связи между потреблением и реакцией между\nпотребление натрия и риск хронических заболеваний; поэтому комитет учредил\nпотребление натрия для снижения риска хронических заболеваний (CDRR). CDRR натрия объединяет\nдоказательство положительного эффекта снижения потребления натрия на сердечно-сосудистую систему\nриск заболевания, риск гипертонии, систолическое артериальное давление и диастолическое артериальное давление.","title":"Новые диетические эталонные потребления 2019 года для натрия и калия (публикация NASEM, март 2019)","subreddit_name_prefixed":"r/nutrition","ups":18,"created":1551840131,"link_flair_background_color":"","id":"axokqc","author":{"name":"dreiter"},"permalink":"/r/nutrition/comments/axokqc/new_2019_dietary_reference_intakes_for_sodium_and/","url":"https://www.reddit.com/r/nutrition/comments/axokqc/new_2019_dietary_reference_intakes_for_sodium_and/","created_utc":1551811331}