{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Мне интересно услышать, что R / Питание говорит об этой, казалось бы, вечной дискуссии о диетическом холестерине в яйцах и его влиянии на здоровье. Общее мнение, кажется, смещается взад и вперед за эти годы. Это исследование из Северо-западного региона утверждает, что оно является наиболее полным на сегодняшний день.\n\n\n\n«Употребление 300 миллиграммов пищевого холестерина в день было связано с повышением риска развития сердечно-сосудистых заболеваний на 17% и повышением риска смерти от любой причины на 18%, исследователи определили из анализа моделей питания и здоровья для разнообразной популяции - 29 615 человек в США. взрослые в течение нескольких лет ».\n\n«Согласно данным исследования, проведенного учеными из Медицинской школы Северо-Западного университета им. Файнберга, употребление трех-четырех яиц в неделю было связано с повышением риска развития сердечно-сосудистых заболеваний на 6% и повышением риска смерти от любых причин на 8%. и опубликовано в журнале Американской медицинской ассоциации ».\n\n«Риск от употребления трех-четырех яиц в неделю был скромным, - писал в редакционной статье, сопровождающей исследование, профессор медицины в области эндокринологии и кардиологии в Университете Колорадо, Роберт Экель. Но риск возрастает с увеличением потребления холестерина, отметил он. Те, кто ел два яйца в день, имели на 27% более высокий риск сердечно-сосудистых заболеваний и на 34% более высокий риск смерти, пишет он ».\n\n\nСсылка (платный WSJ): https://www.wsj.com/articles/study-links-eggs-to-higher-cholesterol-and-risk-of-heart-disease-11552662001\n\nСсылка (Северо-запад, нет платного доступа): https://news.northwestern.edu/stories/2019/03/eggs-cholesterol/\n\nСсылка для полного изучения: https://edhub.ama-assn.org/jn-learning/module/2728487","title":"Исследование связывает яйца с повышенным уровнем холестерина и риском сердечных заболеваний","subreddit_name_prefixed":"r/nutrition","ups":160,"created":1552691338,"link_flair_background_color":"","id":"b1g1yy","author":{"name":"SittingOnA_Cornflake"},"permalink":"/r/nutrition/comments/b1g1yy/study_links_eggs_to_higher_cholesterol_and_risk/","url":"https://www.reddit.com/r/nutrition/comments/b1g1yy/study_links_eggs_to_higher_cholesterol_and_risk/","created_utc":1552662538}