{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Действительно большой обзор различных исследований микробиома здесь\n\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC3448089/\n\nВлияние диеты на состав микробиоты было показано во время начальной фазы колонизации: у вскармливаемых грудью детей уровень Bifidobacteria spp выше. в то время как дети с искусственным вскармливанием имеют более высокие уровни Bacteroides spp., а также увеличенные Clostridium coccoides и Lactobacillus spp. [44]. Помимо постнатального периода, микробиота предположительно была относительно стабильной в течение всей жизни.\n\n Однако, несколько недавних исследований показали, что диетические факторы изменяют микробное сообщество, приводя к биологическим изменениям в хозяине (Таблица 1). Фактически, состав микробиоты кишечника сильно коррелирует с диетой, что продемонстрировано исследованием, оценивающим относительный вклад генетики и диеты хозяина в формирование кишечной микробиоты и модулирование фенотипов метаболического синдрома у мышей. У мышей, которых кормят рационом с высоким содержанием жиров, существует много ключевых изменений в кишечнике, таких как отсутствие кишечной барьерной защиты Bifidobacteria spp.\n\nВ целом, диетические изменения могут объяснить 57% общего структурного изменения микробиоты кишечника, тогда как генетические изменения составляют не более 12% [45].\n\n** Это указывает на то, что диета играет доминирующую роль в формировании микробиоты кишечника ** и изменение ключевых групп населения может превратить здоровую кишечную микробиоту в заболевание, вызывающее заболевание. Например, «западная» диета с высоким содержанием сахара и жира вызывает дисбактериоз, который влияет как на метаболизм желудочно-кишечного тракта хозяина, так и на иммунный гомеостаз [46]. Это было смоделировано на модели гуманизированной мыши, где фекальная микробиота взрослого человека была трансплантирована мышам GF. Мышей кормили нежирной растительной пищей, богатой полисахаридами, и когда они переключались на «западную» диету, состав микробиоты переходил в разрастание Firmicutes, включая Clostridium innocuum, Eubacterium dolichum, Catenibacterium mitsuokai и Enterococcus spp., А также значительное сокращение в нескольких Bacteroides spp. [18]. У мышей диеты с пониженным содержанием углеводов приводят к обогащению популяций бактерий из Bacteroidetes phyla [47], а диеты с ограничением калорий предотвращают рост Clostridium coccoides, Lactobacillus spp. и Bifidobacteria spp., которые являются основными производителями бутирата, необходимыми для гомеостаза колоноцитов [48]. Диеты, богатые сложными углеводами, демонстрируют меньше патогенных видов, таких как Mycobacterium avium sub подвид paratuberculosis и Enterobacteriaceae [49], чем диеты с более высоким содержанием жира или белка [48,50,51,52].\n\nСложные углеводы также увеличивают уровни полезных видов Bifidobacteria spp. такие как B. longum подвид longum, B. breve и B. thetaiotaomicron [53]. ** Рафинированные сахара, с другой стороны, опосредуют разрастание оппортунистических бактерий, таких как C. difficile [54] и C. perfringens, за счет увеличения выхода желчи ** [55].\n\n Вегетарианство изменяет кишечную микробиоту у людей, потому что большое количество клетчатки приводит к увеличению производства короткоцепочечных жирных кислот микробами, которые снижают кишечный рН. Это предотвращает рост потенциально патогенных бактерий, таких как кишечная палочка и другие члены Enterobacteriaceae [56].\n\nИнтересно, что было обнаружено, что европейские дети имеют микробиоту, обедненную бактериоидетами и обогащенную энтеробактериями, по сравнению с сельскими африканскими детьми, которую авторы объясняют низким потреблением клетчатки в пище европейцами","title":"В целом, диетические изменения могут объяснить 57% общего структурного изменения кишечной микробиоты, тогда как генетические изменения составляют не более 12%. Это указывает на то, что диета играет доминирующую роль в формировании микробиоты кишечника.","subreddit_name_prefixed":"r/nutrition","ups":489,"created":1552733651,"link_flair_background_color":"","id":"b1npoy","author":{"name":"Bluest_waters"},"permalink":"/r/nutrition/comments/b1npoy/overall_dietary_changes_could_explain_57_of_the/","url":"https://www.reddit.com/r/nutrition/comments/b1npoy/overall_dietary_changes_could_explain_57_of_the/","created_utc":1552704851}