{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Потребление фруктов и овощей и риск сердечно-сосудистых заболеваний, тотального рака и смертности от всех причин - систематический обзор и мета-анализ зависимости от дозы проспективных исследований\n\nМеждународный журнал эпидемиологии, том 46, выпуск 3, 1 июня 2017 года, страницы 1029–1056,\n\nhttps://doi.org/10.1093/ije/dyw319\n\nОпубликовано: 22 февраля 2017 г. История статьи\n \n\n\nАннотация\n\nИстория вопроса: остаются вопросы о силе и форме зависимости доза-реакция между потреблением фруктов и овощей и риском сердечно-сосудистых заболеваний, рака и смертности, а также воздействием конкретных видов фруктов и овощей. Мы провели систематический обзор и метаанализ для выяснения этих ассоциаций.\n\nМетоды: поиск проводился в PubMed и Embase до 29 сентября 2016 года. Были включены проспективные исследования потребления фруктов и овощей и сердечно-сосудистых заболеваний, общего рака и смертности от всех причин. Суммарные относительные риски (ОР) были рассчитаны с использованием модели случайных эффектов, и была оценена смертность в глобальном масштабе; 95 исследований (142 публикации) были включены.\n\nРезультаты: для фруктов и овощей вместе суммарный ОР на 200 г / день составил 0,92 [95% доверительный интервал (ДИ): 0,90–0,94, I2 = 0%, n = 15] для ишемической болезни сердца, 0,84 (95% ДИ) : 0,76–0,92, I2 = 73%, n = 10) для инсульта, 0,92 (95% ДИ: 0,90–0,95, I2 = 31%, n = 13) для сердечно-сосудистых заболеваний, 0,97 (95% ДИ: 0,95–0,99, I2 = 49%, n = 12) для общего рака и 0,90 (95% ДИ: 0,87–0,93, I2 = 83%, n = 15) для смертности от всех причин. ** Аналогичные ассоциации наблюдались для фруктов и овощей отдельно. Снижение риска наблюдалось до 800 г / день для всех исходов, кроме рака (600 г / день) **. Были обнаружены обратные связи между потреблением яблок и груш, цитрусовых, зеленых листовых овощей, овощей семейства крестоцветных и салатов, сердечно-сосудистыми заболеваниями и смертностью от всех причин, а также между потреблением зелено-желтых овощей и овощей семейства крестоцветных и общим риском развития рака. ** По оценкам, 5,6 и 7,8 миллиона случаев преждевременной смерти во всем мире в 2013 году могут быть связаны с потреблением фруктов и овощей ниже 500 и 800 г / день соответственно **, если наблюдаемые ассоциации являются причинно-следственными.\n\nВыводы: потребление фруктов и овощей было связано со снижением риска сердечно-сосудистых заболеваний, рака и общей смертности. Эти результаты подтверждают рекомендации общественного здравоохранения по увеличению потребления фруктов и овощей для профилактики сердечно-сосудистых заболеваний, рака и преждевременной смертности.","title":"Исследование: Чтобы получить максимальную пользу от употребления фруктов и овощей в отношении сердечно-сосудистых заболеваний, рака и смертности от всех причин, вы должны съедать около 800 граммов / 28 унций фруктов и овощей в день. По оценкам, 5,6 и 7,8 миллиона случаев преждевременной смерти в мире могут быть связаны с низким потреблением фруктов и овощей","subreddit_name_prefixed":"r/nutrition","ups":39,"created":1553068434,"link_flair_background_color":"","id":"b34v19","author":{"name":"Bluest_waters"},"permalink":"/r/nutrition/comments/b34v19/study_to_get_the_full_benefit_of_fruit_and_veggie/","url":"https://www.reddit.com/r/nutrition/comments/b34v19/study_to_get_the_full_benefit_of_fruit_and_veggie/","created_utc":1553039634}