{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Здравствуйте, я недавно планировал покупать добавки с витамином D и недавно нашел это исследование: [https://www.researchgate.net/publication/322071346\\_Enhanced\\_Growth\\_of\\_the\\_Adult\\_Penis\\_With\\_Vitamin\\_D \\ _3]  (https://www.researchgate.net/publication/322071346_Enhanced_Growth_of_the_Adult_Penis_With_Vitamin_D_3)  и планирую подобную более мягкую дозировку D3 & K2. Я хотел проконсультироваться с сообществом об опасностях чрезмерного потребления D3 и о том, как распознать потенциальное / предотвращение потенциального повреждения почек.\n\n\n\n**Изучение:**\n\n«Четырнадцать взрослых мужчин вызвались участвовать в эксперименте по оценке потенциала роста полового члена в результате приема ** 50 000 единиц витамина D 3 и 100 мкг витамина К 2 в день. Длина полового члена увеличилась в среднем на 0,46 дюйма, а окружность увеличилась в среднем 0,523 дюйма **, оба статистически значимы \". Все измерения полового члена увеличились в течение 3-6 месяцев.\n\nЯ посмотрел на исследователя доктора Нормана Шили, и он основал «Международный институт холистической медицины (IIHM)», и другие его исследования кажутся разнообразными и цитируемыми. Я не смог найти никаких вопиющих скандалов или плохой прессы на него или на IIHM, но остался скептическим. У него есть еще одно исследование на эту тему, в котором он попытался провести аналогичный эксперимент с насосами для полового члена, и сообщил о несколько похожих результатах (хотя постоянство этих прибылей еще предстоит решить).\n\n**План:**\n\nВозьмите от 40% до 80% от суммы исследования:\n\n1. D3 от 20 000 до 40 000 единиц в день.\n2. К2 между 40-80 мкг мкг в день. (Для борьбы с побочными эффектами D3)\n\nЯ планирую сделать свою кровь за 3 или 4 месяца для мониторинга, но это не будет еженедельно / ежемесячно, поэтому я должен быть осторожен, не нажимая на мой D3, но я хотел бы, чтобы ввод в правильных количествах был нацелен.\n\n\\ * \\ * Проблемы: \\ * \\ * Очевидно, что многократное употребление рекомендованного количества D3 имеет потенциальную опасность. Уровень кальция в крови повышается до небезопасного порога и приводит к повреждению почек.\n\nЯ не знаю, как К2 борется с повышенным уровнем кальция в крови, но это было его целью в исследовании.\n\nПервоначально я волновался, что в последнее время я веду малоподвижный образ жизни в помещении, и у меня появились признаки снижения полового влечения и низкого кровяного давления, что было связано с тех пор, как я молод, и уже предпринял усилия для низкого стресса / физических упражнений / еды. Я сделал небольшие улучшения (+ кардио, чистая пища, цинк \\ [не уверен, что какая-то разница была сделана \\], кегели, ноотропные добавки), но решил, что попробую немного витамина D. Угол роста полового члена интересен, но не необходим и общее здоровье / благополучие на первом месте.\n\nИтак, что вы рекомендуете? Дозировка? Красные флаги?\n\nРЕДАКТИРОВАТЬ: Интернет был прав, это глупо и слишком опасно. Спасибо за законную обратную связь и шутки Витамина Дика.\n\n\nРЕДАКТИРОВАТЬ 2: нашел сайт, пытающийся извлечь из этого выгоду: [https://normshealy.com/2009/04/15/d3-k2-as-good-as-augmentation-surgery/]<span translate = \"no\"> ( https://normshealy.com/2009/04/15/d3-k2-as-good-as-augmentation-surgery/) </ SPAN>\nПримечание, он продает масло эму.","title":"Исследование витамина D3 и увеличение размера полового члена","subreddit_name_prefixed":"r/nutrition","ups":92,"created":1554650332,"link_flair_background_color":"","id":"badx30","author":{"name":"BombasticStochastic"},"permalink":"/r/nutrition/comments/badx30/study_on_vitamin_d3_increased_penis_size/","url":"https://www.reddit.com/r/nutrition/comments/badx30/study_on_vitamin_d3_increased_penis_size/","created_utc":1554621532}