{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"«Диеты, которые заменяли красное мясо здоровыми растительными белками, привели к снижению факторов риска сердечно-сосудистых заболеваний (ССЗ), согласно новому исследованию из Гарварда Т.Х. Школа общественного здравоохранения им. Чана и Университет Пердью.\n\nДанное исследование является первым метаанализом рандомизированных контролируемых исследований, в которых изучается влияние красного мяса на здоровье, заменяя его другими конкретными типами продуктов.\n\nИсследование было опубликовано в журнале Circulation.\n\n«Предыдущие результаты рандомизированных контролируемых исследований, оценивающих влияние красного мяса на факторы риска сердечно-сосудистых заболеваний, были противоречивыми. Но наше новое исследование, в котором проводится конкретное сравнение между рационом с высоким содержанием красного мяса и рационом с высоким содержанием других видов пищевых продуктов, показывает, что замена красного мяса высококачественными источниками белка приводит к более благоприятным изменениям факторов риска сердечно-сосудистых заболеваний », - сказала Марта Гуаш. Ферре, научный сотрудник отдела питания и ведущий автор исследования.\n\nВ исследование были включены данные 36 рандомизированных контролируемых исследований с участием 1803 участников. Исследователи сравнивали людей, которые ели диеты с красным мясом, с людьми, которые ели больше других видов пищи (например, курицы, рыбы, углеводов или растительных белков, таких как бобовые, соя или орехи), изучая концентрацию холестерина, триглицеридов в крови, липопротеины и артериальное давление - все факторы риска сердечно-сосудистых заболеваний.\n\nИсследование показало, что когда диеты с красным мясом сравнивались со всеми другими типами диет, вместе взятых, не было никаких существенных различий в общем холестерине, липопротеинах или кровяном давлении, хотя диеты с более высоким содержанием красного мяса действительно приводили к более высоким концентрациям триглицеридов, чем сравнительные диеты. , Тем не менее, исследователи обнаружили, что диеты с высоким содержанием высококачественных растительных источников белка, таких как бобовые, соя и орехи, приводят к более низким уровням общего холестерина и ЛПНП («плохого») по сравнению с диетами с красным мясом.\n\nРезультаты согласуются с долгосрочными эпидемиологическими исследованиями, показывающими более низкий риск сердечных приступов при сравнении орехов и других растительных источников белка с красным мясом, утверждают авторы. Полученные данные также свидетельствуют о том, что несоответствия, обнаруженные в предыдущих исследованиях относительно воздействия красного мяса на факторы риска сердечно-сосудистых заболеваний, могут быть частично обусловлены составом сравнительной диеты. Они рекомендовали, чтобы в будущих исследованиях учитывались конкретные сравнения ...\n\nАвторы рекомендовали придерживаться здоровой вегетарианской и средиземноморской диеты, как для их пользы для здоровья, так и для содействия экологической устойчивости ».\n\nhttps://www.hsph.harvard.edu/news/press-releases/substituting-healthy-plant-proteins-for-red-meat-lowers-risk-for-heart-disease/\n\nhttps://www.ahajournals.org/doi/10.1161/CIRCULATIONAHA.118.035225","title":"Мета-анализ РКИ показывает, что замена здорового растительного белка на красное мясо снижает риск сердечных заболеваний","subreddit_name_prefixed":"r/nutrition","ups":179,"created":1556590648,"link_flair_background_color":"","id":"bisrrk","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/bisrrk/metaanalysis_of_rcts_finds_substituting_healthy/","url":"https://www.reddit.com/r/nutrition/comments/bisrrk/metaanalysis_of_rcts_finds_substituting_healthy/","created_utc":1556561848}