{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я заметил, что если вы объедините 5 г пищевых дрожжей с банкой шпината, то это покрывает почти каждый витамин и минерал примерно в 100 калориях. В шпинате есть все витамины А, С, К, кальций, магний. А в пищевых дрожжах есть все витамины группы В, цинк. Вы должны иметь дрожжи с едой. И это придаст шпинату ореховый / сырный вкус, чтобы сделать его более интересным. Они прекрасно дополняют друг друга.\n\nВам по-прежнему будет не хватать 60% витамина Е, весь ваш витамин D (трудно получить из пищи - но сардины будут работать), 40% вашего цинка и железа и B2, 33% магния и фосфора, калия и меди. Хотя вы можете использовать 2 чайные ложки дрожжевых хлопьев, чтобы решить половину этого. Однако вы все равно не можете получить гораздо больше железа / кальция / цинка / магния из этого приема пищи, поскольку ваш организм может поглощать только 700 мг из них одновременно, и вы достигаете этого предела с этим приемом пищи.\n\nНо если вы едите это, вы в значительной степени покрыты, так как у вас осталось еще 1900 калорий, чтобы получить 10% оставшихся вещей. Это должно вписаться в любую диету. На самом деле, несмотря на то, что он полностью углеводный, он даже кето-совместим, так как допускается листовая зелень на уровне или ниже 5% от общего количества калорий. Он будет работать с ультра-низкокалорийными диетами, такими как 500 калорий OMAD. Это будет работать с наращиванием мышц при потере жира (когда вам нужно съесть 150 г на 1500 калорий, что тяжело).\n\n\nОбе вещи хранятся в течение длительного времени и требуют минимальной подготовки. Это стоит менее £ 1. Это также 40% вашего волокна. Микроволновая печь или обжарить в масле с чесноком и лимоном или тмином и гарам масла. Затем посыпать дрожжевыми хлопьями в конце.\n\nОдна 460 г банка (2 чашки) шпината (£ 0,80):\n\n* 600% витамина А\n* 100% витамин С\n* 2500% витамина К\n* 40% витамина Е\n* 68% фолиевой кислоты (B9)\n* 40% кальций\n* 40% железа\n* 66% магния\n\nПищевые дрожжи 5 г (£ 10/450 * 5 = £ 0,11):\n\n* 200% B1\n* 64% В2\n* 107% B3\n* 121% B6\n* 110% фолиевой кислоты (B9)\n* 88% B12\n* 20% биотина B7\n* 117% B5\n* 60% цинка\n\n\nИсточники для шпината:\nhttps://nutritiondata.self.com/facts/vegetables-and-vegetable-products/2629/2\nhttps://nutritiondata.self.com/facts/vegetables-and-vegetable-products/2927/2\n\nИсточники для пищевых дрожжей:\n«Engevita Yeast With B12» - подойдет любой бренд, хотя я уверен. Другой способ получения витаминов группы В из дрожжей - это продукты из мармита и растительных веществ.","title":"Смешайте чайную ложку питательных дрожжей в банку шпината, и у вас будет почти все витамины + минералы в течение дня.","subreddit_name_prefixed":"r/nutrition","ups":347,"created":1558596390,"link_flair_background_color":"","id":"brvu7o","author":{"name":"CHAD_J_THUNDERCOCK"},"permalink":"/r/nutrition/comments/brvu7o/mix_a_teaspoon_of_nutritional_yeast_into_a_can_of/","url":"https://www.reddit.com/r/nutrition/comments/brvu7o/mix_a_teaspoon_of_nutritional_yeast_into_a_can_of/","created_utc":1558567590}