{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"«Цель Оценить связь изменений в потреблении красного мяса с общей и вызывать специфическую смертность у женщин и мужчин.\n\nДизайн Два проспективных когортных исследования с повторными измерениями факторов питания и образа жизни.\n\nИсследование здоровья медсестер и последующее исследование медицинских работников, США.\n\nУчастники 53 553 женщины и 27 916 мужчин без сердечно-сосудистых заболеваний или рака на исходном уровне.\n\nМера основного результата Смерть подтверждается данными государственной статистики естественного движения населения, национальным индексом смертности или данными семей и почтовой системы.\n\nРезультаты 14 019 смертей произошло в течение 1,2 миллиона человеко-лет наблюдения. Увеличение потребления красного мяса в течение восьми лет было связано с более высоким риском смертности в последующие восемь лет среди женщин и мужчин (оба показателя P для тенденции <0,05, P для гетерогенности = 0,97). Увеличение общего потребления красного мяса по меньшей мере на половину порции в день было связано с повышением риска смертности на 10% (объединенный коэффициент риска 1,10, 95% доверительный интервал от 1,04 до 1,17). Для обработанного и необработанного потребления красного мяса увеличение по меньшей мере на половину порции в день было связано с повышением риска смертности на 13% (1,13, 1,04–1,23) и повышением риска смертности на 9% (1,09, 1,02–1,17) соответственно , Снижение потребления переработанного или необработанного красного мяса по меньшей мере на половину порции в день не было связано с риском смертности. Связь между повышенным потреблением красного мяса и риском смертности была постоянной среди подгрупп, определяемых по возрасту, физической активности, качеству питания, статусу курения или потреблению алкоголя.\n\nЗаключение Увеличение потребления красного мяса, особенно переработанного мяса, было связано с более высоким общим уровнем смертности ».\n\nhttps://www.bmj.com/content/365/bmj.l2110","title":"Связь изменений потребления красного мяса с общей и специфической смертностью среди женщин и мужчин в США: два проспективных когортных исследования","subreddit_name_prefixed":"r/nutrition","ups":79,"created":1560466472,"link_flair_background_color":"","id":"c06su5","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/c06su5/association_of_changes_in_red_meat_consumption/","url":"https://www.reddit.com/r/nutrition/comments/c06su5/association_of_changes_in_red_meat_consumption/","created_utc":1560437672}