{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я видел очень много заслуживающих доверия сайтов / людей, которые говорят, что добавки калия (в основном таблетки) ограничены FDA, чтобы содержать 99 мг или меньше. Как и эта статья о публикации Harvard Health - [https://www.health.harvard.edu/staying-healthy/should-i-take-a-potodium-supplement]<span translate = \"no\"> (https: // www.health.harvard.edu/staying-healthy/should-i-take-a-potassium-supplement) </ SPAN>\n\n\n\nЭто широко распространенный миф. У FDA нет ограничений на добавки калия. Об этом говорится в заявлении Национального института здравоохранения (NIH). [https://ods.od.nih.gov/factsheets/Potodium-HealthProfessional/#en23]<span translate = \"no\"> (https://ods.od.nih.gov/factsheets/Potodium-HealthProfessional/# EN23) </ SPAN>\nВы также можете выполнить поиск в базе данных FDA самостоятельно, и вы не найдете нигде, что FDA заявляет, что диетические добавки должны быть ограничены до 99 мг или меньше.\n\n\n\nХорошо, тогда почему так много калийных добавок имеют максимальную дозу 99 мг на таблетку?\nЯ полагаю, что путаница возникла из-за заявления FDA, сделанного в 1975 году, о том, что некоторые лекарства (а не добавки) должны иметь предписанную предупреждающую этикетку, если они содержат более 99 мг калия, смешанного с препаратом. Некоторые исследования в то время говорили, что лекарства, содержащие больше калия, могут вызвать проблемы с желудком.\n[https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfcfr/CFRSearch.cfm?fr=201.306]<span translate = \"no\"> (https://www.accessdata.fda.gov/ скрипты / CDRH / cfdocs / cfcfr / CFRSearch.cfm? фр = 201,306) </ SPAN>\n\n\n\nС учетом всего вышесказанного вы можете найти на рынке некоторые добавки с калийными таблетками, которые содержат более 99 мг. Два крупных бренда, которые я видел на Amazon, которые содержат более 99 мг калия на таблетку, были Pure Encapsulations и Hi-Lyte. Вы также можете искать в базе данных пищевых добавок NIH, чтобы увидеть, есть ли еще.\n[http://www.dsld.nlm.nih.gov/dsld/] (http://www.dsld.nlm.nih.gov/dsld/) ","title":"[МИФ] Несмотря на распространенное мнение, FDA не ограничивает потребление калия только 99 мг. Я был удивлен, увидев, что даже статья из Гарвардской медицинской школы была неправильной.","subreddit_name_prefixed":"r/nutrition","ups":15,"created":1561094338,"link_flair_background_color":"","id":"c31rkk","author":{"name":"flaxseed1"},"permalink":"/r/nutrition/comments/c31rkk/myth_despite_popular_belief_potassium_supplements/","url":"https://www.reddit.com/r/nutrition/comments/c31rkk/myth_despite_popular_belief_potassium_supplements/","created_utc":1561065538}