{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Я не самая яркая иголка в стоге сена, поэтому я просто публикую это, чтобы посмотреть, понял ли кто-нибудь еще то же самое, что и я. Исследование связано ниже, пожалуйста, исправьте меня или предоставьте дополнительную информацию по этому вопросу, если вы можете, мне просто любопытно, так как я в настоящее время использую эритритол в качестве основного заменителя сахара для моей семьи, и после всех исследований, которые я провел с ним, быть наименее вредным (мудрым сердцем и внутренним разумом), это немного пощечина для меня.\n\nИз того, что я понимаю, они в основном использовали длительный период времени (30 лет после того, что заявлено) и связывали потребление различных материалов с их метаболическим концом или продуктами с увеличением или уменьшением ИБС. Одним из них, по-видимому, является эритритол, который, по-видимому, увеличивает (?) Вероятность развития ИБС в случае употребления.\n\nПожалуйста, поделитесь своими мыслями, если можете, спасибо.\n\n\n[https://www.ncbi.nlm.nih.gov/pubmed/31092011] (https://www.ncbi.nlm.nih.gov/pubmed/31092011) \n\n\n\\*РЕДАКТИРОВАТЬ\\*\nДругое исследование, которое я обнаружил, на самом деле показывает, что эритритол в некоторой степени метаболизируется организмом, поэтому для меня это новость:\n\n> В целом, исследования эритрита на людях и клетках подтверждают, что до сих пор не распознавался метаболизм глюкозы в эритритол. Эти данные противоречат ранее опубликованным исследованиям, в которых сообщалось, что эритрит не метаболизируется у людей. Hiele et al. показали, что прием 25 г глюкозы и лактита, меченных 13C, приводит к изменению метаболизма человека; напротив, они сообщили, что после приема 25 г 13 С-меченого эритрита никаких изменений в метаболизме человека не наблюдалось, и эритрит не подвергался дальнейшему метаболизму. Мы показали, что существует метаболизм эритрита в эритронат.\n\n [https://www.pnas.org/content/114/21/E4233] (https://www.pnas.org/content/114/21/E4233) ","title":"Исследование, которое показывает отношение к метаболитам и ИБС - Эритритол, включенный в","subreddit_name_prefixed":"r/nutrition","ups":31,"created":1564790419,"link_flair_background_color":"","id":"cl603w","author":{"name":"Lavasd"},"permalink":"/r/nutrition/comments/cl603w/study_that_shows_relation_to_metabolites_and_chd/","url":"https://www.reddit.com/r/nutrition/comments/cl603w/study_that_shows_relation_to_metabolites_and_chd/","created_utc":1564761619}