{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Они вкуснее для большинства людей или что-то? Для меня цельнозерновой хлеб и белый хлеб на вкус так же хороши, как и друг друга, коричневый рис не сильно отличается от белого риса, видя, что вы обычно сосредотачиваетесь на вкусе соуса или карри, в сочетании с коричневыми пастами, и белыми макаронами. , Тем не менее, в любом ресторане, в который я захожу, нет обедов с альтернативой цельнозерновой в продаже, заходите в любое кафе, и все сэндвичи - это белый хлеб, белые обертки, белые булочки, его как цельное зерно в основном не существует за пределами полок супермаркетов. Кроме того, большинство супермаркетов хлебобулочных / макаронных / рисовых продуктов в любом случае являются рафинированными зернами, и я вижу так много «коричневых хлебных» продуктов, которые представляют собой просто рафинированную муку, но замаскированы, чтобы выглядеть как цельное зерно с коричневым пищевым красителем и несколькими семенами сверху. с этим?\n\nИ даже в этом случае большинство семей по-прежнему предпочитают покупать рафинированные белые продукты питания на все виды зерна. В чем дело? Это довольно раздражает, что большинство людей, кажется, не заботятся вообще. Мне бы хотелось когда-нибудь выйти на улицу и не чувствовать себя виноватым из-за еды и увидеть некоторые умеренно полезные для здоровья альтернативы традиционным продуктам, продаваемым в кафе и ресторанах, которые не являются просто трюком и не стоят значительно дороже, а вкус намного хуже\n\nНекоторое время назад я видел несколько баз для пиццы из цветной капусты в супермаркете в Дании, которые мне показались классными. Но я живу в Ирландии, и у меня просто нет шансов когда-либо увидеть какую-либо более здоровую альтернативу традиционным популярным продуктам, таким как этот пример, здесь. Я просто не понимаю, почему рафинированная мука вообще вещь, они буквально проходят через весь процесс, делая основной продукт из стольких продуктов совершенно нездоровым. Я просто нахожу сумасшедшим, что так много людей ест это, зная последствия для здоровья, связанные с этим, и для меня, по крайней мере, такой маленький компромисс - придерживаться продуктов из цельного зерна с такой большой пользой для здоровья.","title":"Почему общество так против цельного зерна?","subreddit_name_prefixed":"r/nutrition","ups":26,"created":1565998915,"link_flair_background_color":"","id":"cr84qc","author":{"name":"wakka12"},"permalink":"/r/nutrition/comments/cr84qc/why_is_society_so_against_whole_grains/","url":"https://www.reddit.com/r/nutrition/comments/cr84qc/why_is_society_so_against_whole_grains/","created_utc":1565970115}