{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Цейлонская Корица\n\nТакже называется настоящей корицей\nТакже известен как мексиканская корица, потому что Мексика является крупнейшим импортером цейлонской корицы из Шри-Ланки\nИзготовлен из тонких, хрупких слоев, свернутых в форме иглы\nИмеет мягкий, тонкий сладкий вкус с ароматным запахом\nСветло-коричневый цвет\nРассыпчатая и легко разбивается на мелкие кусочки\nМестное растение, эксклюзивное для Шри-Ланки, острова, расположенного на окраине Индии, они поставляют почти 90% всей цейлонской корицы по всему миру.\nСодержит только 0,04% кумарина\n\nКоринье Корица\n\nТакже известный как корица индонезийская кассия\nТип корицы Кассия, который можно найти в Индонезии\nНа его долю приходится 70% импорта из Северной Америки\nСодержит около 4% уровней кумарина\n\nСайгон Корица\n\nТакже известный как вьетнамская корица Кассия\nОчень острый, но более сладкий на вкус\nСодержит высокий уровень кумарина около 8%\n\n: С https://www.google.com/amp/s/www.olivenation.com/amp/different-types-of-cinnamon-powder\n\nЯ знаю, что есть разница между тремя с точки зрения лечебных / целебных свойств и теми, с которыми можно готовить, я просто не уверен, какой именно. В настоящее время я пользуюсь овсяной корицей марки Киркланд (Costco) Сайгон каждый день во время моего быстрого перерыва, хорошее количество, может быть, 2 столовые ложки, сладкое, ароматное, но чертовски вкусное, очень вкусное. Однако я не уверен, что он влияет на меня и особенно на мою печень в таком количестве каждый день, я чувствую себя хорошо. Что я не понимаю, так это\n\n«Кумарин является душистым, но токсичным веществом, которое обычно содержится в больших количествах в некоторых сортах корицы, особенно в корице Кассия»\n\nТем не менее, в нем четко говорится, что Сайгон имеет наибольшую сумму в 8%\n\nНам даже нужно беспокоиться о * кумарине *?\n\nЛюбой интеллектуал, у которого есть более высокое понимание корицы, не стесняйтесь вступать!","title":"Корица Корица Корица, давайте поговорим о (3?) Корицах и в личных целях | Обсуждение в сообществе","subreddit_name_prefixed":"r/nutrition","ups":23,"created":1571836108,"link_flair_background_color":"","id":"dluhvc","author":{"name":"HammondioliNcheeze"},"permalink":"/r/nutrition/comments/dluhvc/cinnamon_cinnamon_cinnamon_lets_talk_the_3/","url":"https://www.reddit.com/r/nutrition/comments/dluhvc/cinnamon_cinnamon_cinnamon_lets_talk_the_3/","created_utc":1571807308}