{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"Nr. 1 причиной смерти в западном мире является болезнь сердца.\n\nКрупнейшими авторитетами в области здоровья сердца в мире являются ** Европейское общество кардиологов ** и ** Американская кардиологическая ассоциация **.\n\nОни основаны на самом большом метаанализе (который я свяжу и выделю внизу), который четко демонстрирует связь между насыщенным жиром и холестерином с повышенным уровнем холестерина в сыворотке крови, и мы видим четкую связь между повышенным уровнем холестерина в сыворотке крови и артериосклерозом. Люди с определенным низким уровнем холестерина в сыворотке крови просто ** не получают ** сердечных приступов.\n\n** «Холестерин в крови в основном генетический, а диетический холестерин не повышает уровень холестерина в крови». ** Почему возникает такая путаница, когда крупнейшие специалисты в этой области говорят об обратном? Исследования, которые показывают, что употребление большего количества насыщенных жиров и холестерина не повышает уровень холестерина в сыворотке крови **, не учитывает базовые уровни холестерина в сыворотке крови **. Это означает, что люди, которые уже едят диету с большим количеством насыщенных жиров и холестерина, не получат намного более высокий уровень холестерина в сыворотке крови от употребления ** БОЛЬШЕ **. Но, скажем, у человека, который не ел много насыщенных жиров или холестерина в год, у них будет ** огромный ** всплеск уровня холестерина в сыворотке крови, если они начнут есть больше насыщенных жиров и холестерина. Отсюда и путаница, потому что у определенных актеров будет только преимущество в сомнении по теме.\n\n** «Рафинированный сахар - настоящий враг». ** Рафинированный сахар, очевидно, также вреден для здоровья. Но в западном мире почти каждый из нас выиграет от снижения уровня насыщенных жиров и холестерина в наших рационах, а также от добавления рафинированного сахара.\n\n** «Но организм использует холестерин для выработки гормонов». ** Да, но организм вырабатывает весь необходимый ему холестерин. Нет необходимости в диетическом холестерине, но в любом случае, если кто-то не станет веганом, мы получим ** немного ** диетического холестерина. Просто убедитесь, что вы уменьшаете его настолько, насколько можете.\n\nНа занятиях:\n\n[Этот мета-анализ демонстрирует связь между диетическим холестерином и повышенным уровнем холестерина в сыворотке крови, и это делается с учетом базовых уровней холестерина в сыворотке крови.] <Span translate = \"no\"> (https://citeseerx.ist. psu.edu/viewdoc/download?doi=10.1.1.549.6029&rep=rep1&type=pdf) </ SPAN>\n\nКороче говоря, это действительно доказывает, что потребление холестерина и насыщенных жиров повысит уровень холестерина в сыворотке крови.\n\n[Это ОГРОМНОЕ резюме многочисленных мета-анализов]  (https://www.ncbi.nlm.nih.gov/pubmed/28444290)  четко показывают связь между высоким уровнем холестерина в сыворотке крови и атеросклероз (болезнь сердца).\n\nКороче говоря, это действительно доказывает, что высокий уровень холестерина приводит к сердечным заболеваниям.\n\n\n\nЕсли все это не убедит вас в фактах, ничего не выйдет.","title":"Путаница вокруг насыщенных жиров и холестерина, а также факты о холестерине в сыворотке крови и здоровье сердца","subreddit_name_prefixed":"r/nutrition","ups":20,"created":1572934642,"link_flair_background_color":"","id":"drp89d","author":{"name":"Alek-Reason"},"permalink":"/r/nutrition/comments/drp89d/the_confusion_around_saturated_fat_and/","url":"https://www.reddit.com/r/nutrition/comments/drp89d/the_confusion_around_saturated_fat_and/","created_utc":1572905842}