{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"«Фармакологические и диетические вмешательства, направленные на постпрандиальную гликемию, доказали свою эффективность в снижении риска развития диабета 2 типа и его сердечно-сосудистых осложнений. Помимо состава и размера пищи, время потребления макронутриентов во время еды было недавно признано ключевым регулятором постпрандиальной гликемии. Появляются новые данные, свидетельствующие о том, что предварительное потребление неуглеводных макронутриентов (то есть «предварительных нагрузок» белков и жиров) может заметно снизить постпрандиальную гликемию, задерживая опорожнение желудка, усиливая стимулируемую глюкозой выработку инсулина и уменьшая клиренс инсулина. Такое же улучшение толерантности к глюкозе достигается за счет оптимальных сроков приема углеводов во время еды (то есть, при последнем приеме углеводов), что сводит к минимуму риск увеличения массы тела по сравнению с предварительными нагрузками питательных веществ. Масштабы эффекта снижения глюкозы в стратегиях питания, основанных на преднагрузке, выше при диабете 2 типа, чем у здоровых субъектов, они сравнимы и аддитивны с современными препаратами, снижающими уровень глюкозы, и, по-видимому, сохраняются со временем. Этот диетический подход также показал многообещающие результаты при патологических состояниях, характеризующихся постпрандиальной гипергликемией, при которых доступные фармакологические возможности ограничены или неэффективны с точки зрения затрат, таких как диабет 1 типа, гестационный диабет и нарушение толерантности к глюкозе. Следовательно, стратегии питания, основанные на преднагрузке, в отдельности или в сочетании с фармакологическим лечением, могут предложить простой, эффективный, безопасный и недорогой инструмент для профилактики и лечения постпрандиальной гипергликемии. Здесь мы рассмотрим эти новые физиологические идеи и их терапевтические последствия для пациентов с сахарным диабетом и нарушенной толерантностью к глюкозе ».\n\n\nhttps://www.frontiersin.org/articles/10.3389/fendo.2019.00144/full\n\nПоследствия последнего приема углеводов приводят к заметно более низкому пиковому отклонению уровня глюкозы и глюкозы (до 70% ниже у пациентов с СД2 и до 50% ниже у здоровых людей).\n\nПоследний рацион потребления углеводов означает, что вы едите белок (мясо / рыбу) и / или овощи на тарелке перед углеводами (рисом). Необычные результаты для такого легкого вмешательства.","title":"Влияние типа и последовательности питательных веществ на толерантность к глюкозе: физиологическое понимание и терапевтические последствия","subreddit_name_prefixed":"r/nutrition","ups":24,"created":1573991685,"link_flair_background_color":"","id":"dxhq22","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/dxhq22/impact_of_nutrient_type_and_sequence_on_glucose/","url":"https://www.reddit.com/r/nutrition/comments/dxhq22/impact_of_nutrient_type_and_sequence_on_glucose/","created_utc":1573962885}