{"subreddit":{"display_name":"nutrition"},"subreddit_loc":"питание","selftext":"* Пищевые группы и маркеры промежуточных заболеваний: систематический обзор и сетевой метаанализ рандомизированных исследований *\n\n\" АННОТАЦИЯ\n\nФон\n\nВ предыдущих мета-анализах проспективных обсервационных исследований мы исследовали связь между группами пищевых продуктов и риском хронического заболевания.\n\nЗадача\n\nЦелью настоящего сетевого метаанализа (NMA) было оценить влияние этих групп продуктов на маркеры промежуточных заболеваний в рандомизированных интервенционных испытаниях.\n\nдизайн\n\nПоиск литературы проводился до января 2018 года. Следующие критерии включения были определены априори: 1) рандомизированное исследование (продолжительность ≥4 недель), сравнивающее ≥2 следующих пищевых групп: рафинированное зерно, цельное зерно, орехи, бобовые, фрукты и овощи, яйца, молочные продукты, рыба, красное мясо и подслащенные сахаром напитки (SSB); 2) холестерин ЛПНП и триацилглицерин (ТГ) были определены как первичные результаты; общий холестерин, холестерин ЛПВП, глюкоза натощак, гликированный гемоглобин, модель гомеостаза, оценка инсулинорезистентности, систолическое и диастолическое артериальное давление и С-реактивный белок были определены как вторичные исходы. Для каждого результата выполнялась случайная NMA, а для ранжирования определялась поверхность под кумулятивными кривыми ранжирования (SUCRA).\n\nРезультаты\n\nВсего было выявлено 66 рандомизированных исследований (86 отчетов), сравнивающих 10 групп продуктов питания и включающих 3595 участников. Орехи были признаны лучшей пищевой группой по снижению холестерина ЛПНП (SUCRA: 93%), за ними следуют бобовые (85%) и цельные зерна (70%). Для снижения TG лучше всего оценивалась рыба (97%), за ней следовали орехи (78%) и красное мясо (72%). Тем не менее, эти выводы ограничены низким качеством доказательств. При объединении всех 10 результатов самые высокие значения SUCRA были обнаружены для орехов (66%), бобовых (62%) и цельного зерна (62%), тогда как SSB показали худшие результаты (29%).\n\nВывод\n\n** Настоящий NMA предоставляет доказательства того, что увеличение потребления орехов, бобовых и цельных зерен более эффективно для улучшения метаболического здоровья, чем у других групп продуктов питания **. Для достоверности взаимосвязи между диетой и болезнями важную роль могли бы сыграть качественные рандомизированные исследования, в которых основное внимание уделялось бы установленным маркерам промежуточных заболеваний. «\n\nhttps://www.ncbi.nlm.nih.gov/pmc/articles/PMC6134288/#__ffn_sectitle","title":"Мета-анализ РКИ: увеличение потребления орехов, бобовых и цельных зерен более эффективно для улучшения метаболического здоровья, чем у других групп продуктов питания.","subreddit_name_prefixed":"r/nutrition","ups":28,"created":1574775730,"link_flair_background_color":"","id":"e1tiwo","author":{"name":"Only8livesleft"},"permalink":"/r/nutrition/comments/e1tiwo/meta_analysis_of_rcts_increased_intake_of_nuts/","url":"https://www.reddit.com/r/nutrition/comments/e1tiwo/meta_analysis_of_rcts_increased_intake_of_nuts/","created_utc":1574746930}