{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Обновление - Извините за название ребята. Многие из вас упоминали, что это не новые идеи в некоторых кругах. То, что я хотел сказать, больше похоже на то, что «люди, которые боятся сингулярности ИИ, возможно, не учли».\n\n\nУ меня есть противоположная полоса, которая заставляет меня противостоять любой тенденции, с которой я сталкиваюсь, и иногда она приводит к интересным идеям. Мы все прочитали статьи «AI singularity is the boogyman», и они отражают интуитивное недоверие и страх перед инструментами, которые мы создали, чтобы привести нас в век информации.\n\nПозвольте мне потратить несколько минут вашего времени, чтобы убедить вас, что человеческий разум так же способен достичь божественного единства, как и машинный интеллект.\n\nЧего мы боимся?\n\nСценарий идет примерно так. Мы строим машину, которая может учиться. Он учится всему, что нужно знать, и достигает сверхразума. Он использует эти знания для разработки своих собственных улучшений, делая их более быстрыми и еще более интеллектуальными, что позволяет ему делать еще более сложные обновления, и так далее, и так далее, пока он не превзойдет человеческое понимание и не станет божественной силой.\n\nЯ утверждаю, что почему человечество не может делать то же самое и делать это лучше, чем любая другая машина? Я хочу взять идею превосходства машины и включить ее на ухо. Биологическая жизнь может самовоспроизводиться с использованием химической энергии. Он может самостоятельно восстанавливаться на уровне наноботов. Он может развиваться и адаптироваться к жизни практически в любых условиях, которые только можно себе представить. И это то, что даже самые глупые микробы делали в течение миллиарда лет. Биология имеет передовой опыт в области искусственного интеллекта на 3 миллиарда лет, и более триллионов отдельных организмов внесли свой вклад в поиск наилучшего способа сделать какую-либо вещь. Превращает ли эта вещь солнечный свет в сахар, или превращает сахар в энергию, или воспроизводит в максимально возможной степени, жизнь перепробовала триллион различных способов, и только способы работы были скопированы.\n\nПосмотрите на наш мозг. Они выполняют больше операций в секунду, чем самые большие суперкомпьютеры, работают на эквиваленте D-элемента и работают с минимальным тепловыделением. Человеческий разум - это уже особенность по сравнению с кремнием. Это, безусловно, самый продвинутый компьютерный дизайн в известной вселенной, и его можно взломать, чтобы улучшить. Не случайно, а благодаря направленной эволюции, гибридизации с новыми технологиями или просто изменяя наш генетический код, чтобы улучшить себя.\n\nИдея машинного интеллекта, создающего свои собственные усовершенствования, - это то, что недоступно человечеству для нашей собственной биологии. Мы упорядочили человеческий геном, и мы находимся в процессе расшифровки кода, который является основой для всех унаследованных признаков. Нам не нужно будет строить машины завтрашнего дня. Нам просто нужно изменить и внедрить новый код в существующие ДНК и РНК, и позволить магии самовоспроизводящихся клеток создать его для нас. Все мечты человечества о сверхинтеллектуальном, массово развитом машинном интеллекте, машинах с наноботами и т. Д. Уже существуют в биологии с миллиардами лет совершенствования.\n\nГде мы можем быть через 20 лет, когда мозговые интерфейсы начинают увеличивать человеческую память с помощью неограниченной цифровой памяти? Как далеко после этого мы начнем проектировать новые узлы мозга, опираясь на существующую физиологию, подобную природе, но добавляя новые специализации через комбинации биологических машин и электронных интерфейсов? Какие ограничения может содержать человеческий мозг? Куда может пойти наша биология и наше сознание, руководствуясь собственной рукой вместо случайного случая? Как мы можем развивать нашу социальную структуру, чтобы использовать наши новые дары? Улей улья, решение групповых проблем со скоростью мышления, непосредственное разделение разума между специализированными группами людей, места, куда мы можем пойти, практически безграничны.\n\nСравните это с машиной, которая сможет модернизировать себя, но у которой есть миллиарды лет на то, чтобы наверстать упущенное, прежде чем она сможет достичь того уровня, когда она сможет встроить суперкомпьютер в несколько фунтов самовосстанавливающейся нано-машины, работающей в сети, живущей клетки в мозге, с которыми мы все родились.\n\nНа самом деле я мог бы утверждать, что даже будущее машин зависит не от кремния, а от углерода, белков и ДНК. Жизнь развивалась из небытия, потому что передаются только вещи, которые работают. Если бы проталкивание электронов через полупроводники было наиболее эффективным способом думать, разве вы не думаете, что это развивалось бы таким образом? Полупроводники, конденсаторы, резисторы и т. Д. - лучший способ создать разум или просто элементарные инструменты, которыми располагает человечество 20-го века. Технический эквивалент превращения камней в примитивные ножи не потому, что они - лучшие инструменты, которые когда-либо могли быть разработаны, а потому, что они были лучшими, что мы могли сделать в то время. Я думаю, что будущее технологий будет биологическим.","title":"Вещи, которые никто не задумывался об искусственном интеллекте и человеческом интеллекте.","subreddit_name_prefixed":"r/singularity","ups":18,"created":1548118407,"link_flair_background_color":"","id":"aibz9y","author":{"name":"kodack10"},"permalink":"/r/singularity/comments/aibz9y/things_that_nobody_has_considered_about_ai_and/","url":"https://www.reddit.com/r/singularity/comments/aibz9y/things_that_nobody_has_considered_about_ai_and/","created_utc":1548089607}