{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"","title":"Почему средства массовой информации - это рак, и это замедляет ваш прогресс на пути к сингулярности","subreddit_name_prefixed":"r/singularity","ups":249,"created":1551155965,"link_flair_background_color":"","id":"auq1em","author":{"name":"swiet"},"permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/","url":"https://i.redd.it/y6f0qoqhx0h21.jpg","created_utc":1551127165,"replies":[{"ups":14,"link_id":"t3_auq1em","id":"eha5m0r","author":"SergeyLL","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"The girl on the photo used to be the chief prosecutor in the Crimea. Now she’s a senator in Russian Duma, if I am not mistaken.","body_html":"<div class = \"md\"> <p> Девушка на фотографии раньше была главным прокурором Крыма. Теперь она сенатор в российской Думе, если я не ошибаюсь. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eha5m0r/","name":"t1_eha5m0r","created":1551166188,"created_utc":1551137388,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":18,"link_id":"t3_auq1em","id":"eh9z3v1","author":"wildgurularry","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"I don't see any evidence that progress towards the singularity is being slowed.  As for climate change on the other hand...","body_html":"<div class = \"md\"> <p> Я не вижу никаких свидетельств того, что прогресс в направлении сингулярности замедляется. Что касается изменения климата с другой стороны ... </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eh9z3v1/","name":"t1_eh9z3v1","created":1551161443,"created_utc":1551132643,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":10,"link_id":"t3_auq1em","replies":[{"ups":3,"link_id":"t3_auq1em","replies":[{"ups":3,"link_id":"t3_auq1em","replies":[{"ups":1,"link_id":"t3_auq1em","id":"ehb2gkk","author":"AnimeKhadir","parent_id":"t1_ehb1u0u","subreddit_id":"t5_2qh8m","body":"I doubt it. And sure I agree that it isn't good to sort of fluff up estimates when you know it'll take longer. Bad optics. Still people forget about all of that when it actually happens. Also excitement is necessary of industry progress and public investment/interest. I understand why he does it. I'd probably do it too in his position.","body_html":"<div class = \"md\"> <p> Я сомневаюсь в этом. И конечно, я согласен с тем, что не стоит разбрасывать оценки, когда знаешь, что это займет больше времени. Плохая оптика. Тем не менее люди забывают обо всем этом, когда это действительно происходит. Также волнение необходимо для прогресса промышленности и государственных инвестиций / интереса. Я понимаю, почему он это делает. Я бы, наверное, тоже сделал это на его месте. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehb2gkk/","name":"t1_ehb2gkk","created":1551195351,"created_utc":1551166551,"subreddit_name_prefixed":"r/singularity","depth":6}],"id":"ehb0spu","author":"AnimeKhadir","parent_id":"t1_ehb0jjg","subreddit_id":"t5_2qh8m","body":"I don't care if he's keeping people excited for something that will happen soon. So long as it happens relatively soon it's all good. You speak as if it's all just bullshit when you can look up videos of Tesla cars picking up people and dropping them off then parking themselves. It's one thing to say \"Musk is optimistic af and keeps pushing the release date forward\" but it's different to just discount all of the progress and say it'll never happen. The latter is disingenuous. ","body_html":"<div class = \"md\"> <p> Мне все равно, будет ли он радовать людей тем, что скоро произойдет. Пока это происходит относительно скоро, все хорошо. Вы говорите так, будто все это чушь собачья, когда вы можете посмотреть видео о машинах Тесла, которые собирают людей и бросают их, а затем сами паркуются. Одно дело сказать: «Маск настроен оптимистично и продолжает продвигать дату релиза вперед», но это совсем другое - просто сбрасывать со счетов весь прогресс и говорить, что этого никогда не произойдет. Последнее неискренне. </Р>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehb0spu/","name":"t1_ehb0spu","created":1551192930,"created_utc":1551164130,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"ehazlg4","author":"AnimeKhadir","parent_id":"t1_ehay3qn","subreddit_id":"t5_2qh8m","body":"Full autonomy will hit cars by the end of this year. Confirmed by Elon Musk in this very recent interview--[https://www.youtube.com/watch?v=vGM341AsOTE](https://www.youtube.com/watch?v=vGM341AsOTE)\n\n&#x200B;\n\nHe owns 99% of all of the driving data and is working to create a world filled with fully autonomus, electric vehicles. He said by the end of 2020 you will be able to fall asleep at the wheel and wake up at your destination and you will be safer than you would if you were driving. People like you are worthless, irrational lazy pessimists.","body_html":"<div class = \"md\"> <p> Полная автономия ударит по автомобилям к концу этого года. Подтверждено Элоном Маском в этом недавнем интервью - <a href=\"https://www.youtube.com/watch?v=vGM341AsOTE\"> https://www.youtube.com/watch?v=vGM341AsOTE</а> </р>\n\n<Р> </р>\n\n<p> Он владеет 99% всех данных о вождении и работает над созданием мира, полностью заполненного автономными электромобилями. Он сказал, что к концу 2020 года вы сможете уснуть за рулем и проснуться в пункте назначения, и вы будете в большей безопасности, чем если бы вы ехали. Такие люди, как вы, бесполезны, иррациональны, ленивы и пессимисты. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehazlg4/","name":"t1_ehazlg4","created":1551191326,"created_utc":1551162526,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"ehagqyt","author":"Hoss-Flea","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"How about just your common closed minded idiot that doesn’t even think self driving cars will be a thing.  ","body_html":"<div class = \"md\"> <p> Как насчет вашего обычного идиота с закрытыми мыслями, который даже не думает, что самостоятельное вождение автомобиля - это вещь. </Р>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehagqyt/","name":"t1_ehagqyt","created":1551174867,"created_utc":1551146067,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":2,"link_id":"t3_auq1em","id":"ehb7etn","author":"h3xag0nSun","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Scientists*","body_html":"<div class = \"md\"> <p> Ученые * </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehb7etn/","name":"t1_ehb7etn","created":1551203554,"created_utc":1551174754,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":4,"link_id":"t3_auq1em","replies":[{"ups":1,"link_id":"t3_auq1em","replies":[{"ups":0,"link_id":"t3_auq1em","replies":[{"ups":1,"link_id":"t3_auq1em","id":"ehdj9sc","author":"DSPGerm","parent_id":"t1_ehd2ta6","subreddit_id":"t5_2qh8m","body":"Fair enough. It’s not CMV but have a fake delta and an upvote","body_html":"<div class = \"md\"> <p> Достаточно справедливо. Это не CMV, но есть фальшивая дельта и голос </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehdj9sc/","name":"t1_ehdj9sc","created":1551272387,"created_utc":1551243587,"subreddit_name_prefixed":"r/singularity","depth":6}],"id":"ehcwu9n","author":"DSPGerm","parent_id":"t1_ehcwj26","subreddit_id":"t5_2qh8m","body":"Yes, YOU would. Crossing the singularity is irreversible and there may be people out there who would rather not or at the very least have a clearer understanding of how it will affect things. ","body_html":"<div class = \"md\"> <p> Да, ВЫ. Пересечение сингулярности необратимо, и могут быть люди, которые предпочли бы не иметь или, по крайней мере, иметь более ясное понимание того, как это повлияет на вещи. </Р>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehcwu9n/","name":"t1_ehcwu9n","created":1551254319,"created_utc":1551225519,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"ehcw8l7","author":"DSPGerm","parent_id":"t1_ehcw0t4","subreddit_id":"t5_2qh8m","body":"Yes, why bother fully analyzing a situation when you can just sprint towards the unknown.","body_html":"<div class = \"md\"> <p> Да, зачем вообще анализировать ситуацию, когда вы можете просто бежать к неизвестному. </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehcw8l7/","name":"t1_ehcw8l7","created":1551253835,"created_utc":1551225035,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"ehaigmc","author":"DSPGerm","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Is slowing our progress towards singularity a bad thing? Keeping in mind that once we pass it we can’t go back, I’d think that slowing our progress would be a good thing. Or at least, a not bad thing.","body_html":"<div class = \"md\"> <p> Является ли замедление нашего продвижения к сингулярности плохой вещью? Помня о том, что, как только мы пройдем его, мы не сможем вернуться назад, я думаю, что замедление нашего прогресса было бы хорошо. Или, по крайней мере, неплохая вещь. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehaigmc/","name":"t1_ehaigmc","created":1551176143,"created_utc":1551147343,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":3,"link_id":"t3_auq1em","id":"ehajyyh","author":"[deleted]","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Uh yea but if them science boys were so smart why aren’t they famous? ","body_html":"<div class = \"md\"> <p> Да, но если эти ребята-ученые были настолько умны, почему они не знамениты? </Р>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehajyyh/","name":"t1_ehajyyh","created":1551177280,"created_utc":1551148480,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":2,"link_id":"t3_auq1em","id":"ehb0ox9","author":"RoyalDog214","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":" Natalia Poklonskaya is still hot as fuck!","body_html":"<div class = \"md\"> <p> Наталья Поклонская по-прежнему горячая, как нахуй! </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehb0ox9/","name":"t1_ehb0ox9","created":1551192785,"created_utc":1551163985,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"eha07p6","author":"Jim_Pemberton","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"I was in the middle of watching an episode and got a notification to look at this and it was worth 15/10 hits too close to home","body_html":"<div class = \"md\"> <p> Я был в середине просмотра эпизода и получил уведомление, чтобы посмотреть на него, и это стоило 15/10 хитов слишком близко к дому </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eha07p6/","name":"t1_eha07p6","created":1551162207,"created_utc":1551133407,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","replies":[{"ups":1,"link_id":"t3_auq1em","id":"ehf0loj","author":"yvessaintlamont","parent_id":"t1_ehepxg4","subreddit_id":"t5_2qh8m","body":"There might be a template for this already.  I believe celebrities who are interested in taking up the charge could model their conversations on those topics similar to how Killer Mike discusses his politics.  He uses his platform to put left-field ideas out there--typically in a blunt but headline-grabbing manner.  He makes a bold claim and then proceeds to elaborate on his opinion when someone pushes back.  Point is, provocation done right can be very useful.","body_html":"<div class = \"md\"> <p> Возможно, уже есть шаблон для этого. Я полагаю, что знаменитости, которые заинтересованы в том, чтобы взять на себя ответственность, могли бы смоделировать свои разговоры на эти темы подобно тому, как Киллер Майк обсуждает свою политику. Он использует свою платформу, чтобы выдвигать идеи левого поля - обычно тупым, но захватывающим заголовком образом. Он делает смелое заявление, а затем продолжает уточнять свое мнение, когда кто-то отталкивает. Дело в том, что провокация, сделанная правильно, может быть очень полезной. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehf0loj/","name":"t1_ehf0loj","created":1551323285,"created_utc":1551294485,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"ehakto9","author":"yvessaintlamont","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Do you think that scientists are doing everyone a disservice by not being more outsized personalities?\n\n&#x200B;\n\nI have a theory that scientists (and most experts, really) can stand toe-to-toe with other celebrities of the day if they would just win the war for people's attention.  Often I've seen the following: scientists shows up on a TV shows panel; their issue comes up (let's say climate change); the scientist goes either into doomsday mode or stat-nerd mode.  My problem with a lot of these people is not what they say to people, but how they approach the people in general.  By starting and finishing on the factual evidence, I fear scientists often don't appeal to people emotionally and they don't help their audience embrace their POV.\n\n&#x200B;\n\nI think the last scientists to be embraced by the public got pretty far by putting their explanations in laymen's terms.   I don't think that's enough going forward.  I'm not saying that the experts should abandon facts altogether.  I'm saying that I think the logical thing do in a post-reality show, post-social media era is to engage audiences in a similar fashion to the celebrities of the day.  The experts should try to being lighter with their approach to these topics and louder than their detractors.","body_html":"<div class = \"md\"> <p> Считаете ли вы, что ученые оказывают всем медвежью услугу, не будучи более крупными личностями? </p>\n\n<Р> </р>\n\n<p> У меня есть теория, что ученые (и большинство экспертов, на самом деле) могут вступить в схватку с другими знаменитостями дня, если они просто выиграют войну за внимание людей. Часто я видел следующее: ученые появляются на телевизионных панелях; возникает их проблема (скажем, изменение климата); ученый переходит либо в режим конца света, либо в режим сторожа. Моя проблема со многими из этих людей не в том, что они говорят людям, а в том, как они подходят к людям в целом. Начинаясь и заканчивая фактическими данными, я боюсь, что ученые часто не обращаются к людям эмоционально, и они не помогают своей аудитории принять их POV. </P>\n\n<Р> </р>\n\n<p> Я думаю, что последние ученые, которых привлекла публика, довольно далеко продвинулись, объяснив их мирянами. Я не думаю, что этого достаточно, чтобы идти вперед. Я не говорю, что эксперты должны полностью отказаться от фактов. Я говорю, что, по-моему, логично в эпоху пост-реалити-шоу, эпохи пост-социальных медиа, привлекать аудиторию, подобную знаменитостям того времени. Эксперты должны стараться быть более легкими в своем подходе к этим темам и громче, чем их хулители. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehakto9/","name":"t1_ehakto9","created":1551177933,"created_utc":1551149133,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehb962i","author":"johnnight","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"regular subreddit vs /r/UNBGBBIIVCHIDCTIICBG/","body_html":"<div class = \"md\"> <p> обычный subreddit против <a href=\"/r/UNBGBBIIVCHIDCTIICBG/\"> / r / UNBGBBIIVCHIDCTIICBG / </a> </p>\n</Div>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehb962i/","name":"t1_ehb962i","created":1551206691,"created_utc":1551177891,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehbbec4","author":"zesterer","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"This is a bit silly.","body_html":"<div class = \"md\"> <p> Это немного глупо. </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehbbec4/","name":"t1_ehbbec4","created":1551210214,"created_utc":1551181414,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehbte3m","author":"PoshFrosh","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"FWIW, IIRC, Kurzweil believes that nothing humans can do can either slow or speed up the rate of the path towards singularity. Some things could (e.g. an asteroid destroying all life on earth prior), but human activities (legislation, media focus, neo-luddite protests, etc.) are irrelevant because the progress of oncoming singularity is bigger than any one person/group/nation.","body_html":"<div class = \"md\"> <p> FWIW, IIRC, Курцвейл считает, что ничто из того, что люди могут сделать, не может ни замедлить, ни ускорить путь к сингулярности. Некоторые вещи могли бы (например, астероид, разрушающий всю жизнь на Земле ранее), но человеческая деятельность (законодательство, фокус СМИ, протесты нео-луддитов и т. Д.) Не имеет значения, потому что прогресс встречной сингулярности больше, чем у любого человека / группы / нации . </р>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehbte3m/","name":"t1_ehbte3m","created":1551226643,"created_utc":1551197843,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehcahp5","author":"500Rads","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Supply and demand","body_html":"<div class = \"md\"> <p> Спрос и предложение </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehcahp5/","name":"t1_ehcahp5","created":1551238532,"created_utc":1551209732,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehcd45m","author":"AMSolar","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"I don't know. Just 10 years ago almost nobody knew anything remotely close to exponential advancement, save for Moore's law. \n\nPeople talked about how government is evil, about climate change and football.\n\nNow we have waitbutwhy.com, Yuval Noah Harari, enormously grown in popularity Elon Musk (as opposed to another celebrity) and wildly popular Tim Ferris podcast.\n\nNow people talk about self-driving cars, electric cars, neural networks and quantum computers. Even mass media!\nThey still talk about football and there's a very visible polarity between right and left, but I believe eventually people who actually read and think largely avoid left/right bias pitfalls. \nAnd we have growing number of people who think and aware.\n\nI actually think there was a tremendous shift in public awareness about exponential progress.","body_html":"<div class = \"md\"> <p> Я не знаю. Всего 10 лет назад почти никто не знал ничего, что было бы близко к экспоненциальному прогрессу, кроме закона Мура. </Р>\n\n<p> Люди говорили о том, как правительство зло, об изменении климата и футболе. </p>\n\n<p> Теперь у нас есть waitbutwhy.com, Yuval Noah Harari, чрезвычайно популярный Элон Маск (в отличие от другой знаменитости) и дико популярный подкаст Тима Ферриса. </p>\n\n<p> Сейчас люди говорят о машинах с автоматическим управлением, электромобилях, нейронных сетях и квантовых компьютерах Даже СМИ!\nОни по-прежнему говорят о футболе, и между правым и левым есть очень заметная полярность, но я полагаю, что в конечном итоге люди, которые на самом деле читают и думают, в основном избегают ошибок, связанных с левым / правым смещением.\nИ у нас растет число людей, которые думают и осознают. </P>\n\n<p> Я действительно думаю, что в общественном сознании произошел огромный сдвиг в экспоненциальном прогрессе. </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehcd45m/","name":"t1_ehcd45m","created":1551240308,"created_utc":1551211508,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehd02k1","author":"mastertheillusion","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Mass media loves drama and idiots drive traffic to them.","body_html":"<div class = \"md\"> <p> СМИ любят драму, и идиоты привлекают к ним трафик. </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehd02k1/","name":"t1_ehd02k1","created":1551256916,"created_utc":1551228116,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_auq1em","id":"ehgk3sc","author":"harbifm0713","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"Most celebrities are dump as fuck and should not have microphone in front of them to speak of politics, science or anything of value, beside about acting or signing or making sex movies. That is true 99.99% of the time","body_html":"<div class = \"md\"> <p> Большинство знаменитостей просто обалденные и не должны иметь перед собой микрофон, чтобы говорить о политике, науке или чем-то ценном, кроме того, чтобы играть, подписывать или снимать сексуальные фильмы. Это правда, 99,99% времени </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/ehgk3sc/","name":"t1_ehgk3sc","created":1551366298,"created_utc":1551337498,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":0,"link_id":"t3_auq1em","replies":[{"ups":1,"link_id":"t3_auq1em","replies":[{"ups":2,"link_id":"t3_auq1em","id":"eherd7e","author":"boytjie","parent_id":"t1_ehal0un","subreddit_id":"t5_2qh8m","body":"> But if a celebrity suddenly started making passing references to the singularity\n\nThe thing is that celebrities are often not drooling dickholes. Some of them are distinctly non shabby about being informed. However, their career and livelihood depend on them being vacuous bubbleheads, so that’s the role they play.","body_html":"<div class = \"md\"> <blockquote>\n<p> Но если знаменитость вдруг начала делать мимолетные ссылки на сингулярность </p>\n</BLOCKQUOTE>\n\n<p> Дело в том, что знаменитости часто не пускают слюни в грудь. Некоторые из них явно не потрёпаны быть информированными. Однако их карьера и средства к существованию зависят от того, являются ли они пустыми головами, так что именно эту роль они играют. </P>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eherd7e/","name":"t1_eherd7e","created":1551317645,"created_utc":1551288845,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"eha0tf3","author":"CultistHeadpiece","parent_id":"t1_eh9znvg","subreddit_id":"t5_2qh8m","body":"it has nothing to do with singularity","body_html":"<div class = \"md\"> <p> это не имеет ничего общего с сингулярностью </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eha0tf3/","name":"t1_eha0tf3","created":1551162636,"created_utc":1551133836,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":-3,"link_id":"t3_auq1em","id":"eha97n8","author":"ytman","parent_id":"t1_eh9znvg","subreddit_id":"t5_2qh8m","body":"Or you get Elon Musk and pedophilia-accusatory tweets all set to the tune of unnecessary publicity stunts around life and death matters.","body_html":"<div class = \"md\"> <p> Или вы получаете Элон Маск и обвиняющие в педофилии твиты, настроенные на мелодию ненужных рекламных трюков, касающихся жизни и смерти. </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eha97n8/","name":"t1_eha97n8","created":1551169027,"created_utc":1551140227,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"eh9xc77","author":"CultistHeadpiece","parent_id":"t3_auq1em","subreddit_id":"t5_2qh8m","body":"what do you mean","body_html":"<div class = \"md\"> <p> что вы имеете в виду </p>\n</DIV>","permalink":"/r/singularity/comments/auq1em/why_massmedia_is_cancer_and_it_slows_down_our/eh9xc77/","name":"t1_eh9xc77","created":1551160253,"created_utc":1551131453,"subreddit_name_prefixed":"r/singularity","depth":0}]}