{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"В физике мы говорим, что наши законы физики нарушаются в экстремальной гравитации черной дыры. Черная дыра - это особенность.\n\nПодобно тому, как законы физики разрушаются в экстремальных условиях черной дыры, в технологической особенности наши законы, теории и модели того, как человеческое общество может разрушиться.\n\nЯ считаю, что это то, что происходит сейчас. Одна из наших старейших и наиболее важных теорий - Закон Сэя, также называемый Законом Рынков.\n\nВо времена Сэя люди иногда утверждали, что для сохранения рабочих мест следует подавлять новые технологии, способствующие сокращению трудовых ресурсов, или же для создания рабочих мест следует использовать заведомо неэффективное производство.\n\nСэй сказал, что рынок автоматически создаст рабочие места. Его ключевая идея заключается в том, что капиталист не будет сидеть на своих сбережениях. Капиталист всегда найдет выгодные способы инвестирования. Сидеть на своих сбережениях и отказываться от возможности получать проценты или прибыль было бы нерационально.\n\nОколо двадцати лет спустя Сэй вернулся и издал то, что я люблю называть «Предостережение Сэя». Он сказал, что его закон будет работать только до тех пор, пока капиталист сможет найти выгодные инвестиции.\n\nМногие экономисты отвергли это предупреждение, но другие разработали варианты этой идеи. Маркс сказал, что монополистический капитализм будет накапливать сбережения до тех пор, пока прибыль и проценты не будут сведены к нулю, что приведет к массовой безработице и кризису капитализма. Он думал, что это приведет к революции.\n\nВеликая депрессия видела что-то подобное. Кейнс и другие экономисты настаивали на дефиците, чтобы поглотить избыточные сбережения. В настоящее время многие экономисты пишут, что процентные ставки по безопасным инвестициям близки к нижней границе, то есть к нулю. Все эти идеи являются вариациями Сэй Савит к Сэй Закон.\n\nКакое это имеет отношение к технологической сингулярности и ускорению технического прогресса? Я полагаю, что сейчас мы вступаем в эпоху, когда технический прогресс настолько быстр, что крупные инвестиции, которые могут поглотить сбережения человечества, не будут сделаны, потому что они не смогут вернуть инвестиции и получить прибыль до технического прогресса. делает инвестиции устаревшими. Это может сделать закон Сэя устаревшим.\n\nПитер Тиль в последние несколько лет говорил, что технологический прогресс замедляется, потому что технологические компании используют свои деньги, а не вкладывают их. Я предполагаю, что происходит обратное. Не медленный технический прогресс сдерживает инвестиции, а быстрый прогресс.\n\nЛампочки служат примером того, как быстрый прогресс может препятствовать крупным инвестициям. Они сказали нам, что мы должны потратить двадцать долларов на более энергоэффективные лампочки. Они прослужат много лет, а сэкономленное электричество заплатит за дорогие лампы. Но цены на лампы быстро падали, поэтому экономическим решением было продолжать использовать менее эффективные лампы накаливания и ждать, пока цена эффективных ламп снизится. Недавно я увидел, что светодиодные лампочки продаются за пару долларов за штуку. Поэтому я купил кучу. Меня все-таки ужалило, потому что вскоре после этого я обнаружил, что энергетическая компания хочет бесплатно дать мне лампочки.\n\nЭто сравнительно небольшой пример, но рассмотрим ваш дом, машину и компьютер. Все это важно для вас, но вы, вероятно, потратили гораздо больше на свой дом, гораздо меньше на машину и гораздо меньше на свой компьютер. Основная причина этого заключается в том, что технология домов меняется очень медленно, автомобили гораздо быстрее, а компьютеры - еще быстрее. Мы не вкладываем значительные средства в быстро меняющиеся технологии.\n\nТаким образом, закон Сая, идея, которая имела огромное влияние в течение последних двух веков, может быть устаревшей. Результатом стала пара десятилетий почти нулевых процентных ставок, медленного экономического роста и массовой безработицы.\n\nНам придется приспосабливаться к новому быстрому прогрессу и менять нашу политику, чтобы приспособиться к изменениям, но по мере того, как мы это делаем, технология будет продолжать ускоряться, что потребует от нас, чтобы приспособиться к изменениям с еще более быстрой скоростью. Добро пожаловать в сингулярность.\n\nКак сказала Бетти Дэвис в фильме: «Пристегни ремни, это будет неровная ночь».\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","title":"Подрывает ли ускорение технологический прогресс закон Сэя? Сингулярность подходит.","subreddit_name_prefixed":"r/singularity","ups":14,"created":1553860170,"link_flair_background_color":"","id":"b6slph","author":{"name":"richleebruce"},"permalink":"/r/singularity/comments/b6slph/is_accelerating_technological_progress_undermine/","url":"https://www.reddit.com/r/singularity/comments/b6slph/is_accelerating_technological_progress_undermine/","created_utc":1553831370}