{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Ключевой идеей в теории технологической сингулярности является то, что прогресс имеет тенденцию ускоряться. Но некоторые знающие люди говорят, что это замедляется. Видный среди них известный технологический инвестор Питер Тиль. Один из его аргументов заключается в том, что тот факт, что многие технологические гиганты сидят на огромных деньгах вместо того, чтобы вкладывать их в технологии, показывает, что прогресс замедляется.\n\nЯ считаю, что дело обстоит иначе. Поскольку технологический прогресс ускоряется, инвесторы неохотно делают крупные инвестиции, которые потребовали бы много времени, чтобы окупить первоначальные инвестиции и получить прибыль, потому что ускоряющаяся скорость технического прогресса очень вероятно сделает их инвестиции устаревшими прежде, чем они смогут получить прибыль. Таким образом, наличные горы являются отражением быстрого прогресса, а не признаком того, что прогресс остановился.\n\nНесколько примеров могут иллюстрировать реальную важность этой проблемы. Мы часто читаем, что ветер, солнечная энергия или другие возобновляемые источники энергии конкурируют с ископаемым топливом. Эти возобновляемые источники энергии, однако, требуют больших первоначальных инвестиций, а затем вырабатывают электроэнергию в течение длительного времени при небольших затратах. Им придется работать долго, чтобы вернуть свои инвестиции. Трудность заключается в том, что они продолжают прогрессировать, все больше и больше электроэнергии производится с меньшими затратами. Так почему бы не подождать, пока цена не упадет дальше. Помимо этого, существует так много технологий, которые быстро совершенствуются, поэтому инвестору приходится задумываться, какая из них станет победителем. Столь быстрый прогресс во многих технологиях может побудить компании не инвестировать, а вместо этого сидеть на своих деньгах.\n\nАналогичным образом, в течение последних нескольких десятилетий мы перешли на более энергоэффективные лампочки. Нам всегда говорят, что в течение своей долгой жизни лампы будут экономить гораздо больше, чем их цена в более низких счетах за электричество. Проблема заключалась в том, что, поскольку цена на лампочки быстро падает, наиболее экономичным решением часто является продолжение использования неэффективных ламп накаливания, в то время как вы ожидаете дальнейшего снижения цены. Если цена падает на пятьдесят процентов каждые два года, вам нужно вернуть пятьдесят процентов стоимости лампы за два года, или имеет экономический смысл ждать. В конце концов, цена падает до такой степени, что вы и можете быстро окупить инвестиции, но к этому времени луковицы становятся настолько дешевыми, что они не стоят дорого и, следовательно, не поглощают много в плане экономии.\n\nЧтобы по-настоящему привнести этот дом, рассмотрим три самые важные вещи в вашей жизни: ваш дом, ваш автомобиль и ваш компьютер. В большинстве случаев ваш дом, безусловно, самый дорогой, затем автомобиль, а компьютер гораздо дешевле. Одна из причин этого заключается в том, что технология домов меняется медленно, технологии автомобилей меняются быстрее, а компьютерные технологии еще быстрее.\n\nСтоль быстрый технический прогресс может и часто уменьшает возможности для инвестиций. Тот факт, что у наших технологических компаний есть куча денег и в целом процентные ставки в течение нескольких десятилетий были низкими, может отражать скорее технический прогресс, чем замедление, как утверждал Питер Тиль.\n\nЭто не может быть приятным сообщением для инвесторов, таких как Питер Тиль. Мы обычно думаем о быстром прогрессе, уменьшающем потребность в работниках, но это может фактически уменьшить потребность в капитале, деньгах, которые можно инвестировать. Поэтому инвесторы могут быть не такими важными, как в прошлом.","title":"Питер Тиль говорит, что тот факт, что технологические компании сидят за наличными, показывает, что технический прогресс замедляется, но может быть и обратное.","subreddit_name_prefixed":"r/singularity","ups":56,"created":1555642775,"link_flair_background_color":"","id":"bepbvd","author":{"name":"richleebruce"},"permalink":"/r/singularity/comments/bepbvd/peter_thiel_says_that_the_fact_that_tech/","url":"https://www.reddit.com/r/singularity/comments/bepbvd/peter_thiel_says_that_the_fact_that_tech/","created_utc":1555613975}