{"subreddit":{"display_name":"singularity"},"subreddit_loc":"singularity","selftext":"","title":"Here's 1 byte (yes, just a byte) of RAM from 1946","subreddit_name_prefixed":"r/singularity","ups":286,"created":1559736573,"link_flair_background_color":"","id":"bwyd8z","author":{"name":"Yuli-Ban"},"permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/","url":"http://i.imgur.com/qIUb1.jpg","created_utc":1559707773,"replies":[{"ups":44,"link_id":"t3_bwyd8z","id":"eq1g66o","author":"Yuli-Ban","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"To put it into perspective, you can currently buy a wristwatch that has billions of times more RAM right now.\n\nLast year, [Michigan scientists created a *literal speck of dust* that has at least a million times more RAM](https://www.geek.com/tech/is-the-worlds-smallest-computer-really-a-computer-1744190/) (though the specifics have never been released).","body_html":"<div class=\"md\"><p> Для сравнения, вы можете купить наручные часы, которые имеют оперативную память в миллиарды раз больше. </p><p> В прошлом году <a href=\"https://www.geek.com/tech/is-the-worlds-smallest-computer-really-a-computer-1744190/\">ученые из Мичигана создали <em>буквально пылинку, объем</em> оперативной памяти которой, по крайней мере, в миллион раз больше</a> (хотя подробности так и не были опубликованы). </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq1g66o/","name":"t1_eq1g66o","created":1559737406,"created_utc":1559708606,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":13,"link_id":"t3_bwyd8z","replies":[{"ups":3,"link_id":"t3_bwyd8z","id":"eq3ps7m","author":"Yuli-Ban","parent_id":"t1_eq2z6gv","subreddit_id":"t5_2qh8m","body":"> but actually running it in a computer is a bit more difficult.\n\n#***FUCK***\n\nNo pun intended.","body_html":"<div class=\"md\"><blockquote><p> но на самом деле запустить его на компьютере немного сложнее. </p></blockquote><h1> <strong><em>БЛЯДЬ</em></strong> </h1><p> Не каламбур предназначен. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq3ps7m/","name":"t1_eq3ps7m","created":1559789447,"created_utc":1559760647,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"eq1s1gg","author":"Joshchamp","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"I don't understand why it took this big a piece of machinery to store one byte? Couldn't one byte be stored on like... anything? Is the bulk from it all from the reading/writing the byte rather than storing it? That's the only thing that makes sense to me.","body_html":"<div class=\"md\"><p> Я не понимаю, почему для хранения одного байта понадобился такой большой кусок техники? Разве один байт не может храниться как ... что-нибудь? Является ли основная часть всего этого чтением / записью байта, а не его хранением? Это единственное, что имеет смысл для меня. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq1s1gg/","name":"t1_eq1s1gg","created":1559746423,"created_utc":1559717623,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":8,"link_id":"t3_bwyd8z","id":"eq2x9it","author":"Thinktankjf","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"SPOCK: Captain, I must have some platinum. A small block would be sufficient, five or six pounds. By passing certain circuits through there to be used as a duodynetic field core...\n\n\nKIRK: Mister Spock, I've brought you some assorted vegetables, baloney in a hard roll for myself, and I've spent the other nine tenths of our combined salaries for the last three days on filling this order for you. Mister Spock, this bag does not contain platinum, silver or gold, nor is it likely to in the near future. \n\n\nSPOCK: Captain, you're asking me to work with equipment which hardly very far ahead of stone knives and bearskins.\n\n \nKIRK: McCoy'll be along in a few days, perhaps sooner. There's no guarantee that these currents in time will bring us together. This has to work. \n\n\nSPOCK: Captain. Captain, in three weeks at this rate, possibly a month, I might reach the first mnemonic memory circuits. \n(There's a knock at the door.) \n\n\nKIRK: Your hat. \n\n\nEDITH: If you can leave immediately, I can get you five hours work at twenty two cents an hour. What? What on Earth is that? \n\n\nSPOCK: I am endeavouring, ma'am, to construct a mnemonic memory circuit using stone knives and bearskins.","body_html":"<div class=\"md\"><p> СПОК: Капитан, мне нужно немного платины. Небольшой блок будет достаточно, пять или шесть фунтов. Проходя через определенные контуры, они будут использоваться как ядро дуодинетического поля ... </p><p> КИРК: Мистер Спок, я принес вам несколько разных овощей, взбитые с трудом рулетики для себя, и я потратил остальные девять десятых наших комбинированных зарплат за последние три дня, выполняя этот заказ для вас. Мистер Спок, эта сумка не содержит платины, серебра или золота, и вряд ли она появится в ближайшем будущем. </p><p> СПОК: Капитан, вы просите меня поработать с техникой, которая едва ли намного опережает каменные ножи и медвежьи шкуры. </p><p> Кирк: Маккой будет через несколько дней, возможно, раньше. Там нет никакой гарантии, что эти потоки во времени соберут нас вместе. Это должно работать. </p><p> СПОК: Капитан. Капитан, через три недели с такой скоростью, возможно, месяц, я мог бы достичь первых мнемонических схем памяти. (Стук в дверь.) </p><p> Кирк: Ваша шляпа. </p><p> ЭДИТ: Если ты можешь уйти немедленно, я могу заставить тебя работать пять часов по двадцать два цента в час. Какая? Что на земле это? </p><p> СПОК: Я стараюсь, мэм, построить мнемоническую схему памяти, используя каменные ножи и медвежьи шкуры. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq2x9it/","name":"t1_eq2x9it","created":1559774515,"created_utc":1559745715,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":5,"link_id":"t3_bwyd8z","id":"eq2k9i9","author":"[deleted]","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"Moore’s Law","body_html":"<div class=\"md\"><p> Закон Мура </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq2k9i9/","name":"t1_eq2k9i9","created":1559767674,"created_utc":1559738874,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":8,"link_id":"t3_bwyd8z","id":"eq328fe","author":"dgendreau","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"I've always thought it would be cool to have an exhibit called \"The Powers of 2\" that organizes and displays collections of either photos or physical computer history artifacts organized to give a better understanding of the rate of technological progress in the computer industry over time.\n\nImagine a timeline that shows various storage media, their data density and average cost per byte at the time.\n\nFor less technical people, help them understand the relative scale of data. How big is a kilo / mega / giga / tera / peta / exa byte and rank the average text message, email, gif, photo, book, CDROM song, MP3 song, SD movie, HD movie, 4K movie etc on that scale. How has the library of congress and the sum total of human knowledge expanded over the years in term of exabytes+ of data?\n\nOr a timeline that ranks the density and processing speed of computers starting with the Jacquard Loom to the first analog and vacuum tube computers, the apple 2, the PC, the Cray supercomputer all the way to the latest processors, GPUs and modern supercomputers.\n\nHow much did the average personal computer cost in 1980, 1985, 1990, 1995, 2000 etc and what were their capabilities at that cost.","body_html":"<div class=\"md\"><p> Я всегда думал, что было бы здорово иметь выставку под названием «Силы 2», которая организует и отображает коллекции фотографий или артефактов физической истории компьютеров, организованных для лучшего понимания темпов технического прогресса в компьютерной индустрии по сравнению с время. </p><p> Представьте себе временную шкалу, которая показывает различные носители данных, их плотность данных и среднюю стоимость за байт в данный момент. </p><p> Для менее технических людей, помогите им понять относительный масштаб данных. Насколько велик килобайт / мега / гига / тера / пета / exa байт и оцените среднее текстовое сообщение, электронную почту, gif, фотографию, книгу, песню CDROM, песню MP3, фильм SD, фильм HD, фильм 4K и т. Д. В этом масштабе. Как расширилась библиотека конгрессов и общее количество человеческих знаний за годы в пересчете на данные? </p><p> Или график времени, который сравнивает плотность и скорость обработки компьютеров, начиная с Jacquard Loom, с первыми аналоговыми и вакуумными ламповыми компьютерами, яблоком 2, ПК, суперкомпьютером Cray и вплоть до новейших процессоров, графических процессоров и современных суперкомпьютеров. </p><p> Сколько в среднем стоил персональный компьютер в 1980, 1985, 1990, 1995, 2000 годах и т. Д. И каковы были его возможности при такой стоимости. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq328fe/","name":"t1_eq328fe","created":1559777112,"created_utc":1559748312,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":4,"link_id":"t3_bwyd8z","id":"eq3y2e7","author":"Solensia","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"Here's a [trillion bytes](https://www.theinquirer.net/w-images/03acbef6-ba10-43a1-b77c-29b4dd50e4a9/2/Micron1TBphone-580x358.jpg) today. And to really blow your mind, you need to realise just [how big a trillion is](https://www.labnol.org/internet/visualize-numbers-how-big-is-trillion-dollars/7814/).","body_html":"<div class=\"md\"><p> Вот <a href=\"https://www.theinquirer.net/w-images/03acbef6-ba10-43a1-b77c-29b4dd50e4a9/2/Micron1TBphone-580x358.jpg\">триллион байтов</a> сегодня. И чтобы по-настоящему взорвать вас, вы должны понять, <a href=\"https://www.labnol.org/internet/visualize-numbers-how-big-is-trillion-dollars/7814/\">насколько велик триллион</a> . </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq3y2e7/","name":"t1_eq3y2e7","created":1559794047,"created_utc":1559765247,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":3,"link_id":"t3_bwyd8z","id":"eq2zoi0","author":"mastertheillusion","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"2019: Time crystals, Optical computers,  the birth of teleportation,  and robots are doing gymnastics and speaking in complex witty ways.","body_html":"<div class=\"md\"><p> 2019: Кристаллы времени, Оптические компьютеры, рождение телепортации и роботы занимаются гимнастикой и говорят остроумно. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq2zoi0/","name":"t1_eq2zoi0","created":1559775804,"created_utc":1559747004,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":3,"link_id":"t3_bwyd8z","id":"eq3028a","author":"Yuli-Ban","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"/u/Dr_Lord_Platypus wrote: \n\n> I spent a summer working on a virtual reality simulation of the ENIAC for an REU. That looks like a decade counter from one of ENIAC's accumulators. Ten of those would be used in an accumulator to store a 10 digit signed number. The decade counters were connected such that each one represented one order of magnitude. Addition was done by counting electrical pulses sent to the accumulator. The 1's place decade would increment by 1 for each pulse until it hit 10 pulses, it would then send a pulse to the 10's place decade counter and reset itself.\n> \n> I'm not sure you can really describe a decade counter as a byte of memory. Its not randomly accessible, and it does just as much computation and is does storage. Its an entirely different computer architecture than we use today!\n> \n> You can find some more info about how the ENIAC functioned here: http://www.inf.fu-berlin.de/lehre/SS01/hc/eniac/","body_html":"<div class=\"md\"><p> <a href=\"/u/Dr_Lord_Platypus\">/ u / Dr_Lord_Platypus</a> пишет: </p><blockquote><p> Я провел лето, работая над симуляцией виртуальной реальности ENIAC для REU. Это похоже на счетчик десятилетий от одного из аккумуляторов ENIAC. Десять из них будут использоваться в аккумуляторе для хранения 10-значного числа со знаком. Счетчики декады были связаны так, что каждый из них представлял один порядок величины. Дополнение было сделано путем подсчета электрических импульсов, посылаемых в аккумулятор. Десятичное место места 1 будет увеличиваться на 1 для каждого импульса, пока оно не достигнет 10 импульсов, затем оно отправит импульс на счетчик десятичного числа места и сбросит себя. </p><p> Я не уверен, что вы действительно можете описать счетчик десятилетий как байт памяти. Он не доступен случайным образом, он выполняет столько же вычислений, сколько и хранит. Это совершенно другая компьютерная архитектура, чем мы используем сегодня! </p><p> Вы можете найти больше информации о том, как функционировал ENIAC здесь: <a href=\"http://www.inf.fu-berlin.de/lehre/SS01/hc/eniac/\">http://www.inf.fu-berlin.de/lehre/SS01/hc/eniac/</a> </p></blockquote></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq3028a/","name":"t1_eq3028a","created":1559776001,"created_utc":1559747201,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_bwyd8z","id":"eq4pjcp","author":"dgillz","parent_id":"t3_bwyd8z","subreddit_id":"t5_2qh8m","body":"Is there a website where stuff like this is actively traded?  I would love to have a couple of things like this as conversation pieces for my home office.","body_html":"<div class=\"md\"><p> Есть ли сайт, где такие вещи активно продаются? Я хотел бы иметь пару вещей как это как части разговора для моего домашнего офиса. </p></div>","permalink":"/r/singularity/comments/bwyd8z/heres_1_byte_yes_just_a_byte_of_ram_from_1946/eq4pjcp/","name":"t1_eq4pjcp","created":1559811201,"created_utc":1559782401,"subreddit_name_prefixed":"r/singularity","depth":0}]}