{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Это слишком долго, чтобы поместиться в текстовое поле submissioms, поэтому я буду вставлять его как комментарий / ветку по мере необходимости.\n\nПросто предупреждение, эта концепция опирается на глубокое, но гибкое знание наших текущих биотехнологий. Если вы ничего не знаете, это правдоподобно. Если вы знаете немного, это невозможно. Если вы много знаете, это «детали должны работать, но это не самая глупая вещь, которую я когда-либо слышал».\n\nДля меня (доктор философии был за разработку технологии биоинженерии, но катагоризирован в другой области), здесь нет ничего невероятного, кроме времени, которое требуется. Это может быть ускорено с помощью сотовых автоматических элементов ответа, но это достаточно запутанно, как есть. Я могу объяснить более глубокие механизмы для устранения недостатков здесь позже.\n\nПредположения:\n\n\n* Сознание и память получаются из дендритных соединений конкретной организации и связанных с ними исходящих / входящих реакций деполяризации, которые они инициируют. Я рассмотрел другие неэлектрохимические возможности и у меня есть ответы, но они выходят за рамки этого.\n\n\n* Состояние нейрона - это функция состояния, не зависящая от маршрутизации активирующего сигнала или предшествующих сигнальных событий (вероятно, самая большая слабость этой концепции. У меня есть идеи, как ее решить, но это также выходит за рамки этой области)\n\n* Нейротрансмиттерная сигнализация и связанные с ней клеточные электрохимические реакции являются единственным механизмом, ответственным за сознание, а гормональная / паракринная сигнализация и т. Д. Являются только модификаторами, а не фундаментальными компонентами и могут игнорироваться для базовой оцифрованной функциональности.\n\n* Однажды мы овладеем переносом генов, и белковая инженерия таким образом сможет произвольно и безвредно доставить ДНК произвольной длины и сложности, кодирующую белки с произвольной, но правдоподобной функцией. Предлагаемая искусственная ДНК больше похожа на хромосому, чем на плазмиду.\n\n* Это, конечно, замусорено техническими проблемами. Это должно быть концептуально, но правдоподобно для известной биологии. Вероятно, есть много способов повысить эффективность, это всего лишь первый проход, игнорирующий время (безусловно, больше, чем человеческая жизнь) и сложность.\n\n* Вещи *, выделенные курсивом *, - это возможности ближайшего будущего, поскольку в концепции есть подтверждение концепции, и люди сегодня работают над соответствующими технологиями. Вещи **, выделенные жирным шрифтом ** правдоподобны, но технологии сегодня не существует. Все остальное возможно с сегодняшней технологией или незначительными модификациями.\n\nРЕДАКТИРОВАТЬ: (Я частично отказался от схемы, выделенной жирным шрифтом / курсивом, возможно, редактировать поздно. Текст, который был изменен, является точным. Вещи, не измененные, не имеют обозначения, используйте ваши знания для интерпретации. Я могу включить эти обозначения позже для своих собственных целей, но это верно, пока присутствует эта правка.)\n\nДля большинства целей «индуцируемый лекарством» и «оптогенетически контролируемый», где это уместно, заменяемы, я переключал методы частично. Оптогенетика, вероятно, более реалистична и гораздо более совместима во времени. Я предполагаю довольно жесткий контроль на чувствительность к длине волны.","title":"Мой биологически вероятный метод для загрузки мыслей с непрерывностью сознания","subreddit_name_prefixed":"r/singularity","ups":15,"created":1560084126,"link_flair_background_color":"","id":"bygoz2","author":{"name":"VirusesAreFriends"},"permalink":"/r/singularity/comments/bygoz2/my_biologically_plausible_method_for_mind/","url":"https://www.reddit.com/r/singularity/comments/bygoz2/my_biologically_plausible_method_for_mind/","created_utc":1560055326}