{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Здравствуйте все,\n\nМы команда исследователей из области права, политики и компьютерных наук. В настоящее время мы изучаем последствия внедрения искусственного интеллекта (ИИ) в общество. Началось активное обсуждение того, какие виды юридической ответственности должны нести AI и роботы. Тем не менее, в этой дискуссии до сих пор в основном участвовали исследователи и политики, и мы хотим понять мысли населения по этому вопросу. Наша правовая система создана для людей и людей, и без публичных консультаций закон может пропустить критическое предвидение.\n\nВ 2017 году Европейский парламент предложил принять «электронную личность» ([http://www.europarl.europa.eu/doceo/document/A-8-2017-0005\\_EN.html?redirect]<span translate нет = \"нет\"> (http://www.europarl.europa.eu/doceo/document/A-8-2017-0005_EN.html?redirect) </ SPAN>).\n\n* «Создание особого правового статуса для роботов в долгосрочной перспективе, чтобы, по крайней мере, самые сложные автономные роботы могли быть признаны имеющими статус электронных лиц, ответственных за нанесение ущерба, который они могут причинить, и, возможно, применение электронной личности в случаях когда роботы принимают самостоятельные решения или иным образом взаимодействуют с третьими сторонами самостоятельно; »*\n\nЭто предложение было быстро отозвано после обратной реакции со стороны экспертов ИИ и робототехники, которые подписали открытое письмо ([http://www.robotics-openletter.eu/] (http: // www. robotics-openletter.eu /) ) против идеи. Мы только в начале дискуссии об этой сложной проблеме, которая у нас есть в будущем.\n\nНекоторые ученые утверждают, что ИИ и роботы являются не чем иным, как простыми устройствами, созданными для выполнения задач для людей, и, следовательно, им не следует уделять никакого морального внимания. Некоторые утверждают, что роботы и автономные агенты могут стать щитами ответственности человека. С другой стороны, некоторые исследователи полагают, что, поскольку мы разрабатываем системы, которые являются автономными, обладают чувством сознания или любым видом свободной воли, мы обязаны предоставить права этим субъектам.\n\nДля изучения мнения населения по этому вопросу мы создаем эту ветку. Мы хотим знать, что вы думаете о проблеме. Как мы должны относиться к искусственному интеллекту и роботам на законных основаниях? Если робот автономен, должен ли он нести ответственность за свои ошибки? Как вы думаете, что будущее имеет для людей и ИИ? ** Должны ли ИИ и роботы иметь права? ** Мы надеемся, что вы поможете нам понять, что вы думаете об этой проблеме!\n\nДля некоторых ссылок по этой теме, мы добавим некоторые бумажные резюме, как поддерживающие, так и против ИИ и робота, правосубъектность и права, в разделе комментариев ниже:\n\n* ван Гендерен, Роберт ван ден Ховен. «Нужны ли нам новые юридические лица в эпоху роботов и искусственного интеллекта?». Робототехника, AI и будущее права. Springer, Сингапур, 2018. 15-55.\n* Gunkel, David J. «Другой вопрос: могут ли роботы иметь права?» Этика и информационные технологии 20,2 (2018): 87-99.\n* Брайсон, Джоанна Дж., Михайлис Э. Диамантис и Томас Д. Грант. «Для, и для людей: юридическая лакуна синтетических лиц». Искусственный интеллект и право 25.3 (2017): 273-291.\n* Брайсон, Джоанна Дж. «Роботы должны быть рабами». Тесное взаимодействие с искусственными компаньонами: ключевые социальные, психологические, этические и дизайнерские проблемы (2010): 63-74.\n\n\\ --------------------------\n\nОтказ от ответственности: Все комментарии в этой теме будут использоваться исключительно в исследовательских целях. Мы не будем делиться никакими именами или именами пользователей, сообщая о наших выводах. По любым вопросам или комментариям, пожалуйста, не стесняйтесь обращаться к нам через [kaist.ds@gmail.com]  (mailto: kaist.ds@gmail.com) .\n\nhttps://reddit.com/link/cfneo3/video/2ffcf41cahb31/player","title":"Должны ли роботы и AI иметь юридическое лицо?","subreddit_name_prefixed":"r/singularity","ups":15,"created":1563667367,"link_flair_background_color":"","id":"cfneo3","author":{"name":"IBSDSCIG"},"permalink":"/r/singularity/comments/cfneo3/should_robots_and_ais_have_legal_personhood/","url":"https://www.reddit.com/r/singularity/comments/cfneo3/should_robots_and_ais_have_legal_personhood/","created_utc":1563638567}