{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Я пишу это, поскольку я видел несколько всплывающих тем, связанных с вышеупомянутыми темами. Особенно с вопросами о Курцвейле и его мыслях на эти темы. Кажется, что некоторые из тех, кто отвечает, возможно, на самом деле не имели возможности сесть с его книгами - но у меня есть.\n\n\n\nКроме того, некоторые из отвечающих людей отвечают с ответами, которые я считаю менее чем достаточными.\n\n\n\nВо-первых, люди, которые читают о квантовых вычислениях, как правило, немного отстают от своих расчетов и чувств к технологии. «Это специализированная технология, которая неосуществима для дома и не практична». Это, по сути, наиболее распространенная точка зрения людей в отношении квантовых вычислений.\n\n\n\nКогда количество компьютеров Quantum превысит 1000 и более 2000 кубитов, технология квантовых вычислений станет предпочтительным методом вычислений для многих компьютерных ученых и физиков. Как только это произойдет (и это не займет много времени, учитывая самые мощные компьютеры, и компьютеры в целом в начале 50-х и в конце 60-х годов находились в аналогичном месте, и уж точно не в домашних хозяйствах), технология постепенно найдет свое применение. путь к вашему дому.\n\n\n\nБудете ли вы видеть Quantum Computers в магазинах относительно скоро? Нет, но в конце концов, в течение следующих 15 лет. Они действительно станут подходящими для дома. И, вероятно, играть в игры на минимуме!\n\n\n\nСингулярность - если вы сможете выжить еще как минимум 10 лет, то вы увидите технологическую сингулярность, как указано в книгах Курцвейла. Технологическая сингулярность Рэя Курцвейла уже здесь, если учесть, что его определение технологической сингулярности в буквальном смысле в форме цитаты - событие Bridge 3.\n\n\n\nИ это неоспоримо. В своих работах он особо отмечает, что технологическая сингулярность будет реализована вместе с первой публичной демонстрацией законной нанотехнологии.\n\n\n\nОн даже упоминает, что эти технологии, возможно, еще не способны нацеливаться на заболевания или специфические клетки в кровотоке, но утверждает, что, как только это было продемонстрировано в открытом доступе, даже если это было продемонстрировано только в небольших контрольных случаях\n\n\n\nпросто чтобы показать, что он может двигаться сам по себе, например ....\n\n\n\nТо, что мы достигли технологической сингулярности и что демонстрация нанотехнологий является важной вехой и индикатором этого\n\n\n\n и что сектор нанотехнологий в течение месяца продвинется далеко за пределы того, что было продемонстрировано публично.\n\n\n\nВ течение 5 лет он будет иметь практическое применение в кровотоке. Его прогноз моста 3 для этой технологии уже здесь - на 10 лет раньше, поэтому, согласно всем его статьям относительно технологической сингулярности и моста 3, мы сейчас испытываем технологическую сингулярность. Согласно его письму, что свидетельствует о единственном числе.\n\n\n\nЕго книги более подробно рассказывают об этом и буквально отмечают эту публичную демонстрацию как начало технологической сингулярности.\n\n\n\n\nОн также упоминает, что мы будем демонстрировать нам ASI в той или иной форме в течение того же периода времени.\n\n\n\n Если ситуация продолжит прогрессировать, как в нанотехнологическом секторе - эта демонстрация ASI может произойти довольно скоро. Если вы знаете его писания.\n\n\n\nПомогая нам идти в ногу с некоторыми из его других предсказаний, и намного опережая то, что в настоящее время указывает его временная шкала.","title":"Квантовые вычисления, сингулярность, нанотехнологии и искусственный интеллект.","subreddit_name_prefixed":"r/singularity","ups":25,"created":1564358049,"link_flair_background_color":"","id":"cixgsn","author":{"name":"Rurhanograthul"},"permalink":"/r/singularity/comments/cixgsn/quantum_computing_the_singularity_nanotechnology/","url":"https://www.reddit.com/r/singularity/comments/cixgsn/quantum_computing_the_singularity_nanotechnology/","created_utc":1564329249}