{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Давайте использовать определение киборга как человека, усиленного технологией\n\nМы явно уже усовершенствованы с технологией. Мы думающая и владеющая инструментом обезьяна.\n\nБольшинство технологий, которыми мы себя усиливаем, находятся за пределами нашего тела, но это начинает меняться.\n\nНедавно у нас было объявление Neuralink. Это поместит электроды в мозг, первоначально как интерфейс человеческого компьютера с высокой пропускной способностью. Это материал первого поколения.\n\nТаким образом, следующим этапом может быть добавление способа слышать. Вы можете слушать все, что хотите, это просто подается прямо в вашу нервную систему. Как улитковый имплантат. Теперь почему бы не добавить микрофон где-нибудь. Круто, ты можешь звонить людям, когда захочешь.\n\nКак насчет видения. Может быть трудно получить действительно хорошее соединение для HD-визуалов непосредственно в нервную систему. Так что насчет замены хрусталика глаза на дисплей. Вы также можете улучшить фокусировку, масштабирование, УФ-фильтрацию и, если у вас есть камера, где-нибудь избирательное / расширенное зрение.\n\nСуществующие протезы становятся все лучше и лучше. В какой-то момент у первого человека выборно будет рука или ноги заменены на искусственную, потому что это дает им некоторую пользу.\n\nТвои органы. А если бы у тебя было механическое сердце, которое никогда не перестанет работать. Если ваше сердце падает, вы бы взяли это? Это уже произошло в некоторых случаях пациентов, ожидающих пересадки. Этот принцип одинаков с любым сменным (всем) органом (ами).\n\nСерия романов «Культура» имеет человеческую модификацию, называемую «железой снадобья». Делает именно то, что вы думаете, что делает. Просто наберите любое настроение, которое вам нравится в данный момент. Под напряжением, расслаблен, сосредоточен и т. Д. Очевидно, не формирование привычки.\n\nИскусственный иммунитет? Наноботы в крови. В организме кровь фильтруется для удаления патогенных микроорганизмов, инфекций, раковых заболеваний, вредных для здоровья молекул. В конечном итоге вы будете здоровы дольше. И дольше ..\n\nТак как далеко это пойдет?\n\nЕсли бы пересадка головы была доведена до совершенства (что делается в Китае после того, как русский парень вытащил), и ваше тело состарилось, вы бы просто получили целое тело робота? Это на самом деле может быть лучше, чем ваше биологическое тело. -Простое обновление или ремонт, если он поврежден после того, как у вас была первая пересадка для взаимодействия с нервной системой и необходимое оборудование, чтобы поддерживать вашу голову живым. Никогда не утомляется. Никогда не болеет.\n\nМы быстро дошли до того, что единственное, что осталось от вас, - это мозг, и, без сомнения, уже будет технология, нацеленная на выполнение передач Моравека. На данный момент вы смотрите на обладание по существу потрясающими умственными и физическими способностями на неопределенный период времени.\n\nЯ полагаю, что потенциал технологий, расширяющих возможности людей, \\ * бесконечен \\ * и уже хорошо развивается.","title":"Мы собираемся стать киборгами? (Ответ: да)","subreddit_name_prefixed":"r/singularity","ups":56,"created":1564803110,"link_flair_background_color":"","id":"cl8qt2","author":{"name":"scarlaton"},"permalink":"/r/singularity/comments/cl8qt2/are_we_going_to_become_cyborgs_answer_yes/","url":"https://www.reddit.com/r/singularity/comments/cl8qt2/are_we_going_to_become_cyborgs_answer_yes/","created_utc":1564774310}