{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Честно, интересно, насколько разные эти подводные лодки. Мы, очевидно, оптимисты здесь, а иногда, может быть, слишком оптимистично. но иногда я вижу подводную лодку, и она искренне безумна, насколько пессимистично настроены некоторые из них относительно нашего будущего.\n\nДА, мы испортили нашу планету, и ее нельзя изменить. Мы можем только попытаться ограничить урон и замедлить неизбежное, пока.\n\nОДНАКО, так много людей серьезно упускают из виду ту роль, которую технологии могут сыграть в резком замедлении и минимизации ущерба. Возможно, мало людей на самом деле понимают, что наши технологии могут позволить нам делать со временем. Я думаю, что мы сможем продержаться в гонке гораздо дольше, чем предсказывают люди. Люди действуют так, как будто человечество будет уничтожено в течение столетия. (Если ИИ не повернется против нас, оф! 😞)\n\nНо экспоненциальный рост технического прогресса принесет много пользы во многих областях. Биоразнообразие разрушается из-за изменения климата? ИИ и биоинженерия могут прийти на помощь. И это должно стать очевидным в течение следующего десятилетия, так как люди начинают осознавать проблему еще больше, чем сейчас.\n\nПочему люди ведут себя так, будто у них нет надежды, и что сделано, то сделано? Это далеко не окончено.\n\nНекоторые просто не должны недооценивать тот факт, что есть так много людей, которые работают над решением каждой из проблем, с которыми мы сталкиваемся. И они все чаще смогут решать их с помощью нашей постоянно совершенствующейся технологии. Технология - это не только виртуальные машины и социальные сети. Люди делают значительные прорывы в этой области, и реальные проблемы были и будут решаться.\n\n«Что происходит, когда все наши пчелы умирают?» Что ж, если мы поможем им с технологией и не позволим им умереть. Люди посвящают свою жизнь этой самой проблеме, и это нельзя упускать из виду. черт возьми, если мы сделаем какое-то черное зеркальное дерьмо и, черт возьми, спроектируем их Есть так много возможностей. Я не думаю, что мы просто сядем и позволим всему этому рухнуть. Тем более, что миллионы и миллионы детей становятся грамотными и, в конечном итоге, получают доступ к технологиям и сами могут изменить ситуацию. Например, учтите, что Google учит детей программировать в Африке.\n\nНе говоря уже о том, что мы сделали беспрецедентный скачок в продвижении нашей расы на другие чертовы планеты. Конечно, нужно сказать что-то о нашем полном пренебрежении к окружающей среде, которая была нам предоставлена, и мы, конечно, не должны просто гадить в каждой среде, к которой мы прикасаемся ...\n\nесть так много информации и данных, и поэтому ИИ будет процветать. мы просто будем продолжать решать проблемы. возможности буквально безграничны. Наивно вести себя так, будто у нас нет вариантов.\n\nНо людей снова и снова проверяют, и теперь у нас есть что-то чертовски мощное на нашей стороне. мы не одиноки. Его становится только мощнее. Каждый день появляются новые истории о влиянии того, что мы сделали с нашей планетой, но в то же время каждый день появляются новые прорывы, которые приближают нас к новым решениям в области искусственного интеллекта, биотехнологии, агротехники и т. Д.\n\nЛюди должны просто рассмотреть обе стороны медали. Я присоединился к сбою, чтобы увидеть другую сторону. Здорово признать ущерб, который уже был нанесен, и то, насколько мы облажались, но также следует признать и уважать достижения в области технологий. Пока что на нашей стороне. Это буквально сделает нас умнее и лучше подготовленными для решения проблем.\n\nМы находимся на встречном курсе. Это так интересно смотреть. Технология движется так быстро, и в то же время наша природная среда так быстро разрушается. Просто хотел снять это с моей груди, потому что я хочу поговорить с моими людьми об этом! (Вы, ребята ☺️) друзья-оптимисты","title":"Сингулярность сабвуфера против Свернуть сабвуфера","subreddit_name_prefixed":"r/singularity","ups":77,"created":1565089166,"link_flair_background_color":"","id":"cml1pr","author":{"name":"susins-wj"},"permalink":"/r/singularity/comments/cml1pr/singularity_sub_vs_collapse_sub/","url":"https://www.reddit.com/r/singularity/comments/cml1pr/singularity_sub_vs_collapse_sub/","created_utc":1565060366}