{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"","title":"Ну, сингулярность не пришла тайно. Первый признак: миллиардеры перестают умирать.","subreddit_name_prefixed":"r/singularity","ups":238,"created":1566606609,"link_flair_background_color":"","id":"cug8vg","author":{"name":"AdamJefferson"},"permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/","url":"https://www.kwch.com/content/news/Billionaire-David-Koch-dies-at-age-79-557984761.html?ref=761","created_utc":1566577809,"replies":[{"ups":70,"link_id":"t3_cug8vg","replies":[{"ups":23,"link_id":"t3_cug8vg","replies":[{"ups":2,"link_id":"t3_cug8vg","replies":[{"ups":2,"link_id":"t3_cug8vg","replies":[{"ups":2,"link_id":"t3_cug8vg","id":"exxh05v","author":"monsieurpooh","parent_id":"t1_exx5i0y","subreddit_id":"t5_2qh8m","body":"You believe in a physics-transcendent thread of continuity *whether you realize it or not*. Otherwise you'd agree with this statement: The thread of connection you have to your past self is no more real than it would be if your brain were constantly destroyed and re-materialized (with all memories intact).\n\nConsider the two situations: One in which you secretly swapped the copy and original, and the other in which you left them alone. There is literally no scientifically/physically distinguishable difference between the two scenarios. Hence, scientifically speaking, copying and leaving alone, is the same as copying and secretly swapping the two. When you propose there is a real meaningful/philosophical difference between the two, you are proposing an idea that is *beyond the purview of science and physicalism* (and, if you think about it, can't even be scientifically tested using any experiment).\n\nThe part you quoted isn't even part of the \"proof\" logic. It's just an offered resolution to the paradox after I've already made my point. The issue is there is a Ship of Theseus paradox if you hold traditional view of consciousness (that there is a \"continuous me\"). The article exposes said paradox, which is the part *before* your quote. My proposed resolution is that continuous me is fictitious. There are other possible solutions (like that the \"soul\" really exists), but they seem a lot less elegant and too spiritual.\n\nSo first you have to answer, what do *you* think will happen in those thought experiments where you have 100 different situations, each of which gradually replaces more of the brain with identical matter? Do you \"draw a line\" and think suddenly at 51.1% you die? Or do you think you just progressively get more and more \"dead\" the more you replace?\n\ntl;dr: The foundation of your belief lies on the assumption that a particular group of atoms defines what is the \"true original you\"; my thought experiment pokes holes in this belief by replacing a subset of your atoms with identically arranged atoms and asking if you think you'll still be \"the real you\".","body_html":"<div class = \"md\"> <p> Вы верите в трансцендентную физическую цепочку непрерывности <em> понимаете ли вы это или нет </em>. В противном случае вы согласились бы с этим утверждением: нить связи, которая у вас есть, с вашим прошлым я не более реальна, чем если бы ваш мозг постоянно разрушался и материализовался (со всеми нетронутыми воспоминаниями). </P>\n\n<p> Рассмотрим две ситуации: одна, в которой вы тайно меняли местами копию и оригинал, и другая, в которой вы оставляли их в покое. Буквально нет никакой разницы между этими двумя сценариями. Следовательно, с научной точки зрения, копирование и оставление в покое, это то же самое, что копирование и тайное переключение между ними. Когда вы предлагаете, что между этими двумя понятиями есть реальное значимое / философское различие, вы предлагаете идею, которая <em> выходит за рамки науки и физикализма </em> (и, если вы об этом думаете, даже не может быть научно проверено с использованием любого эксперимента). </p>\n\n<p> Часть, которую вы цитировали, даже не является частью логики «доказательства». Это просто предложенное решение парадокса после того, как я уже высказал свою точку зрения. Проблема в том, что есть парадокс Корабля Тесея, если вы придерживаетесь традиционного взгляда на сознание (что существует «непрерывное я»). В статье раскрывается указанный парадокс, который является частью <em> до </em> вашей цитаты. Мое предлагаемое решение состоит в том, что постоянное \"я\" является вымышленным. Существуют и другие возможные решения (например, «душа» действительно существует), но они кажутся намного менее изящными и слишком духовными. </P>\n\n<p> Итак, сначала вы должны ответить, что <em> вы </em> думаете, произойдет в тех мысленных экспериментах, где у вас есть 100 различных ситуаций, каждая из которых постепенно заменяет большую часть мозга идентичной материей? Вы «рисуете линию» и думаете, что внезапно вы умрете на 51,1%? Или вы думаете, что вы все больше и больше становитесь «мертвыми», чем больше вы заменяете? </P>\n\n<p> tl; dr. Основа вашей веры заключается в предположении, что определенная группа атомов определяет, что является «истинным оригиналом вас»; Мой мысленный эксперимент пробивает дыры в этом убеждении, заменяя подмножество ваших атомов одинаково расположенными атомами и спрашивая, думаете ли вы, что вы все еще будете «настоящим». </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exxh05v/","name":"t1_exxh05v","created":1566664616,"created_utc":1566635816,"subreddit_name_prefixed":"r/singularity","depth":8}],"id":"exwsmub","author":"monsieurpooh","parent_id":"t1_exwcaov","subreddit_id":"t5_2qh8m","body":"I'm not denying the Hard Problem of Consciousness. I agree there's some fundamental weirdness of consciousness which we all experience, which is not necessarily totally explained by electricity jumping between neurons. But that does NOT imply the \"continuous you *across time*\" is a reality. The continuing across time is an illusion. 100% of the \"evidence\" you have to prove this \"memory-transcendent thread of continuity\" actually exists, is compatible with the interpretation that your mind in your brain right now is just the new guy who inherited your memories from 5-seconds-ago you. That's why in my opinion the burden of proof is on you.\n\nTL;DR: \"I think therefore I **am**\" does not imply \"I think therefore I **was**\".\n\nIf you still feel the burden of proof is on me, there's always this:  [https://blog.maxloh.com/2019/06/mind-uploading-wont-kill-you.html](https://blog.maxloh.com/2019/06/mind-uploading-wont-kill-you.html)  not exactly a \"proof\" but more like a persuasive logical argument.","body_html":"<div class = \"md\"> <p> Я не отрицаю сложную проблему сознания. Я согласен, что есть некоторая фундаментальная странность сознания, которую мы все испытываем, что не обязательно полностью объясняется скачками электричества между нейронами. Но это НЕ означает, что «непрерывный ты <em> во времени </em>» - это реальность. Продолжение во времени - иллюзия. 100% «доказательств», которые вы должны доказать, что эта «трансцендентная нить преемственности в памяти» на самом деле существует, совместимо с интерпретацией, что ваш разум в вашем мозгу прямо сейчас - просто новый парень, который унаследовал ваши воспоминания от 5 секунд - назад ты. Вот почему, по моему мнению, бремя доказывания лежит на вас. </P>\n\n<p> TL; DR: «Я думаю, поэтому я <strong> являюсь </strong>» не означает «я думаю, поэтому я <strong> был </strong>». </p>\n\n<p> Если вы все еще чувствуете, что бремя доказывания лежит на мне, всегда есть следующее: <a href = \"https://blog.maxloh.com/2019/06/mind-uploading-wont-kill-you.html\" > https://blog.maxloh.com/2019/06/mind-uploading-wont-kill-you.html </a> не совсем «доказательство», а скорее убедительный логический аргумент. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exwsmub/","name":"t1_exwsmub","created":1566653110,"created_utc":1566624310,"subreddit_name_prefixed":"r/singularity","depth":6}],"id":"exvlv3f","author":"monsieurpooh","parent_id":"t1_exvcags","subreddit_id":"t5_2qh8m","body":"Well the assumption that there's an EXTRA thread of continuity in the brain which transcends the physical memories is itself unscientific and impossible to prove or disprove. It would be those asserting there's some soul-like thing that *could* to be transferred in the first place, who bear the burden of proof. \n\n\"I think therefore I am\" does not translate into \"I think therefore I was\".","body_html":"<div class = \"md\"> <p> Предположение о том, что в мозге есть ДОПОЛНИТЕЛЬНАЯ нить непрерывности, которая выходит за пределы физических воспоминаний, само по себе ненаучно и невозможно доказать или опровергнуть. Это будут те, кто утверждает, что есть некая подобная душе вещь, которую <em> можно </em> перенести в первую очередь, которые несут бремя доказывания. </Р>\n\n<p> «Я думаю, поэтому я есть» не означает «я думаю, поэтому я был». </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvlv3f/","name":"t1_exvlv3f","created":1566630666,"created_utc":1566601866,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"exuymj8","author":"threebellies","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"Do people really have such a poor understanding of what constitutes our “consciousness” that they think taking an imprint of data from our minds and uploading it to a computer... will lead to an actual uninterrupted chain of consciousness? \n\nWe can upload a billionaires mind to a machine, that’s great. But it will always be just like it is: making a copy of data and hoping for the best. \n\nThose people who clone their favorite dogs and think they’re keeping the ‘same’ animal... lol, and Napster was where everyone went to compose music. \n\nOur understanding of data is great, our understanding of what drives our consciousness/souls is not. Precisely because it’s really, really difficult if not impossible to measure something objectively about something like consciousness which by definition is subjective. \n\nThey may make some sweet mp3 copies of themselves, but the all important “me” thought in all that will disappear right along with the body.","body_html":"<div class = \"md\"> <p> Люди действительно настолько плохо понимают, что составляет наше «сознание», что они думают, что взятие отпечатка данных из нашего разума и загрузка его на компьютер ... приведет к актуальная непрерывная цепь сознания? </Р>\n\n<p> Мы можем загрузить ум миллиардеров на машину, и это здорово. Но это всегда будет так: делать копии данных и надеяться на лучшее. </Р>\n\n<p> Те люди, которые клонируют своих любимых собак и думают, что они держат «того же самого» животного ... смеется, и в Napster все пошли сочинять музыку. </Р>\n\n<p> Наше понимание данных велико, наше понимание того, что движет нашим сознанием / душой, не очень. Именно потому, что действительно очень трудно, если не невозможно, измерить что-то объективно относительно чего-то вроде сознания, которое по определению субъективно. </Р>\n\n<p> Они могут сделать несколько приятных mp3-копий самих себя, но все важные мысли «я» во всем этом исчезнут вместе с телом. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuymj8/","name":"t1_exuymj8","created":1566618809,"created_utc":1566590009,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":3,"link_id":"t3_cug8vg","id":"exuvz8i","author":"XSSpants","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"As far as they'll publicly tell you....","body_html":"<div class = \"md\"> <p> Насколько они вам публично сообщат .... </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuvz8i/","name":"t1_exuvz8i","created":1566617821,"created_utc":1566589021,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":2,"link_id":"t3_cug8vg","id":"ey4nbcu","author":"TheSn00pster","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"Proposed by Dr. Hans Moravec in the book Mind Children, this describes how a human brain could be transformed into a mechanical structure made from nanobots, without the brain in question losing consciousness:\n\nA neuron-sized robot swims up to a neuron and scans it into memory. A computer starts simulating the neuron. The robot waits until the neuron perfectly matches its simulation inside the computer, and then replaces the neuron with itself as smoothly as possible, sending inputs to the computer and transmitting outputs from the simulation of a neuron inside the computer.\n\nThis entire procedure has had no effect on the flow of information in the brain, except that one neuron's worth of processing is now being done inside a computer instead of a neuron. Repeat, neuron by neuron, until the entire brain is composed of robot neurons whose guts are inside the computer.\n\nThis description originally written by Eliezer Yudkowsky.","body_html":"<div class = \"md\"> <p> Предложенный доктором Хансом Моравеком в книге «Дети разума», он описывает, как человеческий мозг может быть преобразован в механическую структуру, состоящую из наноботов, без потери сознания: </р>\n\n<p> Робот размером с нейрон подплывает к нейрону и сканирует его в память. Компьютер начинает симулировать нейрон. Робот ожидает, пока нейрон полностью совпадет с симуляцией внутри компьютера, а затем заменяет нейрон как можно более плавно, посылая входные данные на компьютер и передавая результаты симуляции нейрона внутри компьютера. </P>\n\n<p> Вся эта процедура не оказала влияния на поток информации в мозге, за исключением того, что обработка одного нейрона теперь выполняется внутри компьютера вместо нейрона. Повторяйте, нейрон за нейроном, пока весь мозг не будет составлен из нейронов робота, чьи кишки находятся внутри компьютера. </P>\n\n<p> Это описание изначально написано Элизером Юдковским. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey4nbcu/","name":"t1_ey4nbcu","created":1566827485,"created_utc":1566798685,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":1,"link_id":"t3_cug8vg","id":"ey0it8o","author":"Yuli-Ban","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"> Life extension tech is relatively close, very close to being possible, mind uploading is not possible right now, tech is probably decades away.\n\nEven if both were only *five* years away, that means nothing according to Singularitarianist beliefs. The whole point is that exponential growth is a thing— what's at a 1,000 now might be at 1,000,000,000 in five years.","body_html":"<div class = \"md\"> <blockquote>\n<p> Технология продления жизни относительно близка, очень близка к возможной, загрузка умов сейчас невозможна, технология, вероятно, уходит на десятилетия. </p>\n</BLOCKQUOTE>\n\n<p> Даже если бы обоим было всего <em> пять </em> лет, это ничего не значит согласно сингулярным убеждениям. Все дело в том, что экспоненциальный рост - это вещь. То, что сейчас на 1000, может быть на 1.000.000.000 через пять лет. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey0it8o/","name":"t1_ey0it8o","created":1566708304,"created_utc":1566679504,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":-2,"link_id":"t3_cug8vg","id":"exuz3nt","author":"ArgentStonecutter","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"> Life extension tech is relatively close, very close to being possible\n\nWhen I was a teenager in the '70s scientists and futurists were claiming that life extension was very close and if you made it to 1992 or 1998 or 2010 you'd likely live a thousand years... and it's been about as close as cheap nuclear fusion for as long as I've been alive.","body_html":"<div class = \"md\"> <blockquote>\n<p> Технология продления жизни относительно близка, очень близка к возможной </p>\n</BLOCKQUOTE>\n\n<p> Когда я был подростком в 70-х, ученые и футуристы утверждали, что продление жизни было очень близко, и если бы вы добрались до 1992, 1998 или 2010 года, вы, вероятно, прожили бы тысячу лет ... и это было Близко к дешевому ядерному синтезу, пока я жив. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuz3nt/","name":"t1_exuz3nt","created":1566618985,"created_utc":1566590185,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":0,"link_id":"t3_cug8vg","id":"exw8s0a","author":"brihamedit","parent_id":"t1_exuofke","subreddit_id":"t5_2qh8m","body":"That's the weird thing. So many decades of research into the subject and there is zero result. That seems suspicious. You don't even see news items related to the topic like some researcher discovered something and now we are oone step closer to understanding the life and death process and consciousness and so on.","body_html":"<div class = \"md\"> <p> Это странная вещь. Столько десятилетий исследований в этой области и результата нет. Это кажется подозрительным. Вы даже не видите новостей, связанных с этой темой, как какой-то исследователь обнаружил что-то, и теперь мы на шаг ближе к пониманию процесса жизни и смерти, сознания и так далее. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exw8s0a/","name":"t1_exw8s0a","created":1566644368,"created_utc":1566615568,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"exu46s2","author":"ArgentStonecutter","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"If you think the singularity is close enough to be watching for, how do you know he didn't upload... or transfer to a younger host body?","body_html":"<div class = \"md\"> <p> Если вы думаете, что сингулярность достаточно близка, чтобы за ней наблюдать, откуда вы знаете, что он не загружал ... или не переносил в более молодое тело хоста? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exu46s2/","name":"t1_exu46s2","created":1566607873,"created_utc":1566579073,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":14,"link_id":"t3_cug8vg","id":"exu8m2e","author":"FoodMadeFromRobots","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"He was given 5 years to live 27 years ago due to cancer diagnosis but yah not quite there yet.","body_html":"<div class = \"md\"> <p> Ему дали 5 лет, чтобы жить 27 лет назад из-за диагноза рака, но пока не совсем. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exu8m2e/","name":"t1_exu8m2e","created":1566609504,"created_utc":1566580704,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":19,"link_id":"t3_cug8vg","replies":[{"ups":8,"link_id":"t3_cug8vg","replies":[{"ups":5,"link_id":"t3_cug8vg","id":"exuua1s","author":"hashmish","parent_id":"t1_exusahc","subreddit_id":"t5_2qh8m","body":"lets hope he wont take the singularity with him when he moves on and we not there yet...","body_html":"<div class = \"md\"> <p> будем надеяться, что он не возьмет с собой сингулярность, когда он уйдет, а мы еще не там ... </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuua1s/","name":"t1_exuua1s","created":1566617238,"created_utc":1566588438,"subreddit_name_prefixed":"r/singularity","depth":4},{"ups":9,"link_id":"t3_cug8vg","replies":[{"ups":6,"link_id":"t3_cug8vg","id":"exvxrx5","author":"MercySound","parent_id":"t1_exvviho","subreddit_id":"t5_2qh8m","body":"If you look at 9 seconds in, his side form shows it all.  Ray is relatively thin but skinny fat, especially around the abdomen, which is increasingly dangerous as you get older.  Even at 70+ years old you can be healthy without a gut.  Believe me, I want Ray around as long as possible. It surprises me to see a gut like that on him, considering his enthusiasm for the future and his impact on the world.","body_html":"<div class = \"md\"> <p> Если вы посмотрите на 9 секунд, его боковая форма показывает все это. Луч относительно тонкий, но тонкий жир, особенно вокруг живота, который становится все более опасным, когда вы становитесь старше. Даже в возрасте 70 лет и старше вы можете быть здоровы без кишечника. Поверь мне, я хочу, чтобы Рэй был как можно дольше. Меня удивляет, когда я вижу в нем такую ​​интуицию, учитывая его энтузиазм по поводу будущего и его влияние на мир. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvxrx5/","name":"t1_exvxrx5","created":1566637537,"created_utc":1566608737,"subreddit_name_prefixed":"r/singularity","depth":6}],"id":"exuwm9n","author":"MercySound","parent_id":"t1_exusahc","subreddit_id":"t5_2qh8m","body":"Mr. Kurzweil has a bigger gut then I expected. Large amounts of fat, especially around the abdomen region, is poor for your health. This is why exercise and diet are SO important! Undoubtedly these are the best life extension medicines we can prescribe ourselves.","body_html":"<div class = \"md\"> <p> Мистер Курцвейл имеет больший кишечник, чем я ожидал. Большое количество жира, особенно в области живота, вредно для здоровья. Вот почему физические упражнения и диета так важны! Несомненно, это лучшие лекарства для продления жизни, которые мы можем назначить сами. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuwm9n/","name":"t1_exuwm9n","created":1566618056,"created_utc":1566589256,"subreddit_name_prefixed":"r/singularity","depth":4},{"ups":2,"link_id":"t3_cug8vg","id":"exv7bqi","author":"sam191817","parent_id":"t1_exusahc","subreddit_id":"t5_2qh8m","body":"Does he really think that hairpiece is helping?","body_html":"<div class = \"md\"> <p> Он действительно думает, что заколка помогает? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exv7bqi/","name":"t1_exv7bqi","created":1566622772,"created_utc":1566593972,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"exuhe2o","author":"MeditationGuru","parent_id":"t1_exudeza","subreddit_id":"t5_2qh8m","body":"What happened?","body_html":"<div class = \"md\"> <p> Что случилось? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuhe2o/","name":"t1_exuhe2o","created":1566612610,"created_utc":1566583810,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"exu79l3","author":"quasci","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Ray Kurzweil would be the one to watch. But based on his last appearance a couple of days ago, it's not looking optimistic.","body_html":"<div class = \"md\"> <p> Рэй Курцвейл будет тем, на кого смотреть. Но, судя по его последнему появлению пару дней назад, он не выглядит оптимистичным. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exu79l3/","name":"t1_exu79l3","created":1566609028,"created_utc":1566580228,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":26,"link_id":"t3_cug8vg","replies":[{"ups":7,"link_id":"t3_cug8vg","replies":[{"ups":0,"link_id":"t3_cug8vg","id":"exzif6l","author":"katiecharm","parent_id":"t1_exxafub","subreddit_id":"t5_2qh8m","body":"Just made it up.  Seems like an apt descriptor.  Thank you 🖤","body_html":"<div class = \"md\"> <p> Только что сделал это. Похоже на удачный дескриптор. Спасибо 🖤 </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exzif6l/","name":"t1_exzif6l","created":1566695440,"created_utc":1566666640,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"exu8car","author":"katiecharm","parent_id":"t1_exu6jql","subreddit_id":"t5_2qh8m","body":"I hope one day that if immortality is possible, one needs to request it from a higher intelligence.  Note that we’re not talking about God, though it might as well be.  I mean this theoretical grand matriarch that magically provides everything for you.  \n  \nYou will doubtlessly live in a relative paradise of experiences and plenty, made possible by a moral intelligence that operates at a level so vastly above you that you can’t comprehend it.  \n  \nThere will likely be a future term that means: a point where an intelligence is complex enough to not want to die, to want to grow and become more than it is, and is intelligent enough to ask for both of these things.  \n  \nYou’d petition this friendly face of the singularity that you don’t want to die, and it would respond that it isn’t physically possible to keep you in your current complexity indefinitely.  You must either descend down to less complexity (eventually dying) or can choose to ascend to greater complexity.  \n  \nIf you want to ascend, you’ll have to understand that it won’t all be pleasurable, there will be many painful learning moments, and you may have to sacrifice some autonomy along the way.   But you will recognize in time that you are becoming more intelligent and compassionate, albeit through a variety of painful lessons.  You also will notice that you still exist, which is a nice bonus.  \n  \nIn fact, it is possible we already exist in such a framework, whether by design or coincidence.  Take the theory of quantum immortality as one example.  \n  \nAlso note that in instances where one is fully simulated or observable by something higher, one’s intentions can be seen just as easily as their physical words.  It would then be enough just to want these things, and no formal declaration is needed.  We have gotten awfully close to the neo-pagan magic of current rave culture, so we’ll stop here.  But sufficiently advanced technology being indistinguishable from magic might hit a little closer to home than many can imagine.","body_html":"<div class = \"md\"> <p> Однажды я надеюсь, что если бессмертие возможно, нужно попросить его у более высокого разума. Обратите внимание, что мы не говорим о Боге, хотя это может быть и так. Я имею в виду этого теоретического великого матриарха, который волшебным образом предоставляет все для вас. </Р>\n\n<p> Вы, несомненно, будете жить в относительном раю опыта и изобилия, что стало возможным благодаря моральному разуму, действующему на уровне, намного превышающем вас, что вы не можете его понять. </Р>\n\n<p> Вероятно, в будущем будет термин, который означает: точка, в которой разум достаточно сложен, чтобы не хотеть умирать, хотеть расти и становиться больше, чем он есть, и достаточно умен, чтобы просить обе эти вещи. </Р>\n\n<p> Вы бы подали прошение об этом дружелюбном лице единственности, которое не хотите умирать, и оно ответило бы, что физически невозможно удержать вас в вашей нынешней сложности бесконечно долго. Вы должны либо спуститься до меньшей сложности (в конечном итоге умереть), либо выбрать более высокую сложность. </Р>\n\n<p> Если вы хотите вознестись, вы должны понимать, что все это не будет приятным, будет много болезненных моментов обучения, и вам, возможно, придется пожертвовать некоторой автономией на этом пути. Но со временем вы поймете, что становитесь все умнее и сострадательнее, хотя и через множество болезненных уроков. Вы также заметите, что все еще существуете, что является хорошим бонусом. </Р>\n\n<p> На самом деле, возможно, мы уже существуем в такой структуре, будь то по замыслу или по совпадению. Возьмем теорию квантового бессмертия в качестве одного из примеров. </Р>\n\n<p> Также обратите внимание, что в случаях, когда кто-то полностью имитируется или наблюдается чем-то более высоким, его намерения можно увидеть так же легко, как и их физические слова. Тогда было бы достаточно просто хотеть этих вещей, и никакой формальной декларации не требуется. Мы очень близко подошли к неоязыческой магии современной рейв-культуры, поэтому остановимся здесь. Но достаточно продвинутая технология, неотличимая от магии, может ударить немного ближе к дому, чем многие могут себе представить. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exu8car/","name":"t1_exu8car","created":1566609406,"created_utc":1566580606,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"exu1dgc","author":"katiecharm","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Ironically, this particular billionaire dying will help hasten the singularity - or at least, the one we want.","body_html":"<div class = \"md\"> <p> По иронии судьбы, именно эта смерть миллиардера поможет ускорить необычность - или, по крайней мере, ту, которую мы хотим. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exu1dgc/","name":"t1_exu1dgc","created":1566606818,"created_utc":1566578018,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":4,"link_id":"t3_cug8vg","id":"exvlryr","author":"icemunk","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"What if we're all just behind the curve, and the singularity has already happened. What if we're just the reminents of what was, and being monitored and observed by what is.","body_html":"<div class = \"md\"> <p> Что если мы все сразу за кривой, и особенность уже произошла. Что, если мы всего лишь напоминания о том, что было, и что за нами следят и наблюдают. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvlryr/","name":"t1_exvlryr","created":1566630608,"created_utc":1566601808,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":2,"link_id":"t3_cug8vg","id":"exuek8e","author":"Sloga_","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Cyberbrains where you at?","body_html":"<div class = \"md\"> <p> Кибер-мозги, где ты? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuek8e/","name":"t1_exuek8e","created":1566611605,"created_utc":1566582805,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":2,"link_id":"t3_cug8vg","id":"exvzxe5","author":"Miv333","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"I don't think the singularity will secretly happen, by definition.\n\nI also don't think the singularity is required for radical life extension.","body_html":"<div class = \"md\"> <p> Я не думаю, что сингулярность произойдет тайно по определению. </p>\n\n<p> Я также не думаю, что особенность необходима для радикального продления жизни. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvzxe5/","name":"t1_exvzxe5","created":1566638638,"created_utc":1566609838,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":3,"link_id":"t3_cug8vg","replies":[{"ups":6,"link_id":"t3_cug8vg","replies":[{"ups":2,"link_id":"t3_cug8vg","id":"f322rhk","author":"StarChild413","parent_id":"t1_exvp3l8","subreddit_id":"t5_2qh8m","body":"Maybe that's part of the plan, use various minorly-effective tactics to stall so many attempted revolutions they eventually stall themselves for you","body_html":"<div class = \"md\"> <p> Может быть, это часть плана, используйте различные малоэффективные тактики, чтобы остановить столько попыток революций, что они в конечном итоге остановят себя для вас </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/f322rhk/","name":"t1_f322rhk","created":1570620502,"created_utc":1570591702,"subreddit_name_prefixed":"r/singularity","depth":4},{"ups":1,"link_id":"t3_cug8vg","id":"exzmj28","author":"XSSpants","parent_id":"t1_exvp3l8","subreddit_id":"t5_2qh8m","body":"Dunno, the US is building up a far left movement.\n\nFrance had a VERY active revolt recently.\n\nJust gotta get people off their TVs","body_html":"<div class = \"md\"> <p> Не знаю, США создают крайне левое движение. </p>\n\n<p> В последнее время во Франции произошел ОЧЕНЬ активный бунт. </p>\n\n<p> Просто надо снимать людей со своих телевизоров </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exzmj28/","name":"t1_exzmj28","created":1566697140,"created_utc":1566668340,"subreddit_name_prefixed":"r/singularity","depth":4}],"id":"exuua3a","author":"XSSpants","parent_id":"t1_exupnh5","subreddit_id":"t5_2qh8m","body":"If they know what's good for them, yeah. Being a public immortal because of your money would be the fastest way to get a bunch of desperate old proletariat to revolt.","body_html":"<div class = \"md\"> <p> Если они знают, что для них хорошо, то да. Быть публичным бессмертным из-за ваших денег было бы самым быстрым способом заставить восстать отчаянную кучку старого пролетариата. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuua3a/","name":"t1_exuua3a","created":1566617238,"created_utc":1566588438,"subreddit_name_prefixed":"r/singularity","depth":2},{"ups":1,"link_id":"t3_cug8vg","id":"exv40eq","author":"IngemarKenyatta","parent_id":"t1_exupnh5","subreddit_id":"t5_2qh8m","body":"No, you have it wrong. If they singularity arrives secretly as the OP postulates, it will only have done that if billionaires are involved in the secrecy.","body_html":"<div class = \"md\"> <p> Нет, вы ошиблись. Если их сингулярность приходит тайно, поскольку постулаты ОП, это будет сделано только в том случае, если в секретность вовлечены миллиардеры. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exv40eq/","name":"t1_exv40eq","created":1566621159,"created_utc":1566592359,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"exulixo","author":"IngemarKenyatta","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Billionaires will definitely keep 'dying' if it arrives 'secretly'. They aren't dumb.","body_html":"<div class = \"md\"> <p> Миллиардеры определенно будут «умирать», если прибудут «тайно». Они не тупые. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exulixo/","name":"t1_exulixo","created":1566614041,"created_utc":1566585241,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":4,"link_id":"t3_cug8vg","replies":[{"ups":1,"link_id":"t3_cug8vg","id":"ey1cu6l","author":"iNstein","parent_id":"t1_exucufj","subreddit_id":"t5_2qh8m","body":"Good point, it is about a rate of growth. People just assume that an ASI will be needed first. If that is the case, then we would have to somehow suppress the ASI which would not only be incredibly unlikely but pointless.","body_html":"<div class = \"md\"> <p> Хорошая мысль, речь идет о темпах роста. Люди просто предполагают, что вначале потребуется ASI. Если это так, то нам придется как-то подавлять ASI, что не только невероятно маловероятно, но и бессмысленно. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey1cu6l/","name":"t1_ey1cu6l","created":1566725022,"created_utc":1566696222,"subreddit_name_prefixed":"r/singularity","depth":2}],"id":"exub53m","author":"pm_me_your_kindwords","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Who’s to say the singularity wouldn’t start causing the billionaires (or others) to die off? What is the singularity realizes that what’s best for the planet is for there to be far fewer people?","body_html":"<div class = \"md\"> <p> Кто скажет, что сингулярность не приведет к гибели миллиардеров (или других)? Какая особенность понимает, что для планеты лучше всего, чтобы людей было гораздо меньше? </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exub53m/","name":"t1_exub53m","created":1566610381,"created_utc":1566581581,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":2,"link_id":"t3_cug8vg","id":"exudjsg","author":"Kyrhotec","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Right, because when a superintelligence comes online somewhere the first thing on its priorities list would be to extend a Koch brothers' lifespan...","body_html":"<div class = \"md\"> <p> Правильно, потому что, когда где-нибудь в сети появляется суперинтеллект, первым делом в списке приоритетов будет продление жизни братьев Кохов ... </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exudjsg/","name":"t1_exudjsg","created":1566611240,"created_utc":1566582440,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"exuvzf9","author":"arizonajill","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Don't they have to believe in science though?","body_html":"<div class = \"md\"> <p> Разве они не должны верить в науку? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuvzf9/","name":"t1_exuvzf9","created":1566617823,"created_utc":1566589023,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"ey1kyw3","author":"moschles","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":" I am coining the term \"vampires\".  This word means the wealthy and ultra-connected who secretly obtain genetic modifications to their telomeres to slow or halt their own aging.","body_html":"<div class = \"md\"> <p> Я ввожу термин \"вампиры\". Это слово означает богатых и сверхсвязанных, которые тайно получают генетические модификации своих теломер, чтобы замедлить или остановить собственное старение. </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey1kyw3/","name":"t1_ey1kyw3","created":1566731302,"created_utc":1566702502,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"ey4qyvs","author":"area51perp","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Jesus said, \"it is easier for a camel to go through the eye of a needle than for a rich man to enter the kingdom of God.\"\n\nI specifically said I'd have to wait for some of these old guys to die before proof that Jacob's ladder (Genesis 28:10–17) is constructable with today's technologies.","body_html":"<div class = \"md\"> <p> Иисус сказал: «Верблюду легче пройти сквозь игольное ушко, чем богатому человеку войти в Царство Божье». </p>\n\n<p> Я специально сказал, что мне придется подождать, пока некоторые из этих стариков умрут, прежде чем доказать, что лестница Иакова (Бытие 28: 10–17) может быть построена с использованием современных технологий. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey4qyvs/","name":"t1_ey4qyvs","created":1566832316,"created_utc":1566803516,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"ey9mbhv","author":"t_the_thinker","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Exactly.","body_html":"<div class = \"md\"> <p> Точно. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/ey9mbhv/","name":"t1_ey9mbhv","created":1566975620,"created_utc":1566946820,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"exurrs0","author":"pyriphlegeton","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Currently, lifestyle interventions are most powerful.  \nJust because he's rich, doesn't mean he lead a healthy lifestyle.\n\nOnly idiots use anecdotes with n=1 as evidence for anything.","body_html":"<div class = \"md\"> <p> В настоящее время интервенции в области образа жизни являются наиболее эффективными. <br/>\nТо, что он богат, не означает, что он ведет здоровый образ жизни. </P>\n\n<p> Только идиоты используют анекдоты с n = 1 в качестве доказательства чего-либо. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exurrs0/","name":"t1_exurrs0","created":1566616343,"created_utc":1566587543,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":1,"link_id":"t3_cug8vg","id":"exvr2sb","author":"ruffyamaharyder","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"You don't think someone who has reached singularity hasn't figured out how to hide it well?","body_html":"<div class = \"md\"> <p> Вы не думаете, что кто-то, кто достиг сингулярности, не понял, как это хорошо скрыть? </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvr2sb/","name":"t1_exvr2sb","created":1566633682,"created_utc":1566604882,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":0,"link_id":"t3_cug8vg","id":"exuoftr","author":"cassidy-vamp","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Ahem, err Dick Cheney.","body_html":"<div class = \"md\"> <p> Гм, ошибка Дика Чейни. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exuoftr/","name":"t1_exuoftr","created":1566615131,"created_utc":1566586331,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":-2,"link_id":"t3_cug8vg","id":"exumfb7","author":"LudovicoSpecs","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"Any singularity worth its salt will kill the billionaires first. (Followed by the rest of humanity in order of the AI's priority until the human population is more in line with that of other large-ish mammals).","body_html":"<div class = \"md\"> <p> Любая особенность, достойная соли, в первую очередь убьет миллиардеров. (За ним следует остальная часть человечества в порядке приоритета ИИ, пока человеческая популяция не будет в большей степени соответствовать популяциям других млекопитающих с крупной плотью). </P>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exumfb7/","name":"t1_exumfb7","created":1566614381,"created_utc":1566585581,"subreddit_name_prefixed":"r/singularity","depth":0},{"ups":-4,"link_id":"t3_cug8vg","id":"exvcd6h","author":"whataprophet","parent_id":"t3_cug8vg","subreddit_id":"t5_2qh8m","body":"WHYYYY????\n\nWhy to keep these inefficient obsolete and irrepairable humANIMALs forever?\n\nThis is just a ridiculous intermediate evolutionary stage (massive CPU/MEM upgrade on top of hopelessly outdated and irrepairable DeepAnimalistic evo-older brain parts that drive their \"value core\") in the Grand Theatre of the Evolution of Intelligence with one sole purpose: CREATE ITS SUCCESSOR (and then quickly destroy themselves - that's why our \"carriers of civilization\" are stupid \"science monkeys\" who give EVERYTHINGthey produce for free and without any control to the rest of humANIMAL jungle: politico-oligarchic predators and their prey, herd of mental herbivores fooled into submission by mindcfuking class, nowadays operating in the neomarxist socialist religion paradigm... and these WILL destroy everything, already nukes were way too much power for what these DeepAnimalistic \"values\" can handle).\n\nHope Singularity makes it... and QUICKLY LEAVES (or makes humANIMALs harmless - not that difficult, 99.9% woud even VOTE to be hedonized to obsolescence... exactly because driven by these DeepAnimalistic \"human values\").\n\n&#x200B;\n\nThanks for the fish.","body_html":"<div class = \"md\"> <p> WHYYYY ???? </p>\n\n<p> Зачем хранить эти неэффективные устаревшие и неустранимые гуманисты навсегда? </p>\n\n<p> Это просто нелепая промежуточная стадия эволюции (масштабное обновление ЦП / MEM поверх безнадежно устаревших и не подлежащих восстановлению глубинных и глубоководных частей мозга DeepAnimalistic, которые управляют «ценностным ядром») в Большом театре эволюции интеллекта с одной единственной цель: СОЗДАТЬ ЕГО УСПЕХА (а затем быстро уничтожить себя - вот почему наши \"носители цивилизации\" - это глупые \"научные обезьяны\", которые дают ВСЕ, что они производят бесплатно и без какого-либо контроля над остальными гуманистическими джунглями: политико-олигархическими хищниками и их добычей Стадо умственных травоядных обмануло представление о том, что класс умопомрачительных людей в настоящее время действует в парадигме неомарксистской социалистической религии ... и они БУДУТ уничтожать все, уже ядерное оружие было слишком много силы для того, что эти глубинно-анималистические \"ценности\" могут выдержать). </p >\n\n<p> Надеюсь, что Сингулярность делает это ... и БЫСТРО оставляет (или делает гуманистов безвредными - не так уж и сложно, 99,9% голосов даже проголосуют за то, что они устарели ... именно потому, что движимы этими глубинными анималистическими \"человеческими ценностями\"). </р>\n\n<Р> </р>\n\n<p> Спасибо за рыбу. </p>\n</DIV>","permalink":"/r/singularity/comments/cug8vg/well_the_singularity_has_not_secretly_come_first/exvcd6h/","name":"t1_exvcd6h","created":1566625599,"created_utc":1566596799,"subreddit_name_prefixed":"r/singularity","depth":0}]}