{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"Еще в 1999 году кто-то вручил мне диск с \\ ~ 5500 книгами на нем.\n\nЭто взорвало мой разум!\n\nОдин крошечный диск представлял собой большую библиотеку, чем библиотеки моих родителей и бабушек и дедушек вместе взятых!\n\nЯ сделал копию CD-R и вуаля! В моем распоряжении была совершенно новая библиотека из 5500 книг почти бесплатно. В то время все использовали 15-дюймовые ЭЛТ-мониторы, те громоздкие, которые весили около 40 фунтов и занимали почти все пространство на столе.\n\n\n\nВ первый раз, когда я попытался прочитать книгу с белым фоном и темным шрифтом, это было настолько неудобно, что я сразу начал понимать, как читать на мониторе, не разрушая моих глаз.\n\n\n\nЧерные буквы на белом фоне отлично работали на бумаге, но не на ярком освещенном экране. Нельзя было так читать. После некоторого увлечения (без Google в 1999 году) я обнаружил, что лучше всего будут светло-желтые или светло-зеленые буквы на черном или темно-сером фоне.\n\n\n\nВсе эти 5500 книг были в формате \\ *. Txt, и была программа (древнее название «app») - программа для чтения, которая учитывала цвет фона, а также размер шрифта и изменения цвета. Я настроил его по своему вкусу и быстро привык к чтению на мониторе, и довольно скоро чтение бумажных книг стало ощущаться древним и неудобным.\n\n«Как вы, ребята, читаете эти крошечные буквы? Нет регулировки шрифта? Нет быстрого поиска слов? Пффт». : D\n\nИ вот в 1999 году я начал фантазировать о мире без бумаги. Я сделал несколько вычислений - пару терабайт на каждую когда-либо сделанную книгу на английском языке! Это казалось так близко!\n\n\n\nШли годы, менялись колледж, армия, менялись рабочие места, но глобальные изменения в сфере электронных книг едва ли были заметны: почти никто из тех, кого я знал, даже после всех этих лет читал электронные книги, люди по-прежнему предпочитали бумажные книги, хотя электронная книга уже была изобрел, он не был известен или популярен.\n\nКогда я спросил \"почему бы и нет?\" - общий ответ был «неудобным». Я не мог этого понять, но я принял это.\n\n\n\nПримерно в 2008 году я купил электронный ридер для моей мамы, и удивительно, что она использовала его, чтобы прочитать несколько книг в течение следующих нескольких лет. И когда этот электронный читатель сломался, она попросила меня купить ей новый.\n\nК счастью, я согласился, подумав про себя: «наконец-то! ..» Наконец-то люди не смогут сойти с рук, просто сказав «неудобно» - смотри - это то же самое! Оптически то же самое!\n\nВ то время, когда я читал электронные книги, мне казалось, что это «последний» момент, когда люди, которым неудобно читать с монитора, теперь могут читать из электронных книг, которые оптически идентичны бумаге. Я никогда не чувствовал в этом необходимости, мне казалось, что монитор превосходит меня, но я думал, что электронная книга должна быть последней частью головоломки, чтобы мир стал безбумажным.\n\n\n\nПеренесемся еще на 10 лет, и в некоторых отношениях многое изменилось - почти никто больше не читает газеты, многие неискушенные люди делают большую часть (если не все) своего чтения в Интернете, существуют огромные онлайн-библиотеки, но некоторые все еще находятся в серой зоне ,\n\nДаже сегодня бумажные книги на Amazon часто стоят дешевле, чем их электронные копии. Это огорчает меня безмерно.\n\nТемный режим - вещь, которую было абсолютно необходимо прочитать на мониторе старой школы и которая была очевидна для меня в течение дня, почти полтора года отсутствовала в онлайн-мире, но теперь, спустя два десятилетия, она наконец начала быть широко доступным.\n\nНо да - во многом мир стал безбумажным. В заключение.\n\n\n\nЯ должен быть счастлив ... и я счастлив, но в то же время все это научило меня тому, как глубоко люди укоренились в старых отношениях. Изменить это нелегко.\n\nВ 2017 году мой технически подкованный двоюродный брат читал и покупал бумажные книги, отвергая электронные версии. Когда я спросил, почему он, в конце концов, просто сказал, что это как ритуал, к которому он привык. Электронная книга уменьшит тактильное ощущение бумаги и запах новой книги, уменьшит чувство удивления, кроме того, он сказал - это дешевле!\n\nИ поэтому фраза «** наука проводит по одному похоронам за один раз **». - чувствую себя гораздо более инкапсулирующим и гораздо более широким, достигающим меня. Проникновение смартфона ощущается как чудо, которое вообще не было возможным, особенно не за такой короткий промежуток времени, но каким-то образом все же произошло.\n\n\n\nЧто еще так близко и так возможно сейчас, как электронные книги в 1999 году, но так далеко в то же время?","title":"Чтение книг на экране в 1999 году. Темный режим.","subreddit_name_prefixed":"r/singularity","ups":31,"created":1569763886,"link_flair_background_color":"","id":"dar5rs","author":{"name":"AMSolar"},"permalink":"/r/singularity/comments/dar5rs/reading_books_on_a_screen_in_1999_dark_mode/","url":"https://www.reddit.com/r/singularity/comments/dar5rs/reading_books_on_a_screen_in_1999_dark_mode/","created_utc":1569735086}