{"subreddit":{"display_name":"singularity"},"subreddit_loc":"особенность","selftext":"2d твёрдая сетка - жизнь конвея. >\n\n(почти унитарный вид) 3d smoothlife [https://www.youtube.com/watch?v=wiCHtIHRKXA]<span translate = \"no\"> (https://www.youtube.com/watch?v=wiCHtIHRKXA) < / SPAN>\n\n(почти унитарный вид) [https://www.youtube.com/watch?v=AsUtQgKuZfo]<span translate = \"no\"> (https://www.youtube.com/watch?v=AsUtQgKuZfo) </ span > «Большой шаткий планер в SmoothLife». Планеры - это то, как движутся данные. Когда они сталкиваются друг с другом и с более устойчивыми структурами, образуются новые вещи, или иногда одно продолжается, а другое исчезает и т. Д.\n\n(менее плавный) smoothlife больше похож на 2d hard: [https://www.youtube.com/watch?v=DzJcyspGOvo] (https://www.youtube.com/watch? v = DzJcyspGOvo)  (хотя этот выглядит так, как будто его можно удерживать в сетке хотя бы частично)\n\nеще один вариант с гладкой жизнью, сглаженные углы, но не очень точная дистанция ? v = KJe9H6qS82I) </ SPAN>\n\nНеважно, какие именно клеточные автоматы, поскольку все они взаимозаменяемы, если они обладают минимальной гибкостью и точностью, хотя некоторые являются гораздо более эффективными и зависят от того, какие вычисления вы хотите сделать, насколько эффективными они могут быть. Основная идея заключается в том, что на каждую точку влияет фурье ряда Тейлора и т. Д. Соседних точек и, возможно, в качестве оптимизации в некоторых симах вблизи, но не в соседних точках.\n\nЯ полагаю, что такая «микросхема» может быть построена из некоторого сочетания сверхтекучей, феррожидкой, пьезоэлектрической под давлением, неньютоновской жидкости и других странных свойств вибрирующей капли с 3 выравнивающими «волнами материнской платы» по 3 измерениям. Основная причина выбора плавной жизни по сравнению с жесткой сеткой конусов состоит в том, что она более унитарна, то есть не теряет столько энергии, чтобы не перегреваться даже без вентиляции и т. Д., И, возможно, в конечном итоге может быть построена вблизи планки, потому что это такая простая операция. Существует множество видов гладкой жизни, которые можно настраивать, поэтому их можно настраивать на любые физические работы, сохраняя при этом некоторую форму общих вычислений, к которой можно было бы статистически скомпилировать базовые операции и, возможно, даже превратить слой солнца и т. Д. В какой-то жидкоподобный компьютер в конце концов.\n\nЯ считаю, что вселенная - это совокупность всех самосогласованных математических утверждений, в которых каждый набор взаимозаменяемых вещей учитывается только один раз. Например, только один раз в бозе-конденсате «частицы» действуют как набор частиц вместо упорядоченного списка (который вы могли бы найти «пятой частицей»), так что различные перестановки набора взаимозаменяемы, поэтому рассчитывать только один раз вероятность того, что происходит. Любая достаточно гибкая модель реальности может эмулировать любую другую достаточно гибкую модель, некоторые более полезные и эффективные, чем другие при моделировании ближайших вещей. Казалось бы, меньше размеров бывают чаще.","title":"Conways Game Of Life (забавные реплицирующие узоры в двумерной сетке) - обычный, но медленный компьютер. SmoothLife - это вариант, похожий на поток жидкости, но все же компьютер. Вот видео о том, что может вычислить 3D-чип Smoothlife","subreddit_name_prefixed":"r/singularity","ups":28,"created":1571549746,"link_flair_background_color":"","id":"dka33l","author":{"name":"BenRayfield"},"permalink":"/r/singularity/comments/dka33l/conways_game_of_life_funny_replicating_patterns/","url":"https://www.reddit.com/r/singularity/comments/dka33l/conways_game_of_life_funny_replicating_patterns/","created_utc":1571520946}